[{"id": "B01AYOAI0I", "genre": "Children's Books", "title": "Murf the Monster Goes Camping", "description": "Murf the Monster is back.  In this story, Murf, Mark, and Joey go on a camping trip.  Along the way, they have lots of fun.  But they find something in the woods that scares them.  Then, something happens that scares them even more.  Will they get out of the woods okay?  Come along on their adventure and find out."}, {"id": "0006393136", "genre": "Children's Books", "title": "Love Lies Bleeding", "description": "I, ROBERTA HARRISON, have to keep a diary, and it’s all the fault of the Worm of Jealousy. Ambushed by the dreaded Worm over her “best” friend’s new diary and fashionable clothes, 13-year-old Bobby announces that she, too, has a diary. Now she feels compelled to write in an old exercise book every day, chronicling the trials and tribulations of growing up in a world at war. Bobby’s beloved eldest brother and uncle are fighting overseas in the conflict. Her 16-year-old brother can’t wait to enlist, and her seemingly worldly sister gets pregnant by a young airman. And now Bobby’s fledgling romantic life has turned into a complete humiliation.     A poignant coming-of-age story, interspersed with Barbara Haworth-Attard’s father’s World War II letters,  Love-Lies-Bleeding  will appeal to the author’s large and loyal historical fiction audience, as well as new readers of her bestselling contemporary novel,  Theories of Relativity. • A starred “Our Choice Selection” of the Canadian Children’s Book Centre• Listed on the Resource Links Best Books List• A Bilson Honour Book• Highly recommended by the  Canadian Book Review Annual• Nominated for the Red Cedar Award"}, {"id": "1524715603", "genre": "Children's Books", "title": "Penguins! (Step into Reading)", "description": "Penguin lovers and young nonfiction fans will enjoy following one penguin couple through their efforts to raise a family of chicks in this engaging Step into Reading Science Reader.Did you know that penguins have feathers but don’t fly? Or that their eggs are guarded by the daddy penguin? Or that they dive in the ocean for their food? Discover these facts and more, along with brilliant photographs of chinstrap penguins in Antarctica, in this captivating nonfiction leveled reader. These unusual birds will waddle into children’s hearts while they decode the simple text. Great for confident or reluctant readers.   Step 2 Readers use basic vocabulary and short sentences to tell simple stories. For children who recognize familiar words and can sound out new words with help.“The Step into Reading series makes integrating reading into the curriculum so much easier. The nonfiction titles are perfect for teaching reading and language arts skills, while covering science and social studies content simultaneously!” —Lisa Laake, second-grade Language Arts teacher  "}, {"id": "1404208542", "genre": "Children's Books", "title": "Bob Marley: The Life of a Musical Legend (Graphic Biographies)", "description": "In graphic novel format, presents the life and accomplishments of the legendary songwriter, rhythm guitarist, and reggae superstar."}, {"id": "0330448382", "genre": "Children's Books", "title": "The River of Adventure (Adventure Series)", "description": "A river cruise through ancient desert lands quickly turns into an adventure for Philip, Dinah, Lucy-Ann, and Jack. Bill disappears and the children, along with Kiki the parrot, are trapped beneath a forgotten temple where no one has set foot for 7,000 years."}]