[{"id": "B00HOZVLM0", "genre": "Children's Books", "title": "Jeez...My Horse has Long Ears! (Book One The Gift Mule 1)", "description": "Lauren Peebles is a horse crazy girl. She breathes, dreams, and sleeps horses. For her thirteenth birthday, her only request is a horse. Just when her dream is about to come true, she finds her first horse is no horse at all, but a Molly mule.This is the first installment in a new series for horse/mule lovers. Follow Lauren as she learns about friendship and trust, with her new mule Missy."}, {"id": "0471530107", "genre": "Children's Books", "title": "Janice VanCleave's Earth Science for Every Kid: 101 Easy Experiments that Really Work", "description": "How are mountains formed?  What makes the air we breathe?  What causes the ocean waves?  Now you can learn the answers to these and other questions about the earth, sea, and air through 101 fun, safe, low-cost experiments and activities that can be performed at home or in the classroom. In Earth Science for Every Kid, you'll use a tennis ball and a marble to demonstrate a solar eclipse. You'll make a peanut butter and jelly sandwich to understand sedimentary rock formation. And, with the assistance of a Slinky(r) and a helper, you'll learn about the motion of water waves.  Each of the 101 experiments is broken down into its purpose, a list of materials, step-by-step instructions, expected results, and an easy to understand explanation. Every activity has been pretested and can be performed safely and inexpensively in the classroom or at home.  Also available in this series from Janice VanCleave:  * ASTRONOMY FOR EVERY KID  * BIOLOGY FOR EVERY KID  * CHEMISTRY FOR EVERY KID  * DINOSAURS FOR EVERY KID  * GEOGRAPHY FOR EVERY KID  * GEOMETRY FOR EVERY KID  * THE HUMAN BODY FOR EVERY KID  * MATH FOR EVERY KID  * PHYSICS FOR EVERY KID"}, {"id": "0689841078", "genre": "Children's Books", "title": "The Nutcracker Limited Edition: A Pop Up Adaptation Of E T A Hoffmanns Original Tale (Classic Collectible Pop-Up)", "description": "Detailed illustrations with pop-up artwork compliment this retelling of the classic Christmas tale about a young girl's visit to Candytown and her encounter with the mouse king."}, {"id": "146545859X", "genre": "Children's Books", "title": "DK Readers L1: THE LEGO® BATMAN MOVIE Team Batman", "description": "In DK Readers L1: The LEGO® Batman™ Movie, find out about the minifigures, vehicles, and locations of LEGO Batman, while learning to read with support.Perfect for 3–5 year olds learning to read, Level 1 titles contain short, simple sentences with an emphasis on frequently used words. Crisp photographic images with labels provide visual clues to introduce and reinforce vocabulary.Copyright © 2017 DC Comics. THE LEGO® BATMAN MOVIE © & ™ DC Comics, Warner Bros. Entertainment Inc., & The LEGO Group. LEGO, the LEGO logo, the Minifigure and the Brick and Knob configurations are trademarks and/or copyrights of The LEGO group. © 2017 The LEGO Group. BATMAN and all related characters and elements © & ™ DC Comics. All rights reserved. (s17)"}, {"id": "B002KE5VAI", "genre": "Children's Books", "title": "Sleeping In A Sack: Camping Activities for Kids (Acitvities for Kids)", "description": "6X8 In, 64 Pp, Full-Color Illustrations < Throughout < From The Team That Brought You The < Deliciously Successful Cooking On A < Stick: Campfire Recipes For Kids Comes < Even More Outdoor Fun For Kids. It's < All Here! You'll Find Out How To Have < A Full, Well-Planned, and Adventurous < Camping Trip--Whether That Trip Is A < Night In The Backyard Or Two Weeks In < The Woods. and It's Filled With Lively < Illustrations, How-To Diagrams, and < Packing Lists."}]