[{"id": "0844247812", "genre": "Children's Books", "title": "VGM's Business Portraits: Apple", "description": "VGM Business Portraits * BASIC BUSINESS CONCEPTS. Put into a format that intiques reluctant, young readers. * FULL COLOR. Creates a book that is not only easy to read, but fun to explore. * FOCUS ON FAMOUS COMPANIES. Helps students relate even more to the trials and successes of American business. * SIDEBARS. Explain important terms and phrases, improving student understanding. * GLOSSARY. Provides a handy reference to business terms and concepts."}, {"id": "B073XD1SSC", "genre": "Children's Books", "title": "One Fun Day with Lewis Carroll: A Celebration of Wordplay and a Girl Named Alice", "description": "The wordsmith Lewis Carroll is famed for the freewheeling world of Wonderland in his beloved classics Alice’s Adventures in Wonderland and Through the Looking Glass. In this gloriously illustrated picture book, Carroll's childlike love of life is showcased alongside his brilliance at creating and adapting playful words and phrases. From brillig and uglification to frumious and chortle, the award-winning author Kathleen Krull uses many of Carroll’s own words to tell the story of a man who wanted to make children laugh and whose legacy continues to entertain and delight."}, {"id": "B01L7KT124", "genre": "Children's Books", "title": "THE CROCK OF GOLD (A novel based on Irish folklore and philosophy concepts) - Annotated Top Three Famous Irish Legends and Myths: The Leprechaun, The Selkies, The Cry of the Banshee", "description": "This book is a novel based on Irish folklore and mixture of philosophy.  It consists of 6 books:Book 1--The Coming of PanBook 2--The Philosophers JourneyBook 3--The Two GodsBook 4--The Philosophers ReturnBook 5--The PolicemenBook 6--The Thin Woman's Journey"}, {"id": "0375861165", "genre": "Children's Books", "title": "Calendar Mysteries #4: April Adventure", "description": "From the author of A to Z Mysteries comes a springtime egg hunt mystery featuring the younger siblings of the A to Z Mysteries kids!It's a mystery every month from popular A to Z Mysteries author Ron Roy! With the younger siblings of the A to Z Mysteries kids!April is for Adventure...In the fourth book of the Calendar Mysteries—an early chapter book mystery series—it's springtime in Green Lawn, and Bradley, Brian, Lucy, and Nate are on an Easter egg hunt. They search high and law and find lots of eggs. But soon it's clear that some of the eggs aren't just well hidden. They're gone! Who would steal Easter eggs? It's up to the four kids to crack this eggs-cellent case. Parents, teachers, and librarians agree that these highly collectible chapter books are perfect for emerging readers and any kid who loves mysteries!"}, {"id": "1467757977", "genre": "Children's Books", "title": "I Feel Sick! (Andersen Press Picture Books) (Andersen Press Picture Books (Hardcover))", "description": "The Little Princess is never sick except when anyone asks her to do something. She's too sick to walk the dog and she's far too sick to go to school. But when she's invited to a party, all that changes. Or does it?"}]