[{"id": "1925235270", "genre": "Children's Books", "title": "Let's Go for a Picnic: The Art of Millet (Stories of Art)", "description": "French artist Jean Francois Millet was deeply moved by the ordinary life of the people in Barbizon, who were poor yet always maintaining a heart of gratitude. This story aims to show what he saw and painted by telling a story of young girl pleading with her busy parents to go on a picnic."}, {"id": "1770493441", "genre": "Children's Books", "title": "Hockey Animals (My First NHL Book)", "description": "What better way to introduce your child to the entertaining, action-packed world of hockey than through a new series of books aimed at the youngest of hockey fans? Published through the combined efforts of the NHL, the NHLPA and Fenn/Tundra, My First NHL Books introduce preschool readers to the essential early concepts of learning through the fun and entertaining themes of hockey. Count players, sticks and Stanley cups, explore the colours of the rainbow through team logos and sweaters; look for familiar shapes amongst pucks, scoreboards and nets, and work your way through an alphabet that includes everything from A is for Arena to Z is for Zamboni, and everything hockey in between."}, {"id": "1499880669", "genre": "Children's Books", "title": "Princess Palace", "description": "It’s Princess Petal’s birthday, but her special tiara has disappeared! Journey through the Princess Palace and see if it can be found before the big birthday ball. With a dazzling story and peep-through surprises, this book is perfect for every little princess."}, {"id": "B00QN4Z8VS", "genre": "Children's Books", "title": "The Chanukah Fairy", "description": "The Chanukah Fairy was born from the imagination of a young mother who wanted to paint her children’s world with beautiful colors and bring them into the magical place where good things do happen if you just believe. Justin and Brooke’s puppy goes missing and their parents aren’t sure what to do. Justin being clever and full of hope believes his mom when she tells him to follow his heart.                                   Enter the world of Justin and Brooke, where the power of love, family, and little bit of magic is as enchanting as any ‘fairy’ tale! Be sure to look for clues of the Chanukah Fairy coming!"}, {"id": "B00EMKJKT6", "genre": "Children's Books", "title": "Stories from the Crusades (Illustrated)", "description": "The stories in this book are of heroes who lived hundred of years ago. They caught sight of a beautiful dream and lived and died to make it come true.Their eagerness swept along with them not only men who had never dreamed the dream and who did not know for what end they fought, but bad men also who only wished to get what they could for themselves.The Crusades are long past, yet to-day there are men who see visions of good and who wish to bring them down to earth. With them are others who fight selfishly as did Bohemond and Baldwin long ago. But there are still men like Francis, who carry goodwill with them, and great knights like Tancred and like Louis, who live to fight for the poor and the weak..."}]