[{"id": "1423142179", "genre": "Children's Books", "title": "African Cats: African Cats (Disneynature African Cats)", "description": "This full-color sticker-activity book is sure to delight with its reusable stickers of captivating savannah animals from Disneynature's African Cats! Young fans can match the animals to their footprints, figure out which baby animal belongs with which parent, and create their own landscape play scene. Plus, the book includes two pull-out posters! "}, {"id": "1402732317", "genre": "Children's Books", "title": "Sterling Biographies®: The Wright Brothers: First in Flight", "description": "At least as far back as the ancient myth of Icarus, humans longed to fly\u0097but it wasn’t until December 17, 1903, on the windy dunes of Kitty Hawk, North Carolina, that the dream finally came true. And it was all thanks to Orville and Wilbur Wright, two former bicycle mechanics who built their first toy plane\u0097a rubber-band powered rotary\u0097when they were just children. Find out how the two brothers, working quietly and persistently, ultimately solved the \u0093flying problem” that had grounded so many others; what setbacks they experienced as they developed and improved their machine (including a tragic crash); and what additional \u0093firsts” followed after they triumphantly took to the skies.."}, {"id": "1616551313", "genre": "Children's Books", "title": "Oh My Goddess! Volume 44", "description": "As Urd summons her demonic potential to defeat the infernal machine menacing her sister, Skuld stands by with a holdout bomb should things go out of control. But they may already be out of control, as Belldandy is forced to play her own last, terrible, and most unexpected card - offering Keiichi the chance to cancel their contract!"}, {"id": "1974073742", "genre": "Children's Books", "title": "Life Without Hockey Is Like A Dull Pencil Pointless!: Back To School Composition Notebook, 8.5 x 11 Large, 120 Pages College Ruled (Back To School Journal)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "0590042963", "genre": "Children's Books", "title": "I Spy Gold Challenger: A Book of Picture Riddles", "description": "With 24 million copies sold, the bestselling I Spy series is being relaunched with new designs and foil covers.This bestselling book features a collection of favorite I Spy riddles that send readers searching 12 photographs for hidden objects."}]