[{"id": "0399551352", "genre": "Children's Books", "title": "The Little Red Rescue Box (PAW Patrol)", "description": "Boys and girls ages 0 to 3 will love this box of four board books starring the awesome pups of Nickelodeon’s PAW Patrol! It features a sturdy handle for adventures on the go."}, {"id": "1500496006", "genre": "Children's Books", "title": "The Adventures of Molly Blue: The Pumpkin Patch", "description": "A story about the keeping of traditions. The Blue family are headed to Farmer Bob's Pumpkin Patch. Skyler and Reed want to pick out the best pumpkin for carving a jack-o-lantern. There are lots of fun things to do at Farmer Bob's. It is a treat for the whole family."}, {"id": "B00CJ58844", "genre": "Children's Books", "title": "The Adventures Of Roscoe The Pig(A Beautifully Illustrated Children's Picture Book; Perfect Bedtime Story)", "description": "Roscoe the pig tries to escape his surroundings after finding out from an old horse that his brothers and sisters end up as human meat in the mysterious red buildingWill Roscoe be able to escape and embark on an epic journey full of adventure or is his fate linked to the red building?To find out,Grab your copy of ‘The Adventures of Roscoe The Pig'Simply Click the “buy now” button"}, {"id": "048680884X", "genre": "Children's Books", "title": "Sugar Skulls Stickers (Dover Little Activity Books Stickers)", "description": "Twenty vivid stickers recapture the grotesque charm of Mexico's popular holiday. Every day can be a Day of the Dead with these brightly colored peel-and-apply stickers, which include a variety of grinning skulls as well as a pair of skeleton guitarists and the holiday's name in Spanish and English."}, {"id": "B077RH15MN", "genre": "Children's Books", "title": "We Regret to Inform You", "description": "When a high achiever is rejected by every Ivy League college--AND her safety school--her life is turned upside down. Becky Albertalli meets The Princeton Review in this witty, nerve-racking, and occasionally heartsick look at college admissions.Mischa Abramavicius is a walking, talking, top-scoring, perfectly well-rounded college application in human form. So when she's rejected not only by the Ivies, but her loathsome safety school, she is shocked and devastated. All the sacrifices her mother made to send her to prep school, the late nights cramming for tests, the blatantly résumé-padding extracurriculars (read: Students for Sober Driving) ... all that for nothing.      As Mischa grapples with the prospect of an increasingly uncertain future, she questions how this could have happened in the first place. Is it possible that her transcript was hacked? With the help of her best friend and sometimes crush, Nate, and a group of eccentric techies known as \"The Ophelia Syndicate,\" Mischa launches an investigation that will shake the quiet community of Blanchard Prep to its stately brick foundations.     In her sophomore novel, A. E. Kaplan cranks the humor to full blast, and takes a serious look at the extreme pressure of college admissions."}]