[{"id": "0989153711", "genre": "Children's Books", "title": "23andMe The One and Only Me: A Book About Genes", "description": "HAVE YOU EVER wondered what makes you, You? Join Poppy on her journey into the fascinating world of her genetics. Learn how Poppy’s genes created her red hair and blue eyes \u0097 and trace these traits through her family tree. Poppy’s genes are not the only things that help make her unique. discover, with Poppy, how your genes and the world around you can shape who you are.- What makes you unique?- Why do you look like your family?- What do genes have to do with it?Join Poppy to find out answers to these questions and more."}, {"id": "1250133386", "genre": "Children's Books", "title": "Ruby's Chinese New Year", "description": "In this picture book celebrating Chinese New Year, animals from the Chinese zodiac help a little girl deliver a gift to her grandmother.Ruby has a special card to give to her grandmother for Chinese New Year. But who will help her get to grandmother’s house to deliver it? Will it be clever Rat, strong Ox, or cautious Rabbit? Ruby meets each of the twelve zodiac animals on her journey. This picture book includes back matter with a focus on the animals of the Chinese zodiac.- GODWIN BOOKS -"}, {"id": "1403456887", "genre": "Children's Books", "title": "0: Asian Elephant (Animals Under Threat)", "description": "What is the difference between an Asian elephant and an African elephant? Are all Asian elephants the same? Do female Asian elephants have tusks? This book answers these and other questions about Asian Elephants."}, {"id": "0547959095", "genre": "Children's Books", "title": "Egg: Nature's Perfect Package", "description": "Hatching a plan for survival isn’t always easy in the wild. And how animals lay, protect, and even use each other's eggs as a food source help reveal the life cycle of the natural world. Eggs come in all shapes and sizes. The ostrich’s is the largest, but some are so small, you need a microscope to spot them. Animals hide them and disguise them in smart and surprising ways, too. Some abandon their eggs, while others protect them fiercely and carry them wherever they go. There are as many kinds of eggs as there are animals that depend on them, because in the animal kingdom, the fight for survival begins with the simple, but extraordinary, egg."}, {"id": "B01LZZPGGC", "genre": "Children's Books", "title": "Playin' Catch With Dad (...With Dad Book 1)", "description": "Ronnie Williams loves baseball, he loves pitching, and he loves playin' catch with his dad. The Williams family moves to Texas and Ronnie has to start all over. He has to make new friends and make a new baseball team. The new friends part is easy when he meets Billie and Adrian who just so happen to be the best two players on the team he's trying out for.He then goes through ups and downs like making the team, dealing with a demanding coach and a bully, and winning and losing. But through it all his dad is there to give him advice while they play catch in the backyard.When he finally gets the biggest opportunity of his life can Ronnie overcome his nerves and remember the lessons from his dad and show everyone what he's really got?"}]