[{"id": "1445152452", "genre": "Children's Books", "title": "Sports Skills: Gymnastics", "description": "Looking to take up a new sport? Or just thinking about ways to keep fit and healthy? This book is a great introduction to all the important gymnastics skills you'll need. Full of skills tips and photos showing key techniques, you'll discover everything - from training to competing - while also finding out something about gymnastics stars of the past and present.Perfect for readers aged 9 and up.The series Sports Skills covers rules, equipment, famous competitors and major competitions through specially commissioned, step-by-step photography that clearly shows skills and techniques needed for a sport."}, {"id": "1928832857", "genre": "Children's Books", "title": "Darby O'Gill and the Crocks of Gold: And Other Irish Tales", "description": "Eight Irish tales about Darby O'Gill and his adventures with mournful ghosts, enchanted gold, fairies, and leprechauns."}, {"id": "0385753977", "genre": "Children's Books", "title": "The Tree in the Courtyard: Looking Through Anne Frank's Window", "description": "A New York Times Best Illustrated Children's BookA New York Public Library Best Book for Kids, 2016Told from the perspective of the tree outside Anne Frank's window—and illustrated by a Caldecott Honor artist—this book introduces her story in a gentle and incredibly powerful way to a young audience.   The tree in the courtyard was a horse chestnut. Her leaves were green stars; her flowers foaming cones of white and pink. Seagulls flocked to her shade. She spread roots and reached skyward in peace.  The tree watched a little girl, who played and laughed and wrote in a diary. When strangers invaded the city and warplanes roared overhead, the tree watched the girl peek out of the curtained window of the annex. It watched as she and her family were taken away—and when her father returned after the war, alone.  The tree died the summer Anne Frank would have turned eighty-one, but its seeds and saplings have been planted around the world as a symbol of peace. Its story, and Anne’s story, are beautifully told and illustrated in this powerful picture book."}, {"id": "B00AH370MQ", "genre": "Children's Books", "title": "The Desperate Dog Writes Again", "description": "        Emma loves her human, George, but he can be so difficult! This time he has a visitor, who won't let go of his hand. Worse, she's brought along her dog, Hankie, and they've taken over Emma's spot next to George on the couch.     What's a desperate dog to do? Emma hurries off to the library to write to her favorite canine columnist for advice. But this may be one problem that even Dear Queenie can't solve. Will Emma's happy home ever be the same again?     Drawn in an accessible comic-book style, this story is just right for children who are adjusting to a new member of the family, and will strike a chord with dog lovers of all stripes.     "}, {"id": "0008271178", "genre": "Children's Books", "title": "Collins Children's Dictionary: Learn With Words", "description": "For children aged 7 and over, this dictionary contains up to date coverage of a range of everyday and curriculum vocabulary. It offers additional language tips and carefully selected and annotated illustrations to help students with more complex language. The Word Wizard section provides in-depth support on spelling, punctuation and grammar. This book is designed to build confidence and develop language and dictionary skills at home and in the classroom in preparation for secondary school. Includes a wide range of the latest vocabulary from different subject areas with example sentences and tips on grammar and spelling to help students understand how to use language more effectively. Synonyms and antonyms are provided to help build vocabulary. Beautiful annotated illustrations add an extra dimension and provide additional information on a range of topic areas."}]