[{"id": "0791057917", "genre": "Children's Books", "title": "Mia Hamm (Women Who Win)", "description": "Describes the life and soccer career of Mia Hamm, who helped the United States win a gold medal in soccer in the 1996 Olympics."}, {"id": "885441218X", "genre": "Children's Books", "title": "Coding for Kids 2: Create Your Own Animated Stories with Scratch", "description": "With this easy, fun guide, even children new to coding can learn how to tell their own, original animated stories!   Why should children experience technology passively when they can use this powerful tool to bring their own ideas to life? Starting from simple, two-dimensional drawings, Coding for Kids 2 teaches students how to build animations . . . and gradually make them more complex as their skills grow. Written especially for ages 8 to 12, this book uses Scratch 2.0, the free software created by the MIT Media Labs specifically for young people. With step-by-step instructions, the projects are arranged by difficulty and each features a series of challenges for older readers."}, {"id": "B074ZJQWB7", "genre": "Children's Books", "title": "Roberta Gibb (You Should Meet)", "description": "Get to know the first woman to ever run in the Boston Marathon in this fascinating nonfiction Level 3 Ready-to-Read, part of a series of biographies about people “you should meet!”Meet Roberta Gibb. In 1966, Roberta was the first woman ever to run in the Boston Marathon. When Roberta applied for the event she received a letter saying women were not physically able to run marathons and therefore her request was denied. Roberta decided to run anyway, and told her mom, “This is really going to change things for women.” She disguised her appearance with a blue hooded sweatshirt pulled up over her head and her brother’s Bermuda shorts. Instead of being ridiculed, when the men running realized she was a woman, they cheered her on as she became the first woman to ever complete the Boston marathon! A special section at the back of the book includes extras on subjects like history and math, plus exercise and nutrition tips for kids. With the You Should Meet series, learning about historical figures has never been so much fun!"}, {"id": "0375803289", "genre": "Children's Books", "title": "Jack and the Leprechaun (Pictureback(R))", "description": "It's St. Patrick's Day, and Jack Mouse is visiting his cousin Sean in Ireland. Sean tells Jack about the myth of leprechauns, and Jack is determined to catch one for himself! Children will delight in learning about Irish folk tales and traditions and the customs of St. Patrick's Day in this brand-new Pictureback®."}, {"id": "157765353X", "genre": "Children's Books", "title": "Mary-Kate and Ashley Olsen (Young Profiles)", "description": "A biography of thirteen-year-old twin sisters who began their acting careers at the age of nine months in the television series \"Full House\" and who today produce and star in their own videos, CDs, and books"}]