[{"id": "B003UYUO68", "genre": "Children's Books", "title": "The Troll With No Heart in His Body", "description": "As tall as trees and as ancient and rugged as the Norwegian landscape from which they come, trolls are some of lore's most fascinating and varied creatures. Some live under bridges, others deep inside caves. They can carry their heads under their arms or hide their hearts inside wells. They can walk across oceans and fly over mountains. Trees and shrubs may grow from their heads, and their noses can be long enough to stir soup. There are troll hags, troll daughters, and elderly, shrunken trolls. Old or young, they are quarrelsome, ugly, and boastful, and they love to trick princesses and children. To defeat them, children must rely on the strengths of their humanity-persistence, kindness, pluck, and willingness to heed good advice"}, {"id": "B00QM6YPBG", "genre": "Children's Books", "title": "Algonquin Spring: An Algonquin Quest Novel (An Algonguin Quest Novel)", "description": "Six years ago, Mahingan’s wife was taken from him by the Haudenosaunee at the Battle of the Falls. Now, after learning that she is still alive and captive, he and his remaining family struggle to survive and rescue her. But events 2,000 kilometres away, and a mysterious Mi’kmaq legend, are conspiring in ways that could snatch away Mahingan’s hopes."}, {"id": "B01MTSY2P1", "genre": "Children's Books", "title": "The Marvelous Mrs: A Fun Rhyming Christmas Book About Gratitude", "description": "So many wonderful things happen at Christmas time. The Marvelous Mrs. is a fun rhyming book for young children with a message about gratitude at this special time of year. This original read-aloud book is beautifully illustrated with hand-rendered watercolors."}, {"id": "0310766184", "genre": "Children's Books", "title": "The Bedtime Book", "description": "From beloved New York Times bestselling illustrator Mary Engelbreit comes The Bedtime Book filled with snuggly poems and prayers that will help little ones drift off to sleep. With adorable illustrations and sweet rhymes, The Bedtime Book is an endearing and tender padded cover board book perfect for little ones.Puppies piled high, sound asleep…Chicks by mama, not a peep.Bunnies snuggled in their hutch…Purring kitten all must touch."}, {"id": "1424552001", "genre": "Children's Books", "title": "A Thankful Heart Is a Happy Heart: A Gratitude Journal for Kids", "description": "Being thankful doesn’t always come easy... even for children. Having an attitude of gratitude can change their outlook on life and bring happiness to their hearts. This gratitude journal for kids is inspired by the popular “Choose Gratitude” journal for women. Children are encouraged to think about one thing they are thankful for each day, and then write about it or draw a picture of it in the space provided. Watch their faces light up with smiles as they focus their hearts and minds on things that are good. Whatever is true, whatever is noble, whatever is right, whatever is pure, whatever is lovely, whatever is admirable—if anything is excellent or praiseworthy—think about such things. Philippians 4:8 NIV"}]