[{"id": "B014DW6DCE", "genre": "Children's Books", "title": "How to Train Your Turtle", "description": "Just how do you train your turtle? What do you train him to be? A ninja, of course!Children are sure to enjoy this fun, imaginative story. Just watch them try to guess what the main character is trying to do with that turtle. No child will be able to resist the silliness!"}, {"id": "060637325X", "genre": "Children's Books", "title": "Grandma Elephant's In Charge (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. An entertaining, educational look at the everyday life of a family of elephants - who never forget who's in charge. Elephants are the biggest animals on land, and they live in big families, too. So who can possibly keep them in line? Grandma! After all, she's been around long enough to know where all the best watering holes are, how to gather the tastiest food, and how to sniff out danger. In lively prose interspersed with fun facts (did you know that an adult elephant eats 1,000 pounds of food a day?), Martin Jenkins spins a striking story about this no-nonsense matriarch and her remarkable brood, while Ivan Bates brings the great beasts to rumbling, tumbling, lumbering life."}, {"id": "0060085606", "genre": "Children's Books", "title": "One Candle", "description": "For one family the traditional Hanukkah celebration has a deeper meaning. Amidst the food and the festivities, Grandma and Great-Aunt Rose begin their story -- the one they tell each year. They pass on to each generation a tale of perseverance during the darkest hours of the Holocaust, and the strength it took to continue to honor Hanukkah in the only way they could. Their story reaffirms the values of tradition and family, but also shows us that by continuing to honor the tragedies and the triumphs of the past there will always be hope for the future."}, {"id": "0679810455", "genre": "Children's Books", "title": "Robin Hood (A Stepping Stone Book)", "description": "Life in Sherwood Forest has never been livelier than with this selection of tales of the fun-loving outlaw and his merry men. A fast-moving adaptation of the classic adventure will delight older slow readers as well as kids reading on grade level."}, {"id": "1421577747", "genre": "Children's Books", "title": "Pokemon Black and White Box Set 2: Includes Volumes 9-14", "description": "Meet Pokémon Trainers Black and White! His entire life, Black has dreamed of winning the Pokémon League! Now he embarks on a journey to explore the Unova region and fill a Pokédex for Professor Juniper. White has an exciting career as the Trainer of a talented troupe of performing Pokémon. She dreams of making her Tepig Gigi a star! Together, Black and White continue on their journey... What surprising new Pokémon—and people—will they meet next?!"}]