[{"id": "152470086X", "genre": "Children's Books", "title": "Dolphins: Voices in the Ocean", "description": "A thrilling journey into the spiritual, scientific and sometimes threatened world of dolphins. Based on Susan Casey's bestselling adult work Voices in the Ocean: A Journey into the Wild and Haunting World of Dolphins, this young readers adaptation, which includes an 8-page photo insert, explores the extraordinary world of dolphins in an interesting and accessible format that engages as well as entertains.Inspired by an encounter with a pod of spinner dolphins off the coast of Maui, author Susan Casey embarked on a two-year global adventure to study these remarkable beings. Casey details the extraordinary connection between dolphins and humans, including shared characteristics such as capacity for emotion, playfulness, sociability, and intelligence, the sophisticated navigation ability innate in dolphins, and the dangers they face from people who aim to profit by putting them in captivity or far worse. Includes an 8-page photo insert that offers a glimpse of these magical creatures in their natural habitat."}, {"id": "0152020349", "genre": "Children's Books", "title": "Monster Goose: A Magic Shop Book", "description": "Old Monster Goose has turned Mother Goose’s world of nursery rhymes inside out! Here she presents twenty-five deliciously disgusting new poems, filled with rodents and maggots, zombies and ghouls, spiders and, of course, monsters. Remember King Cole? That terrible troll washes his feet in the toilet bowl. And poor Mistress Mary, her garden’s quite scary--its killer potatoes ate all her tomatoes and now are out looking for Mary!  From the bestselling author of Antarctic Antics: A Book of Penguin Poems and the popular illustrator of the Zack Files comes a zany book that has everyone talking:“Terribly tasteless. Downright gross.”--Mother Goose“Somebody, help!”--Mistress Mary"}, {"id": "1496555813", "genre": "Children's Books", "title": "The Lost World (Classic Fiction)", "description": "Hidden somewhere in South America, a world full of adventure awaits, but only the extravagant Professor Challenger believes in its existence. When he joins a reporter in search of adventure, a brave nobleman and a colleague ready to prove him wrong, Challenger will, at last, have the opportunity to discover the lost world."}, {"id": "0862727464", "genre": "Children's Books", "title": "Trees and Leaves (Fun with Science)", "description": "One of a series designed to enable young children to have fun finding out how things work and why things happen in the world around them, this book focuses on trees and leaves. It contains experiments which investigate the annual cycle of growth and a study of forests and their importance."}, {"id": "1492656259", "genre": "Children's Books", "title": "Rocket Science for Babies (Baby University)", "description": "Simple explanations of complex ideas for your future genius!Written by an expert, Rocket Science for Babies is a colorfully simple introduction to aerospace engineering. Babies (and grownups!) will learn about the basics of how lift and thrust make things fly. With a tongue-in-cheek approach that adults will love, this installment of the Baby University board book series is the perfect way to introduce basic concepts to even the youngest scientists. After all, it's never too early to become a rocket scientist!Baby University: It only takes a small spark to ignite a child's mind."}]