[{"id": "0898125804", "genre": "Children's Books", "title": "Simple Machines: Levers", "description": "\"A foundational look at levers, explaining how these simple machines work and describing some common examples, such as crowbars, that have been used throughout history\"--Provided by publisher."}, {"id": "0590308769", "genre": "Children's Books", "title": "512 Ants on Sullivan Street (Hello Reader, Math, Level 4, Grade 2 & 3)", "description": "Featuring activities by a nationally acclaimed math educator and the author of The I Hate Mathematics Book, a whimsical mathematics skill-builder finds a number of ants helping themselves to a family picnic. Original. Reading level, 2.5."}, {"id": "1538322420", "genre": "Children's Books", "title": "Life As an Indian American (One Nation for All: Immigrants in the United States)", "description": "Immigration is an increasingly important subject in United States politics, and this information-rich book empowers readers to research complex issues on their own. This vital volume explores and celebrates the lives of Indian American immigrants today. Readers will learn about pivotal moments in modern Indian history that provide context for current events and contemporary issues. They'll see the rich and meaningful ways Indian immigrants bring their culture to the United States. Photographs bring this vital topic into focus, while fact boxes offer a deeper look at important points. Readers will gain a deeper sense of cultural awareness as they learn about issues that affect many Indian Americans today."}, {"id": "1627658742", "genre": "Children's Books", "title": "The Journey Home from Grandpa's W/CD", "description": "While looking through the car window on the way home from Grandpa's house, a child describes - in rhyming verse - a variety of colourful vehicles that he sees, from a red fire engine to a silver bicycle."}, {"id": "080509945X", "genre": "Children's Books", "title": "Lincoln and Kennedy: A Pair to Compare", "description": "President Abraham Lincoln grew up in a one-room log cabin. President John F. Kennedy was raised in the lap of luxury. One was a Republican and one a Democrat. They lived and served a hundred years apart. Yet they had a number of things in common. Some were coincidental: having seven letters in their last names. Some were monumental: Lincoln's support for the abolitionist movement and Kennedy's support for the civil rights movement. They both lost a son while in office. And, of course, both were assassinated. In this illuminating book, Gene Barretta offers an insightful portrait of two of our country's most famous presidents."}]