[{"id": "1925335585", "genre": "Children's Books", "title": "Perfect Petunias", "description": "Perfect Petunias is a book especially for those little people who find it hard to make mistakes, designed to ’shape’ perfectionistic tendencies towards being a little more self-accepting and flexible. Loppy LAC is very worried about not doing his homework well enough. He is always focusing on what he hasn’t done rather then what he has, and he becomes very frustrated. So, his friend Curly teaches him about how petunias grow - in lots of different, imperfect directions that we can’t control! Loppy learns that by trying to control whether he makes mistakes or not it’s as if he’s always trying to grow ‘perfect’ petunias.  Sometimes he just needs to accept that things go a certain way and to change his definition of ‘perfect’ to mean trying his absolute best. Perfect Petunias is the third book in the ‘Lessons of a LAC’ series. This gorgeous series, by an author and illustrator who are passionate about giving children ways to think about and manage common emotional difficulties, is a valuable resource for every child to help guide their emotional development. "}, {"id": "1508103755", "genre": "Children's Books", "title": "Mongol Warriors (Warriors Around the World)", "description": "Much myth has been made in subsequent centuries over the nomadic Mongols, who, under the unified leadership of the khan, established a massive empire spanning the Asian continent in the 13th century. This title follows the life of Genghis Khan, from humble beginnings through his rise to power and, ultimately, the transfer of his authority to mighty successors such as Kublai Khan. The reader will glean key points of interest, from the Golden Horde in modern-day Russia to the Yuan Dynasty in China, alongside the average life of the warrior and nomad on the steppes of Central Asia."}, {"id": "0394846966", "genre": "Children's Books", "title": "The American Revolution (Landmark Books)", "description": "In the American colonies of the 1770s, people were fed up with British laws. Local farmers and tradesmen secretly formed a militia. In 1775, when the British marched into Lexington and Concord, Massachusetts, the Americans were ready. From that first battle to the final showdown at Yorktown, the Americans fought against tremendous odds. The British army was bigger and better trained. Food and guns were scarce. But George Washington’s ragged army fought for–and won–the freedom and independence we cherish to this day.Illustrated with black-and-white photographs, the tale of our country's fight for independence is brought to life in fast-moving, dramatic detail."}, {"id": "0613525604", "genre": "Children's Books", "title": "Fishing in a Brook: Angling Activities for Kids (Gibbs Smith Jr. Activity)", "description": "Children's activity book that teaches fishing skills in a fun, interesting way."}, {"id": "0606407073", "genre": "Children's Books", "title": "Treaties, Trenches, Mud, And Blood: A World War I Tale (Turtleback School & Library Binding Edition) (Nathan Hale's Hazardous Tales)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. World War I set the tone for the 20th century and introduced a new type of warfare: global, mechanical, and brutal. Nathan Hale has gathered some of the most fascinating true-life tales from the war and given them his inimitable Hazardous Tales twist. Easy to understand, funny, informative, and lively, this series is the best way to be introduced to some of the most well-known battles (and little-known secrets) of the infamous war."}]