[{"id": "B077MZ6DQB", "genre": "Children's Books", "title": "The Cash in the Hat (The Financial Lit Kit Book 1)", "description": "Families need to understand the importance of getting their debt under control in a way that will make them stand up, take notice, and take action. How much they spend is the only financial issue totally within their control. In a style that is reminiscent of Dr. Seuss but fortified with the common sense of Warren Buffet, The Cash in the Hat is a simple story that delivers a powerful message in an entertaining way: if you don t get your financial house in order, you're sunk. Mitch Anthony and artist Greg Wimmer have created a beautifully illustrated book to help families understand the importance of living within their means. The Cash in the Hat drives home the message of financial fitness in an entertaining way that both adults and their children can appreciate."}, {"id": "B01DBD2SYS", "genre": "Children's Books", "title": "Captain Perseverance: How I Became a Superhero (The Grit Alliance Book 1)", "description": "Captain Perseverance, ordinary kid turned superhero, discovers the superpower that turns the dread of struggle into the joy of success. Learning to read, long division, science fair, band — “I break the chains, I fly sky high, there’s nothing I can’t do!”With high-energy illustrations and text that sings from the page, Captain Perseverance inspires young readers to discover the power of grit.  "}, {"id": "0316189863", "genre": "Children's Books", "title": "The Adventures of Tintin 3", "description": "ADV OF TINTIN NEW ED HC VOL 03 (C: 0-1-2)\nHACHETTE BOOK GROUP USA \nby Hergé\nWhether he's trolling the high seas for treasure or blasting off for the moon, young reporter-sleuth Tintin and his faithful dog, Snowy, have delighted readers everywhere for generations with their timeless adventures. Join Tintin and Snowy as they tackle the toughest mysteries around the world in this series of hardcover collections."}, {"id": "152476812X", "genre": "Children's Books", "title": "Furr-Ever Friends! (Barbie)", "description": "Celebrate Valentine's Day with this BarbieTM coloring book with four chunky crayons and over 50 stickers!Children ages 3 to 7 will love to share the love with Barbie and her pets as they celebrate Valentine's day by baking sweet cupcakes, delivering chocolates, and creating friendship cards for all their friends in this Valentine-themed Chunky Crayon Book starring BarbieTM! It features 4 chunky crayons and over 50 stickers!Since 1959, Barbie has shown girls that they can live their dreams. From an astronaut to a chef to the president, she knows that girls can do anything!"}, {"id": "B01AQULX3G", "genre": "Children's Books", "title": "I am Held", "description": "Heldic tribe has two classes - the higher class (aristocrats), who engage in battles and defend their lands, and the lower class (plebeians), who do work and aren't allowed to fight, although the motto of the Heldic tribe is \"I am warrior, I am Held\". The higher class Helds call the lower class \"Serons\", which means \"Zeroes\" in Danadonian, their language.One day, a young Seron girl, Wolvena Nillin, decides that she should fight for her rights, and she, as well as all other plebeians, should be allowed to defend Heldic lands. Wolvena's dream is to at least once see King Daniel the Magnificent and Prince Drahtar, the king and prince of Dragharon, the kingdom of dragons. She counts them as her heroes, because Daniel was the one who ended the war between Draghars and Helds, and Drahtar ended the war between Helds and Lavadans. As the wars are over and Heldic tribe became peaceful, the girl believes that there should be made changes in their traditions too. Will Wolvena be able to achieve her goals and change Heldic life? Or will she fail? Read the book to find out!The book is written directly in English by 17 years old Georgian author.The picture belongs to Leonardo, a. k. a. dleoblack, a wonderful artist on deviantart.com."}]