[{"id": "B06Y1B88CJ", "genre": "Children's Books", "title": "Josephus: The History of the Jews Condensed in Simple English", "description": "After 2,000 years, his writings remain an important and relevant source for historians and Bible Scholars. Josephus - The History of the Jews Condensed in Simple English takes one of his most important works and presents it to modern readers in condensed simple English the first update of his Antiquities in nearly 300 years. Treasures of faith and history await your discovery on each page. Find out about a prophetic and friendly meeting between Alexander the Great and the high priest, Jaddua. Learn important details about the first and second temples essential for understanding the spirituality and religious politics in those times. Original illustrations, a map, a table of equivalents, and a colorful timeline help further contribute to the stories Josephus wrote for generations to come including you!"}, {"id": "0756954428", "genre": "Children's Books", "title": "A Big Surprise (Green Light Readers: Level 1)", "description": "It's Mouse's birthday--and her friends Dog, Frog, Cat, Fox, and Snake have something special in store!"}, {"id": "B00BIUA0RO", "genre": "Children's Books", "title": "Coral Reefs (Science and Nature for Young Readers)", "description": "Did you know that coral reefs make up less than one percent of our oceans, yet they are home to nearly a quarter of all marine species? Explore the many wonders of coral reefs in this beautifully illustrated Kindle ebook. On your journey through the underwater world of CORAL REEFS, you will learn about the different types of reefs, what coral is and how it feeds, where you can find coral reefs, and the amazing sea life that lives there. You will also discover the importance of coral reefs, what threatens coral reefs, how humans are intimately connected to coral reefs, and what you can do to help protect them. This is an important read before heading out into the ocean in Hawaii. The author also includes many tips for reef etiquette and perpetuating an attitude of stewardship.The Science and Nature Series is written by a former teacherand an award-winning textbook author who has a background in the biologicalsciences. Each book provides a supplementary resource for units on Spiders,Fish, Coral Reefs, and Sea Turtles. Recommended for middle school children ages 9-12. Add them to your school or home school curriculum today."}, {"id": "1596640006", "genre": "Children's Books", "title": "THe Adventures of Oliver the Clownfish: Invitation Slip-up", "description": "A clownfish named Oliver does not receive an invitation to his friend Sally the seahorse's birthday party. Oliver goes through many emotions trying to figure out why he wasn t invited. Oliver discovers that miscommunications happen to everyone. He realizes that things are not always as they appear."}, {"id": "153832248X", "genre": "Children's Books", "title": "Life As a Syrian American (One Nation for All: Immigrants in the United States)", "description": "Since 2011, the Syrian civil war has forced over 11 million people to flee their country. What is life like for Syrians who have made new homes in the United States? This timely book empowers readers to understand the complex issues many Syrian Americans experience today. Readers will also explore the unique and enriching ways Syrian immigrants bring their culture to the United States. Photographs bring this highly relevant topic into sharp focus, and fact boxes highlight important points. Accessible and informative, this text introduces readers to critical points in Syria's modern history, illuminates the Syrian refugee crisis, and provides context for current events in the United States and around the world."}]