[{"id": "1878489305", "genre": "Children's Books", "title": "001: Rock N Learn Phonics", "description": "Developed by educators working with pop musicians, here's a fun way to boost reading and spelling skills through phonics. Volume 1 teaches short vowels, consonants, blends, and silent \"e.\""}, {"id": "1503816060", "genre": "Children's Books", "title": "Eyewitness to the Russian Revolution (Eyewitness to World War I)", "description": "Details the Bolshevik revolution from the perspectives of those involved, including the protesters, Vladimir Lenin, Tsar Nicholas II, and others. Additional features include a bullet-point summary of the events, compelling narrative descriptions, primary source quotes and accompanying source notes, questions to spark critical thinking, sources to guide further research, historical photographs, informative captions, a table of contents, an index, an introduction to the author, and a phonetic glossary."}, {"id": "B00UGQ1H3M", "genre": "Children's Books", "title": "Minecraft: Awesome Minecraft Seeds (MineCraft Gaming Expert - Unofficial Minecraft Guides (Minecraft Handbooks, Minecraft Comics & Minecraft Books for kids) Book 9)", "description": "Get the all time TOP 40 Minecraft seeds.Awesome Minecraft Seeds has the all time Minecraft TOP 40 Seeds with a full beginners guide to installing and using Minecraft Seeds.BONUS: TOP 40 Xbox 360 SeedsDon't get left behind - become a true Master Of Minecraft with MC Gaming Expert Guides.Awesome Minecraft Seeds is an unofficial Minecraft Gaming Guide and is an original work of fan fiction that is not associated with Minecraft or Mojang/Notch. It is an unofficial work and is not sanctioned nor has it been approved by the makers of Minecraft.Minecraft ®/TM & © 2009-2013 Mojang / Notch"}, {"id": "1426304153", "genre": "Children's Books", "title": "World History Biographies: Joan of Arc: The Teenager Who Saved Her Nation (National Geographic World History Biographies)", "description": "Around 1412, a baby girl was born in the village of Domrémy who would change France forever. A farmer’s daughter, she seemed destined for an unremarkable life. But as the dramatic narrative of this World History Biography reveals, Joan’s life was anything but ordinary. By the age of 13, she knew her destiny—to drive the English invaders from France. By 17, she had led an army to victory at Orléans. Captured in battle, and too poor to be ransomed, Joan was burned at the stake before her 20th birthday.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "0590428322", "genre": "Children's Books", "title": "Catwings Return", "description": "The bestselling Catwings series has been redesigned for Fall 2006!Mrs. Jane Tabby's kittens assume they are the only cats with wings in the world . . . until they discover a little kitten with wings of her own living in an abandoned building that is about to be demolished. Will they be able to rescue their new friend from the dangers of the city?"}]