[{"id": "B0104EOH0U", "genre": "Children's Books", "title": "Hana's Suitcase: The Quest to Solve a Holocaust Mystery", "description": "This award-winning true Holocaust story, newly updated, connects generations through one woman’s quest to find the truth behind a mysterious suitcase.   In March 2000, Fumiko Ishioka, the curator of a small Holocaust education center in Tokyo, received an empty suitcase from the museum at Auschwitz. On the outside, in white paint, were the words “Hana Brady, May 16, 1931, Orphan.”   Fumiko and the children at the center were determined to find out who Hana was and what happened to her all those years ago, leading them to a startling and emotional discovery.   The dual narrative intertwines Fumiko’s international journey to find the truth about Hana Brady’s fate with Hana’s own compelling story of her life in a quiet Czech town, which is shattered by the arrival of the Nazis, tearing apart the family she loves. This suspense-filled work of investigative nonfiction draws in young readers and makes them active participants in the search for Hana’s identity.   Praise for Hana’s Suitcase • “Hana wanted to become a teacher, and surely through this little book her dream is being realized.” —Archbishop Desmond Tutu, from his new foreword to Hana’s Suitcase • “The account . . . is part history, part suspenseful mystery . . . with an incredible climactic revelation.” —Booklist"}, {"id": "0753471310", "genre": "Children's Books", "title": "Navigators: Pirates", "description": "Navigate your way through a fantastic range of subjects with this visually spectacular new series. Every spread is brimming with lively text, amazing photographs and artworks, and weblinks and quotes. Panels throughout offer focused information on specific topics.If it's action and adventure you're looking for--you've grabbed the right book, matey! Take to the seas to meet some of history's most terrifying characters in Navigators: Pirates by Peter Chrisp. From the earliest records when Cilician pirates kidnapped Julius Caesar, to the 17th-century buccaneer who cut out his victim's heart, and the infamous exploits of the most fearsome pirate-Blackbeard. Along the way, readers will explore a pirate ship, meet some terrifying female pirates and learn about modern piracy. Links and features throughout the book point readers toward contemporary resources to keep the exploration going."}, {"id": "0738382922", "genre": "Children's Books", "title": "Curious George Tadpole Trouble (Turtleback School & Library Binding Edition) (Curious George (Prebound))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When Curious George loses his tadpoles, he must learn all about the life cycle of frogs in order to find them."}, {"id": "1633626628", "genre": "Children's Books", "title": "Living on a Budget (21st Century Skills Library: Real World Math: Personal Finance)", "description": "Do you know how to balance your wants and needs? This book introduces readers to setting a personal budget. Real world examples help readers learn the importance of math skills for money management. Callouts prompt inquiry, further thinking, and close examination of photographs. Additional text features and search tools, including a glossary and an index, help students locate information and learn new words."}, {"id": "0062351265", "genre": "Children's Books", "title": "Olga and the Smelly Thing from Nowhere", "description": "Meet Olga, the amazing child scientist who LOVES animals (because they are super-cute)! Brightly.com put this amusing don't-miss book on their \"Ultimate Summer Reading List for 9- to 12-Year-Olds\"Olga and the Smelly Thing from Nowhere is jam-packed with fun: vibrant illustrations, word bubbles, quirky humor, olgamus facts, and plenty of excitement for readers who love making discoveries and meeting new friends. Olga is a charming combination of independent, curious, and smart—making her the coolest girl scientist around—perfect for fans of Dork Diaries and Captain Underpants. When Olga crosses paths with a weird creature and becomes the first kid to discover the species olgamus ridiculus, she is ecstatic! What does an olgamus eat? How does it poop? Why does its burp sound like the word rubber? With her trusty observation notebook and the help of a librarian, a shopkeeper, and some friends, Olga sets out to do science—learning the facts about her smelly, almost-furry pal and searching for him when he goes missing. The scientific method is the best way to discover anything!"}]