[{"id": "1629793248", "genre": "Children's Books", "title": "Last-But-Not-Least Lola and a Knot the Size of Texas", "description": "In her fourth hilarious adventure, good-hearted Lola can't help getting into trouble. Her friends are all traveling for the Thanksgiving holidays, so she offers to dog-sit—but fails to mention this to Mom, who is desperately trying to finish a batch of Lola dresses for a new client. Now Lola is juggling her dog-sitting responsibilities with her worries. Will her parents discover the growing knot in her hair and cause her excruciating pain brushing it out? Will her grandmothers discover that she's lied to them every year about who makes the best pumpkin pie? Will Jack get so involved in his new babysitting and yard-work jobs that, like Mom and Dad, he won't have time for her anymore? Lola's worries, like the knot in her hair, grow greater until she finally has to stop hiding them and start untangling them."}, {"id": "0374377545", "genre": "Children's Books", "title": "The Travels of Benjamin of Tudela: Through Three Continents in the Twelfth Century", "description": "Through Three Continents in the Twelfth CenturyImagine a time when streets were narrow and dirty, towns were surrounded by walls, brigands lurked alongside roads that were treacherous and few, bridges over rivers were rare, and a man setting out on a journey never knew if he would return alive. It was the year 1159 when the medieval Jewish traveler Benjamin left his native town of Tudela in northern Spain on an adventure to see the places he had read about in the Bible. He traveled for fourteen years - from Rome to Constantinople to Jerusalem to Baghdad, among others - by ship, by cart, and on foot, enduring great hardships in his quest for knowledge of other places and people.Working from Benjamin's original chronicle, written in Hebrew, as well as other sources on the period, Uri Shulevitz captures the true spirit of this amazing adventurer, using a text written in the first person and superlative illustrations.The Travels of Benjamin of Tudela is a 2006 Bank Street - Best Children's Book of the Year."}, {"id": "1772754609", "genre": "Children's Books", "title": "Disney Descendants Wicked World Cinestory Comic Vol. 3", "description": "The adventures of Mal, Evie, Carlos, and more continue in volume 3 of the Disney Descendants Wicked World Cinestory Comic. Fans of the hugely popular Disney Descendants Wicked World Shorts, which has had over 99 million views since its launch, can't miss this graphic novel-style adaptation of episodes 1-7 of the second season."}, {"id": "0375824944", "genre": "Children's Books", "title": "Cooking With the Cat (The Cat in the Hat: Step Into Reading, Step 1)", "description": "Look! Look! The Cat wants to cook! Told with simple rhymes and rhythms, this jaunty illustrated tale gives very young readers a taste of the Cat in the Hat’s flamboyant cooking skills as he slaps on a Chef’s hat and whips up purple cupcakes using some truly odd ingredients!"}, {"id": "B0096DEE4A", "genre": "Children's Books", "title": "Shaped Board Book: Tractor (Shaped Board Books)", "description": "Full of simple diagrams and fun facts, these vehicle-shaped board books help kids learn how real farmers use tractors to do important jobs all around the farm."}]