[{"id": "B002PJ4IAM", "genre": "Children's Books", "title": "My First Ramadan", "description": "Look! There is the new moon in the sky.It's time for Ramadan to begin. Follow along with one young boy as he observes the Muslim holy month with his family.This year, the narrator is finally old enough to fast, and readers of all ages will be interested as he shares his experiences of this special holiday."}, {"id": "B076VV8V24", "genre": "Children's Books", "title": "Walking the Trail at Oak Grove Lake Park", "description": "There is a place I like to visit.  It is full of the noises that I want to hear, birds calling to each other, the wind drifting through tall trees, and the laughter of friends sharing a walk and a talk.  This place is called Oak Grove Lake Park and today I will walk a few laps beneath the trees.I walk down the trail with the hope that I can free myself of the frustrations that bombard me every day.  I want to think only of the life that I encounter on the trail today, not the violence around the world, or the hateful speech spewed nationwide, or the lies people tell themselves in order to keep what they want.  I want to be here in both body and mind, present in this physical moment.Explore wildlife photography as I wander down a trail at the Oak Grove Lake Park.  Walk with me as we discuss life and living in the moment.  Look closely at the leaves and flowers, the insects and spiders.  It is a beautiful world out there, if only we will take the time to explore.  Join me on my trek."}, {"id": "1429662689", "genre": "Children's Books", "title": "Houdini: The Life of the Great Escape Artist (American Graphic)", "description": "Harry Houdini never met a lock he didnt like. Handcuffs, leg irons, and thumbscrews were childs play for the worlds greatest escape artist. During his stunning career he invented some of the most mind-boggling escapes of all time. Join Houdini as he attempts his most dangerous stunts and unlock the secrets of the illusionists lasting legacy."}, {"id": "1974318206", "genre": "Children's Books", "title": "Best Coach Ever: Football Coach Gifts (Football Notebook Journal)(Football Books For Kids)(V22)", "description": "The Best Gift Ever For Football CoachesDo you have that special football coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your football coach will appreciate the thoughtful gift and use it for seasons to come. Or he will spike it into the dirt in excitement when you get a touch down or make the game winning tackle.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any football player’s tastes. Great football books for kids to give as gifts.Grab your football notebook journal today. "}, {"id": "B01BRIUUD0", "genre": "Children's Books", "title": "Diary of a Minecraft Zombie Book 1 (An Unofficial Minecraft Book)", "description": "Charlie an eleven-year-old zombie enjoys his life at home. Until one day his world is turned upside down. When him and his family leave with the others to seek refuge, Charlie knows that they must side with one of their worst enemies...humans. Charlie believes that this new threat is a common enemy to everyone including the humans. Who is the enemy?"}]