[{"id": "0735300267", "genre": "Children's Books", "title": "The Animal Boogie Jigsaw Puzzle", "description": "If you love The Animal Boogie, a colorful and engaging sing-a-long book with CD, then you will enjoy working the durable, coordinating puzzle. Packaged in a compact cube, the 36 large and bright pieces make a great first puzzle. Finished puzzle measures 16 x 16 inches"}, {"id": "B0756WJR5N", "genre": "Children's Books", "title": "In Harm's Way", "description": "In September 1941, young Jack Kennedy was appointed an Ensign in the U.S. Naval Reserve. After completing training and eager to serve, he volunteered for combat duty in the Pacific and was appointed commander of PT 109.On August 2, 1943, Kennedy's PT 109 and two others were on a night mission to ambush an enemy supply convoy when they were surprised by a massive Japanese destroyer. The unsuspecting Americans had only seconds to react as the Japanese captain turned his ship to ram directly into Kennedy's. PT 109 was cut in half by the collision, killing two of Kennedy's 12 crewmen and wounding several others in the explosion.In Harm's Way tells the gripping story of what happened next as JFK fought to save his surviving crew members who found themselves adrift in enemy waters. Photographs round out the exciting narrative in the first book to cover this adventurous tale for young readers."}, {"id": "0153021918", "genre": "Children's Books", "title": "Ellis Island: New hope in a new land (Passports)", "description": "An inspiring chronicle of the immigrant experience recounts the history of Ellis Island from 1892 to 1954, the period during which more than seventeen million immigrants passed through its doors in search of new lives in America"}, {"id": "1403499349", "genre": "Children's Books", "title": "Electricity and Electrical Circuits (Physical Science in Depth)", "description": "What causes a flash a lightning? How can you use a lemon to create an electric circuit? Which type of electrical circuit powers my MP3 player? How does electricity get from a power station to my home? Are there electric signals flowing through your body right now? This title explores the nature of electricity, including how it behaves and how it is generated. The book looks at different types of electrical circuits and ways in which electricity can safely and efficiently provide power to our homes. It also examines exciting new ways in which electricity may change the world around us."}, {"id": "1629917389", "genre": "Children's Books", "title": "The Smurfs #23: Can't Smurf Progress (The Smurfs Graphic Novels)", "description": "When Papa Smurf is away, the Smurfs will play! Handy Smurf has invented some machines to ease the burden of the hard-working Smurfs (not including Lazy Smurf!). Soon, the whole Village is interested in these inventions that improve the quality of life. Seduced by the easy life, The Smurfs rely more and more on these robots to perform their daily tasks, however small they may be. Will the Village survive the occupation of these high-functioning robots?"}]