[{"id": "151273652X", "genre": "Children's Books", "title": "A Farmer, His Son and Their Mule", "description": "Have you ever made a decision about something and more than one person decides to give you their advice and things do not turn out the way you expected?   That's exactly what happens when the Farmer and his son who are happy about taking their mule to the market to sell for school clothes. They are so excited they sing a song on their way to keep up their morale.   One person after the other gives the farmer their opinion on how the farmer and his son should ride the mule. Their song never changes but they try to please everyone who offers them advice. They learn in the end that you can please some of the people some of the time but you can't please all of the people all of the time.   PROVERBS 25:11   Like apples of gold in setting of silver is a word spoken in right circumstances.   NASB"}, {"id": "0670060526", "genre": "Children's Books", "title": "Corduroy Goes to the Beach", "description": "Celebrate Corduroy’s 50th anniversary with this lift-the-flap beach adventure!   Corduroy and his friends are heading to the beach for a fun-filled day of playing by the sea. First they jump over the waves and fly kites, then it’s time for a tasty picnic lunch and a special treat—ice cream! In the afternoon, Corduroy and his pals collect seashells and build sandcastles. Seven spreads filled with thirty-five flaps will keep small fingers happily busy."}, {"id": "099181648X", "genre": "Children's Books", "title": "Tumbling Dreams: The Gymnastics Series #2", "description": "Five Girls. Four Events. And One Major Competition Can a gymnastics squad have a break-up? Regionals are only a few months away and the Bellevue Kips are falling apart. Sara can’t get her OCD under control Bethany struggles to find her balance after a growth spurt Nadia artistic marks are sinking and her moods are affecting the entire team Jamie is the glue that holds this team together but her grandma is in the hospital so her mind isn't on the task. and Kelley is sneaking out of practices. The whole team is split. Can the girls find their squad spirit in time to compete as a team? Or is it time to say goodbye to their fuchsia-and-black leotards forever?"}, {"id": "0778766217", "genre": "Children's Books", "title": "Hail! Ancient Chinese (Hail! History)", "description": "This entertaining book explores the extraordinary dynasties of Ancient China, and how China has defended itself over thousands of years against invaders such as the Mongols. It includes features on Qin Shi Huangdi and the massive Terracotta Army he prepared for the afterlife, the role of the great philosopher Confucius, inventions such as gunpowder and the wheelbarrow, and a day in the life of a guard on the Great Wall of China."}, {"id": "B01M0Q1KLG", "genre": "Children's Books", "title": "The 65-Story Treehouse (The Treehouse Books)", "description": "Before they can go up, they have to go back—travel through time with Andy and Terry as they attempt to save the treehouse! New York Times bestselling author Andy Griffiths invites readers to come hang out with him and his friend Terry in their 65-Story Treehouse-the fifth book in the illustrated chapter book series filled with Andy and Terry's signature slapstick humor!Andy and Terry live in a 65-Story Treehouse. (It used to be 52 stories, but they keep expanding.) It has a pet-grooming salon, a birthday room where it's always your birthday (even when it's not), a room full of exploding eyeballs, a lollipop shop, a quicksand pit, an ant farm, and a time machine...which is going to be really, really useful now, since Terry messed up (again) and the treehouse just FAILED it's safety inspection. Join Andy and Terry on a whirlwind trip through time as they try to stop the treehouse from being demolished!"}]