[{"id": "0778766225", "genre": "Children's Books", "title": "Hail! Ancient Egyptians (Hail! History)", "description": "This entertaining book guides readers through 3,000 years of ancient Egyptian history on the banks of the Nile River, from the early settlers and kings to great pharaohs such as Ramesses II, Hatshepsut, Tutankhamun, and Cleopatra. It also includes features on building the perfect pyramid, food and feasting, mummies, trade, and education."}, {"id": "1498477011", "genre": "Children's Books", "title": "Coronado Dog Surfing Olympics", "description": "The book describes the dogs who are contestants in a surfing competition. A funny dog story about surfing dogs at the Coronado Dog Surfing Olympics. Told by the dog hosts, this short story describes a surfing competition just for dogs. Dogs compete to win. They must compete for points in the form of barks for their style, tricks, time, and board dismount. Book with anthropomorphism and talking dogs. A humorous short story about dogs who compete against each other. Water sports, surfing, sports and recreation. Funny animals surf in a competition. Chihuahua, shepherd, Siberian Husky, Shar-Pei, Portuguese Water Dog, spaniel, golden retriever, bulldog, retriever, poodle. Fourth of July summer recreation. Funny story about talking dogs. Dog story for kids. Short story about dogs. Cute story about dogs. A fictional story about dogs. Surfing dogs competition. Bulldogs surfing. Surfing dogs Coronado Beach, California. Surfing competition California. Short story about talking dogs."}, {"id": "0807524964", "genre": "Children's Books", "title": "Flicka, Ricka, Dicka and Their New Skates: Updated Edition with Paperdolls", "description": "Early one Christmas morning in Sweden, Flicka, Ricka, and Dicka opened their eyes. Soon they would have their Christmas gifts! For the first time in over thirty years, this classic holiday tale returns, in a deluxe hardcover edition. Longtime fans of the series will delight in revisiting the story, and new readers will find fun and excitement as the girls must save their friend Bertie after an ice-skating disaster."}, {"id": "0764152254", "genre": "Children's Books", "title": "Leonardo and the Flying Boy", "description": "There were no spaceships or airplanes when Zoro was a boy. He lived in Italy during the era we now call the Renaissance, a time when the sky belonged to the birds. But one unusual man dreamed of incredible flying machines. \"One day, Zoro,\" he told his pupil, \"people will sail through the clouds and look down at the world below.\" Zoro was curious. He knew that his teacher did more than merely dream about the future, but was an important artist and inventor. Then Zoro made an astonishing discovery. His teacher was building a mysterious machine. A machine intended to fly! Here begins a fascinating story based on a true event, for Zoro's master was the famous artist and inventor, Leonardo da Vinci. Full-color illustrations throughout this beautiful book include reproductions of some of Leonardo's famous artworks."}, {"id": "0635026287", "genre": "Children's Books", "title": "Tomochichi: Chief of the Yamacraws, Friend of Savannah (170) (1000 Readers)", "description": "Tomochichi was a Creek Indian chief. He lived a long life. He was over 90 years old when he died! He was a very good friend of James Oglethorpe. Tomochichi was an important part of the colony that grew to be Savannah. With his help, the colony grew peacefully. You can thank Tomochichi for the beautiful city of Savannah!These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}]