[{"id": "0998268755", "genre": "Science Fiction & Fantasy", "title": "Storm Seed (Sacred Band)", "description": " Own the definitive Authors' Cut edition of Storm Seed, the seventh volume in the iconic Sacred Band series. High adventure awaits in Storm Seed by Janet & Chris Morris:   - Travel with the Sacred Band of Stepsons to a future undreamed.  - Meet the changeling son of Tempus and the Froth Daughter.  - Learn what it takes to become a dragon.  - Bring gods to a godless realm.   Tempus the Black, avatar of the Storm God, and his partner Niko reunite the Sacred Band for a mission to a dying world. And from there -- should the gods allow -- to mystical Lemuria.   - Praise for the Sacred Band series:   \"Janet Morris, Tempus (1987), and, with Chris Morris, Tempus Unbound (1989), The Sacred Band (2010).  \"A fantasy series about the Sacred Band of Stepsons, an elite army modeled on the fourth-century B.C.E. Sacred Band of Thebes. The stories explore the fraught personal relationships of mixed hetero- and homosexual troops, only sometimes paired, as they fight for their commander, the immortal Tempus. Morris includes archaeological and historical details, from physical items to social practices, religion, and philosophy, to create a fantasy world that is, in many ways, more historically accurate than many popular accounts of antiquity.\" -- Robert W. Cape, Jr, in Classical Traditions in Science Fiction, Brett M. Rogers & Benjamin Eldon Stevens, eds., Oxford University Press"}, {"id": "B00MMZVIKW", "genre": "Science Fiction & Fantasy", "title": "Lay of Runes: Sky Treader", "description": "A young Thor seeks to make a riding partner in Loki, but Loki has his own plans for his day: sleep. Unwilling to accept Loki's laziness, Thor drags him from bed and takes him to Vanaheim for drinking and revelry. When Loki does not agree with Thor's idea of fun, he takes Thor on an adventure of his own, picking up horses, dwarfs, and gryphons as they trek across the realms."}, {"id": "1565042719", "genre": "Science Fiction & Fantasy", "title": "Wind From The East (Vampire: The Dark Ages)", "description": "This book provides complete information on the Mongol invasions of Genghis Khan and the diverse vampires who move among the Khan's horde. It covers the entire period of Mongol expansion into the West. It also includes information on the Mongols from their beginnings to their conquest of China and the world. Two new bloodlines are introduced, and much more information is presented to the player."}, {"id": "1565047729", "genre": "Science Fiction & Fantasy", "title": "Trinity Field Report Alien Races", "description": "We Are Not Alone  It was only a matter of time after humans ventured to the stars that we would encounter other sentient life. We knew it would happen; we anticipated feared who or what we would meet. We had no idea.In the 22nd century, humanity has made contact with three spacefaring alien races: the Qin, the Chromatics and the Coalition. Everyone knows them by reputation apparent friends, hostile crusaders and encroaching enigmas but what are their true natures, their true faces and their true intentions? The on Trinity knows.  Aliens Are Among Us  The second Trinity Field Report, Alien Races is a full-color setting dossier from on for all orders and psions. It updates you on everything the Trinity has recorded about the officious Qin, the fanatical Chromatics and the violative Coalition. Finally, the secrets of the alien races are revealed! This update is ideal for Trinity players and Storytellers."}, {"id": "0998150525", "genre": "Science Fiction & Fantasy", "title": "The White Tower (The Aldoran Chronicles)", "description": "Winner 2017 National IE Award for Fantasy.Winner 2017 Readers Favorite for Epic Fantasy.Magic is outlawed. Those caught wielding it are taken to the White Tower. They are never heard from again. After the chaos of the great Wizard Wars nearly a thousand years ago, the people turned their backs on magic. It was deemed evil. Those born with it will stop at nothing to remain hidden.In the north, a young boy is hunted by the Black Watch. Desperate to survive, he turns to the one thing he fears most. Magic. A young girl's affection for him forces her to pick up the sword. Her life may never be the same. In the east, a tortured prisoner vows to escape the White Tower. His sister's life depends on it. And in the west, a captain fights to protect his king while shielding the woman he loves from the king's son.The world balances on the edge of a blade.Can a handful of wielders manage to change it?The first installment in the Aldoran Chronicles, a new epic fantasy saga filled with magic and monsters, sword and scorcery, heroes, villains, and those in between."}]