[{"id": "0972650431", "genre": "Children's Books", "title": "Girls Can!: Make It Happen", "description": "Encourages girls to set their own course, knowing that they can do and be anything at all when they set their minds to it and make it so. Briefly describes how Jackie Joyner-Kersee, Sandra Day O'Connor, and Sally Ride achieved their dreams."}, {"id": "B00I8R16O6", "genre": "Children's Books", "title": "101 Amazing Facts about Ancient Egypt", "description": "Do you know who the ancient Egyptian god of the underworld is? What type of mask would an embalmer wear whilst carrying out the mummification process on a body? Who was the most successful of all the pharaohs? All these questions and more are answered in this fascinating easy-to-read guide to ancient Egypt. Whether you are studying the subject and need access to the important information fast, or you are just interested in this fascinating period of history, this excellent quick-read guide containing over one hundred facts is a perfect addition to your bookshelf."}, {"id": "1540890899", "genre": "Children's Books", "title": "The Little Bear with Hare's Ears: The Little Bear with Hare's Ears (1)", "description": "The Little Bear with Hare’s Ears . The Fairy-Tale of the Little Bear with Hare’s Ears.This is one of the best stories you need to show or buy for you kids especially in the new year. \"The little bear was all broken up by the fact that all the animals are afraid of him. But suddenly an idea struck him and he became cheerful he asked to knit him ears as the hare has . Why ? and whats going on ? you will read in this Nice story . We are doing this for kids they are our hearts and the future of our humanity. In this lovely story, specially prepared for children in winter time, particularly in the holidays, animals play attractive & heroic roles in children's fantasy which touch their hearts with more lovely and positive emotions. Our children must see the world from the most merciful, beautiful and lovely side. There is a lot of snow, bear and other amazing animals, many new characters and some words. I hope you will enjoy it with your kids so much."}, {"id": "0374301115", "genre": "Children's Books", "title": "Tractor Mac Harvest Time", "description": "When the nights start to get cooler and the corn is ready for picking, it's time for autumn fun at the farm! Tractor Mac loves the fall, but he's just too big for the orchard, where he is stuck harvesting apples that Farmer Bill will make into delicious treats. Across the road, Small Fred the tractor is busy with the Pumpkin Picking Festival, but he's just too small to pull all of the people who want to go on a hayride. Working together, Tractor Mac and Small Fred figure out a way to share their chores and share the fun."}, {"id": "1883043484", "genre": "Children's Books", "title": "I've Been Working on the Railroad Musical Book (Rub-a-Dub Tub) (Rub a Dub Tub Musical Books)", "description": "Press the top of the smokestack on the cover and sing along to the melody of this classic children's song.  The book is shaped like a little steam engine and is both musical and waterproof."}]