[{"id": "1633221016", "genre": "Children's Books", "title": "Be Happy & Color!: Mindful activities & coloring pages for kids", "description": "Coloring is a great method to promote child development and learning through artistic self-expression. Coloring is a great method to promote child development and learning through artistic self-expression. Be Happy & Color pairs this essential part of growing up with tools and techniques that can help children learn to express themselves and support their emotional well-being. Alongside beautifully illustrated coloring pages, this book provides guided therapeutic instruction from a well-known children's art therapist to promote feelings of calm, happiness, and well-being and help children combat feelings of sadness or anxiety."}, {"id": "0874416485", "genre": "Children's Books", "title": "Ten Thousand Children: True Stories Told by Children Who Escaped the Holocaust on the Kindertransport", "description": "Tells the true stories of children who escaped Nazi Germany on the Kindertransport, a rescue mission led by concerned British to save Jewish children from the Holocaust."}, {"id": "0750235004", "genre": "Children's Books", "title": "Mexico (Country Insights)", "description": "This work compares the lifestyle of Mexico's successful inhabitants to the hardship experienced by slum-dwellers and people who live in rural Mexico. It takes the reader through the arid deserts, mountain ranges and tropical coastlines to discover how the Mexican environment is being altered by the modernization of the country. It includes maps and graphic panels showing statistics and fact boxes about flag, size population, religion currency and language. This title is part of a series looking at how countries are changing to face the challenges of the 21st century."}, {"id": "1615324801", "genre": "Children's Books", "title": "The Land and Resources of Texas: Shaping the Growth of the State (Spotlight on Texas)", "description": "The diverse geographic features of Texas offer unique opportunities in agriculture and business. This book examines how land and resources have helped shape its history and economy. Intriguing maps and graphic organizers are included to create a fun and enriched learning experience."}, {"id": "0984989412", "genre": "Children's Books", "title": "The Mystic Princesses and the Whirlpool (Volume 1)", "description": "Join Exciting Princess Adventures and Learn Life Lessons Along the WayHave you ever wanted to ride a dolphin or dreamed of playing on a rainbow as if it were a waterslide? How would you feel if someone tried to kidnap you, and you were forced to move to Hawai'i to hide and live with people you don't know? That happened to Harmonie. Come meet Harmonie, her new Mystic Princess friends, and find out what happens when her enemies, the Children of Ares, find her again."}]