[{"id": "0778740250", "genre": "Children's Books", "title": "Paralympic Sports Events (Winter Olympic Sports)", "description": "The Paralympics are a series of sporting events for elite athletes with different physical abilities. This book examines the five Paralympic winter sportsalpine skiing, cross-country skiing, biathlon, ice sledge hockey, and wheelchair curlingand the athletes who compete in them. Prepare to be inspired by their courage, skill, and dedication to their sport."}, {"id": "075662553X", "genre": "Children's Books", "title": "Amelia Earhart (DK Biography)", "description": "Full-color photographs of people, places, and artifacts; definitions of key words; and sidebars on related subjects add dimension and relevance to stories of famous lives, creating a unique reading experience about people youngsters should know."}, {"id": "0439856531", "genre": "Children's Books", "title": "How Do Dinosaurs Learn Their Colors?", "description": "The bestselling, award-winning team of Yolen and Teague present their third original dinosaur board book, a fun read-aloud that teaches children all the colors of the rainbow.Dinosaur colors start with red:A red fire truck stuck under the bed,A purple towel left on the floor,A green sign taped to the closet door,The third board book by the bestselling, award-winning duo Jane Yolen and Mark Teague focuses on one of the most fun concepts learned in childhood: colors. Packed with vibrant illustrations of dinosaurs drawing, painting, and playing, this book will captivate and inspire children as they learn their colors."}, {"id": "0736842845", "genre": "Children's Books", "title": "From Corn to Cereal (From Farm to Table)", "description": "Provides an introduction to the basic concept of food production, distribution, and consumption by tracing the production of cereal from corn to the finished product."}, {"id": "1634286006", "genre": "Children's Books", "title": "Monster Trucks Coloring Book", "description": "They're big, they're loud, and they ignite the delight of a child and inspire a world of color in the pages of the Monster Truck Coloring Book. Where tires can be pink or green, have polka dot hoods, and orange doors if so desired. Explore the world of Monster Trucks on each page and customize the color of each vehicle. What trucks! What size! What colors? The Monster Truck Coloring book engine is roaring and ready!"}]