[{"id": "0786856548", "genre": "Children's Books", "title": "13-16: Cheetah Girls: Off the Hook!: Bind-Up #4 (Cheetah Girls, 4)", "description": "The Civil War is at an end, but for thirteen-year-old Eulinda, it is no time to rejoice. Her younger brother Zeke was sold away, her older brother Neddy joined the Northern war effort, and her master will not acknowledge that Eulinda is his daughter. Her mettle is additionally tested when she realizes her brother Neddy might be buried in the now-closed Andersonville Prison where soldiers were kept in torturous conditions. With the help of Clara Barton, the eventual founder of the Red Cross, Eulinda must find a way to let go of the skeletons from her past."}, {"id": "0008149356", "genre": "Children's Books", "title": "Women in African History – Wangari Maathai", "description": "A short history of the life of one of the incredible women highlighted in UNESCO’s Women in African History series. Wangari Maathai was founder of the pioneering Green Belt Movement in Kenya.Wangari Maathai, born in rural Kenya, was a scholar and environmental activist who founded the pioneering Green Belt Movement in 1977. The Movement encourages people, particularly women, to plant trees to combat environmental degradation. Wangari Maathai’s holistic approach led her to link environmental responsibility to political struggles of governance, human rights and peace. She was awarded the Nobel Peace Prize in 2004.Wangari Maathai’s story is told through comic strip illustrations by Eric \"Zoe\" Muthoga a self-taught Kenyan artist, illustrator, and author of comic strips."}, {"id": "B00KKXU8SQ", "genre": "Children's Books", "title": "Peace Day: (Plus The Peace Pledge) (Peace Kids Adventures)", "description": "The Peace Kids help promote the United Nations International Day of Peace, a worldwide day of peace on September 21.  This edition also includes the full-length book, The Peace Pledge.  With full-color illustrations by Ginger Nielson."}, {"id": "1434296660", "genre": "Children's Books", "title": "Month of Waters and Independence Day (Batman: Li'l Gotham)", "description": "During Japan's Month of Waters, Aquaman calls upon The Dark Knight, so get ready for a battle of GIGANTIC proportions as the Bat-family faces robots, sea monsters, and more. Then, on Independence Day, Uncle Sam implores his villainous friends to steal all the fireworks for one explosive celebration!"}, {"id": "0756637651", "genre": "Children's Books", "title": "DK Eyewitness Books: Ancient Egypt", "description": "Now in Paperback! In Eyewitness: Ancient Egypt, travel back in time and discover one of history's most remarkable civilizations — from the legends of the great Pharaohs to the triumphs of the ordinary people. Explore the inside of the Great Pyramid in Giza, or learn how Tutankhamun's tomb was found. Images and supported text throughout the book showcase the pottery, weapons and other objects Ancient Egyptians left behind, the architecture they created, the food they ate, their system of Hieroglyphic writing, and more, giving an eyewitness account of this incredible empire. For over 25 years, DK's Eyewitness books have been the most trusted nonfiction series in classrooms, libraries, and homes around the world. In summer 2014 this award-winning series will get a fresh new look both inside and out. The introduction of paperback editions, eye-catching jackets, and updated interiors ensure that the Eyewitness series will continue to be relevant in the ever-changing world of education and remain the go-to source for homework help, research projects, reluctant readers, ESL students, and, as always, to satisfy the minds of curious kids. Supports the Common Core State Standards."}]