[{"id": "B00FNVUTVQ", "genre": "Children's Books", "title": "Stories of South America (Illustrated)", "description": "Our schools have neglected too long to instruct our youth in the history and natural resources of the South American republics. Most of the literature on South America published in this country consists of books of travel, which, as such, are unsuitable as texts for our elementary or secondary schools. The rising generation, however, should know that near our southern limits lies a continent that has a history as interesting as that of the ancient Greeks and Romans and as entertaining as that of any nation of modern Europe. They should know that within this century these South American republics may possibly become our greatest competitors in the commerce of the world and share the prestige of demonstrating the purpose of democratic government. They should know that many of our own citizens have moved to South America and established colonies in the Amazon valley and elsewhere; and they may ask, as our country becomes more and more thickly populated, whether the surplus from North America will not go to enlarge the peoples of South America."}, {"id": "1592960332", "genre": "Children's Books", "title": "Rock Climbing (Kid's Guides to the Outdoors)", "description": "An introduction to rock climbing, discussing basic techniques, safety measures, the necessary equipment, and popular places to climb."}, {"id": "B005WMBJ9M", "genre": "Children's Books", "title": "A History of Tombstone, Arizona for Kids", "description": "A short illustrated history of Tombstone Arizone in easy-to-read English for kids, including the story of \"The Gunfight at the O.K. Corral.\""}, {"id": "1931127492", "genre": "Children's Books", "title": "Shiny Dinah: Sing, Dance, and Read With Me (Kindermusik Library)", "description": "Shiny Dinah Choo-Choo! Shiny Dinah shines her way through tunnels, around the bends, all day long and into the night, clickety-clacking down the track. Book, cassette. Recommended age range is 3-5 years."}, {"id": "B00OWZ7MGO", "genre": "Children's Books", "title": "Secrets to Educational Success: How YOU can be an A+ Student", "description": "Secrets to Educational SuccessHow YOU can be an A+ StudentStudents who do well in school are on the path to a life full of choices, comfort, and enough free time to enjoy the things they love.  But how do they do it?  What are the tricks to being a successful student?  In this book, written by long-time educator Sara Van Donge, you will learn 10 tried and true strategies for classroom success.  Including what to do in the classroom, how to manage your materials, and how to study for tests, anyone can learn techniques to improve as a student.  Written in a clear, positive tone, this book is designed to give students tips they can apply immediately for academic success."}]