[{"id": "1521736766", "genre": "Science Fiction & Fantasy", "title": "The Vagabond Codes: A Young Adult Survival Thriller", "description": "In the not-too-distant future, Southern California -- and maybe the world -- lies in ruins. A catastrophic electromagnetic pulse, now known as the Surge, pulled the plug on society and left millions of unprepared people in darkness, panic, and mayhem. But the party is just beginning for the bloodthirsty gangs; Ferrari-driving demonic cults; former virtual reality addicts called deadheads; and last but not least, the Vagabonds -- artificially intelligent robots with a psychotic obsession to be the only survivors of the human race. In this world of shadow and fire, fourteen-year-old Benedict Knight carries the immense burden of protecting his fellow orphans at his family's hidden desert retreat. The Knights had prepared for TEOTWAWKI, but with seventeen mouths to feed, supplies are running dangerously low. It's been a year since the Surge, and Ben is on the run from killer machines after a daring night mission ends with tragedy. On a remote stretch of highway, he happens upon the mysterious Stranger, who has a startling revelation about the Knight family that could change the course of history. Or so he says. Torn between defending his friends and fulfilling a father’s dying wish, Ben sets off on a perilous journey in search of the final link in the Vagabond Codes. JD Stone -- a lawyer and former English teacher -- delivers an original post-apocalyptic epic that is equal parts adventure and drama, science-fiction and realism ripped from today's headlines."}, {"id": "B00D3A97IU", "genre": "Science Fiction & Fantasy", "title": "Extinct", "description": "Channel Two predicted a blanket of snow for Thanksgiving weekend--unusual, but not alarming for the little Maine island. What comes is a blinding blizzard, and a mass disappearance of nearly every person Robby Pierce knows. He and his family flee, trying to escape the snow and the invisible forces stealing people right from the street.*** Join the mailing list at http://www.ikehamill.com to receive Ike's next book free. ***Miles away, Brad Jenkins battles the same storm. Alone, he attempts to survive as snow envelops his house. When the storm breaks, Brad makes his way south to where the snow ends and the world lies empty. Join Brad, Robby, and the other survivors as they fight to find the truth about the apocalypse and discover how to live in their new world.Look for the sequel, \"Instinct,\" on sale now."}, {"id": "1535171782", "genre": "Science Fiction & Fantasy", "title": "1: The Forgotten Federation (Volume 1)", "description": "Four words changed the world: THE FEDERATION IS DEAD. It was the impossible war—the heroes of the Federation against the scourge of the planet Xenoe and their dictator, Goliaric. With the weaknesses of the Federation exposed, both sides crumbled. After Earth’s heroes were dead, Ophelia Keating conquered the political podium, pushing her way into the Presidential chair and closer to world dominance. The new commander-in-chief was free to enact changes to “better” the world which included establishing a one-world governmental body known as Parliament. Then came the worldwide decree intended to control Earth’s overwhelming population crisis Keating called HRV-EST, the Human Reproductive Vector, yet another shackle on the human race. But that was years ago, too many years for Doctor Andre Hudson to remember. He lost faith long ago, shedding his youthful alter ego, Hacker, and conceding to a monotonous, middle-aged life. That is, until accounts of superhuman happenings begin to flood the headlines. His hope is rekindled as the search begins for the young superheroes. He must locate the newfound champions and prepare them for combat before they are destroyed by a government that wants to crush the Insurgence once and for all. But will his young superheroes be willing to fight a war that is not their own? Enter a dystopian world of superheroes and archenemies built especially for you by the workers of FICTION FACTORY INCORPORATED"}, {"id": "1682616363", "genre": "Science Fiction & Fantasy", "title": "EMPulse2", "description": "What would change if the lights went out…permanently?Adele Michaels had found safe haven from her abusive ex-husband at the Rocky Mountains Geo-Domes resort. But when a nuclear electro-magnetic-pulse took down the entire power grid, multiple warheads turned the east coast into an unstable hot zone. Adele may be safe at the resort, but she's also stranded far from home and family. Now she must undertake a long and perilous journey from Montana to Michigan, and two of her new friends aren't about to let her make the journey alone. Faced with both friend and foe, the travelers find themselves on a dangerous path. Will finding her mother be enough for them to start rebuilding their new lives?"}, {"id": "B00U7U2DNK", "genre": "Science Fiction & Fantasy", "title": "1634: The Bavarian Crisis", "description": "The Thirty Years' War continues to ravage seventeenth-century Europe, but a new force is gathering power and influence: the Confederated Principalities of Europe, an alliance between Gustavus Adolphus, king of Sweden, and the West Virginians from the twentieth century, led by Mike Stearns, who were hurled centuries into the past by a mysterious cosmic accident. The CPE has the know-how of twentieth century technology but needs iron and steel to make the machines. The iron mines of the upper Palatinate were rendered inoperable by wartime damage, and American know-how is needed on the spot to pump them out and get the metal flowing again - a mission that will prove more complicated than anyone expects. In the maelstrom that is Europe, even a twentieth-century copy of the Encyclopedia Britannica can precipitate a crisis when readers learn of the 1640 Portuguese revolt, a crisis that will involve Naples as well. Another factor: Albanian exiles in Naples, inspired by the Americans, are plotting to recover lost Albanian turf, which will precipitate yet another crisis in the Balkans. This troubled century was full of revolutions and plans for more revolutions before the Americans arrived and gave every would-be revolutionary an example of a revolution that succeeded. Europe is a pot coming to a boil, and Mike Stearns will have his hands full seeing that it doesn't boil over on to Grantville and the CPE."}]