[{"id": "B00FY2T7DA", "genre": "Children's Books", "title": "Barnaby Grimes: Return of the Emerald Skull", "description": "Barnaby Grimes is a tick-tock lad, running errands in his city, day and night, and high-stacking around the rooftops in search of new mysteries to solve. After collecting a strange parcel from a deserted ship in the fog of the docks, and delivering it to the local schoolmaster, Barnaby thinks he's earned a moment to sit on the rooftops and eat his favorite pastry. But soon he realizes that all is not well at the school. Is the problem quite as he expects it? A gruesome tale of a school overrun by a terrible curse—who will survive?"}, {"id": "0939217651", "genre": "Children's Books", "title": "1-2-3 Draw Princesses: A Step-By-Step guide", "description": "Starting with simple lines and shapes, and step-by-step instructions, budding artists can create a basic princess (front or side view), princesses in history - from Eleanor of Aquitane of France, Nes Amun of Egypt, Jahanara of India, Nzinga of Africa and princesses in art. It's not just about the tiara. Learn how to also draw a queen, king, castle, hat, and wand, prince, carriage and horses."}, {"id": "1609922379", "genre": "Children's Books", "title": "A Midsummer Night's Dream (Tales from Shakespeare)", "description": "This attractive series retells some of Shakespeare’s most popular and well-known plays, with lively illustrations and contemporary language to make the stories accessible to young readers."}, {"id": "B077JJH1MW", "genre": "Children's Books", "title": "Vaccines (Baby Medical School Book 2)", "description": "Taking your kids to the doctor's office and want to explain vaccines to them?Learn about the molecular makings of immunizations in the second semester of Baby Medical School! Meet some members of our immune system and learn how they handle germs and vaccines to keep us healthy. This is a great gift for a new baby, to prep kids for their doctor visits, or to give as a science lesson to your favorite anti-vaxxer."}, {"id": "B001PO5ICU", "genre": "Children's Books", "title": "Night Before Christmas in Oregon, The", "description": "Santa travels all over Oregon and recalls the fun times he's had there. Then, he meets two boys who ask him for help in getting their mom the perfect Christmas gift. What could Santa suggests? "}]