[{"id": "1617837474", "genre": "Children's Books", "title": "Adele: Singing Sensation (Big Buddy Biographies)", "description": "Presents an introduction to the life and career of the English singer, discussing her musical influences, her big break in the music business, and her personal and professional successes."}, {"id": "1599209837", "genre": "Children's Books", "title": "Special Operations (Action Force: World War II)", "description": "Examines the special operations of World War II, looking at the forces of each nation and pivotal battles."}, {"id": "1478960620", "genre": "Children's Books", "title": "Great Americans in Sports:  Blake Griffin", "description": "This entry in a brand new line of sports biographies from Matt Christopher takes readers onto the court with an all-star who reaches for new heights Blake Griffin is known for being a #1 draft pick, Rookie of the Year, Slam Dunk Contest winner, and one of the best power forwards playing today. But he had to fight to make it onto the NBA court at all after sitting out his first pro season with a devastating knee injury. Learn more about the perennial All-Star in this comprehensive biography, complete with photos and fun infographics."}, {"id": "1532111142", "genre": "Children's Books", "title": "Inside Your Body", "description": "Kids will love learning how their bodies work with the fun and fact-packed Inside Your Body series. From sore throats to broken bones, this engaging series explores some of the illnesses and injuries that keep kids home from school. Easy-to-read text and colorful graphics help young readers explore what's going on inside of them while learning key science concepts. Aligned to Common Core Standards and correlated to state standards. Super Sandcastle is an imprint of Abdo Publishing, a division of ABDO."}, {"id": "1609928342", "genre": "Children's Books", "title": "51 Things to Make with Cardboard Boxes (Super Crafts)", "description": "51 Things to Make with Cardboard Boxes transforms cereal boxes into monsters, robots and much more. Perfect activities for parents and children to do together. The 51 projects feature a well-balanced mix of techniques, materials, colors and styles for a range of ages."}]