[{"id": "1540520161", "genre": "Children's Books", "title": "1: Legendary Warriors and Mystical Giants: Volume One (Volume 1)", "description": "This first volume contains a great collection of mythological tales. Please see below the table of contents:  Connla and the Fairy Maiden - 03 Guleesh - 05 The Field of Boliauns - 19 The Horned Woman - 22 Conall Yellow Calw - 25 Hudden and Dudden and Donald O’Neary - 34 The Shepherd of Myddvai - 40 The Sprightly Tailor - 42 The Story of Deirdre - 44 Munachar and Manachar - 55 Gold-Tree and Silver-Tree - 58 King O’Toole and His Goose - 62 The Wooing of Olwen - 66 Jack and His Comrades - 75 The Shee and Gannon and the Gruagach Gaire - 81 The Story-Teller at Fault - 87 The Sea-Maiden - 96 A Legend of Knockmany - 103 Fair, Brown and Trembling - 111 Jack and His Master - 119 Beth Gellert - 126 The Tale of Ivan - 127 Andrew Coffey - 130"}, {"id": "0062294962", "genre": "Children's Books", "title": "Plants vs. Zombies: Save Your Brains! (I Can Read Level 2)", "description": "Based on the bestselling game, Plants vs. Zombies: Save Your Brains! introduces young readers to Crazy Dave and the fun-dead.The zombies are coming! If you want to save your brains, you'll need to know which plants to use in your garden. Don't worry—Crazy Dave is here to help guide you.I Can Read books are designed to encourage a love of reading. Plants vs. Zombies: Save Your Brains! is a Level Two I Can Read book, geared for kids who read on their own but still need a little help. "}, {"id": "0431073791", "genre": "Children's Books", "title": "Discovering Sacred Texts: The Guru Granth Sahib (Paperback)", "description": "This examination of the sacred texts of Guru Granth Sahib is part of a series on the world's major religions. Each book is written by a practising believer from the faith, and traces the development of the scriptures and their importance to believers today."}, {"id": "0997000546", "genre": "Children's Books", "title": "Small for the Glory of God: Saint John the Dwarf (God's Forgotten Friends: Little-known Saints for Children) (Volume 1)", "description": "Meet Saint John, a little fellow with a huge heart, who did ALL FOR THE GLORY OF GOD and learned to love Him enormously! Being different from others is never easy. Saint John the Dwarf, of all people, could tell you that! Forever standing on chairs to reach things, unable to play games with other children because of his size, and being teased by the village bullies were all hard things to bear, and could have made John bitter and full of self-pity. But John discovered a secret – a great BIG secret – which changed his life and turned him into a giant of a saint. Join Little John on his adventures – from his home to a desert cave, to the altar and beyond – and let him teach you his secret of holiness too! With charming full-color illustrations and easy-to-read text, this first book in Susan Peek's new series for children (companion to her series for teens, “God's Forgotten Friends: Lives of Little-known Saints”) is sure to capture the hearts of Catholic children everywhere."}, {"id": "B017MXCYAQ", "genre": "Children's Books", "title": "Ali Ibn Abi Talib: Hero of Chivalry (Leading Companions of the Prophet)", "description": "Ali ibn Abi Taleb is the fourth Caliph of Islam, but he is the first to remember from among all the Companions of the Prophet Muhammad as far as bravery is concerned. He is a symbol of courage and gallantry as much as a leading spiritual figure in Islam. This book brings to life the biography of this unique hero of Islam, analyzing where and how he was raised, the dynamics that formed his personality and the struggles that he went through in his lifetime."}]