[{"id": "1621274284", "genre": "Children's Books", "title": "Wedges (Simple Machines)", "description": "From zippers and bicycles to cranes and fishing rods, simple machines are all around us. This exciting series explores each simple machine, including how each one works, the forces involved, and examples of how they can be used to make our lives easier. Simple Machines is a series of AV2 media enhanced books. A unique book code printed on page 2 unlocks multimedia content. These books come alive with video, audio, weblinks, slide shows, activities, hands-on experiments, and much more."}, {"id": "B00FM5HE2K", "genre": "Children's Books", "title": "Meet The Pterodactyl: Fun Facts & Cool Pictures (Meet The Dinosaurs)", "description": "\"Meet The Pterodactyl\" - A nonfiction dinosaur book for children.This pterodactyl book is filled with cool pictures and interesting facts about these long gone creatures that once ruled the skies.If you want to learn about pterodactyls, then this book - \"Meet The Pterodactyl\" - will give you the answers to questions, including:- When did the Pterodactyl live?- What was the Pterodactyl's feeding habits like?- How did the Pterodactyl move?- How good was the Pterodactyl's eyesight?- Did the Pterodactyls roam together or were they solitary?... and more!Pterodactyls were amazing creatures and have been studied for many years.  So, if you want your child to know more than their teacher about pterodactyls then you need to grab a copy of \"Meet The Pterodactyl\" right now.Combining fantastic images of the pterodactyl with interesting facts, this is a perfect children's book about this majestic creature.This book uses language that is simple enough for children to read on their own or to read alongside a parent, guardian or teacher.This is one of those must have books for kids."}, {"id": "0382396960", "genre": "Children's Books", "title": "Clothes & Crafts in Aztec Times (Clothes and Crafts Series)", "description": "Examines the crafts, clothing, and festivals of the people who settled in what is now central Mexico more than 700 years ago"}, {"id": "B01EXN74XK", "genre": "Children's Books", "title": "A Merry Shopkins Christmas (Shopkins)", "description": "It's Christmastime, and all the Shopkins are getting ready to celebrate! Strawberry Kiss is wrapping presents. Kooky Cookie and Apple Blossom are decorating the tree. Everyone has a job to do--except Lippy Lips! Can Lippy find a way to bring cheer to Shopville?"}, {"id": "B00SG65EHO", "genre": "Children's Books", "title": "#03 Jack at the Helm (The Berenson Schemes)", "description": "Jack's parents have bought a farmhouse in Nepal. It'll be the site of a new religion―their latest get-rich-quick scheme. Sure, the Berensons don't know quite how to get to the place. But once they arrive, their plan is sure to work. When the Berenson family's travels leave Jack lost in the wilderness of Nepal, a patched-up old raft is the only way to track down his mom and dad. At least this time, Jack has company. He's riding with Harry from Connecticut, a traveling dude who has been trying to find himself―and who also wound up stranded. As Jack and Harry ride down a winding river, they'll have to watch out for rocks, rapids, and even crocodiles!"}]