[{"id": "B005FOIDIM", "genre": "Children's Books", "title": "One Million Things: Space", "description": "There are millions of stars in the sky and millions of things to learn about the universe, and One Million Things: Space serves up imagery and information about all things cosmic: from planets, moons, and comets, to black holes, nebulae, distant solar systems, and more."}, {"id": "0698114124", "genre": "Children's Books", "title": "Too Many Tamales", "description": "Christmas Eve started out so perfectly for Maria. Snow had fallen and the streets glittered. Maria's favorite cousins were coming over and she got to help make the tamales for Christmas dinner. It was almost too good to be true when her mother left the kitchen for a moment and Maria got to try on her beautiful diamond ring . . .This is the story of a treasure thought to be lost in a batch of tamales; of a desperate adn funny attempt by Maria and her cousins to eat their way out of trouble; and the warm way a family pulls together to make it a perfect Christmas after all."}, {"id": "1538214059", "genre": "Children's Books", "title": "Women Scientists in Chemistry (Superwomen in Stem)", "description": "Marie Curie is one of the most famous chemists in history for her groundbreaking discoveries in radioactivity, but many people don't know that her daughter, Irne Joliot-Curie, also pioneered the field of chemistry and received the Nobel Prize in 1935. This engaging book sheds light on incredible women chemists, the obstacles they overcame, and their groundbreaking accomplishments. Mini bio boxes of each featured scientist give readers fast facts, and quotes from the scientists and their contemporaries inspire readers to explore the wonders of STEM for themselves. A gallery spread introduces to even more famous women chemists, while a thorough timeline marks the progress of women in chemistry. A concluding \"Science Now\" spread gives readers a view of where the field of chemistry is at today. Charmingly illustrated and full of stunning photographs, this book will be an inspiring addition to any library or classroom."}, {"id": "B0083GQSYA", "genre": "Children's Books", "title": "06 Kidnapped in the Kafue (Wallace Boys)", "description": "This is the sixth in the Wallace Boys series. Winner of the Highly Commended Award by the National Book Development Council of Singapore, this adventure takes place in the Kafue National Park of Zambia. Here the Wallace Boys and Muyunda visit Muyunda’s uncle, the Chief Game Warden in the park.Apart from the uncle acting weirdly, the boys discover very soon that they are on the trail of a vicious gang of poachers who have teamed up with a group of terrorists. Set against the exciting backdrop of Africa’s magnificent wildlife, including a cantankerous elephant that chases cars and buffaloes used as a decoy, the story leads the three boys in an ancient Land Rover, named by the boys ‘Lazarus’ for obvious reasons, to track down the poachers, the terrorists and what is upsetting Muyunda’s uncle."}, {"id": "0689828357", "genre": "Children's Books", "title": "Red Caboose: A Little Lionel Book About Colors (Lionel Trains)", "description": "When Red Caboose chugs through a contemporary country town, multicolored cars teach little engineers about working on the railroad, in a train-shaped board book with real model-train photographs set in painted backgrounds."}]