[{"id": "1943813590", "genre": "Science Fiction & Fantasy", "title": "Drowning in Beauty: The Neo-Decadent Anthology", "description": "From the ashes of countless decayed Modernities comes Neo-Decadence, a profaned cathedral whose broken stained glass windows still glitter irregularly in the harsh light of a Symbolist sun. Behind this marvellously vandalised edifice, a motley band of revellers picnic in the graveyard of the Real, leaving behind all manner of rotting delicacies and toxic baubles in their wake. During the last eighty years, world culture has seen an explosion of popular aesthetics, art-forms and the movements associated with them: clothing, trends in fashion, tattoos, recreational drugs, musical sub-cultures, cosmetics, photography—all of which can be the subject of obsessions, damnations and salvations. Devices and formats, initially vulgar, are worshipped, only to be forgotten by all but the few initiates who, through their maniacal fixations, manage to uncover their hidden allure. These twelve stories and their preceding manifestos, then, arise from a shift in aesthetic consciousness: synaesthesia, ecstasy in extremes, the Divine and Infernal alike seen through a neurasthenic lens of supreme focus."}, {"id": "1537314394", "genre": "Science Fiction & Fantasy", "title": "The Dire Wolf of Pelham Parkway: Sales Survivor", "description": "Flat broke in Manhattan after an extended run of middle-aged adolescent bliss, unemployed salesman and writer, Lance Bedrosian, flees to the Bronx to reinvent himself. As the Prodigal Son of Pelham Parkway assimilates to strange surroundings, he lands a job at Sleep Dine and Furnish, and is then torn between the thrill of surviving and thriving on a competitive sales floor of sharks, or patiently establishing himself in a realm of writers and professors. A surprise romantic fling, and a prestigious job offer, force him to choose between what he believes he wants, and what he truly desires. Lance discovers that it’s never too late to start anew when you’ve got nothing to lose. The Dire Wolf of Pelham Parkway, is an intense and hilarious expedition into the gut of a cutthroat sales floor."}, {"id": "B00ER7IKPE", "genre": "Science Fiction & Fantasy", "title": "The Circle", "description": "He was created for only one person. She was never supposed to be the One. It is 1988 and Lilly, a shy high school senior with a non-existent social life, is forced to live out her romantic fantasies through the fictional characters of her books. That all changes when she issues a spur of the moment invitation to the strange new kid. The world Charlie comes from is much different than Earth. Almost every aspect of a Sentrian's life is under complete government control. There is only one right the intrusive authorities may not violate: that God chooses your soul mate. While on his planet, Charlie never found his One, so when he develops an attraction to Lilly, he is torn. Should he ignore his feelings for the Earthan, or pursue a doomed relationship with the only girl he has ever cared about? His contact with Lilly does not go unnoticed. Involvement with an Earthan is considered blasphemy, and Charlie is condemned as a criminal of the state. The couple is faced with a difficult choice: accept eternal separation or risk everything to stay together."}, {"id": "1481040936", "genre": "Science Fiction & Fantasy", "title": "Portals", "description": "If you wanted to end your life, would a first contact with an alien stop you? Paul Stevens' wife of thirty years was dead, and after months of grief he was ready to end his life. Then something incredible happened – an alien girl dropped into his world through a portal, a hole in space. Trina, from the distant planet Freyda, appears to be in her late teens, but she's mysteriously a lot older than she looks. She wields twin swords of unearthly power and has wondrous healing gifts. But an army from her world has followed Trina to Earth. Nine feet tall, riding dragon eagles, they search for the Angrelline, a legendary warrior with healing powers who can use her swords to open the space portals. The warriors want to fetch her home to bring peace, but their warmongering general wants to capture her and harness her powers to dominate his planet – or kill her if she resists. When Trina saves Paul's life from a warrior attack, he decides to put his suicide on hold and to use his contacts as a newspaper science writer to help Trina escape. But time is running out. Earth is marshalling its forces to combat the aliens, and a genetics conglomerate, GenCorp, wants the alien woman and her technology to increase their corporate bottom line. And day after day, for some unknown reason, living on Earth drains Trina's strength. She needs to get back home, but the portal is broken, allowing passage only from Freyda to Earth. This is a story of first contact, of a clash of cultures and of a race to restore the balance of power between two planets. But it's also the story of a grieving man, rocked by mind-boggling revelations, searching for a reason to live."}, {"id": "1548001813", "genre": "Science Fiction & Fantasy", "title": "The Line", "description": "On a barren planet, only the City remains. Those who seek its protection are forced into a restrictive caste system based on their usefulness to the common collective. The people have had no choice but to accept their fate, until now.   Daryl, a thief and worse, has just been released from the brutal confines of the Prison. It takes all the inner strength the ex-convict has to cope with the psychological scars inflicted by the cruel wardens. Things just get worse when Daryl is recruited for a criminal undertaking that will have major ramifications for the entire City.   Lyons Emmett is the head of Madman, an organization that rules the criminal underworld. He believes that Daryl owes him a favor, and he isn’t above sending his fearsome enforcer, Jace Locket, to emphasize what could happen if Daryl refuses.   As Daryl and Locket form a strange alliance to stay one step ahead of Lyons, Daryl will have to confront the brutality of the Prison. It took Daryl’s sanity, security, and more. Can they be stolen back?   This new thriller by debut author K. J. Southworth combines social commentary with dazzling action sequences to create an unforgettable world full of striking characters. "}]