[{"id": "1781212309", "genre": "Children's Books", "title": "North Africa and Europe: 1940-1945 (World War II: The Full Story)", "description": "World War II defined the lives of a generation and shaped the modern world. This new series gives readers an accessible summary of the war and an understanding of what the experience was like for those who lived through it-from the perspective of soldiers, generals, nurses, politicians and civilians."}, {"id": "153821167X", "genre": "Children's Books", "title": "Inside the Lgbtq+ Movement (Eyewitness to History)", "description": "The first American gay rights organization formed in 1924, but was soon pressured to disband. Another wouldnt form until the 1950s. The history of the U.S. movement to achieve progressive rights for people who identify as lesbian, gay, bisexual, transgender, transsexual, or queer is full of stops and starts and victories and tragedies, but also hope for the future. This important and timely volume describes a topic of history often glossed over and a movement that is still working to effect change. Key figures are featured as well as crucial events, both past and present."}, {"id": "0756619815", "genre": "Children's Books", "title": "Eye Wonder: Arctic and Antarctic", "description": "Shows and describes wildlife found in the Polar regions, looks at Inuit clothing and artifacts, and depicts the equipment used by Polar explorers."}, {"id": "0737710071", "genre": "Children's Books", "title": "Nature's Predators - Tigers", "description": "Beautiful, regal, and full of mystery, the tiger is one of the most feared and loved predators in the world. Learn about the way the world's largest cat hunts, catches, and kills its prey."}, {"id": "075666277X", "genre": "Children's Books", "title": "Space: A Visual Encyclopedia", "description": "Featuring a wealth of never-before-published NASA photographs, charts, stories, and contributions by NASA astronauts and experts, Space: A Visual Encyclopedia is a comprehensive exploration of space from our nearest planets and stars to far-off galaxies. Supports the Common Core State Standards."}]