[{"id": "B00A4KQ0R8", "genre": "Children's Books", "title": "Alia's Mission: Saving the Books of Iraq (Dragonfly Books)", "description": "The inspiring story of an Iraqi librarian's courageous fight to save books from the Basra Central Library before it was destroyed in the war.It is 2003 and Alia Muhammad Baker, the chief librarian of the Central Library in Basra, Iraq, has grown worried given the increased likelihood of war in her country. Determined to preserve the irreplacable records of the culture and history of the land on which she lives from the destruction of the war, Alia undertakes a courageous and extremely dangerous task of spiriting away 30,000 books from the library to a safe place.Told in dramatic graphic-novel panels by acclaimed cartoonist Mark Alan Stamaty, Alia's Mission celebrates the importance of books and the freedom to read, while examining the impact of war on a country and its people."}, {"id": "0618369236", "genre": "Children's Books", "title": "Kids On Strike!", "description": "By the early 1900s, nearly two million children were working in the United States. From the coal mines of Pennsylvania to the cotton mills of New England, children worked long hours every day under stunningly inhumane conditions. After years and years of oppression, children began to organize and make demands for better wages, fairer housing costs, and safer working environments. Some strikes led by young people were successful; some were not. Some strike stories are shocking, some are heartbreaking, and many are inspiring — but all are a testimony to the strength of mind and spirit of the children who helped build American industry."}, {"id": "B0099QFZEC", "genre": "Children's Books", "title": "The Story of Holly and Ivy", "description": "Ivy, Holly, and Mr. and Mrs. Jones each have one Christmas wish. Ivy, an orphan, wishes for a real home and sets out in search of the grandmother sheÕs sure she can find. Holly, a doll, wishes for a child to bring her to life. And the Joneses wish more than anything for a child to share their holiday. Can all three wishes come true? Rumer GoddenÕs classic tale, illustrated by Caldecott Medal winner Barbara Cooney, is filled with the warm glow of the Christmas spirit."}, {"id": "162024764X", "genre": "Children's Books", "title": "Land of the Lost Socks", "description": "Liz and Oscar's puppy Mochi loves to play her favorite game-hide the socks under the bed! She soon makes friends with all the socks she gathers under the bed. She's even invited to attend the Annual Sock Fest with them! Find out what Mochi and her friends Fuzzy, Dottie, Stripes, and many more do in the Land of the Lost Socks!"}, {"id": "0874834791", "genre": "Children's Books", "title": "Wisdom Tales from Around the World (World Storytelling)", "description": "Winner of PLA/ALLS Best New Books for New Adult Readers and the Storytelling World AwardThis collection of fifty folktales and parables was selected from diverse story traditions such as Sufi, Zen, Taoist, Buddhist, Jewish, Christian, African, and Native American. Comprised of ancient plots both poignant and comical, this anthology contains simple truths, common sense, and the promise that we can benefit from past generations' wisdom and experience.By metaphorically suggesting constructive strategies for living, these ancient tales resonate with a universal appeal. \"The characters in these stories may gain wisdom by observing a good example or by bumbling through their own folly,\" Heather Forest observes. \"I hope these stories will provide discussion and offer insight into joys, sorrows, fears and farce of human experience.\" Wisdom tales offer useful insights into life's joys and sorrows that all of us experience. "}]