[{"id": "0692549684", "genre": "Science Fiction & Fantasy", "title": "He Without Sin", "description": "Aboard the Hobbe, a spacefaring team enters a distant star system. He Without Sin chronicles their actions on a beautiful and largely unpopulated world. Their decisions and interactions have far-reaching consequences both for themselves and for the planet’s future. Spanning millennia, He Without Sin will challenge readers to question society's long-held beliefs."}, {"id": "B016VCHZTY", "genre": "Science Fiction & Fantasy", "title": "Small Wars: A Tor.Com Original (A Sin du Jour Affair)", "description": "The Sin du Jour procurement team has been tasked with acquiring a substantial cache of rare Welsh gold for a rather important event, but when they stumble upon rivals factions of the smallest warriors they've ever encountered, they'll need to bring out the big guns if they're to survive.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}, {"id": "0684805936", "genre": "Science Fiction & Fantasy", "title": "Science Fiction Writers Edition 2. (2nd Ed) (Scribner Writers Series)", "description": "Since the first edition was published in 1982, many new writers have joined the pantheon of greats in this genre. New classics have been discovered and unknown treasures that lay buried have been unearthed. Twenty new essays have been added on authors ranging from Gregory Benford and Katherine MacLean to Lucius Shepard and Gene Wolfe. In addition, 19 essays have been extensively revised. Pictures of most of the 96 authors have been added and the set has been reorganized in alphabetical order for ease of use."}, {"id": "1932564837", "genre": "Science Fiction & Fantasy", "title": "Classic Battletech: Technical Readout: Project Phoenix (FPR35032)", "description": "As the FedCom Civil War swung into high gear and conflict swept through the Inner Sphere, the need for additional war materials was paramount. However, unlike many companies, which produced new, but expensive, BattleMechs, a new upstart company, Vicore Industries, took a different route. By taking centuries old machines and upgrading both their physical as well as technological capabilities, Vicore almost single handedly started a revolution that provided a cheap means to bring 'new' BattleMechs to the field commanders desperate for more assets. Classic BattleTech Technical Readout: Project Phoenix provides descriptions, game statistics and illustrations for twenty-nine classic BattleMechs that have been upgraded both in appearance and technology. Also, for the first time in any technical readout, additional illustrations representing all the variants for every design in the book are also included. This is the corrected second printing."}, {"id": "B076P28KY5", "genre": "Science Fiction & Fantasy", "title": "Rosinanti: Rise of the Dragon Lord (Rosinanti Series Book 3)", "description": "Valentean Burai, White Dragon of the Rosinanti, suffered a stunning defeat within the shadow of a desolate ancient city. Beaten and burned to the point of near death, he recovers among his closest friends and allies, while harboring a dark secret. The flames of chaos have latched onto his soul, granting him the power of his ancient enemy, but at the cost of his compassion, his kindness, and everything that makes him who he is.Word of Valentean's newfound ferocity and unnatural ability to transform into a vicious dragon has spread to all corners of Terra, earning him the moniker of \"Dragon-Lord\"Meanwhile, a world away, Princess Seraphina Kackritta, The Ice Queen, continues to fight against the forces of chaos that have claimed her homeland. Far from the man she loves, Seraphina must focus her magical abilities and lead an armed resistance to reclaim her kingdom from the shadowy evil that has enveloped her people.As the flames of chaos spread out to envelop all of Terra, the Dragon-Lord and Ice Queen must find their way back to one another, and stand together with their allies to beat back the chaotic inferno that threatens to swallow everything they've ever known."}]