[{"id": "0399234446", "genre": "Children's Books", "title": "Gingerbread Baby", "description": "Remember how the Gingerbread Boy is eaten by the fox? Well, not this Gingerbread Baby in a delicious twist to a favorite old tale.It all begins when Matti opens the oven too soon and out jumps a cheeky little Gingerbread Bay. He leads Matti's mother and father, the dog and the cat. And a whole colorful cast of characters on a rollicking chase through the village and into the forest, staying just out of reach, daring them to catch him along the way.But Matti's not with them. He's at home in the borders making what turns out to be a gingerbread house into which the Gingerbread Baby runs. Only Matti knows he is safely inside. And readers will too when they look under the lift-the-flap gingerbread house at the end of the story, and there he is!"}, {"id": "1780555016", "genre": "Children's Books", "title": "The Kids' Book of Sudoku 1 (Buster Puzzle Books)", "description": "The perfect book for ace puzzlers and kids who like a challenge, The Kids' Book of Sudoku 1 helps to develop mental arithmetic and logic skills. With a simple tutorial filled with invaluable tips and tricks, and puzzles that range in difficulty, this book is perfect for anyone from complete beginners to the ultimate sudoku-solvers."}, {"id": "1927309468", "genre": "Children's Books", "title": "Biology for NGSS (2nd Ed)", "description": "Biology for NGSS has been specifically written to meet the requirements of the Next Generation Science Standards (NGSS) for High School Life Sciences (HS-LS). It is a hybrid resource that's part textbook, part study guide and part activity book all rolled into one. We use an infographic style of presenting information, with annotated diagrammatic explanations. Our program and pedagogical approach requires learners to apply what they've learned in a previous activity to a new situation, not merely recall data. It's an enquiry-based approach."}, {"id": "1480837679", "genre": "Children's Books", "title": "Dinosaur Detective: Thomas “t” Rex and the Case of the Angry Ankylosaurus", "description": "Thomas \"T\" Rex is a dinosaur super sleuth. He's kind of a loner, being top of the food chain and all, but he never eats his clients...well, mostly never. To be honest, he scares other dinosaurs, which works really well during his many investigations. Do you have a missing family member, or have you lost something important? Then, Thomas is your dinosaur. Alistair is an angry Ankylosaurus, and what brings him to Thomas's door is a deplorable robbery of ferns. Who would steal Alistair's favorite snack and, even worse, on his birthday? Thomas is hot on the trail, but there are so many sets of footprints at the crime scene! Will he ever figure out which herbivore is the culprit? Thomas, expert sleuth that he is, must solve this mystery in time to save poor, angry Alistair's birthday—or is something other than thievery going on here? With a focus on successive letters of the alphabet, the Dinosaur Detective series helps kids identify emotions, solve problems, and become familiar with letters of the alphabet. There are humorous asides for parents, too, as Thomas stomps his way to crime-fighting king."}, {"id": "0060877111", "genre": "Children's Books", "title": "Whales", "description": "Whales are among the biggest creatures that have ever lived on our planet. Some whales grow bigger than one hundred feet long and can weigh as much as fifty cars or more. They are huge, majestic creatures, yet we rarely ever lay eyes on them. Acclaimed science writer Seymour Simon introduces you to one of the world's truly amazing animals."}]