[{"id": "1478782684", "genre": "Children's Books", "title": "Confessions of a Mad Inventor: Surviving Failed Inventions", "description": "Flaming hair, and a knot on the back of the head would have been enough to discourage most boys, but it only lit the fire under Robert's passion for inventing. Robert's first invention was a rocket plane. At the age of six, he borrowed one of his brother's bottle rockets, and glued it to the side of a toy balsa glider. The rocket plane functioned flawlessly, making a high speed loop, and hitting young Robert in the back of the head. Robert not only learned some painful facts about aeronautics that day, but also, the fine art of extinguishing a fire in one's hair! Having narrowly survived his deep diving experiment, and his electric worm extraction device, young Robert continued testing fate, by obtaining a private pilot's license, inventing a lightening powered x-ray machine, and a motorized wheelbarrow. Later, a sail powered bicycle, and his perilous first attempt at hitch-hiking nearly ended his innovative ambitions."}, {"id": "B00IFD2REG", "genre": "Children's Books", "title": "Poems for a Greener Earth", "description": "POEMS FOR A GREENER EARTH -- The twenty-nine poems contained in this book incorporate a variety of topics related to taking better care of the planet we all call home.  Also included are descriptions of twenty different poetry forms that were used to create the poems.  Interest level:  age ten through adult"}, {"id": "B077KT5RSX", "genre": "Children's Books", "title": "The Real Me: Boys RULE! (The Real Me Series Book 1)", "description": "You are special, unique and important!Join us on the Journey as we discover the real you.This is a great book for ✅ Bedtime Reads ✅  Morning Wake-ups and✅ Afternoon Affirmations  Reminding your precious little one just how important they are. Birth from the mommy and mini-minds of the authors when doing their daily affirmations and reminders of just how special our little people are.Enjoy this awesome book for \"I am\" statements/ affirmations. Such an amazing expression of love for others, this is the encircling of love for all who are in need of love."}, {"id": "030797698X", "genre": "Children's Books", "title": "Not That Tutu!", "description": "Taylor loved her tutu and wore it all the time, day and night. She wore it to school and she wore it in the pool, much to the mild annoyance and amusement of her friends and family. Will she ever give up that tutu?With style and humor, this charming board book addresses young children's attachments to specific articles of clothing. Hiroe Nakata's playful illustrations are the perfect complement to Michelle Sinclair Colman's lively rhyming text. And the cover features a tulle tutu!"}, {"id": "1482376008", "genre": "Children's Books", "title": "ABC's for ID Fellows", "description": "Everyone needs to know their ABC's. This book is dedicated to all students of Infectious Diseases in helping to find balance. It is a way for trainees to learn while reading to their children at the same time. Sure, your kids might not be able to pronounce most of the content here, but at least they can learn their ABC's."}]