[{"id": "0486298361", "genre": "Children's Books", "title": "Fun with Horses Stencils (Dover Stencils)", "description": "Kids who love horses will have hours of fun with the brightly colored pre-cut stencils in this appealing collection. Six sturdy designs depict \"man's second-best friend\" engaged in a variety of equine activities: running, grazing, leaping, and trotting. Ready to help decorate bulletin boards, posters, walls, furniture, and other flat surfaces, these multi-purpose stencils will also appeal to graphic designers and craftworkers."}, {"id": "1510723706", "genre": "Children's Books", "title": "Extreme Stories from the Extreme Hills: 5-Minute Adventure Stories for Minecrafters (5-Minute Stories for Minecrafters)", "description": "While Audrey yearns for new adventures, her brother Oliver dreams of hidden treasures. When the twins explore different biomes, they find plenty of both in 5-Minute Adventures for Minecrafters, an all-new series of stories for Minecrafters that can be read in 5 minutes! In Extreme Stories from the Extreme Hills, Audrey and Oliver collect many treasures―and mini adventures. For every dangerous hike up a rocky cliff, there’s a waterfall roaring back down. Each dungeon hides a treasure chest―but also a monster spawner! As the mobs get deadlier, the stakes grow higher. The twins hope to make it back to Birchtown with their treasures in hand. Will the next ravine lead to riches or to a river of hot lava? There’s only one way to find out. These five-minute stories promise plenty of twists and turns―and surprise endings. In 5-Minute Adventures for Minecrafters: Extreme Stories from the Extreme Hills, the twins explore one of the Overworld’s most treacherous terrains, one exciting step at a time."}, {"id": "1590182863", "genre": "Children's Books", "title": "Comets and Asteroids (Lucent Library of Science and Technology)", "description": "Discusses comets and asteroids and how scientists have studied them throughout history, describes their characteristics, and explains what happens when they collide with Earth."}, {"id": "0817250042", "genre": "Children's Books", "title": "Hot Deserts (World Habitats)", "description": "Introduces some notable deserts around the world, including the Sahara Desert in Africa, the Sonoran Desert in North America, and the Simpson Desert in Australia"}, {"id": "B077YT6C43", "genre": "Children's Books", "title": "Herobrine and Dragon Boy Episode 1: Minecraft Ender Dragon Rider (Herobrine and Dragon Boy Comic Series)", "description": "Herobrine, Jack and their friend Aella set off through the ender portal to the end, after Jack trades a piece of armor for some ender pearls.There they find themselves sorely outnumbered by a pack of vicious endermen and a deadly battle ensues. Our heroes have to fight their way past a horde of mobs and just when they thought things couldn’t get worse, the ender dragon appears and attacks from the skies above. But as all seems lost Dragon Boy appears..."}]