[{"id": "B00IGEIXII", "genre": "Children's Books", "title": "The Story of Sir Launcelot and his Companions (Illustrated)", "description": "Wherefore if it will please you to read that which is hereinafter set forth, you will be told of how Sir Launcelot slew the great Worm of Corbin; of the madness that afterward fell upon him, and of how a most noble, gentle, and beautiful lady, hight the Lady Elaine the Fair, lent him aid and succor at a time of utmost affliction to him, and so brought him back to health again. And you may herein further find it told how Sir Launcelot was afterward wedded to that fair and gentle dame, and of how was born of that couple a child of whom it was prophesied by Merlin (in a certain miraculous manner fully set forth in this book) that he should become the most perfect knight that ever lived and he who should bring back the Holy Grail to the Earth.For that child was Galahad whom the world knoweth to be the flower of all chivalry; a knight altogether without fear or reproach of any kind, yet, withal, the most glorious and puissant knight-champion who ever lived."}, {"id": "B004KAB49W", "genre": "Children's Books", "title": "Lucky New Year!", "description": "Come celebrate the Chinese New Year with its magical traditions— from giving gifts to watching parades! Children will love to scratch and sniff the sweet oranges, turn the wheel to find their Chinese animal year, lift the flap to find the lucky money, and watch the big dragon pop up to wish them a year filled with wisdom, wealth, and happiness. Happy Chinese New Year!"}, {"id": "0635015617", "genre": "Children's Books", "title": "Franklin Delano Roosevelt: President with a 'New Deal' for America (92) (1000 Readers)", "description": "Franklin Delano Roosevelt served four terms as a United States President, more than any other president in history! During those 16 years, he led America out of a depression, through World War II, and towards prosperity and peace.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "B00BR4A4MM", "genre": "Children's Books", "title": "Coral Reef: A Fascinating Children’s Picture Book about Coral Reefs and Tropical Fish", "description": "Do you love ocean picture books? Fish? Nature? Or perhaps even Marine Biology?Discover the natural beauty of tropical fish and their coral reef habitats in this colorful picture book, ideally suited for young readers aged 6-12.“Coral Reefs” includes 16 full color photos of tropical fish and coral reefs, as well as extensive text to challenge your young reader and help him or her to explore and learn about the planet and nature. Click the book cover image above to take a peek inside, “Coral Reef.” Contents of this book include:Discover The Amazing World Of The Coral ReefWhat Is A Coral Reef?How Is A Coral Reef Made?How Big Is A Coral Reef?Where Do Coral Reefs Grow?Is A Coral Reef Alive?Why Are Coral Reefs Important?What Hurts A Coral Reef?What Kind Of Plants Live On A Coral Reef?What Kind Of Animals Live On A Coral Reef?What Is It Like To Scuba Dive A Coral Reef?How Can I Help Protect Coral Reefs?Glossary Of Cool Marine Life WordsDiscover More About Nature"}, {"id": "0984347704", "genre": "Children's Books", "title": "The Caterpillar and the Express Train", "description": "The Caterpillar and the Express Train is an illustrated story about a caterpillar (Sally) who unintentionally climbs into the hub of the Silver Bulletâ\u0080\u0099s Express Trainâ\u0080\u0099s wheel. The express steam engine is the fastest train on the East Coast of America and travels between Boston and Miami. The other trains nickname the Silver Bullet, â\u0080\u009cBullyâ\u0080\u009d. When the trainâ\u0080\u0099s loud whistle breaks, Sally saves the day by holding the broken wires together so that the train is saved from embarrassment, as he is now able to whistle in all the stations down to Miami. Sally changes his nick name from â\u0080\u009cBullyâ\u0080\u009d to â\u0080\u009cSilly. Sally and Silly become good friends and the train asks if the caterpillar will stay with him, we get the reply,  â\u0080\u009cDonâ\u0080\u0099t be silly Silly,â\u0080\u009d Sally said. â\u0080\u009cI will stay with you for ever.â\u0080\u009d But things donâ\u0080\u0099t quite work out as planned."}]