[{"id": "0525469117", "genre": "Children's Books", "title": "The Paper Princess Finds Her Way", "description": "When the little girl who created her grows up and moves away, leaving her behind, the Paper Princess embarks on a perilous journey to a summery land where she finds a new little girl to love, who loves her in return, in this magical sequel to The Paper Princess."}, {"id": "B01BFISOJ4", "genre": "Children's Books", "title": "Children's book: \"WHO SAW MY GLASSES?\": Bedtime story - values for beginner readers - Funny Humor - Rhymes- Early learning - read along - story picture ... (\"UNCLE JAKE\"- funny & values Book 5)", "description": "Children's book:\"WHO SAW MY GLASSESRead it FREE as part of your PRIME or Kindle Unlimited membership Uncle Jake was shopping for the holiday season,Guests would visit and that was a good reason.He struggled with a shirt in the fitting room,Trying on new clothes just made him fume.  ***"}, {"id": "0340663812", "genre": "Children's Books", "title": "The Many Paths of Christianity", "description": "This text explains the history, beliefs and practices of the Orthodox, Roman Catholic and Protestant churches. Each can be studied in its own right or compared thematically. The book concludes by looking at ecumenism and at developments outside the mainstream churches."}, {"id": "0613331850", "genre": "Children's Books", "title": "Vince Carter Story (NBA Fast Breaks)", "description": "Vinsanity! From his awesome gravity-defying dunks to his thrilling moves on the court, Vince Carter has slammed his way into NBA superstardom! In this amazing biography, kids will get the inside scoop on this 1999 Rookie of the Year."}, {"id": "1512429082", "genre": "Children's Books", "title": "CAM Newton (Amazing Athletes (Paperback))", "description": "Carolina Panthers quarterback Cam Newton is one of the biggest stars of the National Football League (NFL). The Panthers chose Cam as the first overall pick in the 2011 NFL draft. He went on to win the 2011 Offensive Rookie of the Year award. In 2015, Cam led Carolina to the best record in the league and a place in Super Bowl 50. Learn more about Cam's journey to NFL stardom."}]