[{"id": "0983768579", "genre": "Children's Books", "title": "Are You Smarter Than A Flying Teddy? Teddy Roosevelt Returns to North Dakota!", "description": "The nine precocious teens who call themselves Sarabiskota have been chosen to be grand marshals of the largest parade in the world, the Independence Day Parade in Mandan, North Dakota. The theme of the parade is \"Teddy Roosevelt Returns to North Dakota,\" and Sarabiskota decides to build a gigantic Flying Teddy airship, larger than the Statue of Liberty. After it's built in Florida, they plan to fly on board Flying Teddy from Florida to North Dakota. All during the trip, Flying Teddy will be asking people multiple-choice questions about Teddy Roosevelt's life. But danger lurks as two of the world's top spies plan to steal Flying Teddy's technology. The whole world gets involved in the adventure—and learns about Teddy Roosevelt's life along the way!"}, {"id": "B00EGT71JO", "genre": "Children's Books", "title": "Stories from German History (Illustrated)", "description": "This short introduction to German history spans the period from the barbarian invasions of Rome through the Dark Ages to the tragically violent Thirty Years' War. Richly illustrated throughout to enhance the reading experience. Contents include:The Ancient GermansAlaric the GothRise of the FranksCharlemagneDivision of the EmpireRise of Three KingdomsManners and CustomsHenry the EmperorGregory the PopeIn the Days of ChivalryThe CrusadesFrederick the Red-beardRudolph of HabsburgDawn of the ReformationMartin Luther the ReformerThe Thirty Years WarThe Aftermath"}, {"id": "1569761248", "genre": "Children's Books", "title": "Inventing Toys: Kids Having Fun Learning Science", "description": "An intriguing combination of invention and toy making, this guide encourages students to work in teams to design and fabricate working toys while learning the fundamentals of science, design, tool usage, and the creative process. Toys range from cars to electric fans to rockets, and the trial-and-error process that students use to build these toys allows them to refine their models through experimentation—building, conducting tests, collecting and interpreting data, and making changes or improvements to their inventions. There are directions for seven workshops and suggestions for five more, and the science concepts and historical background involved in each project are explained for teachers."}, {"id": "1101918292", "genre": "Children's Books", "title": "Super Narwhal and Jelly Jolt (A Narwhal and Jelly Book #2)", "description": "Narwhal and Jelly are back in action for a SUPER adventure! Join Super Narwhal and sidekick Jelly Jolt as they take on three SUPER new stories in this early graphic novel series.Happy-go-lucky Narwhal and no-nonsense Jelly find their inner superheroes in three new under-the-sea adventures. In the first story, Narwhal reveals his superhero alter-ego and enlists Jelly to help him figure out what his superpower is. Next, Narwhal uses his superpower to help a friend find his way back home. In the third story, Jelly is feeling blue and Narwhal comes to the rescue. Ben Clanton showcases the joys of friendship and the power of believing in yourself and others through this irresistible duo."}, {"id": "0545207304", "genre": "Children's Books", "title": "Skating Superstars", "description": "Perfect tie-in for the Winter Olympics!Check out the hottest men's and women's US and international figure skaters as they glide, spin, jump, and dazzle crowds on the ice. This book features everything you want to know about the top competitors in singles, pairs, and ice dancing with exciting full-page action photographs. Get to know America's own Alissa Czisny, Rachael Flatt, Evan Lysacek, and Tanith Belbin and Ben Agosto, along with Yu-Na Kim (South Korea), Jeannie Rochette (Canada), Brian Joubert (France), and more!"}]