[{"id": "1509824162", "genre": "Children's Books", "title": "100 Brilliant Poems For Children", "description": "From Paul Cookson comes 100 Brilliant Poems For Children, featuring the best of the absolute best. The essential poems for every child to read and enjoy."}, {"id": "B0090JA94E", "genre": "Children's Books", "title": "The Adventures of Pabit the Rabbit Volume 2 (A funny Illustrated Children's Story Picture Book; A Perfect Bedtime Story for 4-8 Year Old Children)", "description": "Join Pabit the rabbit and his friends in a magical adventure. This Children's story as well as the stories that will follow in the series were imagined for my son. He loved them so much that I decided to get this first children's story illustrated and published it here on Amazon Kindle. He is now seven years old and still loves to hear them. Your children will find the characters in this kid's story interesting and entertaining. It makes a great bedtime story."}, {"id": "1898000166", "genre": "Children's Books", "title": "Little Buddha: The Story of Prince Siddhartha", "description": "Colour paintings from an Indian collection illustrate a re-telling of the life story of the Buddha as a child, as it will be told on screen in Bertolucci's new film 'Little Buddha', scheduled for release in March 1994."}, {"id": "B01M4FQRXI", "genre": "Children's Books", "title": "Charlie Cat Does NOT Like Halloween", "description": "Charlie Cat does not like scary monsters and ghosts. Charlie's friend Susie Dog loves to dress up for Halloween. When Susie Dog scares Charlie Cat, Charlie uses his strong voice to tell her STOP. Find out how these two friends get along on Halloween."}, {"id": "1629700843", "genre": "Children's Books", "title": "United States President Biographies", "description": "These titles will introduce your little readers to American Presidents, past and present. They'll learn introductory information about each president's early life, family life, basic ideals, and term through easy-to-read, simple text alongside beautiful, historic photographs. Complete with a More Facts section and bolded glossary terms."}]