[{"id": "075665839X", "genre": "Children's Books", "title": "Sticker Encyclopedia: Space", "description": "With more than 600 reusable stickers to keep little hands busy for hours, Sticker Encyclopedia: Space features stickers and facts about everything space-related, from lunar modules, to the planets of our Solar System, to galaxies millions of light-years away."}, {"id": "0544763483", "genre": "Children's Books", "title": "Curious George: 75th Anniversary Edition", "description": "This treasured classic is where it all began for the curious, loveable monkey. Special anniversary cover with foil and spot gloss make this edition a must-have for any children’s book collection. Includes bonus downloadable audio read by the actor, producer, and director John Krasinski. Access code can be found inside the book on page 2."}, {"id": "0750013222", "genre": "Children's Books", "title": "The Amazonian Indians? (What Do We Know About)", "description": "Explores what we know about the Amazonian Indians. Illustrated throughout in colour, a new title in the WHAT DO WE KNOW ABOUT series. Meets the requirements of the National Curriculum Key Stage 2/3."}, {"id": "0881109002", "genre": "Children's Books", "title": "Tales of Mystery & Imagination (Library of Fantasy and Adventure Series)", "description": "In Tales of Mystery and Imagination, Tony Al lan retells some of the classic tales of master horror write r Edgar Allan Poe. Included in the collection are Masque of the Red Death, The Pit and the Pendulum, Gold Bug, and The F all of the House of Usher '"}, {"id": "B01NH9WHLK", "genre": "Children's Books", "title": "Frida Kahlo (My Early Library: My Itty-Bitty Bio)", "description": "The My Itty-Bitty Bio series are biographies for the earliest readers. This book examines the life of Frida Kahlo in a simple, age-appropriate way that will help children develop word recognition and reading skills. Includes a timeline and other informative backmatter."}]