[{"id": "B0784X9MBM", "genre": "Children's Books", "title": "Twelve: Christmas Short Stories for Children", "description": "Twelve, magical Christmas short stories, ideal for bedtime reading. Meet the Faunifirs - tiny people living inside a Christmas tree, or join an Arctic explorer who discovers a world beneath the ice. What does Father Christmas do when his sleigh breaks down and find out what happens when a girl's wish for a dog for Christmas goes horribly wrong. This collection includes: The Faunifirs; All I Want for Christmas is a Dog; The Christmas Egg; The Boy in the Tree; The North Pole Diaries; The Tools and the Repair Man; The Biggest Tree; The Mice in the Wall; The Fox and the Animal Catcher; The Little Shop of Lost Toys; A Christmas Nightmare; The Stone Angel."}, {"id": "B00P2LGJWU", "genre": "Children's Books", "title": "Angel Island Immigration: A History Perspectives Book (Perspectives Library)", "description": "This book relays the factual details of immigration through the Angel Island station, which is near San Francisco, California. The narrative provides multiple accounts of the event, and readers learn details through the point of view of a male Chinese immigrant, a Chinese woman coming to join her immigrant husband, and a missionary woman trying to help Chinese immigrants. The text offers opportunities to compare and contrast various perspectives in the text while gathering and analyzing information about a historical event."}, {"id": "0756542391", "genre": "Children's Books", "title": "Islam (World Religions)", "description": "The religion of Islam traces it beginnings to the 600s in what is present-day Saudi Arabia. The angel Gabriel was said to have visited the prophet Muhammad, who then shared the word of Allah, or God, with the people. Today Islam has more than a billion followers. Learn more about the rich history and traditions of Islam and how the religion fits into today’s world in Islam, part of the World Religions series."}, {"id": "B004JZWRIA", "genre": "Children's Books", "title": "Allie Gator and the Easter Egg Hunt (John Deere (Running Press Kids Hardcover))", "description": "Help Allie Gator, Barney Backhoe, and their friends as they work together on Merriweather Farm and in Deerfield Valley preparing for the upcoming holiday, making new friends, and enjoying springtime in these new interactive board books!  In this new board book with flaps, Allie Gator's cousin, Callie, is visiting Merriweather Farm--just in time for the Easter Egg Hunt. As they search the field, the meadow, and the barnyard for Easter eggs, Allie and Callie discover all the new things that happen on the farm in the spring. Kids will enjoy lifting the flaps to find Easter eggs, see baby animals, and help Johnny Tractor plow and plant."}, {"id": "0778797368", "genre": "Children's Books", "title": "El Salvador: The People and Culture (Lands, Peoples & Cultures)", "description": "Introduces the religion, holidays and festivals, art, traditional and modern dance and music, language, and literature of El Salvador."}]