[{"id": "0448426773", "genre": "Children's Books", "title": "Frida Kahlo: The Artist who Painted Herself (Smart About Art)", "description": "Through original artwork by the renowned artist Tomie dePaola-a longtime aficionado of Frida Kahlo's work-as well as beautiful reproductions of Kahlo's paintings, this latest Smart About book explores the creative, imaginative world of Mexico's most celebrated female artist."}, {"id": "1974316467", "genre": "Children's Books", "title": "Best Coach Ever: Baseball Coach Gifts (Baseball Notebook Journal)(Baseball Books For Kids)(V43)", "description": "The Best Gift Ever For Baseball CoachesDo you have that special baseball coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your baseball coach will appreciate the thoughtful gift and use it for seasons to come.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any baseball player’s tastes. Great baseball books for kids to give as gifts.Grab your baseball notebook journal today."}, {"id": "B073ZVZKD9", "genre": "Children's Books", "title": "Happy Wonder Years: A Chinese New Year Book", "description": "Introduce your kids to the wonders of Chinese New Year as the siblings and their beloved pet Corgi await the special new year dinner.Each page explores Chinese New Year traditions with a touch of magic.Asian-American author and illustrator Debbie M. Chou created this book for kids to remember their roots while learning to readFun rhymes for first readers!"}, {"id": "1580372090", "genre": "Children's Books", "title": "Exploring Asia, Grades 4 - 8 (Continents of the World)", "description": "Students will love exploring Asia in this comprehensive, supplementary resource. Activity information covers maps, climates, resources, industries, people, animal life, cultures, and more! Information is presented through questions, map labeling, research, and writing so that students become engaged learners. It also includes bibliographies and answer keys.Mark Twain Media Publishing Company specializes in providing captivating, supplemental books and decorative resources to complement middle- and upper-grade classrooms. Designed by leading educators, the product line covers a range of subjects including mathematics, sciences, language arts, social studies, history, government, fine arts, and character. Mark Twain Media also provides innovative classroom solutions for bulletin boards and interactive whiteboards. Since 1977, Mark Twain Media has remained a reliable source for a wide variety of engaging classroom resources."}, {"id": "1610806719", "genre": "Children's Books", "title": "From Birds To... Aircraft (21st Century Skills Innovation Library: Innovations from Nature)", "description": "From airplanes to football helmets, some of the greatest inventions of all time have been based on the natural abilities of plants and animals. Readers will learn how some of history's most imaginative inventors were inspired by nature and how their incredible creations continue to improve our lives today. Available in reinforced library and paperback bindings."}]