[{"id": "0606140921", "genre": "Children's Books", "title": "Dandelion Fire (Turtleback School & Library Binding Edition) (100 Cupboards)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Presents the continuing adventures of Henry York, who has been living in Kansas with his cousins, where he discovers doorways leading to other worlds and becomes involved in a multi-world struggle between good and evil."}, {"id": "0685194590", "genre": "Children's Books", "title": "The Life and Adventures of Santa Claus", "description": "Nicholas the orphan becomes Nicholas the woodcarver, whose job is to create a gift for every child in his small village on the Baltic Sea. As he grows older, explanations for many beloved Christmas traditions are woven into the story as the true spirit of Christmas is revealed."}, {"id": "0816731551", "genre": "Children's Books", "title": "Kwanzaa An African American Holiday", "description": "Everybody's learning about Kwanzaa! This African American holiday celebrating the importance of family and community has become more and more popular every year. Here's an activity book full of puzzles, games, craft ideas, recipes, and information for kids who want to learn more about Kwanzaa. Line drawings."}, {"id": "0613094441", "genre": "Children's Books", "title": "Baba Yaga", "description": "Based on Russian folktales collected by Aleksandr Afanas'ev and illustrated in a bold, primitive style inspired by 17th-century Russian folk art, this story of the fearsome witch Baba Yaga is a memorable introduction to one of the most celebrated figures in Russian folklore. Full color throughout."}, {"id": "B00ZBCYEHM", "genre": "Children's Books", "title": "MYSTERY OF THE OLD DESK", "description": "This is a pleasant short story intended to appeal to younger readers.Aida is an avid reader about to enter Grade Six. Her family moves to Nebraska where they buy a stately century-old home and some furniture including an antique desk from Ethel Tanner Ward, the elderly former owner who now resides in a nursing home.Aida begins to read to the old woman each day and learns that the old desk never revealed the surprise that was supposed to emerge on Miss Ward's 21st birthday back in 1943.Will Aida and her clever brother, Dawson finally solve the mystery of the old desk in the summer of 2015? ABOUT THE AUTHOR:  Donald W. Desaulniers is a retired Canadian lawyer who loves to write about the legal profession. This is the author's first attempt at penning a story suitable for younger readers. He sincerely hopes he hasn't totally botched it up."}]