[{"id": "076602895X", "genre": "Children's Books", "title": "Denzel Washington (African-american Heroes)", "description": "Using simple sentences and color illustrations, each title in this series features a different famous African-American, examining the person's life and contributions, and emphasizing their position as role model."}, {"id": "1683680448", "genre": "Children's Books", "title": "Biographies for Kids - All about Michael Jackson: The King of Pop and Style - Children's Biographies of Famous People Books", "description": "Let’s get to know Michael Jackson and his craft. This cool educational resource will help your child learn about the King of Pop while picking up new vocabulary, too. Sure, movies are available but reading enriches a child’s experience. Grab a copy and read with your child. Don't forget to ask questions to verify understanding! Have fun!"}, {"id": "053116473X", "genre": "Children's Books", "title": "Native American Shipwrecks (Watts Library: Shipwrecks)", "description": "Examines archaeological excavations of the watercraft of ancient Native Americans and what the findings tell us about the daily life and culture of people who lived thousands of years ago."}, {"id": "B00ANYKFIA", "genre": "Children's Books", "title": "The Gulf War (War and Conflict in the Middle East)", "description": "After nearly bankrupting his country, Saddam Hussein came up with a different sort of get-rich-quick scheme: invading Kuwait. By invading the small country due south, he could have rich oil fields and billions of dollars from Kuwaiti banks. Hussein's invasion spurred the response of nearly 100 countries worldwide with America leading the way, and within 100 hours, Kuwait was liberated. This book examines the war itself as well as America's role in defeating the Iraqi army."}, {"id": "1538208903", "genre": "Children's Books", "title": "Native American Ceremonies and Celebrations: From Potlatches to Powwows (Native American Cultures)", "description": "Native American celebrations are packed with symbolic gestures and intriguing details. A kind of party called a potlatch, staged by native peoples of the Pacific Northwest, was marked by guests receiving gifts, not giving them, and were sometimes put on to get back at an enemy. This appealing volume about a high-interest aspect of native cultures highlights several celebrations and ceremonies important to Native Americans across North America. Thought-provoking fact boxes, historical images, and modern-day customs will engage readers of all levels."}]