[{"id": "1486247857", "genre": "Children's Books", "title": "Jacky Daydream", "description": "Lots of Jacqueline Wilson's characters are well-known and well-loved by thousands of readers: Hetty Feather, Ruby and Garnet, Pearl and Jodie, Elsa, Lily and, of course, the brilliant Tracy Beaker! But how much do you know about Jacqueline herself? Jacqueline takes a look back at her own childhood and teenage years in this captivating story of friendships, loneliness, books, family life and much more. She explores her past with the same warmth and lightness of touch that make her novels so special. Best of all, she reveals how she was always determined to be a writer; from the very first story she wrote, it was clear that this little girl had a very vivid imagination! But who would've guessed that she would grow up to be the mega-bestselling, award-winning Jacqueline Wilson?"}, {"id": "1936261308", "genre": "Children's Books", "title": "The Only One Club", "description": "This heartwarming story explores the many ways in which children feel unique and special. Mrs. Matthews' first grade class begins making Christmas decorations, but because Jennifer is Jewish, Mrs. Matthews allows her to make Hanukkah decorations instead. Jennifer enjoys the attention and creates \"The Only One Club,\" of which she is the sole member. When her classmates want to join, she is resistant until she realizes that each of her friends is also \"the only one\" at something. As she inducts them into her club she reveals the unique qualities that make each of her classmates extraordinary. Through this touching story, young children are encouraged to discover and treasure their own uniqueness and to actively look for special qualities in others beyond race or culture. A medley of pencil, watercolor, acrylic paint, and pastel illustrations bring this inspiring and humorous tale to life."}, {"id": "B077NZJ4TS", "genre": "Children's Books", "title": "Hattie's Holidays (A Hattie the Hummingbird Story Book 2)", "description": "Hattie the Hummingbird sets out on a holiday adventure to learn how her multicultural friends celebrate the season! Experiencing Hanukkah, Kwanzaa, Christmas and more, Hattie's Holiday is an adventurous poem that is as informative as it is beautifully illustrated, with a message as open-minded and loving as the holiday season itself that all can connect with.For kids and adults of all ages, especially children who want to learn about each of the commercial holidays, this book is a must for your holiday story collection!Writer & National Merit Poetry Award Winner Dunnet Albert and her Hattie the Hummingbird offer parents a gentle, non-secular way to teach their young children of that Universal, spiritual and Divine love, inspire them, and help them come to terms with the truths and the ways of the world."}, {"id": "1590845498", "genre": "Children's Books", "title": "3: The Education of the Presidents of the United States", "description": "Focuses on the education of the forty-two men who grew up to serve as president, from George Washington to George W. Bush."}, {"id": "1847154204", "genre": "Children's Books", "title": "The Hammer of Thor (Ninja Meerkats)", "description": "Legend tells of the Clan of the Scorpion, four mighty meerkats who are armed to the teeth with ninja-knowhow. They are sworn to protect the world from their longtime nemesis, the Ringmaster...Small, deadly and furry, the Ninja Meerkats are four warriors on a mission. In Book 10 in the Ninja Meerkats series, The Ringmaster has stolen the Hammer of Thor, an electrifying weapon that controls thunder and lightning. The Clan race to the deep freeze of the Arctic to put the top-hatted villain's plans to rule the world on ice. But the Ringmaster isn't about to let the meerkats steal his thunder...May battle commence! A hilarious series for boys by Blue Peter Book Award-winning author Gareth P. Jones (The Considine Curse), featuring death-defying meerkat action! Full of comical characters, daft puns, fast dialogue and even faster action, these book are irresistible to boys and girls aged around six to eight years."}]