[{"id": "1939087007", "genre": "Science Fiction & Fantasy", "title": "Lady of Devices: A steampunk adventure novel (Magnificent Devices) (Volume 1)", "description": "Book One of the Magnificent Devices series. London, 1889. Victoria is Queen. Charles Darwin’s son is Prime Minister. And steam is the power that runs the world. At 17, Claire Trevelyan, daughter of Viscount St. Ives, was expected to do nothing more than pour an elegant cup of tea, sew a fine seam, and catch a rich husband. Unfortunately, Claire’s talents lie not in the ballroom, but in the chemistry lab, where things have a regrettable habit of blowing up. When her father gambles the estate on the combustion engine and loses, Claire finds herself down and out on the mean streets of London. But being a young woman of resources and intellect, she turns fortune on its head. It’s not long before a new leader rises in the underworld, known only as the Lady of Devices. When she meets Andrew Malvern, a member of the Royal Society of Engineers, she realizes her talents may encompass more than the invention of explosive devices. They may help her realize her dreams and his . . . but sometimes the closest friendships can trigger the greatest betrayals . . . “Adina is a literary master in her field.” —BookLoons.com “An immensely fun series with some excellent anti-sexist messages, a wonderful main character (one of my favourites in the genre) and a great sense of Victorian style and language that’s both fun and beautiful to read.” —Fangs for the Fantasy: The latest in urban fantasy from a social justice perspective"}, {"id": "B0053CYXS0", "genre": "Science Fiction & Fantasy", "title": "Lady of Devices: A steampunk adventure novel (Magnificent Devices Book 1)", "description": "Book One of the Magnificent Devices series. London, 1889. Victoria is Queen. Charles Darwin’s son is Prime Minister. And steam is the power that runs the world. At 17, Claire Trevelyan, daughter of Viscount St. Ives, was expected to do nothing more than pour an elegant cup of tea, sew a fine seam, and catch a rich husband. Unfortunately, Claire’s talents lie not in the ballroom, but in the chemistry lab, where things have a regrettable habit of blowing up. When her father gambles the estate on the combustion engine and loses, Claire finds herself down and out on the mean streets of London. But being a young woman of resources and intellect, she turns fortune on its head. It’s not long before a new leader rises in the underworld, known only as the Lady of Devices. When she meets Andrew Malvern, a member of the Royal Society of Engineers, she realizes her talents may encompass more than the invention of explosive devices. They may help her realize her dreams and his . . . but sometimes the closest friendships can trigger the greatest betrayals . . .“An immensely fun series with some excellent anti-sexist messages, a wonderful main character (one of my favourites in the genre) and a great sense of Victorian style and language that’s both fun and beautiful to read.” —Fangs for the Fantasy: The latest in urban fantasy from a social justice perspective"}, {"id": "076539894X", "genre": "Science Fiction & Fantasy", "title": "The Fated Sky: A Lady Astronaut Novel", "description": "Continuing the grand sweep of alternate history laid out in The Calculating Stars, The Fated Sky looks forward to 1961, when mankind is well-established on the moon and looking forward to its next step: journeying to, and eventually colonizing, Mars. Of course the noted Lady Astronaut Elma York would like to go, but could the International Aerospace Coalition ever stand the thought of putting a woman on such a potentially dangerous mission? Could Elma knowingly take the place of other astronauts who have been overlooked because of their race? And could she really leave behind her husband and the chance to start a family? This gripping look at the real conflicts behind a fantastical space race will put a new spin on our visions of what might have been."}, {"id": "0765303728", "genre": "Science Fiction & Fantasy", "title": "The Skystone (The Camulod Chronicles, Book 1)", "description": "This first novel in Jack Whyte's riveting Arthurian series tells how the story of Camelot may have actually come to be.We all know the story―how Arthur pulled the sword from the stone and how Camelot came to be.But how did it really happen?The Roman citizens of Britain faced a deadly choice: leave to live in a corrupt Roman world, or stay amidst the violence of the warring factions of Picts, Celts, and invading Saxons.For Publius Varrus and Caius Britannicus, there is only one answer. They will stay, try to preserve the best of Roman life, and create a new culture from the wreckage.In doing so, they will plant the seeds of a legend. For these two men are Arthur's great-grandfathers and their actions will shape a nation...and forge the sword known as Excalibur."}, {"id": "1523448555", "genre": "Science Fiction & Fantasy", "title": "1: Hall Pass: Erotic Short Story (BWWM) (Volume 1)", "description": "When a wife gives her husband of two years a hall pass to experience different women, several things can go wrong. Elizabeth T. Pendleton is a National Best Selling Author who has an imagination beyond anyone's wildest dreams. Can you change a housewife into a hoe? Find out if hoe tendencies will destroy or save this marriage by reading with an open mind. Let the fun begin..."}]