[{"id": "1590848802", "genre": "Children's Books", "title": "Muslims In China (The Growth and Influence of Islam in the Nations of Asia and Central Asia)", "description": "Examines the expansion of Muslims in China and describes the economic, social, and political issues the country faces today."}, {"id": "1632873907", "genre": "Children's Books", "title": "Dragons Coloring Book", "description": "Children are creatures of imagination, and when it comes to the animals that populate their minds, dragons are often at the top of the list. Dragons are amazing monsters with lizard-like bodies, bat-like wings and the ability to breathe fire, and when they are invoked, children light up with joy. Let your child learn to color the sinuous bodies of dragons, tracing the spines, the wings and the claws in different colors. Learning about dragons lets your child exercise their imagination."}, {"id": "1973733447", "genre": "Children's Books", "title": "Fourth of July Activity Book (Algenon Owl’s Fun Activities)", "description": "Celebrate the Fourth of July with this patriotic activity book. The book contains fun activities for kids (ages 8 plus), including mazes, quizzes, coloring pages, word search puzzles, Independence Day bingo, doodles, and more!The pages are printed on one side only so you can cut them out if you like."}, {"id": "1884822789", "genre": "Children's Books", "title": "101 More Read-Aloud Classics: Ten-Minute Readings from the World's Best-Loved Children's Books", "description": " An engaging follow-up to the popular 101 Read-Aloud Classics, designed for parents and children to read together. The perfect book for just before bed-time and any other shared quiet time. This illustrated collection presents ten-minute selections from such favorites as Matilda, The Little House in the Big Woods, Crow and Weasel, Harriet the Spy, Freddy the Detective, The Legend of Sleepy Hollow, The Phantom Tollbooth and many more."}, {"id": "B06Y3LWRBN", "genre": "Children's Books", "title": "Betsy Bird Learns To Fly: Free audio book included. Children's bedtime rhyming picture story book. Preschool book for kids ages 2-4", "description": "FREE bonus material included:Read-along audio book available to watch on your smartphone/tablet at any time.Downloadable web app.Printable coloring pages and activity book.Betsy Bird just can’t figure out how to fly! But with a little help from her family, and a lot of practice, practice, practice, Betsy learns to start small and finish big so she can get the knack.This fun rhyming picture book for kids is about a cute little bird and her family, teaching children the valuable lessons of determination, persistence and patience.Betsy Bird Learns to Fly is a great book for children ages 2-4. It shows preschool kids that if they don’t give up they can accomplish anything they want.A perfect bedtime story. Just watch Betsy learn!"}]