[{"id": "0756538408", "genre": "Children's Books", "title": "Spanish Colonies in America (We the People: Exploration and Colonization)", "description": "The Spanish presence in the New World began in 1492, with Christopher Columbus historic voyage. Lured by stories of gold and riches, Spanish conquistadors battled native peoples to claim vast amounts of land in the Americas. During the 16th century, the Spanish established many cities and founded missions to convert the native population to Spanish religious beliefs and cultural practices. But by the turn of the 19th century, Spanish control of its colonies was waning, and the independence movement that was spreading across the Americas took hold. Spains North American colonies eventually became part of the United States or Mexico."}, {"id": "1947118994", "genre": "Children's Books", "title": "If You Were Me and Lived In...Ancient China: The Han Dynasty: An Introduction to Civilizations Throughout Time (If You Were Me and Lived In...Historical)", "description": "Join Carole P. Roman and travel through time to visit the most interesting civilizations throughout history in the first four books of her new series.  Learn what kind of food you might eat in Ancient Greece, the clothes you wore in 15th century Renaissance Italy, what your name could be in Viking Europe, and what children in the Han Dynasty children did for fun.  If You Were Me and Lived in...does for history what her other award-winning series did for culture.  So get on-board this time-travel machine and discover the world through the eyes of a young person just like you."}, {"id": "0791086119", "genre": "Children's Books", "title": "Vasco Da Gama And The Sea Route To India (EXPLORERS OF NEW LANDS)", "description": "Introduces the explorer Vasco da Gama, describing his childhood in Portugal and his journey to find a sea route from Europe to the East Indies."}, {"id": "B0773L6335", "genre": "Children's Books", "title": "Best Kid's Short Stories: 18 Fun and cute stories!", "description": "18 Hilarious Short Stories For the Price of 1Are you ready for the funniest bestselling short story of 2017?All of these stories are hilarious, You won't believe how the scary story ends!   Some of these short stories are cute, some are adventurous, but once you start reading you won't want to stop!Kids love the friendly characters!Grandparents love reading these books to their grandchildren!**Price drop for the holidays!   Scroll up and click \"Buy Now\" to get your copy!**"}, {"id": "B00OIKOHF2", "genre": "Children's Books", "title": "Famous American Buildings: The 20 Coolest and Most Awesome Buildings in America - That You Can Visit on Your Next Vacation!", "description": "Discover the most famous and amazing buildings ever built in America.From 800 years ago to the 21st century, you will explore 20 of the tallest, grandest, and downright WEIRDEST buildings that anyone has ever constructed in the United States.And any one (or several) of them can be visited on your next vacation!Discover...* The famous New York skyscraper that was climbed by King Kong.* The most famous house in America (it has 132 rooms!)* The awesome building designed by George Washington (with 850 doors inside!)* The luxurious building that once won the \"race for the sky.\"* The weird building that is totally transparent...and inside they sell computers and phones!* The triangular skyscraper that looks like an old-fashioned clothes iron.* The mysterious \"Big House\" in the middle of the Arizona desert that is over 600 years old. * The 20-room \"high-rise apartment\" built 800 years ago right into the cliff of a mountain....and much more!"}]