[{"id": "B00U7XTQ7S", "genre": "Science Fiction & Fantasy", "title": "The Fall of Celene: The Goddess Prophecies Fantasy Series Book 2", "description": "Impossible Odds, Terrifying Powers\"My name is Issa and I am hunted. I hold a power that I neither understand nor can barely control...\"The battle for Maioria has begun. Issa faces a deadly enemy as the Immortal Lord’s attention turns fully in her direction. Nothing will stand in Baelthrom’s way—he must destroy this new power that grows with the rising dark moon… or assimilate it.Hameka, a cunning, ruthless and brilliant commander, takes his savage fleet of undead to the tranquil shores of Celene. Cirosa, her plans thwarted, hungers for revenge.Issa’s enemies are many and few seek to join her cause as she struggles to survive against those who would enslave her. The warrior within is awakening but only by embracing the Raven Queen of prophecy can she hope to face the darkness that threatens to consume her.The Fall of Celene is the second novel in this epic fantasy adventure series readers are comparing to Raymond E. Feist’s Riftwar Saga, Terry Goodkind’s The Sword of Truth, Patrick Rothfuss' Kingkiller Chronicles, and David Edding’s The Mallorean.The Goddess Prophecies sword and sorcery epic is being hailed as one of the best high fantasy series in years, drawing on all the appeal of Tolkien’s deep and soulful characters, Robert Jordan’s sweeping worlds, and Marion Bradley's unyielding heroines. This is a saga full of spirit, determination and resilience.Buy The Fall Of Celene to continue upon this epic fantasy adventure today!"}, {"id": "1781162700", "genre": "Science Fiction & Fantasy", "title": "Alien: Sea of Sorrows (Novel #2)", "description": "As a deputy commissioner for the ICC, Alan Decker’s job is to make sure the settlements on LV178 follow all the rules, keeping the colonists safe. But the planet known as New Galveston holds secrets, lurking deep beneath the toxic sands dubbed the Sea of Sorrows.The Weyland-Yutani Corporation has secrets of its own, as Decker discovers when he is forced to join a team of mercenaries sent to investigate an ancient excavation. Somewhere in that long-forgotten dig lies the thing the company wants most in the universe—a living Xenomorph.Decker doesn’t understand why they need him, until his own past comes back to haunt him. Centuries ago, his ancestor fought the Aliens, launching a bloody vendetta that was never satisfied. That was when the creatures swore revenge on the Destroyer…Ellen Ripley. Alien TM & © 1979, 2013 Twentieth Century Fox Film Corporation. All Rights Reserved."}, {"id": "B0731HJ7QG", "genre": "Science Fiction & Fantasy", "title": "Nolan Kilkenny (6 Book Series)", "description": "From Book 1: They call it Spyder: a supposedly undetectable intelligence-gathering computer program that can easily penetrate heavily-encrypted computer networks. When ex-Navy SEAL Nolan Kilkenny discovers its existence, Spyder has already been stolen by three indusrial spies in a heist that quickly escalates to murder and treason. Suddenly, Kilkenny is leading the FBI and CIA in the search for Spyder... and is in the crosshairs of those who will stop at nothing to possess the ultimate spy weapon."}, {"id": "0804173141", "genre": "Science Fiction & Fantasy", "title": "Prince Lestat and the Realms of Atlantis: The Vampire Chronicles", "description": "A NATIONAL BESTSELLERFrom Anne Rice, conjurer of beloved bestselling metaphysical tales and mystical ancient histories“In my dreams, I saw a city fall into the sea . . . And all the world was shaken . . .”In this ambitious, rich new vampire novel of vision and power, the indomitable vampire hero, Lestat de Lioncourt, returns . . . caught up in an urgent and fundamental quest to understand the origins of the Undead and the deeper meanings of existence for both mortals and immortals. Now Lestat, Prince of the vast tribe of the undead, finds himself at war with a strange, ancient, otherworldly form that has somehow taken possession of his immortal body and spirit, and it is through this perilous and profound struggle that we come to be told the hypnotic tale of a great sea power of ancient times: a mysterious heaven on earth situated on a boundless continent in the Atlantic Ocean.As we learn of the mighty, resonant powers and perfections of this lost kingdom of Atalantaya, the lost realms of Atlantis, we come to understand how and why the vampire Lestat, indeed all the vampires, must reckon so many millennia later with the terrifying force of this ageless, all-powerful Atalantaya spirit. An exhilarating novel that deepens Rice’s vampire mythology as it brings together the ancient worlds and beings of the Vampire Chronicles and opens up to us a whole new universe of characters, history, storytelling, and legend."}, {"id": "0886773687", "genre": "Science Fiction & Fantasy", "title": "Armor", "description": "The military sci-fi classic of courage on a dangerous alien planetThe planet is called Banshee. The air is unbreathable, the water is poisonous. It is home to the most implacable enemies that humanity, in all its interstellar expansion, has ever encountered. Body armor has been devised for the commando forces that are to be dropped on Banshee—the culmination of ten thousand years of the armorers’ craft. A trooper in this armor is a one-man, atomic powered battle fortress. But he will have to fight a nearly endless horde of berserk, hard-shelled monsters—the fighting arm of a species which uses biological technology to design perfect, mindless war minions.  Felix is a scout in A-team Two. Highly competent, he is the sole survivor of mission after mission. Yet he is a man consumed by fear and hatred. And he is protected, not only by his custom-fitted body armor, but by an odd being which seems to live within him, a cold killing machine he calls “The Engine.” This is Felix’s story—a story of the horror, the courage, and the aftermath of combat, and the story, too, of how strength of spirit can be the greatest armor of all."}]