[{"id": "1452129134", "genre": "Children's Books", "title": "Little Sea Turtle: Finger Puppet Book (Little Finger Puppet Board Books)", "description": "A new title in the bestselling finger puppet series! Tiny tots will enjoy swimming with newly hatched baby sea turtles in Little Sea Turtle. This simple, comforting story features a permanently attached plush finger puppet and peek-a-boo holes in every page, giving parents and children a fun, interactive way to play and read together."}, {"id": "0989207900", "genre": "Children's Books", "title": "Robot + Bike = Kitten: 34 of JoeM's Poems", "description": "Kids of all ages love Joe Mohr's hilarious poetry! His whimsical illustrations and silly poems are full of imaginative word play and surprise endings. Parents appreciate the way Joe sneaks important messages into this colorful and quirky collection of poems. As singer/songwriter, Brett Dennen shares, From a generation of parents who grew up on Seuss and Silverstein, here comes another timeless children's book with modern relevance. Mohr inspires our kids to be imaginative, caring, and self-respecting good people. He does this with poignant poetry and unique illustrations sure to spark conversations with your child on many themes. This book will surely be the first of many for Mohr and his own brand of humorous and insightful storytelling. ROBOT+BIKE=KITTEN includes 34 of JoeM's poems about sister-eating gorillas, boy-eating sharks, owl-eating monsters, vowel-stealing children, nose-picking poets and much, much, more!"}, {"id": "0753461587", "genre": "Children's Books", "title": "Archaeology (Kingfisher Knowledge)", "description": "From ax heads to entire towns, learn about the excavation and examinationof the debris left by centuries of daily human life. Readers will uncover thehistory and techniques of this important science."}, {"id": "0766028690", "genre": "Children's Books", "title": "Hottest Nascar Machines (Wild Wheels!)", "description": "Each title in this series for reluctant readers focuses on a specific type of car, ranging from muscle cars to motorcycles and from NASCAR racers to dragsters, providing stories about famous racing heroes and popular car manufacturers from yesterday and today."}, {"id": "0736480986", "genre": "Children's Books", "title": "Mater's Birthday Surprise (Disney/Pixar Cars) (Step into Reading)", "description": "Mater thinks all his friends in Radiator Springs have forgotten his birthday—until they throw him the best surprise party ever! This Step 2 reader starring Lightning McQueen, Mater, and the rest of the cars from Disney/Pixar Cars and Cars 2 will make a perfect birthday gift for boys ages 4 to 6."}]