[{"id": "0877880050", "genre": "Children's Books", "title": "Absolutely Perfect Summer (Shaw Young Adult Fiction)", "description": "Two brothers come of age one summer as the older one, a high school senior, must choose between playing major league baseball and going to college, and the younger maintains a perfect batting average in Little League."}, {"id": "B00YQR34CO", "genre": "Children's Books", "title": "The Haunted Hamburger and Other Ghostly Stories", "description": "What's scarier than a ghost story? Three ghost stories, of course. And these three stories, told to little ghosts at bedtime, are the scariest kind of ghost stories there are-they're about people! From a ghost who becomes the victim of a baby in need of a diaper to a hamburger that can win a scaring contest just by lifting its bun, these hilariously illustrated silly stories are sure to bring Halloween laughs to even the littlest ghosts."}, {"id": "1538215373", "genre": "Children's Books", "title": "Desiertos / Deserts (Nuestra Maravillosa Tierra!/ Our Exciting Earth!) (Spanish and English Edition)", "description": "Many people have preconceptions about biomes, especially deserts. They picture only hot, barren wastelands where nothing lives. This valuable volume teaches young Earth explorers some surprising facts about desert habitats. For example, some deserts don't have sand, and some are quite cold. They'll also learn how some resilient plants and animals survive in these arid environments. Beautiful images accompany the accessible low-ATOS text."}, {"id": "1452153744", "genre": "Children's Books", "title": "This Is Not a Valentine", "description": "This book is not a valentine. It doesn't have lacey edges or sugary hearts. But it is full of lucky rocks, secret hiding spots, and gumball machine treasures. This is a book about waiting in line and wishing for cinnamon buns. About recognizing that if you care so much about someone not thinking you care, maybe you really do. But wait—isn't that exactly what love is about? Maybe this book is sort of a valentine after all. A testament to handmade, wacky, bashful, honest love—sure to win over the hearts of all readers—this offering from debut picture book author Carter Higgins and children's book veteran Lucy Ruth Cummins is the perfect gift to celebrate every relationship, from parent to child, sibling to sibling, partner to partner, crush to crush."}, {"id": "0545491479", "genre": "Children's Books", "title": "Jeremy Lin: Rising Star", "description": "The biography of worldwide basketball sensation, Jeremy Lin!Jeremy Lin is an overnight basketball success! But in order for him to have been ready for his big opportunity, he had to put in years of hard work and practice. Follow along as we trace Jeremy's rise from his high-school days, college hoops at Harvard, and bouncing around the NBA to his awesome, unprecedented performances with the New York Knicks. It's Lin-credible!"}]