[{"id": "B00S34263Y", "genre": "Children's Books", "title": "The Fox and the Grapes Refurinn og Vínber : Children's Picture Book English-Icelandic (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week. Refurinn er svangur og augu gómsætri vínber. Refurinn reynir aftur og aftur til að fá vínber í þessuLengri útgáfa af refurinn og vínber með refurinn gera áhugaverttil að reyna að fá vínber. Kennir daga vikunnar."}, {"id": "B01MCQXKIO", "genre": "Children's Books", "title": "Thanksgiving for Cats: A Rhyming Thanksgiving Picture Book for Kids filled with Thanksgiving food, Thanksgiving memories and Thanksgiving Fun", "description": "Excerpt from the Book:\"Food cooked with love brings us all glee.\"\"But Thanksgiving is about more than delicious turkey.\"\"We are all together in a wonderful way.\"\"Such special memories on this joyous day.\" A family of cats is celebrating Thanksgiving. They delight in food, fun, friends and family. Join these cats as they announce the things they love about the Thanksgiving holiday. \"Thanksgiving for Cats\" has a rhyming style that sure to engage young readers. It is perfect for festive holiday story times and read alouds.Visit the Author Page at:www.Deesignery.com"}, {"id": "B001O9CBJE", "genre": "Children's Books", "title": "Lucia and the Light", "description": "Luminously illustrated by Mary GrandPré, a timeless adventure from master storyteller Phyllis Root about the loss of the sun — and one girl's brave quest to find itIn a cozy cabin high in the mountains of the Far North, Lucia and her family live a snug and contented life. But one day the wind screams fiercely and the sun does not rise over the mountain. Someone has stolen the sun! \"Perhaps it has lost its way,\" says Lucia, who despite her mother's pleas sets out to find it with only a bit of bread, a tinderbox, and her milk-white cat to keep her company. In dramatic pastels, Mary GrandPré illuminates troll-pocked frozen mountains and wraps Lucia's family in a blanket of warmth. Inspired by Nordic lore, Phyllis Root spins a golden yarn of courage, love, and the age-old longing for the return of light."}, {"id": "0064451755", "genre": "Children's Books", "title": "Archaeologists Dig for Clues (Let's-Read-and-Find-Out Science 2)", "description": "Archaeologists on a dig work very much like detectives at a crime scene. Every chipped rock, charred seed, or fossilized bone could be a clue to how people lived in the past. In this information-packed Let’s-Read-and-Find-Out Science book, Kate Duke explains what scientists are looking for, how they find it, and what their finds reveal.  "}, {"id": "1623708753", "genre": "Children's Books", "title": "Be A Star, Wonder Woman! (DC Super Heroes)", "description": "As a new day dawns, a young girl faces the ultimate challenge: school! Follow along as she demonstrates her greatest superpower (sharing), overcomes her worst fear (the playground),and conquers her archenemy (the spelling test).With courage, kindness, and other heroic traits of DC Comics' Wonder Woman, she'll turn a difficult school day into an AMAZING ADVENTURE!   Along with  Omar Lozano's  bright, bold illustrations, bestselling author Michael Dahl (Bedtime for Batman and Good Morning, Superman) delivers an imaginative read-aloud for your littlest super heroes."}]