[{"id": "B00CX5WFPI", "genre": "Children's Books", "title": "How The Zebra Got Its Stripes", "description": "It is always good to learn lessons from a story. How the zebra got its stripes is one such story. This book is one that promises a captivating story about how the zebra got its stripes. There is a lot of drama in this story with good lessons to learn. Much of this story is centered on bravery. Every time you look at the zebra, it will remind you of the journey to acquiring the stripes it wears with so much pride. Enjoy the experience."}, {"id": "1682970337", "genre": "Children's Books", "title": "Acorn to Oak Tree (LifeCycles)", "description": "Where do acorns come from? How do acorns grow into trees? What is a catkin?Packed with fascinating facts about life cycles, amazing photographs of every stage, and labelled diagrams to explain growth and development.Discover the amazing stages of different life cycles and learn all about your favorite species with this stunning series. From plants and birds to garden animals, readers will soon learn how different species are born, grow up, and reproduce. Each book has amazing photographs, easy-to-understand text, and discussion points for further learning."}, {"id": "1568473362", "genre": "Children's Books", "title": "7: The Rich-Poor Divide (Global Issues)", "description": "Introduces the origins of the gap between rich and poor countries, and within countries of both kinds, explains why it is growing, discusses its effects on health and education and the problems of population growth, food production, and migration to the cities, and suggests possible solutions.Introduces the gap between rich and poor, explains why it is growing, and discusses health, education, population growth, food production, migration to the cities, and possible solutions"}, {"id": "B0091XJEHC", "genre": "Children's Books", "title": "Tub Toys", "description": "The water's running, bubbles bubbling, time to grab some toys. One duck, two trucks, three bottles...how much can a tub hold? Even the bath-shy will relish the rambunctious rhymes in this ballad of a bubble-loving bather and his over-the-top attempts to assemble his army of toys. Good to the last--surprise!--drop."}, {"id": "0812405528", "genre": "Children's Books", "title": "The Planets in Our Solar System (Let's-Read-And-Find-Out Science: Stage 2 (Pb))", "description": "You live on Earth, so you already know a lot about it. But do you know about its place in out solar system? For instance, it's not the largest planet. If Jupiter were a hallow ball, 1,000 Earths would fit inside it. And did you know our planet Earth takes 365 days to go around the sun, while the planet Pluto takes 248 years?  This simple text by Franklyn M. Branely introduces the nine planets in our solar system and is complemented by Kevin O'Malley's full-color illustrations, which incorporate some of the newest space photographs available."}]