[{"id": "0763630292", "genre": "Children's Books", "title": "Hanukkah Lights", "description": "Sweet illustrations and simple language bring the holidays to life for the youngest of children. (Ages 1-3)Candles on the menorah, ready to light! At Hanukkah, there are many much-anticipated rituals -- latkes to eat, dreidels to spin, presents to give and receive, and shiny gold treats. Add some free-form fun, from shadow puppetry to singing and dancing, and you have a warm, truly child-friendlycelebration."}, {"id": "0385618654", "genre": "Children's Books", "title": "On Your Farts, Get Set, Go! (Mitchell Symons' Trivia Books)", "description": "Mitchell Symons, the revolting reference expert, turns his attention to the world of sport. Whether you're a sports nut or more of an armchair follower, there will be facts and stories to entertain and educate you. Find out: which striker's shorts fell down when he took a penalty; when some ducklings interrupted a rowing race; who played in the longest tennis match ever; and, which football team's fanzine is called 'Linesman, You're Rubbish'."}, {"id": "0340960035", "genre": "Children's Books", "title": "Zoom and Fly, Mr Croc: A Flap and Pop-Up Book", "description": "Where are you going, Mr Croc? Mr Croc is off to visit his friends. Will he take the car, the plane, or the submarine? Join in all the fun with Elsie the Elephant, Lulu the Leopard, Wilf the Wolf, and Zebedee the Zebra. Superb pop-ups and interactivity make this a must-have Mr Croc book."}, {"id": "B06X9YJJMR", "genre": "Children's Books", "title": "The Mystery of Sherard's Most Malevolent Misfortune. (The Legend of Sherard Lockheart Book 2)", "description": "Sherard has fallen prey to a poisoned cupcake. On his return to Ms Peddly's Home, he finds Amelia pretending onto be innocent. And everyone is falling for it.But with Amelia suddenly Kidnapped, and a thief in their midst, Sherard's day is about to go from bad... to worse.  Much, much worse."}, {"id": "0531164918", "genre": "Children's Books", "title": "Bill Gates: Software King (Book Report Biographies)", "description": "A biography of the man who created Microsoft, from his childhood to his battle in court after being accused of having a monopoly in the computer industry."}]