[{"id": "B073RQZ2FM", "genre": "Children's Books", "title": "If You Were Me and Lived in... Scotland: A Child's Introduction to Cultures Around the World", "description": "Carole P. Roman is taking students to Northern Europe again and this time it’s to visitScotland. You’ll learn about the fascinating architecture that was inspired by ancientGreece and Rome.Whether your name is Ian, Connor, or Malcolm, you’ll follow along and visit Loch Ness andhope to get a sighting of its famous occupant, Nessie.Perhaps you’ll try haggis or tatie scones and finish your meal with a clootie.Children are loving this award winning series! It has created a whole generation of armchairtravelers that are thrilled to learn about cultures and customs from around the globe.Join Carole P. Roman and discover the world!"}, {"id": "1549751093", "genre": "Children's Books", "title": "Team Goon: Writing Journal, Diary or Planner", "description": "A fun writing journal with 110 lined pages This small sized (5.5x8.5) book is perfect for taking notes, writing your daily routines or as a diary. The smaller size is also perfect to fit in book-bags, purses or a carry-on. With 100 plus pages there should be plenty of room to doodle what you want for a good while. If you fill the whole book up you can always get another one."}, {"id": "B00N5E5864", "genre": "Children's Books", "title": "Aesop's Fables", "description": "Timeless tales of inspiration and enlightenment In ancient Greece, a storyteller named Aesop captivated his listeners with tales both beautiful and instructive. Thousands of years later, his fables—from “The Ant and the Grasshopper” to “The Boy Who Cried Wolf” to “The Goose That Laid the Golden Egg” to “The Tortoise and the Hare”—have lost none of their power to guide and entertain. This ebook has been professionally proofread to ensure accuracy and readability on all devices."}, {"id": "0873586883", "genre": "Children's Books", "title": "Gift For Abuelita / Un regalo para Abuelita: Celebrating the Day of the Dead/En celebracion del Dia de los Muertos (English, Multilingual and Spanish Edition)", "description": "The love and rituals surrounding the Mexican folk holiday― The Day of the Dead."}, {"id": "B007BWCD3C", "genre": "Children's Books", "title": "The Legend of the King (The Squire's Tales)", "description": "In this final installment of the Squire's Tale series, Terence and his fellow Knights of the Round Table must come together in a last stand to save Camelot. The characters Gerald Morris has brought to life throughout his series—“Terence and Gawain, Lynet and Gaheris, Luneta and Rhience, Dinadan and Palomides\"—each have an important role to play in this climactic final conflict. Maintaining their faith, selflessness, and honor, Arthur's court bands together to try to defeat Morgause and Mordred and banish the dark magic from England forever."}]