[{"id": "0316309222", "genre": "Children's Books", "title": "LEGO Ninjago: Ghost Ninja (Graphic Novel #2)", "description": "Since defeating Master Chen, the ninja have never been more united. But when the cursed spirit of Morro--the Master of Wind and Master Wu's first pupil--blows into town and possesses Lloyd, the ninja must find a way to save their friend without their elemental powers. Also includes a never-before-seen look into the secret world of Ninjago in The Lost Scrolls of Spinjitzu. The second in an epic graphic novel series of new stories and action-packed adventures following the Masters of Spinjitzu. Features exclusive content that holds more secrets and stories about the world of Ninjago. LEGO, the LEGO logo, the Brick and Knob configuration, NINJAGO, the NINJAGO logo and the Minifigure are trademarks of the LEGO Group. ©2016 The LEGO Group. All rights reserved. Produced by Little, Brown and Company under license from the LEGO Group."}, {"id": "B077WTVS3R", "genre": "Children's Books", "title": "Physics Lesson 12: Light: Physics Notes and Study Guides", "description": "The Ultimate Guide to Learning or Teaching Physics! This book contains the real lecture notes and slide of a highly effective high school and college Physics teacher. This series covers all of the topics in general physics and is perfect to help you prepare for AP Physics, A Level Physics, or any general Physics course!   Teachers: Never plan another lesson again!  Students: Ace your upcoming exam!   This series covers all of the topics of General Physics:   Vectors, Velocity, Acceleration, Projectiles, Forces, Work, Energy, Power, Momentum, Rotation, Torque, Hooke’s Law, Pendulums, Waves, Sound, Light, Electricity, Circuits, Resistance, Magnetism, Thermodynamics, and Fluid Dynamics."}, {"id": "1499880316", "genre": "Children's Books", "title": "Row, Row, Row Your Boat (A Big Button for Little Hands Sound Book)", "description": "Row your boat gently down the stream! This brilliant musical book will bring this classic children's song to life. Press the big sound button to sing along together for a merrily, merrily storytime."}, {"id": "0375840052", "genre": "Children's Books", "title": "A Horn for Louis: Louis Armstrong--as a kid! (A Stepping Stone Book(TM))", "description": "How did famous New Orleans jazz trumpet player Louis Armstrong get his first horn?  Seven-year-old Louis Armstrong was too poor to buy a real instrument. He didn’t even go to school. To help his mother pay the rent, every day he rode a junk wagon through the streets of New Orleans, playing a tin horn and collecting stuff people didn’t want. Then one day, the junk wagon passed a pawn shop with a gleaming brass trumpet in the window. . . . With messages about hard work, persistence, hope, tolerance, cooperation, trust, and friendship, A Horn for Louis is perfect for aspiring young musicians and nonfiction fans alike! History Stepping Stones now feature updated content that emphasizes Common Core and today’s renewed interest in nonfiction. Perfect for home, school, and library bookshelves!"}, {"id": "192748393X", "genre": "Children's Books", "title": "Kate & Pippin's Family: The Unlikely Love Story Continues", "description": "The sequel to Kate & Pippin: An Unlikely Love Story, which stole the hearts of kids, parents, and teachers everywhere. Now Kippin brings her fawns with her on visits from the forest to hang out with Kate -- and to visit Henry the cat and another Great Dane in the family, too."}]