[{"id": "B00AK3NRP2", "genre": "Children's Books", "title": "Helicopters/ Helicopteros (Mega Military Machines / Megamaquinas Militares)", "description": "Bright photos and clear text will engage young readers as they learn about the extraordinary capabilities of military helicopters."}, {"id": "1628323795", "genre": "Children's Books", "title": "Reel Time: Fresh Fish", "description": "\"A primer on the basic dos and don'ts of fishing, including tips on where to find certain species, information on how a fish's anatomical makeup helps it avoid getting hooked, and instructions for cleaning a catch\"--"}, {"id": "1512415502", "genre": "Children's Books", "title": "A King's Guide (How-to Guides for Fiendish Rulers)", "description": "I am a powerful medieval king. I have an impressive castle, I like to be entertained by music and jesters, and I'm not afraid of an intense battle. But being a king isn't easy. There are a few important rules to follow in order to be great. Everyone in the kingdom must bow down to me, and I must have the most powerful weapons. If you betray me, you will be punished—severely. Read all of my rules to learn more about how I control my great kingdom. You're lucky I'm telling you my secrets. But I know I can trust you not to betray me . . . can't I?"}, {"id": "1626176477", "genre": "Children's Books", "title": "Dav Pilkey (Blastoff Readers. Level 4: Children's Storytellers)", "description": "Humor is the language Dav Pilkey speaks to reach his readers. Just consider the names he gives his characters: Wedgie Woman, Professor Poopypants, and Super Diaper Baby! In this storyteller bio, kids will discover the life adventures of the funny man behind the popular Captain Underpants book series."}, {"id": "B00MS8QW3G", "genre": "Children's Books", "title": "The Adventures of Zelda: Pug and Peach (Zelda Pug, #3)", "description": "The adventures continue with double the sneezes, wrinkles, and slobber…I am not an ordinary pug. I have the wrinkles, smashed face, and curly tail of a pug, but the similarities stop there. Instead of sleeping or eating my days away, I prefer to gather acorns for my squirrel friend Squeaks, solve the mystery of the leaf pile, or hide bones throughout the house. Now I have a sister. Her name is Peach, and we tell of our adventures together. We meet a giant mutant rabbit, try to catch a pesky squirrel, and survive a crab attack. Kids and adults alike smile and laugh as they read about our adventures, and rumor has it that families are more likely to adopt a pug after reading any of my books. The world will be a better place with more wrinkles and curly tails in it!The Adventures of Zelda is an exciting and hilarious chapter book series for young readers (ages 7 and up). Books in the Series:The Adventures of Zelda: A Pug TaleThe Adventures of Zelda: The Second SagaThe Adventures of Zelda: Pug and PeachThe Adventures of Zelda: The Four SeasonsThe Adventures of Zelda: The One and Only Pug"}]