[{"id": "1932530975", "genre": "Children's Books", "title": "Minnesota Twins 101 (101 My First Team-Board-Books)", "description": "Minnesota Twins 101 is required reading for every Twins fan! From the legendary Rod Carew and Harmon Killebrew to eating waving a Homer Hanky and cheering with TC, you'll share all the memories with the next generation. Enjoy all the traditions of your favorite team, learn the basics about playing baseball and share your passion for America's pastime!"}, {"id": "0007465483", "genre": "Children's Books", "title": "Ade Adepitan: A Paralympian's Story (Collins Big Cat)", "description": "A Paralympic medal winner, commentator and a successful TV presenter, Ade Adepitan has led a remarkable life. Find out Ade's story, from growing up in Nigeria with a disability, to developing his passion for sport, to receiving an MBE, in this inspirational autobiography."}, {"id": "B00DMCV2K0", "genre": "Children's Books", "title": "How to Cheer Up Dad", "description": "A hilarious book about parent and child relationships for fans of Ian Falconer and Jon Agee--a perfect gift idea for Father's Day and beyond!Little Jumbo just can't understand why his dad is having such a bad day. It couldn't be the raisins Little Jumbo spit out at the ceiling or the bath he refused to take--after all, Little Jumbo's dad knew he hated raisins and had already taken a bath that week! Luckily, Little Jumbo is such a thoughtful elephant that he decides to turn his dad's bad day around with some of his--ahem, his dad's--favorite things.How to Cheer up Dad is a standout debut featuring a charmingly oblivious little elephant with serious pluck and staying power. It turns the parent-child roles upside down is a great book for dads and the kids who make them laugh."}, {"id": "0821422685", "genre": "Children's Books", "title": "Virginia Hamilton: America’s Storyteller (Biographies for Young Readers)", "description": "Long before she wrote The House of Dies Drear, M. C. Higgins, the Great, and many other children’s classics, Virginia Hamilton grew up among her extended family near Yellow Springs, Ohio, where her grandfather had been brought as a baby through the Underground Railroad. The family stories she heard as a child fueled her imagination, and the freedom to roam the farms and woods nearby trained her to be a great observer. In all, Hamilton wrote forty-one books, each driven by a focus on “the known, the remembered, and the imagined”—particularly within the lives of African Americans.Over her thirty-five-year career, Hamilton received every major award for children’s literature. This new biography gives us the whole story of Virginia’s creative genius, her passion for nurturing young readers, and her clever way of crafting stories they’d love."}, {"id": "1542633923", "genre": "Children's Books", "title": "Maya the Mermaid", "description": "Maya the mermaid saves a man swimming in the sea. They dream of a life together on land. The story is based on a selection of illustrations by Emmett Watson that appeared in the early 20th century. The illustrations are re-purposed to tell Maya's story."}]