[{"id": "B005FR2BUA", "genre": "Science Fiction & Fantasy", "title": "2/4 Cavalry Book 5: Eagle Hammer (Military Scifi)", "description": "After the unsuccessful attempt of the unit and the Texians to capture General Malik in Another Day in Paradise (Book 4), the unit is eventually deployed to Talis, a forested planet where a republic has broken away from the main planetary government.  Hired to support the Golden Eagles, a crack tank mercenary regiment, the unit heads to the planet in a more \"conventional\" tank setting rather than a couner-insurgency one."}, {"id": "B0163IOC24", "genre": "Science Fiction & Fantasy", "title": "The Artifact Hunters Bundle: Books 1, 2, 3 and 4", "description": "In a steam powered Victorian England, feisty Cara Devon is on the trail of powerful ancient artifacts in this bestselling historical fantasy series. This bundle contains the entire Artifact Hunters series of 4 full length novels.1: Nefertiti's HeartA killer stalks the nobility seeking a legendary diamond said to have once belonged to Queen Nefertiti and rumoured to hold the key to immortality.2: Hatshepsut's CollarAn ancient Egyptian necklace is driving Queen Victoria mad with megalomania, and that's not Cara's most pressing problem.3: Nero's FiddlePeople start dying from spontaneous human combustion when someone uses a relic from Rome to cover up an old secret.4: Moseh's StaffLondon is in the grip's of an unnatural winter and Queen Victoria wants answers. Cara suspects who is responsible, she just doesn't know what..."}, {"id": "B000BRQ4WU", "genre": "Science Fiction & Fantasy", "title": "Men Without Bones and Other Haunting Inhabitants of the Wide Weird World of Gerald Kersh", "description": "Gerald Kersh is another one of those writers who have so many good stories -- and such great titles! -- but the problem with Kersh would be choosing his SECOND best story. \"The Dancing Doll\", \"The Man Who Sold His Head\", \"A Game Played in the Twilight\", and \"The Unkillable Man\" would all be up there. But Kersh took a trip into the metaphoric jungle, as well as outside the margins of space and time, for this one. If you're a fan of British gangster films, and are as aware of how influental Kersh's work was on the genre, then this story will confuse and chill you. An explorer is dying, and tells a fellow passenger on his boat about discovering a crashed alien spaceship deep in the darkest jungle. And then, before he dies, he lets slip the even WORSE thing he discovered."}, {"id": "1938257685", "genre": "Science Fiction & Fantasy", "title": "My Partner Jakup The Jay", "description": "When Riley’s mother rudely interrupted his comfortable summer of snacking and TV reruns, the notion he was about to enter the world of the supernatural never occurred to him. Drafted by Jakup, a scrub jay and freelance familiar for Witches local 723, he discovers psychic abilities he didn’t realize he had. He agrees to join Jakup as part of an unlikely interspecies team deputized to confront paranormal plots. Not all the creatures of his new shadowy world are friendly. Their job would be to sort the good guys from the bad guys and stop them."}, {"id": "0425190374", "genre": "Science Fiction & Fantasy", "title": "Practical Magic", "description": "The Owens sisters confront the challenges of life and love in this bewitching novel from the New York Times bestselling author of The Rules of Magic.For more than two hundred years, the Owens women have been blamed for everything that has gone wrong in their Massachusetts town. Gillian and Sally have endured that fate as well: as children, the sisters were forever outsiders, taunted, talked about, pointed at. Their elderly aunts almost seemed to encourage the whispers of witchery, with their musty house and their exotic concoctions and their crowd of black cats. But all Gillian and Sally wanted was to escape. One will do so by marrying, the other by running away. But the bonds they share will bring them back—almost as if by magic...“Splendid...Practical Magic is one of [Hoffman's] best novels, showing on every page her gift for touching ordinary life as if with a wand, to reveal how extraordinary life really is.”—Newsweek “[A] delicious fantasy of witchcraft and love in a world where gardens smell of lemon verbena and happy endings are possible.”—Cosmopolitan  "}]