[{"id": "0670011444", "genre": "Children's Books", "title": "Guys Write for Guys Read: Boys' Favorite Authors Write About Being Boys", "description": "This fast-paced, high-energy collection of short works features today?s most popular writers and illustrators writing about what it means to be a guy. Contributors include Chris Crutcher, Stephen King, Matt Groening, Daniel Pinkwater, Neil Gaiman, and many more. Includes an all-new foreword by Jon Scieszka and an excerpt from Knucklehead."}, {"id": "0753473100", "genre": "Children's Books", "title": "Basher Science: Engineering: The Riveting World of Buildings and Machines", "description": "How does a 3D printer work? What stops a skyscraper from falling over? Where does a smart phone store information? Welcome to the world of engineering! Discover how the familiar machines and buildings in today's world are constructed, and how they function. How do scientists choose the right materials for the right job? Which scientific principles lie behind each machine or structure?Basher's highly original books explain difficult scientific concepts in ingenious ways, making them tangible, understandable and even lovable. Chatty first-person text and stylish, contemporary character illustrations give a voice, personality, and story to each topic -- it's a truly brilliant way to communicate science."}, {"id": "150263189X", "genre": "Children's Books", "title": "Honesty in Government and Society (Civic Values)", "description": "One of the key values in society is honesty. Students will learn how it functions in the United States' government and society, how basic principles and laws rely on it, and how it is essential to everyday interactions."}, {"id": "1603424490", "genre": "Children's Books", "title": "One-Yard Wonders: 101 Sewing Projects; Look How Much You Can Make with Just One Yard of Fabric!", "description": "Discover all that you can make with just one yard of fabric! Rebecca Yaker and Patricia Hoskins offer 101 stylish projects that use a single yard of fabric to make clothes, accessories, baby items, and more. With simple step-by-step instructions that are accompanied by templates and pattern pieces, each project is designed to be completed in just a few hours. Get inspired and turn a yard of your favorite fabric into a quilted lunch bag, bright sundress, or a cuddly plush turtle. "}, {"id": "154697914X", "genre": "Children's Books", "title": "Notebook Grid Paper: Graph Paper Notebook, 8.5 x 11, 120 Grid Lined Pages (1/4 Inch Squares)", "description": "Perfect For All Your Grid Line Journaling & DrawingGraph Paper Journal Style book with 1/4 inch squares perfect for solving math problems, drawing and doodling or even journaling. Professionally designed covers make your book stand out from the rest.120 8.5” x 11” grid lined pages allows you to fill this book with your sketches, ideas, memories and much more. Makes a great gift for anyone who loves to journal."}]