[{"id": "1405930039", "genre": "Science Fiction & Fantasy", "title": "Doctor Who: Tales of Terror", "description": "A new spine-chilling collection of twelve short illustrated adventures packed with terrifying Doctor Who monsters and villains, just in time for Halloween 2017! The six authors featured are Jacqueline Rayner, Mike Tucker, Paul Magrs, Richard Dungworth, Scott Handcock and Craig Donaghy. The illustrator is Rohan Eason.  Each short story will feature a frightening nemesis for the Doctor to outwit, and each will star one incarnation of the Doctor with additional appearances from favourite friends and companions such as Sarah Jane, Jo and Ace."}, {"id": "1886528772", "genre": "Science Fiction & Fantasy", "title": "The Sixth World of Men (12 Passions) (Volume 5)", "description": "In this fifth volume of The Sixth World of Men, dominant forces begin to assert themselves. Each force is driven by powerful emotions. Some emotions are constructive; some are destructive. Some emotions are self-serving; some serve others. The more powerful of these emotions touch others regardless of the intent of the emotion. These emotions are so strong that they become passions. Some passions tend toward oppression while others tend toward kindness. As the opposing forces within Kosundo rush headlong toward each other, passions intensify. Among these passions is the greatest of passions. This passion has endured the mayhem to this point, but will it continue to endure among the eleven other passions that have overcome much of Kosundo?"}, {"id": "B00H1V5FO2", "genre": "Science Fiction & Fantasy", "title": "The Defenders: Short Story", "description": "After a devastating war between the United States and the Soviet Union mankind has taken refuge beneath Earth’s surface. But the war continues above ground, with robots called “leadys” fighting on our behalf—or so the humans think. “The Defenders” was later expanded into a full-length novel entitled The Penultimate Truth, published in 1964.Philip K. Dick was an American science-fiction novelist, short-story writer and essayist. His first short story, “Beyond Lies the Wub,” was published shortly after his high school graduation. Some of his most famous short stories were adapted for film, including “The Minority Report,” “Paycheck,” “Second Variety” (adapted into the film Screamers) and “We Can Remember It For You Wholesale” (adapted into the film Total Recall).HarperCollins brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperCollins short-stories collection to build your digital library."}, {"id": "B0098CLJ1K", "genre": "Science Fiction & Fantasy", "title": "Fell Winter (The Ulfr Crisis Book 1)", "description": "An evil not seen in hundreds of years has awakened in the highland nation of Badelgard. The Ulfr – the original inhabitants of the land whose evil was matched only by their power over death – stir from their barrows.The dead walk again at the command of an Ulfr witch. The fate of the High King and the possession of the High Throne grow more and more uncertain. Tensions flare between the lowborn commoners and the highborn descendants of the Seven Wardens.In the middle of it all, the lowborn musician Brand Gutlaffson is thrust into a perilous chase thanks to the foolish decisions of his friend, the warrior Gunnar Whoreson. Their midnight flight takes them to the accursed land of Blackfold, where the ancient Ulfr goddess waits for Her awakening.The cold begins to set in. But there is more to fear than darkness and snow in this FELL WINTER.This novel of epic fantasy begins the “Ulfr Crisis” trilogy."}, {"id": "1400100690", "genre": "Science Fiction & Fantasy", "title": "Pellucidar", "description": "In this sequel to At the Earth's Core, David Innes vows revenge and returns to the Inner World of Pellucidar to rescue the beautiful Dian, who had been torn from his arms by trickery. However, his return trip places him far from the land of his beloved and he is forced to undertake a desperate journey thousands of miles across the fierce inner earth to reach her. David's epic voyage takes him through the many strange lands of Pellucidar, including the pendant moon and Land of Awful Shadow. His heart pounding encounters with primeval beasts and extraordinary peoples makes Pellucidar one of the best adventure stories ever penned by Edgar Rice Burroughs."}]