[{"id": "0545791243", "genre": "Children's Books", "title": "The Cobra Clash (Battle Bugs #5)", "description": "Max Darwin is summoned back to Bug Island to discover the island in turmoil. Spike has vanished, and his disappearance has all the hallmarks of one of General Komodo's dastardly schemes.Max soon discovers that Spike has been bugnapped and is being held prisoner in the Reptilian Empire! Max must devise a daring rescue plan that involves traveling deep into enemy territory."}, {"id": "B012OW55BK", "genre": "Children's Books", "title": "Books For Kids: Fun Bird Facts for Kids: (Picture books for kids, 20 POPULAR BIRD BREEDS PHOTOS,kids books  Ages 3-8,Early Readers)", "description": " Books for kids: Fun Bird Facts for Kids Find out about the largest, smallest and fastest birds, how scientists believe they evolved, how many different species there are and much more.Beautifully Birds that children and parents will love! 20 POPULAR BIRD BREEDS PHOTOS Download this book now, and enjoy quality time with your kids."}, {"id": "1402743157", "genre": "Children's Books", "title": "Panda's Valentine's Day (Cuddle & Read)", "description": "For Panda, Valentine's Day means making the best card ever for his Mama-one that's pretty and fun and with lots of love inside, just like her. But nothing he does works out quite right: the heart's uneven, the red ribbon tears, and the beads won't glue. Then Mama shows him: it's the love you share that really makes a card-and Valentine's Day-special."}, {"id": "1406371564", "genre": "Children's Books", "title": "Daedalus and Icarus and Orpheus and Eurydice", "description": "The ancient Greek myths as you've never read them before!The classic stories of Daedalus and Icarus and Orpheus and Eurydice are re-told here in master storyteller, Marcia Williams' inimitable comic style. These splendid adaptations have easy-to-read, accessible text and brilliantly witty illustrations, making them a perfect introduction to the classic legends of adventure and endeavour! Ideal for newly-confident readers - the classics have never looked so good!"}, {"id": "0766038688", "genre": "Children's Books", "title": "Top 25 Gymnastics Skills, Tips, and Tricks (Top 25 Sports Skills, Tips, and Tricks)", "description": "During the heat of competition, the slightest misstep in your floor exercise or a fall off the balance beam could cost you a trophy or your team a championship. Gymnastics is all about precision and technique. Would you like to perform like an Olympic gold medallist? Author Jeff Savage gives step-by-step instructions to many of the basic techniques in gymnastics, and provides you with some fun tips from Olympic champions."}]