[{"id": "1554397030", "genre": "Children's Books", "title": "The Avro Arrow Story (JR): The Impossible Dream (Amazing Stories)", "description": "The Avro CF-105 Arrow was an interceptor aircraft. It was designed and built in Ontario in the 1950s. The company that built the Arrow was one of the best airplane companies in the world. It was an amazing plane. But the plane as cancelled by the government. The prototypes were destroyed, and the blueprints were burned. But the name lives on."}, {"id": "1590183150", "genre": "Children's Books", "title": "Influential Figures of Ancient Rome (Lucent Library of Historical Eras)", "description": "Looks at the lives and contributions of important literary figures, rulers, scholars, and revolutionaries of ancient Rome."}, {"id": "149942177X", "genre": "Children's Books", "title": "Medical Robots (Robots and Robotics)", "description": "Can robots save lives? Medical robots save lives every day, and they’re sure to save more as their technology advances. This book describes the amazing work done by medical robots, from surgical robots to nano-robots. Readers will learn about the medical breakthroughs performed by robots, the latest models, and the future of robots in medicine. Accessible descriptions of how medical robots work will engage readers and give them a deep understanding of this burgeoning technology. Color photographs of each robot are provided to give readers an inside look into the operating room and beyond."}, {"id": "B00CQYAVQG", "genre": "Children's Books", "title": "Ninja Meerkats (#6): Big City Bust-Up", "description": "JET FLASHFEET, CHUCK COBRACRUSHER, DONNIE DRAGONJAB, and BRUCE WILLOWHAMMER . . .Together they are THE NINJA MEERKATS!Armed to the teeth with ninja-know-how, this ultimate fighting force has one goal - to thwart the evil ringmaster's plans for world domination. Ninja-Boom!The mystical stone of life has fallen into the wrong hands and an army of statues is causing chaos on the streets of London. The meerkats are summoned to help by the Secret Secret Service, and vow to leave no stone unturned. Can they succeed before the city crumbles? Get ready to rock!"}, {"id": "0448432498", "genre": "Children's Books", "title": "Cool Yule!A Crafty and Creative Christmas", "description": "Easy-to-follow instructions and adorable illustrations accompany a funky how-to guide to making perfect gifts for the holidays, including necklaces, bulletin boards, and homemade bubble bath. Original."}]