[{"id": "1869209273", "genre": "Children's Books", "title": "101 Bible Stories for Toddlers", "description": "The 101 Bible Stories for Toddlers Picture Book is an enjoyable way to introduce a small child to the Spirit of God and His creation. The stories are faithfully-adapted to appeal to three to six-year-olds. Each page is delightfully illustrated by Caron Turk. Sturdy hardcover volume has a padded front cover. The author, Carolyn Larsen, has written more than 40 books for children and adults. She is best known as the author of the Little Girls & Boys Bible Storybook line of products, with illustrations by Caron Turk. Suitable for ages 3 - 6  6.75 x 7.5 Inch - 416 Full-Color Pages"}, {"id": "1619303213", "genre": "Children's Books", "title": "Technology: Cool Women Who Code (Girls in Science)", "description": "Do you listen to music with an MP3 player or read books on a tablet? Do you play multiplayer video games with people on the other side of the world? Do you have a robot cleaning your kitchen? Maybe not yet, but someday!In Technology: Cool Women Who Code, kids in grades four through six learn about the thrilling effort that goes into researching, inventing, programming, and producing the technology we use today, from iPods to mechanical limbs. Young readers discover exactly what technology is, how it evolved, and where the future may lead. They also meet three women who have contributed to the field in critical ways, including Grace Hopper and Shaundra Bryant Daily.Technology: Cool Women Who Code combines high-interest content with links to online primary sources and essential questions that further expand kids’ knowledge and understanding of a topic they come in contact with every day. Compelling portraits of women who have excelled in meeting the challenges of their field keep kids interested and infused with a sense of possibility and determination."}, {"id": "1403457875", "genre": "Children's Books", "title": "0: Mexico (We’re From . . .)", "description": "Join us on a tour around the world and visit a variety of exciting countries. Using real case studies this series shows the reader what it is really like to live in these countries. It includes information on family life, schools, transport, landscapes, food, festivals, weather and climate. It features specially commissioned case studies using people from different parts of the country. It covers core curriculum areas for Key Stage 1 Geography."}, {"id": "0140320954", "genre": "Children's Books", "title": "Babe Didrikson: Athlete of the Century (Women of Our Time)", "description": "Recounts the childhood and youth of the great Olympic and golf champion and reveals the dedication and commitment that lay behind her unparallelled achievements"}, {"id": "1547137126", "genre": "Children's Books", "title": "Happy 26th Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 26 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]