[{"id": "1426323891", "genre": "Children's Books", "title": "Weird but True! Collector's Mega-set: 1,800 Outrageous Facts", "description": "Get six incredible, full-length Weird but True! books in one out-of-this-world collector's mega-set, featuring all-new outrageous trivia and eye-popping photos in every book and all the fun you've come to expect from this wildly popular series. Fascinating information and lively art combine to make irresistible brain candy for young readers. Kids will have such a good time that they won't even realize they're learning! Did you know that \"borborygmus\" is the word for the rumbling sound in your stomach when you’re hungry, or that some butterflies drink turtle tears? The creators of National Geographic Kids, the nation's most popular kids' magazine present the Weird but True! Collector's Mega-set. It’s chock-full of 1,800 wacky, wild, mind-bending facts about everything on Earth and beyond, including animals, food, science, pop culture, outer space, geography, weather, and more! They will so wow family and friends that you won't be able to stop turning the pages of these brainteasing treats."}, {"id": "1783446722", "genre": "Children's Books", "title": "The Little Book of Football Jokes", "description": "What did the ref say to the chicken who tripped a defender? Fowl! Why was the footballer upset on his birthday? He got a red card! These and many more howlers to make you laugh no matter how your team is doing!"}, {"id": "1541511921", "genre": "Children's Books", "title": "Johnny Clem's Civil War Story (Kids in War)", "description": "Bullets whizzed overhead, narrowly missing twelve-year-old Johnny Clem. The Confederate army was winning the Battle of Chickamauga, and Johnny's unit had begun to retreat. Although he had joined the Union army as a drummer boy, Johnny knew the dangers of the Civil War. Now he clutched his musket tight, prepared to protect himself and his fellow soldiers at any cost. Join Johnny on the battlefield as he fights to stay alive."}, {"id": "1119046025", "genre": "Children's Books", "title": "Adventures in Raspberry Pi", "description": "Start programming quickly with this super-fun guide to Raspberry Pi Adventures in Raspberry Pi, 2nd Edition includes 9 cool projects that show you how to set up and start developing on your Raspberry Pi. Updated for the release of the Rev 3 board, this second edition covers all the latest features and tells you everything you need to know. Written specifically for 11-15 year-olds, this book uses the wildly successful, Raspberry Pi to explain the fundamentals of computing. You'll have a blast learning basic programming and system administration skills, beginning with the very basics of how to plug in the board and turn it on. Each project includes an instructional video so you can jump right in and start going through the lessons on your own. This hands-on book gets you up and running fast, with fun projects that let you explore.  Learn how to \"talk to\" your Raspberry Pi Create games and stories with Scratch Program with Turtle Graphics and Python Code music and create a Raspberry Pi jukebox  If you want to get started programming today, Adventures in Raspberry Pi is the ultimate hands-on guide."}, {"id": "0692980261", "genre": "Children's Books", "title": "The world's best jokes for kids: Volume 1 (Silliness is...)", "description": "Kids love jokes and they also love silly drawings. This book is unique in that every joke is illustrated by New York Times Bestselling duo Swerling & Lazar. Each drawing is a sweet comic gem in itself, and will help get the kids reading ... and the whole family laughing."}]