[{"id": "0316471674", "genre": "Science Fiction & Fantasy", "title": "Spice and Wolf, Vol. 18 (light novel): Spring Log", "description": "Lawrence and Holo have settled into an idyllic life together after opening the Spice and Wolf bathhouse, but their happy marriage is suddenly intruded upon by an unexpected guest. During Nyohhira's sleepy off-season, the gruff stranger wanders alone from door to door as if in search of fleeting memories from long ago. Soon after his silent arrival, rumors about the possible construction of a rival hot spring village begin to spread. To protect their new home, the wise wolf and the cunning merchant return to the town of Svernel, but what they find there may spell the end of their adventures for good... "}, {"id": "156882243X", "genre": "Science Fiction & Fantasy", "title": "Cthulhu For President", "description": "The Aeon of the Elder Party has ArrivedHave you lost all hope in the future? Tired of Big Government? Sick of greedy, corrupt officials? You are not alone! Become one with the Elder Party! The greatest evil in the universe just sunk to new depths and has announced his intention to enter politics. Don't settle for the lesser evil! Heed the Call of Cthulhu! Get ready for muck-raking, magic, and mayhem (with a little help from the world of H. P. Lovecraft.)  The Stars Are Right! In Cthulhu For President, you become an Elder Party staffer tasked with serving the Great Old Ones during their eternal struggle for domination. Cross wits with the other political parties, manipulate voters using non-Euclidian geometry, swear on the Necronomicon, and sacrifice your co-workers to the Elder Gods. Politics has always been evil, but destroying the world has never been so much fun!  Cthulhu For President is a complete roleplaying game with rules for character generation, skills, combat, and magic in the shadowy world of occult national politics. A Campaign Manager section includes adventure seeds, political enemies, game-master secrets, and a ready-to-run adventure.  Strange Aeons Are Upon Us! Chaosium Inc. and 9th Level Games became strange political bedfellows to bring to life the mind-bending horror that is an election year."}, {"id": "0940064014", "genre": "Science Fiction & Fantasy", "title": "001: Lost in Time and Space With Lefty Feep: Eight Funny and Fanciful Fables of the Forties, Plus One Brand-New Parable of Modern Times", "description": "Rediscovered at last!....Back in print for the first time in 45 years, eight rollicking Lefty Feep stories....and one brand-new modern parable....zany fantasy-comedies starring literature's most beloved, befuddled character, a scratch-sheet tout with a one-track mind. Robert Bloch, who gave birth to Norman Bates in \"Psycho\", shows the lighter side to his dark genius with these hysterically rib-fracturing Funny Fables of the Forties when lefty meets the: Clarinet King and the Dancing Mice, the Bowling Dwarfs of the Catskills, the Extraordinary Average Man, the Ginch and the Invisible Pinch, the Dope and the Midascope, and Burts and Skirts of the 1940s. Ray Bradbury Raves: \"In a field that often takes itself much too seriously, Robert Bloch makes me laugh. Good medicine, that. I wish I had the patent!\""}, {"id": "0312360800", "genre": "Science Fiction & Fantasy", "title": "First Grave on the Right (Charley Davidson Series)", "description": "First Grave on the Right is the smashing, award-winning debut novel that introduces Charley Davidson: part-time private investigator and full-time Grim Reaper.Charley sees dead people. That's right, she sees dead people. And it's her job to convince them to \"go into the light.\" But when these very dead people have died under less than ideal circumstances (i.e., murder), sometimes they want Charley to bring the bad guys to justice. Complicating matters are the intensely hot dreams she's been having about an Entity who has been following her all her life...and it turns out he might not be dead after all. In fact, he might be something else entirely. This is a thrilling debut novel from Darynda Jones, an exciting newcomer to the world of paranormal romantic suspense.First Grave on the Right is the winner of the 2012 Rita Award for Best First Book."}, {"id": "B01HGB88A4", "genre": "Science Fiction & Fantasy", "title": "10,000 Dawns: Tales of Treason", "description": "Six stories exploring the parts of 10,000 Dawns you don't see on the surface: treason, treachery, conspiracy, heists, and more are contained within. From a soldier on Mars who finds out that the rally he'll be attending could be hosting an assassin, to a Cyborg learning the home he grew up in wasn't what it seemed, to a guy who just wants to run a restaurant but has to deal with a massive planetary threat, danger and wonder lurk at every turn!So go ahead, delve into the 10,000 Dawns. Adventure awaits."}]