[{"id": "B01L2D6O4Y", "genre": "Children's Books", "title": "Fullerton the Dog in OCEAN ADVENTURE: Fullerton The Dog Story No. 5", "description": "Fullerton Story No. 5 is a very interesting story because for the first time in his life Fullerton goes out to sea and he travels around the world. He also meets many wonderful people and has many exciting adventures that children will love to hear about."}, {"id": "1538350963", "genre": "Children's Books", "title": "Use It Again!: Sharing and Reusing (Computer Science for the Real World)", "description": "Computer science is all around us, at school, at home, and in the community. This book gives readers the essential tools they need to understand the computer science concept of reusing resources and knowledge. Brilliant color photographs and accessible text will engage readers and allow them to connect deeply with the concept. The computer science topic is paired with an age-appropriate curricular topic to deepen readers learning experience and show how reusing resources and knowledge can be helpful in the real world. In this book, readers learn how they can reuse and share jars of homemade salsa. This nonfiction title is paired with the fiction title My School Supplies (ISBN: 9781538350935). The instructional guide on the inside front and back covers provides: Vocabulary, Background knowledge, Text-dependent questions, Whole class activities, and Independent activities."}, {"id": "B01A3A8H0G", "genre": "Children's Books", "title": "Christopher's Precious Little Life 2", "description": "Christopher is back! This time he talks about his family, friends, and school. As you are all aware, Christopher has Autism and holds a special place in my heart. He is determined to show that just because you have Autism, does not mean that you are Handicapped!Come share a little of Christopher's life and allow him to take you on a journey of fun and adventure!.Remember proceeds from this book will be donated to Autism Speaks!"}, {"id": "0544110005", "genre": "Children's Books", "title": "Curious George Goes to the Zoo with downloadable audio", "description": "George is going to visit a new kind of zoo where the animals all roam free. Some of those animals look like a lot of fun—so much fun that a curious monkey can’t resist joining them. Giraffes and flamingos are close enough to touch, but George befriends a baby rhino who seems a little sad. Who better to lure her from her hiding place than George? And just in time for her special birthday party! Bonus activities include spot-the-difference and fun animal facts. Also includes downloadable audio!"}, {"id": "153470115X", "genre": "Children's Books", "title": "Land of the Dead", "description": "Zack Gilman: time traveler, honor student, dead guy Back in the ninth century once again, Zack joins the rest of his Viking crew as they set off for the mysterious Norse world of Niflheim, where they must recover the next treasure of Yggdrasil’s Chest. They know it won’t be easy, but they find a lot more trouble than they’d bargained for. Hel, the ruler of the Viking land of the dead, is determined to keep her new guests imprisoned in her freaky palace forever. She has many tricks up her sleeve—from a hideous flesh-eating dragon to a maze of moving walls to an army of undead warriors—and she’ll use everything she’s got to make sure Zack never makes it out alive. . . ."}]