[{"id": "1935954202", "genre": "Children's Books", "title": "Flea and Spikey", "description": "Meet Floyd, otherwise known as Flea. He's not very brave, he's rather small, and constantly being hassled by Arnold the bully. His life isn't very exciting until a new student joins his class--a tiny girl with a big personality. With a broad grin on her freckled face, she surveyed the classroom. Her eyes twinkled. All the prying eyes and gaping mouths didn't seem to bother her at all. On the contrary, she seemed to enjoy the attention. \"This is Phoebe,\" said Mrs. Jutter, introducing her. The girl looked up at the teacher ... \"But most people call me Spikey.\" Spikey is not afraid of anything. She isn't even afraid of Arnold, and she takes Floyd under her wing. Spikey shares a big secret with Floyd: Arnold turns out to practice voodoo. When Arnold discovers that Floyd knows, Floyd lands in big trouble. How will Flea and Spikey escape the wrath of Arnold and the machinations of his mother? And how will Floyd come to terms with his obnoxious nickname? With plenty of humor, Peter Koolwijk introduces the reader to the world of Flea and Spikey where the boundaries between reality and fantasy blur. Illustrator Linde Faas gives Spikey, the girl everyone wants to be friends with, her cheerful and unique form."}, {"id": "1432933442", "genre": "Children's Books", "title": "People Who Help Us (People in the Community)", "description": "Read 'People Who Help Us' to learn about what a community is, and the different people who help communities around the world. Simple text and vivid images introduce readers to dentists, doctors, teachers, police officers, firefighters, and vets. This Acorn Read-Aloud is an excellent tool for introducing readers to communities and common jobs."}, {"id": "1429660309", "genre": "Children's Books", "title": "Desert Animal Adaptations (Amazing Animal Adaptations)", "description": "Desert animals special features help them survive in the heat and cold of their bone dry homes. Read all about the amazing adaptations of desert animals."}, {"id": "1406313726", "genre": "Children's Books", "title": "Btwf: William The Conqueror: Nowhere To", "description": "A thrilling historical adventure in the \"Before They Were Famous\" series, telling the story of the young William the Conqueror.A young boy is sent away to France, far from the political turmoil of the Normandy court. He spends his years training to become a knight and learning the value of friendship and loyalty - which will be vital when decides he must return to take his rightful place as Duke of Normandy. This thrilling historical adventure, one of the \"Before They Were Famous\" series that includes the Cleopatra, Boudica and Pocahontas, tells the story of a young boy who one day became known as William the Conqueror."}, {"id": "0789309858", "genre": "Children's Books", "title": "The Ancient Egypt Pop-up Book: In Association with the British Museum", "description": "A magnificently illustrated, interactive pop-up book chronicles the history of ancient Egypt and its diverse cultural innovations, covering everything to the construction of the Egyptian pyramids and the elaborate mummification process, to the mysterious rites performed at an Egyptian god's temple and the ancient hieroglyphic writings. 20,000 first printing."}]