[{"id": "B00IZHKDQG", "genre": "Children's Books", "title": "Fascinating Numbers: The 33 Best Math Tricks", "description": "Math fun for everyone!Math can be so much fun – no matter if you're only 8, 18 or even 80! In this small ebook I have collected 33 math tricks for you. Most of them are relatively simple, but still they got what it takes to stun you and all your friends. You won't find long preambles or explications in this ebook. The math tricks in this ebook want to be nothing else than fun, fascination and frolic.Much pleasure!"}, {"id": "B076DXT5WJ", "genre": "Children's Books", "title": "The Salmon's Journey (Lightning Bolt Books ™ — Amazing Migrators)", "description": "Did you know adult salmon return to the rivers where they were born? Salmon are migrators! They travel in groups as they make their long migration swim. From egg to fish and out to the open ocean—then back again—follow the journey of migrating salmon!"}, {"id": "B0064CPR1U", "genre": "Children's Books", "title": "Ripley’s RBI 02: Dragon's Triangle (Ripley's RBI)", "description": "Join the RBI—a group of teen agents with special gifts—on a series of action-packed adventures as they travel the world!The coast of Japan is being terrorized by a mysterious creature. The RBI are sent to investigate sightings of red glowing eyes that peer out of sea mists and an enormous beast that breathes fire and tramples cars. A trip to Japan reveals a bizarre inventor and stories of a slumbering sea dragon. Is their mission linked to the old legend of the “Dragon’s Triangle” and its tales of disappearing ships?"}, {"id": "B074WG5DG5", "genre": "Children's Books", "title": "Immortal Rebel (The Allegiance Book 2)", "description": "He is scarred by betrayal, she lives by deceiving others...Betrayed, rebel Michael O’Conner blames himself for the Allegiance laying waste to the rebel town Pyke. After Pyke’s destruction, a curse of immortality was placed on him by the three Furies. Ashamed, he vowed to live a disconnected life, undisturbed by anything occurring outside his seclusion.Phoibe is an Allegiant bounty hunter, circumstances forcing her to collect bounties or lose her only home. When she is tasked with capturing a girl named Marylyn O’Conner, for a promising reward, Phoibe agrees. To aid in her mission, she creates an alliance with the isolated immortal, Michael O’Conner.After learning his sister has been taken captive by an Allegiant Prince, Michael O’Conner realizes he can no longer hide from the world. He agrees to join Phoibe and save his sister, completely unaware of her ulterior motives.Phoibe knows she needs to keep everything a secret from the handsome immortal, or risk losing her only home. Phoibe only hopes she can handle the heartache that will come with betraying a man who has already experienced so much betrayal in his past."}, {"id": "B0768HLDN8", "genre": "Children's Books", "title": "The Life of a Native American Indian Child - US History Books | Children's American History", "description": "Imagine for a while that you're a Native American Indian child. What would life be like? With the help of this US History Book, you don't have to imagine without help! Inside the pages are pictures and child-friendly texts for easy understanding and effective retention of information. What is your favorite part of being a Native American Indian Child?"}]