[{"id": "B009V9EO4O", "genre": "Science Fiction & Fantasy", "title": "Pactum (Contractor Book 1)", "description": "Society still finds itself reeling from magic coming out into the open. As the world comes to grips with the fact that old legends are true, Homicide Detective Alison Kaur still has a job to do. After the corpse of William Lanner is found, Alison must delve into the ugly world of prostitution, gangsters and murder. All while she and her partner deal with the dangers of Mages, Werewolves, Succubi and others. Will Alison be able to track down the killer of William Lanner? Or will she become a victim herself?The Contractor SeriesPactumSeeker             "}, {"id": "B006WSJRSK", "genre": "Science Fiction & Fantasy", "title": "Young Falcon (Sons and Daughters Book 1)", "description": "Elysia's comfortable and uneventful life abruptly ends when her father asks her to journey to the capital on a mission for him. Having only dreamt of seeing other cities in her elven country of Yaracina, seventeen-year old Elysia jumps at the chance but soon encounters the downside of the world beyond her safe borders.Captured by soldiers, thrown in a dungeon, and soon to be sold to humans--a race thought long since extinct--Elysia refuses to face defeat. During her long hours of isolation while held prisoner, she develops a mental bond with a man she's never met that becomes so strong that the two cannot even tell their own thoughts, dreams, or emotions apartElysia escapes her captors, only to have others pursue her. A secret mission, a plunge into the land of the dead, ruthless killing about her--she finds danger lurking at every turn. Secrets abound. Friends fade into foes. And Elysia stumbles amidst the chaos going on about her, confused, alone, and uncertain. But now that she's begun, she cannot turn back..."}, {"id": "0738811963", "genre": "Science Fiction & Fantasy", "title": "Fear of Writing", "description": "Get the latest edition of Fear of Writing (April 2014). Look for the \"3rd edition\" gold starburst on the cover of the paperback. Or click on the 'Kindle' box above to read the 3rd edition on Kindle. This Amazon page is for the 1st edition in hardcover (January 2000).  Fear of Writing is for anyone who experiences that familiar thud in the pit of the stomach when they visualize sitting down to write. The process of unblocking the paralysis of fear and learning to flow is demystified, and a triage of fun is applied to heal the writing scars."}, {"id": "B00O0E3IBU", "genre": "Science Fiction & Fantasy", "title": "All For Nothing", "description": "Secrets. Half-truths. Lies.For seventeen years, Amy Corbett has been deceived. After the jarring events in \"Ordinary World\" (from the Portals anthology), her life was turned upside down. Now she wants answers. Answers about her past. Why didn't her mother clue her into the truth about her father? And why keep her heritage as a witch quiet? Reluctantly accepting the changes forced upon her, Amy's trying to embrace her 'new' self. One thing is certain: being a witch is hard work. Frustrated by her inability to grasp a simple spell, she soon learns from a mysterious new guy about an obscure society of magic users called mavericks. They've been shunned for not 'fitting in.' Finding out more about the mavericks isn't easy when information about them is restricted. Her curiosity piqued, Amy wonders if that secret group has the answers she wants. Maybe she'll find a place among them where she truly belongs. There's no place like home? Sometimes, Amy discovers, there are alternatives."}, {"id": "B074P4613D", "genre": "Science Fiction & Fantasy", "title": "The Sword With The Ruby Hilt", "description": "Two dead bodies are found in the sanctum of the most sacred temple in the Empire, with no marks of violence on them.  A king raises his daughter as a son, dresses her as one, gives her a male name and sits her on his throne as King. She is Emperor Rudradeva. When she orders an investigation, it reveals a plot to kill her.  The investigation unveils a chain of events where forces beyond human control unleash their savagery. Rudradeva hides a dark secret which now threatens her life and the very existence of the Empire. Only the Sword With The Ruby Hilt can save them. Set in 12th Century India, the historical fantasy thriller tells the story of a brave warrior’s fight against a malevolent force of evil and terror."}]