[{"id": "143291622X", "genre": "Children's Books", "title": "Rock (Materials)", "description": "How is rock used? Read this book to learn all about rock. Books in this series introduce children to the exciting world of materials. Each book uses simple, repetitive text to teach basic vocabulary, and includes stunning photographs that illustrate the properties of each material. In Rock, readers learn where rock can be found, how rocks can look, and the different ways rocks are used."}, {"id": "1441314180", "genre": "Children's Books", "title": "Pet Shop Scratch and Sketch Trace-Along", "description": "Come join the fun at the pet shop, and see which pet you would want to take home!This is a Trace-Along title! Use the white outlines to trace all your favorite animal friends -- from puppies and kitties to turtles and birds -- and discover sparkling, colorful, lovable pets beneath the black coating.Learn fun facts about each pet with informative accompanying text!Includes a wooden stylus to scratch the black-coated pages to reveal glittering foil or swirling colors beneath.Wire-o bound hardcover binding.20 scratch-off black-coated pages, 20 illustrated pages, and 20 pages for your own sketches.Recommended for ages 5 and up.6-3/8 inches wide x 8-1/2 inches high.Non-toxic: Potential eye irritant. Avoid inhaling particles of scratch coating. Not for children under 5 years. Meets all applicable safety standards."}, {"id": "155386011X", "genre": "Children's Books", "title": "2: Funky Phonics: Resource Book, Learn to Read (Funky Phonics Learn to Read)", "description": "Ready-to-use classroom activities, lessons, reproducible worksheets and exercises based on \"Funky Phonics: Learn to Read, vol. 2\". Teaches the long vowels, y as a vowel, consonants and blends. Includes: qu, j, v, w, hard g, soft g, x, y and z. Great for teaching reading at school or at home. Recommended: K-Grade 1."}, {"id": "0531240959", "genre": "Children's Books", "title": "Amazing Makerspace DIY Basic Machines (True Books) (True Books: Amazing Makerspace DIY)", "description": "Building your own robot at home might seem difficult or even impossible at first. But to a maker, it is no problem at all! Readers will find out how to build robots using household objects such as scrub brushes and cardboard boxes. As they work, theyll learn how the earliest robots were created, how robots have improved our lives, and much more."}, {"id": "082343771X", "genre": "Children's Books", "title": "There Was an Old Woman Who Lived in a Shoe", "description": "Jane Cabrera’s boldly colored rendition of a favorite rhyme gets an ecofriendly spin. This old woman and her household of high-spirited children and talented pets are resourceful. Together they repair their broken furniture, find alternative modes of transportation when the car breaks down and remake worn clothing with colorful patches. Sheet music for piano, voice and guitar are included in the book."}]