[{"id": "0525422463", "genre": "Children's Books", "title": "The Snow Dog's Journey", "description": "One wintry day, two children build a dog out of snow, and they play with him and love him just as if he were real. That night, the icy Frost King spies the dog and decides to make him his own. Together, they travel far and wide, but in his heart Snow Dog knows that no one loves him like the children. So he sets out to find his way home. In the spirit of such classics as The Velveteen Rabbit, here is a magical, heartwarming story about the transformative power of love."}, {"id": "0736423036", "genre": "Children's Books", "title": "The Koala King (Step into Reading)", "description": "Life in a New York City Zoo is normal by day, but at night the animals let loose! Trouble arises one night when one a young lion accidentally gets shipped away to Africa. It’s up to Nigel, a koala with self-esteem issues, and the other zoo animals to help him. This action-packed Step 2 reader tells the story of Disney’s new movie, The Wild."}, {"id": "0061344990", "genre": "Children's Books", "title": "Merry Christmas, Mouse! (If You Give...)", "description": "Join Mouse from If You Give a Mouse a Cookie as he decorates his Christmas tree in a holiday counting adventure.This board book with sturdy pages is perfect for toddlers, who will enjoy this simple introduction to numbers. Mouse adds ornaments to his tree, one by one. A great opportunity for the littlest ones to practice counting along with the ever-popular Mouse.Fans of the If You Give... series won't want to miss this special Christmas board book. "}, {"id": "1841930792", "genre": "Children's Books", "title": "Succeed in Maths 9-11 Years", "description": "Specifically designed to help parents support their children's work at home, and concise and accessible so both parent and child can follow the principles easily and at their own pace, this book provides in-depth coverage of the essential Maths topics for school children aged 9-11. With a simple attractive layout, the books provide a comprehensive examination of each topic and a wealth of exercises to test the reader's understanding. The bestselling Succeed In series has already sold over 350,000 copies. Titles in this series: Succeed In ... English 7-9, Maths 7-9, English 9-11, Maths 9-11, English 11-14, Maths 11-14, Science 11-14, English 14-16 (GCSE), Maths 14-16 (GCSE)"}, {"id": "157565413X", "genre": "Children's Books", "title": "Tessa Tiger's Temper Tantrums (Animal Antics A to Z)", "description": "Tessa Tiger likes to play sportsbut NOT when she loses. She stomps and storms until her friends dont want to play with her anymore. Can Tessa change her attitude and make T-ball fun againfor everyone?"}]