[{"id": "1683489748", "genre": "Children's Books", "title": "The Adventures of Bessie Bunny", "description": "Extra, extra read all about it in the Bunnsville Buzz:  What happens when life presents you with a challenge at birth? How do you and those around you cope? How does it make you feel when you know you are different? Bessie Bunny was born different physically than other bunnies. Will this affect her life? How does she cope with the challenges that life presents? Read on to see what life has in store for Bessie, or should I say what Bessie has in store for life? "}, {"id": "0316109525", "genre": "Children's Books", "title": "Behind the Desk with... Matt Christopher: The #1 Sportswriter for Kids", "description": "In 1954, Matt Christopher wrote and published The Lucky Baseball Bat and has since published more than one hundred twenty novels, making him the most prolific and bestselling sportswriter for children ever. With over 6 million copies sold, Matt's books have a permanent place in the hearts of young sports fans. Throughout 2004, we celebrate 50 years with Matt Christopher's own commemorative biography written by his son, Dale, in the tradition of the Matt Christopher Biography Bookshelf, with exclusive photos, original letters, and memorabilia."}, {"id": "0060000090", "genre": "Children's Books", "title": "Goldie and the Three Bears", "description": "In this spirited new version of \"Goldilocks,\" we meet a determined heroine with a mind of her own. Goldie knows exactly what she likes -- and what she doesn't. Can she help it if everyone she invites over is too bossy or too boring or too snobby or too rough? What she desperately wants is a friend who is just right -- someone she can love with all her heart. Then one day, Goldie gets off the bus at the wrong stop, walks to a nearby cottage to find help, and opens the door. . . Diane Stanley, author and illustrator of Rumpelstiltskin's Daughter, once again takes an old tale and gives it a fresh spin that is funny as well as perceptive. Readers will love accompanying Goldie on her up-to-date adventure and discovering the clever, heartwarming surprise at its end."}, {"id": "B0739Y45FF", "genre": "Children's Books", "title": "Easy-to-Read Facts of Religious Holidays Celebrated Around the World - Holiday Books for Children | Children's Holiday Books", "description": "The people of the world is divided, not only by locations, but also by religions. Different religions have different practices. In addition, different religions have various causes for celebration. In this picture book, we're going to tackle some of the most well-known religious holidays celebrated around the world. With this knowledge, your child will learn to accept and respect the other religions other people follow. Happy reading!"}, {"id": "0544880366", "genre": "Children's Books", "title": "Curious George Discovers Recycling (science storybook)", "description": "Curious George wants to help clean up the planet, and recycling seems like a good place to start—but where does he begin? Follow along with George as he learns about what recycling is, how it works, and what else he can do to reduce his monkey paw print. Readers will learn the difference between recycling and trash, what happens to the things we throw away, and other ways to help keep our planet clean. Based on Curious George, the Emmy Award-winning PBS TV show, this story also includes fun facts, real photos, experiments, activities, and more. Learning about science has never been so much fun!"}]