[{"id": "1416928154", "genre": "Children's Books", "title": "Howliday Inn (Bunnicula and Friends)", "description": "Not a great place to visit, and you wouldn't want to live there   The Monroes have gone on vacation, leaving Harold and Chester at Chateau Bow-Wow -- not exactly a four-star hotel. On the animals' very first night there, the silence is pierced by a peculiar wake-up call -- an unearthly howl that makes Chester observe that the place should be called Howliday Inn.   But the mysterious cries in the night (Chester is convinced there are werewolves afoot) are just the beginning of the frightening goings-on. Soon animals start disappearing, and there are whispers of murder. Is checkout time at Chateau Bow-Wow going to come earlier than Harold and Chester anticipated?"}, {"id": "1616550546", "genre": "Children's Books", "title": "Avatar: The Last Airbender: The Search, Part 1", "description": "For years, fans of Avatar: The Last Airbender and The Legend of Korra have burned with one question&mdash;what happened to Fire Lord Zuko's mother? Finding a clue at last, Zuko enlists the aid of Team Avatar&mdash;and the most unlikely ally of all&mdash;to help uncover the biggest secret of his life. * This is the perfect companion to The Legend of Korra! * The official continuation of Airbender from its creators!"}, {"id": "0547614322", "genre": "Children's Books", "title": "Johnny Tremain", "description": "Johnny Tremain, winner of the 1944 Newbery Medal, is one of the finest historical novels ever written for children. As compelling today as it was seventy years ago, to read this riveting novel is to live through the defining events leading up to the American Revolutionary War. Fourteen-year-old Johnny Tremain, an apprentice silversmith with a bright future ahead of him, injures his hand in a tragic accident, forcing him to look for other work. In his new job as a horse-boy, riding for the patriotic newspaper, The Boston Observer, and as a messenger for the Sons of Liberty, he encounters John Hancock, Samuel Adams, and Dr. Joseph Warren. Soon Johnny is involved in the pivotal events shaping the American Revolution from the Boston Tea Party to the first shots fired at Lexington. Powerful illustrations by American artist Michael McCurdy bring to life Esther Forbes's quintessential novel of the American Revolution."}, {"id": "1526300508", "genre": "Children's Books", "title": "Global Conflict (Children in Our World)", "description": "The Children in Our World picture book series helps children make sense of the larger issues and crises that dominate the news in a sensitive and appropriate manner. With relatable comparisons, carefully researched text and striking illustrations, children can begin to understand what war and conflict are, how they affect people and how readers can help those who are affected. Where issues aren't appropriate to describe in words, Hanane Kai's striking and sensitive illustrations help children visualise what war and conflict are, in images that are suited to their age and disposition. The series forms an excellent cross-curricular resource that looks at refugees, war, poverty and racism making them ideal for tying into Refugee Week and dicussions about current affairs."}, {"id": "0713673192", "genre": "Children's Books", "title": "Developing Numeracy: Maths Skills - Year 3 (Developings)", "description": "A CD-Rom for each primary year group from R-6 offering 20+ on-screen numeracy activities that strongly support the content of the Developing Numeracy resource books and focus on areas where students need practice and reinforcement. The CDs include activities across all the strands of the numeracy strategy for each year group plus FREE downloadable worksheets from the Developing Numeracy resource books. Accompanying booklet offers teaching ideas to support use of the CD."}]