[{"id": "0606403124", "genre": "Children's Books", "title": "Terrors Of The Forest (Turtleback School & Library Binding Edition) (The Mystery of Entity303: a Gameknight999 Adventure)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Gameknight999 reenters a dangerous Minecraft environment where Entity303 has kidnapped Weaver, but when he tries to save Weaver, he falls into the strange Twilight Forest mod."}, {"id": "1491481307", "genre": "Children's Books", "title": "Medieval Knight Science: Armor, Weapons, and Siege Warfare (Warrior Science)", "description": "Medieval knights were like armored tanks in combat. They often made quick work of their enemies. They may not have realized it, but they owed their success to science. Engaging text, fascinating photos, and useful illustrations will help young readers understand how science helped medieval knights be victorious in battle."}, {"id": "0786801786", "genre": "Children's Books", "title": "Duke Ellington: The Piano Prince and His Orchestra (Caldecott Honor Book)", "description": "A brief recounting of the career of this jazz musician and composer who, along with his orchestra, created music that was beyond category"}, {"id": "0142406643", "genre": "Children's Books", "title": "20,000 Leagues Under the Sea", "description": "This special edition contains edits specifically aimed at assisting readers in understanding the classic text, preparing students for examinations, or providing lesson plans for teachers. This book is ideal for readers in high school, college, or otherwise seeking an easier understanding of a classic text. Original additions may include notes, lessons, and activities designed to foster understanding at key points in the story and at critical chapters. As an educator, I believe that older works of literature must be introduced into new generations. This belief has guided my editing of the original source material. Enjoy this classic piece of literature with an appreciation fostered by greater understanding and insight!"}, {"id": "1570916101", "genre": "Children's Books", "title": "Ox, House, Stick: The History of Our Alphabet", "description": "Bold collage illustrations and clear prose trace the origins of our familiar letters. From the proto-Sinaitic peoples, through the Phoenicians, Greeks and Romans, this book follows the development of the Roman alphabet.Includes sidebar information on punctuation, writing materials, the technology of printing, and more."}]