[{"id": "1543509452", "genre": "Children's Books", "title": "How to Make a Mystery Smell Balloon: A 4D Book (Hands-On Science Fun)", "description": "Do you love playing tricks on your friends? This book shows you how to bewilder your friends with a mystery smelly balloon! Using simple materials and easy step-by-step instructions, young readers can explore the science behind this fun project."}, {"id": "1424043956", "genre": "Children's Books", "title": "Alaskan Ice Climbing: Footprint Reading Library 1 (Footprint Reading Library: Level 1)", "description": "Many people visit Alaska to see the beautiful national parks. One group of visitors wants to fly into a national park and go skiing. However, the weather turns bad. Will the visitors be able to get to the park? What will they do there?"}, {"id": "1854303481", "genre": "Children's Books", "title": "Owl Babies (Vietnamese Edition)", "description": "A story in which three baby owls wake up one night in their hole in a tree to find that their mother has gone. Darkness gathers and the owls grow anxious, until at last she returns and they bounce up and down with joy. Illustrated by Patrick Benson in full colour."}, {"id": "1465473580", "genre": "Children's Books", "title": "Human Body: A Visual Encyclopedia", "description": "Next in the bestselling tradition of Animals: A Visual Encyclopedia and the first substantial human body encyclopedia aimed at young children, Human Body: A Visual Encyclopedia entertains and excites, while putting key biological information at young readers' fingertips. Employing a dynamic visual approach, this children's encyclopedia explains how the body works through pictures, making the subject matter accessible and intuitive to readers of all ages. The accompanying text is simple, lively, and packed with amazing facts and surprising stories that appeal to curious minds. Specially-commissioned 3-D imagery of the body systems and organs will delight every budding scientist and doctor! Supports the Common Core State Standards."}, {"id": "B00J417FYU", "genre": "Children's Books", "title": "Smile", "description": "Raina Telgemeier's #1 New York Times bestselling, Eisner Award-winning graphic memoir based on her childhood!Raina just wants to be a normal sixth grader. But one night after Girl Scouts she trips and falls, severely injuring her two front teeth. What follows is a long and frustrating journey with on-again, off-again braces, surgery, embarrassing headgear, and even a retainer with fake teeth attached. And on top of all that, there's still more to deal with: a major earthquake, boy confusion, and friends who turn out to be not so friendly."}]