[{"id": "0525578676", "genre": "Children's Books", "title": "The Littlest Family's Big Day", "description": "From the New York Times bestselling author of The Wonderful Things You Will Be, meet Emily Winfield Martin's little forest family and the adventures they have on one very big day.Who is only under 5 inches tall and has just moved to the woods? The cutest and littlest bear family you have ever seen--and their adopted teeny tiny fox tot! What happens when they venture out to explore their new world...? With an easy-to-read story and the careful brushstrokes of Emily Winfield Martin's illustrations, The Littlest Family's Big Day captures the mystery and magic of the woods. Inspired by classic children’s books such as The Littlest Fur Family and Dream Animals, this is a radiant treasure to be cherished for generations. "}, {"id": "1684051886", "genre": "Children's Books", "title": "Violette Around the World, Vol. 1: My Head In the Clouds!", "description": "A 12-year-old girl travels the globe with her parents' circus, having adventures and learning to appreciate the joys of being different.\"My name is Violette Vermeer: Dutch father, French mother...citizen of the world! My house has a thousand rooms...one for every place we've passed through!\"Her name is Violette, like the flower in the spring, like the seventh color of the rainbow. She lives with the Circus of the Moon, where her mother is the stuntwoman and her father is the insect tamer. At the end of the 19th-century, Violette is a curious, happy 12-year-old who is fascinated by the beauty of the world around her: music, painting, drawing, nature, and much more. She shares adventures with her friend Samir (a budding trapeze artist), her unusual animal friends, and her father's trained insects!This, the first of three books, takes place in Paris, where Violette has to balance her time between the freedom of the circus and her homework at school. But Paris is the city of beauty and art, and soon she will make an encounter with a very special person!"}, {"id": "B074LSGDBY", "genre": "Children's Books", "title": "The Length of a String", "description": "Imani is adopted, and she's ready to search for her birth parents. But when she discovers the diary her Jewish great-grandmother wrote chronicling her escape from Holocaust-era Europe, Imani begins to see family in a new way.Imani knows exactly what she wants as her big bat mitzvah gift: to find her birth parents. She loves her family and her Jewish community in Baltimore, but she has always wondered where she came from, especially since she's black and almost everyone she knows is white. Then her mom's grandmother--Imani's great-grandma Anna--passes away, and Imani discovers an old journal among her books. It's Anna's diary from 1941, the year she was twelve and fled Nazi-occupied Luxembourg alone, sent by her parents to seek refuge in Brooklyn, New York. Anna's diary records her journey to America and her new life with an adoptive family of her own. And as Imani reads the diary, she begins to see her family, and her place in it, in a whole new way."}, {"id": "1629146544", "genre": "Children's Books", "title": "My First Book of Knots: A Beginner's Picture Guide (180 color illustrations)", "description": "Highest-rated knot tying book under $10 on Amazon. * My First Book of Knots is a landmark gift that will impact children (and craft-loving adults) with hours of fun and a lifetime of skills. Create memories and embark on the journey of knot tying together. This charming picture guidebook of knots will teach your child, grandchild, godchild, and perhaps even yourself in the valuable art of knot tying.* My First Book of Knots simplifies the craft and brings the reader into the world of knots through beautiful, detailed illustrations. Learn how to secure knots for use in outdoor activities such as fishing, camping, ranching, farming, and many more. You will learn how Santa Claus ties up his sack of presents, or how to tie a knot that will help you lift heavy objects. Each knot is illustrated step-by-step, with clear, engaging instructions. Wow your friends with a double figure eight bend, or save the day with a square knot. My First Book of Knots teaches a lifetime of useful skills. "}, {"id": "148183519X", "genre": "Children's Books", "title": "Alex and the Lava Pit: The Amazing Adventures of Alex the Crocodile (Volume 1)", "description": "Alex is the main character in the Amazing Adventures of Alex the Crocodile Children's book series. He lives in Crocodile Cove and wears a letter A because his name is Alex. He is very adventurous, and can only do good. He has a love for life, and always seeks out new adventures. Alex also loves to learn new things. He is not afraid of anything. He has a brother named Derek, and many friends that live near him in Crocodile Cove. In this adventure, Alex, Derek, and their friend Peaches go on an adventure to a Lava Pit. This is the first book in the series, with a new book available monthly."}]