[{"id": "1403458022", "genre": "Children's Books", "title": "0: Brazil (We’re From . . .)", "description": "To learn more about Brazil we meet three children who live there. Brazil is a country in the continent of South America. Brazil is the largest country in South America."}, {"id": "0822587629", "genre": "Children's Books", "title": "Hanukkah Around the World", "description": "Take a trip to Italy, Uzbekistan, Tunisia, and beyond to see how Hanukkah is celebrated around the world. Join the torch relay in Modi'in, Israel; the Ladino concert in Istanbul, Turkey; and the candle lighting on the beach in Sydney, Australia. Try the delicious and unusual recipes for fried burmelos, latkes, and precipizi that recall the miracle of the little jug of oil in the Hanukkah story."}, {"id": "0823418316", "genre": "Children's Books", "title": "The Cat With the Yellow Star: Coming of Age in Terezin", "description": "The author recounts her experiences in the Terezin concentration camp with the other Jews, detailing how, despite sickness, terror, and loss, the adults tried to make the children's lives more bearable, and she managed to forge lifelong friendships that sustained her through hard times."}, {"id": "1457186950", "genre": "Children's Books", "title": "JavaScript Robotics: Building NodeBots with Johnny-Five, Raspberry Pi, Arduino, and BeagleBone (Make)", "description": "JavaScript Robotics is on the rise. Rick Waldron, the lead author of this book and creator of the Johnny-Five platform, is at the forefront of this movement. Johnny-Five is an open source JavaScript Arduino programming framework for robotics. This book brings together fifteen innovative programmers, each creating a unique Johnny-Five robot step-by-step, and offering tips and tricks along the way. Experience with JavaScript is a prerequisite."}, {"id": "B00GPDYLCE", "genre": "Children's Books", "title": "You Are Here", "description": "More Than Words:Bestselling authors and real-life heroinesEvery year, Harlequin's More Than Words award is given to three real-life heroines, women whose courage and vision have helped change people's lives for the better. Once again, three bestselling Harlequin authors have written stories inspired by these remarkable women.In You Are Here, sixteen-year-old Jennifer Whitman wishes she could just disappear. After her father's death, her family lost everything, including their home and comfortable way of life. With the help of a local charity, they've relocated to downtown Phoenix. But Jenn has unfinished business back in Paradise Valley.Sixty-six days ago, Jenn fell in love with seventeen-year-old cowboy William Finnigan…and then he shattered her heart. She's been avoiding him ever since. But if Jenn wants to reclaim her beloved horse, she'll have to stop running. Jenn needs to face Finn one last time so she can put her past behind her and truly start over.Look for all three ebooks inspired by real-life heroines: Red at Night by Katie McGarry, You Are Here by Liz Fichera and The Gift of a Good Start by Earl Sewell. "}]