[{"id": "1591881641", "genre": "Children's Books", "title": "The Case of the Three Rings (Hank the Cowdog)", "description": "It's New Years Eve day on the ranch, and Slim and Miss Viola are both having second thoughts about their engagement – only for very different reasons. Viola returns the lock-washer ring Slim had given her a week before, but before Slim can fix things with Viola, Uncle Johnny asks for his help with a “little job.” Like all of Uncle Johnny's “little jobs,” this one ends up being a lot more than Slim signed-up for and the day's events put him in a race against the clock. Will he make it to dinner at Viola's house in time to straighten things out, or will Hank and Drover live the rest of their doggy lives without ever seeing Miss Viola again?"}, {"id": "0756614732", "genre": "Children's Books", "title": "It's My Life: Digital Photography Kit and Book", "description": "From knowing how the camera works and choosing what to photograph to having fun manipulating images on computer, this no-nonsense kit explains the main principles and techniques of photography, and shows children how to get the most out of their digital camera."}, {"id": "B00ANYEEE6", "genre": "Children's Books", "title": "Olympic Swimming and Diving: Swimming And Diving (Great Moments in Olympic History)", "description": "A history of swimming and diving as Olympic events includes short biographies of the stars of the sports, including Johnny Weissmuller, Greg Louganis, and Mark Phelps."}, {"id": "0316352241", "genre": "Children's Books", "title": "Toot & Puddle: Let It Snow", "description": "Coming to paperback with a brand new cover just in time for the holidays, this Toot and Puddle story evokes the warmth of friendship and the coziness of the season.How do you find the best Christmas present ever for your best friend in the whole wide world? That's what Toot is trying to find out, and Puddle is having just as much trouble. With a nod to previous books in the bestselling Toot & Puddle series, Holly Hobbie shows readers that the best kind of present for the best kind of friend is one that shows just how much you care."}, {"id": "B01F325HYI", "genre": "Children's Books", "title": "Go Baby! Beat Army!: An Army-Navy Game Baby Book", "description": "Teach your children early about the joy of beating Army. Even if they can't read, they can shout Go Navy, Beat Army!The Army-Navy rivalry is one of the nation's most famous and long lasting college rivalries. This rivalry goes beyond the football field and is embraced by each school's student body. Reading books with little ones is an time for connection and shared experience. Let Go Baby, Beat Army! be the beginning of a new Army-Navy tradition!"}]