[{"id": "B01AIEWJRO", "genre": "Science Fiction & Fantasy", "title": "[guiDe] The 5th Wave: by Rick Yancey", "description": "The 5th Wave: by Rick Yancey | Summary & Analysis Rick Yancey gives a fresh twist to the idea of an alien apocalypse in his Young Adult science-fiction bestseller. Alien enthusiasts expecting to find creatures with three eyes or slimy tentacles may be disappointed, or perhaps, they may feel refreshed by Yancey’s choice to place the alien consciousness within a human host. Although it rids the novel of a definitive extraterrestrial creepiness, putting the aliens in human form to roam the Earth undetected presents a series of significant dilemmas for the survivors of humanity. It is a unique change of pace that allows for an unusual dynamic in the typical alien-human relationshipCassie Sullivan is busy leading the typical life of the American teenager when an alien invasion turns her world upside down. The Others, as they are called, have come to the Earth for reasons unknown to anyone. Their mothership becomes a permanent fixture in the sky as humans speculate to their purpose. Days of silence pass and just when everyone begins to let their guard down, the waves of destruction begin crashing. This Analysis fills the gap, making you understand more while enhancing your reading experience."}, {"id": "B01N5BOVP6", "genre": "Science Fiction & Fantasy", "title": "Gangsters In Time III: Veni, Vidi, Vici (A Leo and Capone book, #3)", "description": "Thrilling action, constant adventures, unexpected twists, accompanied by inspiring and explosive humor, are just a fraction of the things that you will encounter while reading this book. Double the action and triple the excitement is something you could expect at any point.     Two men, with one desire, in a city you must figure out to survive, they sold a new drug, and the government wanted in… All for the wrong reasons… You know, reasons that might cost millions of lives.Both emigrants, both smart and funny, Leo and Capone are an awesome duo, capable of almost everything… The first one with a mob background and chemistry education, the second with mad computer skills and mafia blood, all they wanted was to sell drugs, like everybody else. Unfortunately, their drug wasn’t like the rest. Their drug was the missing link. What follows might even change the course of history. An unexpected twist will change them forever…"}, {"id": "0786938498", "genre": "Science Fiction & Fantasy", "title": "Eberron Player Character Sheets: Eberron Campaign Accessory", "description": "Character sheets created especially for the Eberron Campaign Setting.Encased in a handy pocket folder featuring a beautiful piece of Eberron artwork, these character sheets contain all the information from the D&D® Deluxe Player Character Sheets, with modifications and additional material appropriate for game elements unique to the Eberron. setting. In addition to the standard D&D classes, a sheet is included for the new class introduced in Eberron. Each character folio isfour pages long and includes not only extensive for a character record, but space for roleplaying information and campaign progress as well. Spell sheets for spellcasters are also included.CHRISTOPHER PERKINS is the Design Manager for RPGs and miniaturesat Wizards of the Coast, Inc. He has contributed to numerous roleplayingproducts, includeing d20 Future™ and Monster Manual™ III."}, {"id": "B077YBTW7F", "genre": "Science Fiction & Fantasy", "title": "Hinterland Series Book 1: The Wolf's Bounty", "description": "**Cliffhanger**. Not a Standalone. Book 1 of 4 in the Hinterland Series. Free Bonus Book offer Raleigh Douglas always considered herself just another farm girl from the country. She gets the shock of her life when she wins a prestigious position apprenticed to the greatest slayer/hunter in the country. The famous Knox Bishop isn’t glad to see her, though. He wasn’t expecting a woman, and he doesn’t think she can survive the week working for him. These two alpha personalities butt heads from their very first meeting, and Bishop won’t believe Raleigh can hunt with the best of them.  Raleigh sets out to prove him and everybody else wrong, but danger and mystery lurk around every corner. Before she knows it, Raleigh finds herself swept into an unknown world of power and danger. A mystical world of fantastic possibilities lies beyond the veil of her humdrum past. Unknown forces pull hidden strings behind the scenes to thwart her every move. Can she and Bishop find a way to work together before evil swallows Hinterland in darkness?  Contains violence, action, and steamy scenes. 18+  Read the Hinterland Series in order! :)   >Book 1: The Wolf's Bounty Book 2: The Wolf's Quarry (Coming Soon!)Book 3: The Wolf's Hunt (Coming Soon!)Book 4: The Wolf's Prize (Coming Soon!)"}, {"id": "156882050X", "genre": "Science Fiction & Fantasy", "title": "Lordly Domains (Pendragon Role Playing Game Series)", "description": "A complete revision of the old Nobles Book from 1st edition Pendragon. LORDLY DOMAINS details the privileges the nobility can expect and the obligations demanded of them. Included are special rules for castle construction, life of the noble class, and how they are supposed to act. Also included is an expanded economic table."}]