[{"id": "B00OE6KHE0", "genre": "Children's Books", "title": "A Lizard's Tail", "description": "From the moment he hatches, Marvin P. Tinkleberry knows he is destined for greatness. For one, he has a marvelous, well-groomed tail. For another he can puff out his throat pouch in the most spectacular way. Maybe the other lizards in his colony don’t take him seriously, but he knows the truth. It lives in the marrow of his bones; he’s going to be a hero.When a feral cat threatens the lives of all who live at Stone Wall in the Garden by the Sea, Marvin knows it’s HIS destiny to get rid of the fearsome beast. Travelling Over the Hill to find help should be as easy as snapping up a sleeping moth. But it doesn’t take long for Marvin to see that the world beyond Stone Wall is not the same as his pampered life back at the garden. From the deadly Sucker Cactus Forest to beastly mongooses, danger lurks around every corner and Marvin will have to decide if he’s willing to be the hero he’s long bragged about being."}, {"id": "0486489345", "genre": "Children's Books", "title": "Little Dioramas--Farm (Dover Little Activity Books)", "description": "With a moo-moo here and an oink-oink there, you can put together your own 3-D farm! First, assemble the colorful background scene of a pasture on the book's inside covers by cutting along the lines, folding, and attaching with glue or tape. Then, populate the farm with 10 punch-out figures — including a farmer, pigs, a lamb, and other animals — that can be rearranged until the cows come home!"}, {"id": "0756621070", "genre": "Children's Books", "title": "A First Book of Fairy Tales", "description": "In this beautifully illustrated book, 14 classic fairy tales are retold for young children. Old favorites, such as \"Cinderella\" and \"Jack and the Beanstalk,\" are presented alongside some lesser known stories, such as \"The Fisherman and his Wife\" and \"Diamonds and Toads.\" Mary Hoffman's charming retellings use simple, lyrical language ideal for reading aloud, while Julie Downing's illustrations bring the characters to life. The stories in this collection show the consequences of greed, pride, and vanity, but also tell of the love that grows from a kind heart and a cheerful nature. And along the way, there is a wealth of magic and fun to be enjoyed."}, {"id": "B00812DH04", "genre": "Children's Books", "title": "Our wonderful world", "description": "God created all kinds of animals and birds. Then he created man who was to be the keeper of the earth. The animals and birds protested so what did God say? Find out in Our Wonderful World."}, {"id": "0823422143", "genre": "Children's Books", "title": "El dia de los muertos / The Day of the Dead", "description": "Follow two children as they celebrate their ancestors on this vibrant holiday. They offer marigolds, sugar skulls, and special bread, and make delicious foods. By spreading marigold petals, they guide the dead home to join the festivities. Finally, after singing and dancing, it's time for bed. Bob Barner's luscious collages incorporate the traditional symbols of Day of the Dead. His poetic text is both English and Spanish. An author's note provides additional information on the holiday."}]