[{"id": "B00Z7C15ZK", "genre": "Children's Books", "title": "Under the Dragon's Spell", "description": "The dragon riders discover a new island—and a new, mysterious dragon—in this story based on a popular episode of DreamWorks Dragons: Race to the Edge!When Hiccup and the other Dragon Riders go exploring using a new map, their dragons pull them toward an island with entrancing music. It’s getting late, so they decide to land and get some sleep. But when they wake up in the morning, their dragons are gone! Will Hiccup and his friends be able to figure out who is making the music—and how to break the spell—before Toothless and the other dragons are lost forever? DreamWorks Dragons © 2016 DreamWorks Animation LLC. All Rights Reserved."}, {"id": "1442474955", "genre": "Children's Books", "title": "Rudolph the Red-Nosed Reindeer", "description": "The original story of Rudolph the Red-Nosed Reindeer—written in verse by his creator, Robert L. May—now with charming new illustrations!Every year at Christmastime, everyone—young and old alike—has one catchy, joy-inspiring song stuck in their heads: “Rudolph the Red-Nosed Reindeer!” Now fans of the most famous reindeer of all-time can fall in love with the original story, written by Robert L. May in 1939. Rudolph, a youthful reindeer buck who possesses an unusual luminous red nose, is harassed mercilessly and excluded by his peers because of this trait. One particularly stormy Christmas Eve, Rudolph manages to prove himself after Santa Claus catches sight of his nose and asks him to lead his sleigh for the evening. Rudolph agrees, saving Christmas, and is finally treated the way he deserves by his fellow reindeer!"}, {"id": "1592986846", "genre": "Children's Books", "title": "Tide Day", "description": "Bubbly, silly, and a little bit stubborn, this mermaid named Pearl shirks her chores and gets her fins into trouble on Tide Day! When the rip tide drifts too close to the school, it's jellyfish chores for little Pearl! But she would much rather go on an adventure--wouldn't you?"}, {"id": "1526301105", "genre": "Children's Books", "title": "Generation Code: I'm a JavaScript Games Maker: Advanced Coding", "description": "Once you learn to code using JavaScript, the world of gaming opens up. If you already know a bit about JavaScript, it's time to pick up the pace! In this book, learn how to build mind-bending games, that you'll want to play for hours and will amaze your friends. Along the way, learn about core coding and gaming concepts like variables, random numbers, key presses and arrays.The Generation Code series is a hands-on guide to computer coding, designed to train you in the coding languages used by real-world computer programmers. You'll discover how to code exciting programs, web pages, apps and games, and learn how the tools and functions you're using can be applied to other situations.Other books in the Generation Code series:I'm an Advanced Scratch CoderI'm a Python ProgrammerI'm an HTML Web Page BuilderI'm an App DeveloperI'm a JavaScript Games Maker: The Basics"}, {"id": "067942072X", "genre": "Children's Books", "title": "Illustrated Woody Allen Reader", "description": "Selections from published and never-before-published works are collected in a work that features film excerpts, one-liners, essays, stand-up routines, Allen's classic New Yorker pieces, screenplays, film outtakes, magazine articles, and interviews. 40,000 first printing. $50,000 ad/promo."}]