[{"id": "0951696041", "genre": "Children's Books", "title": "Alice from Tooting: 1879-1977 Working Class Autobiography (Ordinary Lives)", "description": "Few working class women of Alice's generation wrote their autobiography, which includes harsh times in domestic service, gaining her ambition to become a nurse, marrying a widower and becoming a mother and step-mother and, eventually in old age living with her daughter Bertha in Chard. As well as general readers, this book is sought for first-hand information about housing conditions, female employment and social circumstances during Alice's lifetime."}, {"id": "0996211217", "genre": "Children's Books", "title": "Paper Moon", "description": "Paper Moon is round, old and … sleepy. Against a prismatic palette of intriguing textures, Paper Moon slips away to dream his own dreams. Children and adults alike will enjoy the soothing visuals and musical verse of this charming bedtime story."}, {"id": "1459412842", "genre": "Children's Books", "title": "Sliding Home (Lorimer Sports Stories)", "description": "Miguel hasn't missed his native El Salvador since arriving in Canada with his mother and sister. But with his father still in El Salvador running their bakery, and gangs shaking down the old neighbourhood, life still isn't easy for Miguel. Holding down multiple jobs leaves him with little time for his beloved game of baseball — while happy-go-lucky Sebastian, Miguel's teammate on the Blues of Toronto's Christie Pits Park, spends his free time becoming a faster and better player.When his father's situation becomes critical, Miguel becomes desperate to bring him to Canada. But he can't even afford to join the Blues on a road game — how can his family possibly pay his father's way? A solution comes from Sebastian, who proposes a big baseball fundraiser. As the Blues learn about the hard realities some new Canadian kids face, Miguel and his family learn to trust their neighbours and teammates."}, {"id": "1458739406", "genre": "Children's Books", "title": "Captain Starlight: Australian bushrangers", "description": "The fifth book in the series features the two men known as ''''Captain Starlight''''. Both were bushrangers who travelled widely across the country in the second half of the 19th Century, and although their backgrounds and their crimes differed greatly, they are linked by their connection with a character from a novel. Frank Pearson was the first ''''Starlight who burst onto the scene in 1868, when he abandoned his practice as a doctor, stole a horse and took off on a bushranging spree that ended in a shoot out and the death of a policeman. Pearson was a very talented man: intelligent, well educated and well read, and a clever artist and composer. He was also a pathological liar with no moral compass whatsoever. He had so many aliases that we dont even know what his real name was. The other was Henry Readford, whose stunning theft of 1000 cattle was the inspiration for the fictional character ''''Captain Starlight'''' in Rolf Boldrewoods novel Robbery Under Arms."}, {"id": "0142414972", "genre": "Children's Books", "title": "Roald Dahl Magical Gift Set (4 Books): Charlie and the Chocolate Factory, James and the Giant Peach, Fantastic Mr. Fox, Charlie and the Great Glass Elevator", "description": "Four of Roald Dahl's most beloved bestselling books are together in one box! Charlie and Willy Wonka, Mr. Fox, and even James and his giant peach are available in this beautifully packaged gift set. All of the books are charmingly illustrated by Quentin Blake. This Roald Dahl gift set is the perfect gift for longtime fans and newcomers alike! "}]