[{"id": "0062275607", "genre": "Children's Books", "title": "Pete the Cat and the New Guy", "description": "From the bestselling Pete the Cat series comes a story about friendship and acceptance.There's a new guy in town, and Pete can't wait to meet him. After all, more friends mean more fun. When Pete finally meets Gus, he realizes they're very different from each other...but that's what makes him cool. Gus is special in his own way, just like Pete and just like you, and there is something everyone can do!In this hardcover picture book, the message of acceptance shines through and is perfect for young readers learning to navigate the social waters. Fans of Pete the Cat will delight in the rhythmic storytelling and fun repetition throughout the book.The fun never stops—download the free groovin’ song!"}, {"id": "1524714135", "genre": "Children's Books", "title": "Jack and Jill and T-Ball Bill (Step into Reading)", "description": "Just in time for spring training! Don't take Big Dog Bill out to the ballgame! This hilarious Step 1 early reader is about a dog who loves T-ball! Well, he loves the ball.Jack and Jill bring Big Dog Bill to their T-ball game. Crack! The moment the ball is hit, Big Dog Bill can be counted on to steal it, and hilarity ensues as everyone tries to catch him. Once Jill spies a hot dog cart, a bright idea to save the daypops into her head. Just like Jack and Jill and Big Dog Bill, written and illustrated by Martha Weston, this fun phonics reader helps children with alliteration, rhyming, and word families. Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story."}, {"id": "0375855769", "genre": "Children's Books", "title": "Shampoodle (Step into Reading)", "description": "It's picture day at the dog park. But before the first photo can be taken, an exuberant pack of pups needs a bit of grooming. So they’re off to Shampoodle, the local pet salon, where the eager dogs simply cannot sit still. And when some curious cats stop by, things go from messy to mayhem. Shampoodle is perfect for animal lovers and children who are just starting to read on their own, taking their cues from lively art and bubbly, rhymed text.Step 2 Readers use basic vocabulary and short sentences to tell simple stories. For children who recognize familiar words and can sound out new words with help."}, {"id": "0375853316", "genre": "Children's Books", "title": "HEROES! DC SUPR FRND", "description": "An action-packed coloring book featuring Batman, Superman, and more!Batman, Superman, Green Lantern and all the other DC Super Friends are ready for action in this Hologramatic Sticker Book featuring 48 pages to color and more than 30 shiny stickers that is perfect for super hero fans 3 to 6 years old!"}, {"id": "0385470061", "genre": "Children's Books", "title": "Draw 50 Birds (Draw 50 Series)", "description": "Step-by-step examples show how to draw cardinals, herons, owls, robins, flamingos, mallards, penguins, hummingbirds, puffins, woodpeckers, loons, peacocks, and swans"}]