[{"id": "1423113373", "genre": "Children's Books", "title": "Amelia Earhart: This Broad Ocean", "description": "Amelia Earhart developed a love of flying at a very young age. As she followed her dream and built a name in the field of aviation—breaking numerous records along the way—she inspired other women to soar to new heights.With an introduction by astronaut pioneer Eileen Collins, Amelia Earhart: This Broad Ocean focuses on Amelia's triumphant crossing of the Atlantic Ocean in 1928. Panel by panel, it offers a glimpse of her relentless ambition and tireless will to promote women's rights. Above all, it leaves us with a sense of her deep-rooted desire to touch the sky."}, {"id": "1481465406", "genre": "Children's Books", "title": "Click, Clack, Moo: Cows That Type (A Click, Clack Book)", "description": "Now the inspiration for a new Christmas special, CLICK, CLACK, MOO: Christmas on the Farm. New York Times bestselling duo Doreen Cronin and Betsy Lewin’s Caldecott Honor–winning book is now available as a Level 2 Ready-to-Read!Farmer Brown has a problem. His cows like to type. All day long he hears: Click, clack, moo. Click, clack, moo. Click, clack, moo. But Farmer Brown’s problems REALLY begin when his cows start leaving him notes! Come join the fun as a bunch of literate cows turn Farmer Brown’s farm upside-down!"}, {"id": "B00BF2B3OO", "genre": "Children's Books", "title": "Flight to Freedom: One child's escape from the Vietnam war.", "description": "In April, 1975 as the Vietnam War was escalating, a brave woman, Betty Tisdale, with many government and other connections, sent a plane to rescue the children of An Loc Orphanage in Saigon.It arrived in the dead of night to whisk the children and caregivers away to the United States.This is the story of one of those children and his arrival to his 'forever' family."}, {"id": "B00RZUYZBI", "genre": "Children's Books", "title": "The Fox and the Grapes Rena la ak Rezen yo : Children's Picture Book English-Haitian Creole (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week.Rena a se grangou ak je kèk rezen bon gou. Rena a ap ankò e ankò yo ka resevwa rezen yo nan sa avèsyon pwolonje nan rena a ak rezen yo ak rena a fè bagay sa yo enteresaneseye epi pou yo jwenn rezen yo. Anseye jou nan semèn nan."}, {"id": "B00LPOA35C", "genre": "Children's Books", "title": "Twenty-Four Marc Chagall's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Marc Chagall's Paintings. Twenty-Four Marc Chagall's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}]