[{"id": "0812626591", "genre": "Children's Books", "title": "911: The Book of Help", "description": "In 911: The Book of Help, award-winning writer share their responses to the September 11, 2001 tragedy and describe the heroism of those who first rushed to help. The works in 911 are donated, and 50 percent of the net proceeds will go to a charity assisting children and spouses of victims."}, {"id": "1684360056", "genre": "Children's Books", "title": "Too Many Carrots (Capstone Young Readers)", "description": "Rabbit loves carrots. Maybe a little too much. In fact, his carrots are crowding him out of his cozy burrow. When his friends offer to help, Rabbit happily accepts. But will too many carrots cause too much trouble for Rabbit and his caring friends? The board book edition of this bestseller is the perfect size for little hands."}, {"id": "1598697889", "genre": "Children's Books", "title": "The Everything Kids' Hanukkah Puzzle & Activity Book: Games, crafts, trivia, songs, and traditions to celebrate the festival of lights!", "description": "Kids love holidays, especially Hanukkah, which is celebrated for eight dazzling nights. From the lighting of the menorah to the blessings and all the tradition in between, kids are mesmerized by the magic of this celebration. With this book, kids will enjoy more than 100 puzzles and activities about: the history of Hanukkah from its roots more than 2,000 years ago; the meaning behind the various rituals, traditions, and prayers; why certain foods are eaten during Hanukkah; Hanukkah crafts, decorations, and gifts they can make; and more! Kids will enjoy watching this fun-filled puzzle and activity book unfold, as each chapter opens with one more candle lit on the menorah. With this book by their side, kids are sure to become dreidle-spinning masters in no time!"}, {"id": "0966884574", "genre": "Children's Books", "title": "Pelican Pete's Backyard Adventures: Nature Discoveries and Outdoor Fun. Book 1", "description": "Pelican Pete's Backyard Adventures: Nature Discoveries and Outdoor Fun is a nonfiction children's book written by Frances Keiser that inspires children to get outdoors, explore, and play. Filled with fun facts about nature, observations to make, activities to do, and games to play, all designed to help children connect with nature. In full color with illustrations by Hugh Keiser. For children through middle school. Nature journal pages and teaching standards are also included. Additional journal pages are available free at the PelicanPete website."}, {"id": "B01GSJCFW2", "genre": "Children's Books", "title": "Mystery of the Missing Fox (Cooper & Packrat Book 3)", "description": "The stakes have never been higher for Cooper Wilder. When an accident puts Cooper’s dad in the hospital, Cooper must shoulder new responsibilities at the campground. But he’s distracted. First, he finds a fox caught in an illegal trap on the campground’s land. Then kits start to go missing from the fox den. Who would want to steal the foxes? And why? Cooper joins forces with his friends, Packrat and Roy, to solve the mystery. The three young detectives must protect the den, find the kits, and (hopefully) rule out Summer, the new girl who lives across the lake, as a suspect. Juggling new work duties, feeling guilty about his father’s accident, and desperate to help the fox kits, Cooper faces tough decisions about who—and what—should come first."}]