[{"id": "1419707884", "genre": "Children's Books", "title": "13 Hangmen", "description": "Some people won’t believe any of this story. You might be one of them. But every single word is true. Tony DiMarco does catch a murderer, solve a mystery, and find a treasure—all in the first few days he moves, unexpectedly, to 13 Hangman’s Court in Boston. The fact that he also turns thirteen at the same time is not a coincidence. So begins the story of Tony and his friends—five thirteen-year-old boys, all living in the same house in the same attic bedroom, but at different times in history! None are ghosts, all are flesh and blood, and somehow all have come together in the attic room, visible only to one another. And all are somehow linked to a murder, a mystery, and a treasure."}, {"id": "1547088613", "genre": "Children's Books", "title": "Happy 19th Birthday: Birthday Memory Book, Birthday Journal Notebook For 19 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0763658928", "genre": "Children's Books", "title": "1-2: When I Was Your Age: Volumes I and II: Original Stories About Growing Up", "description": "\"Memoirs of adolescence by renowned YA authors. . . . Readers can journey to places where the seeds of imagination and keen powers of observation are planted.\" — Publishers Weekly (starred review)\"Tell me a story of when you were little\" is something children love to ask. Twenty award-winning authors respond in these two extraordinary volumes, now combined in one book. The writers of these stories make it clear that despite the difference between one childhood and another, all children share a complex humanity and a deep capacity for joy."}, {"id": "1580372155", "genre": "Children's Books", "title": "America in the 1960s & 1970s, Grades 4 - 7 (American History Series)", "description": "Provide challenging activities that enable students to explore history, geography, and social studies topics. Activities include word searches, fact or opinion, creative writing, and more. Answer keys, time lines, and suggested reading lists are included."}, {"id": "1429080922", "genre": "Children's Books", "title": "Winter Sports (American Antiquarian Society)", "description": "Author Josephine Pollard's beautifully illustrated children's book about the winter activities of a town was originally published circa 1886 by McLoughlin Brothers of New York. In this rhyming story, children go sledding and skating, build snowmen and have snowball fights. Everything becomes a sport. Even the adults in their fancy sleighs, or delivering milk, or hauling wood enjoy the winter season."}]