[{"id": "1684101212", "genre": "Children's Books", "title": "Wind and Water Shape the Land (What Shapes Our Earth?)", "description": "Earth is a beautiful place! See some of its most amazing sights as you find out how Wind and Water Shape the Land. Sing along as you explore What Shapes Our Earth! This hardcover book comes with CD and online music access."}, {"id": "1783445912", "genre": "Children's Books", "title": "Jamal's Journey", "description": "Jamal is a little camel so he must walk, walk, walk through the desert. One day he becomes separated from his friend, the boy, but a wise falcon helps to reunite them. They go on to explore the city and its exciting sights and sounds. A modern tale of friendship and adventure from the twice Greenaway Award-winning author/illustrator, Michael Foreman."}, {"id": "B00AVO7UP8", "genre": "Children's Books", "title": "Lord Jim (Annotated Edition)", "description": "“Lord Jim” is a novel by Joseph Conrad (1857-1924). It was first published in 1900. The novel tells the story of Jim, a young British sailor and his adventures in the south seas. The ebook also contains “A Personal Record”, an autobiographical text written by Conrad in 1912."}, {"id": "0307745856", "genre": "Children's Books", "title": "The Rivalry: Mystery at the Army-Navy Game (The Sports Beat, 5)", "description": "New York Times bestselling sportswriter John Feinstein investigates a covert op at the Army-Navy football game in this exciting sports mystery.   The Black Knights of Army and the Midshipmen of Navy have met on the football field since 1890, and it’s a rivalry like no other, filled with tradition.   Teen sports reporters Stevie and Susan Carol have been busy at West Point and Annapolis, getting to know the players and coaches—and the Secret Service agents. Since the president will be attending the game, security will be tighter than tight. Weeks and months have been spent on training and planning and reporting to get them all to this moment. But when game day arrives, the refs aren’t the only ones crying foul. . . .   John Feinstein has been praised as “the best writer of sports books in America today” (The Boston Globe), and he proves it again in this fast-paced novel.From the Hardcover edition."}, {"id": "0746027850", "genre": "Children's Books", "title": "Amazing Facts (Hotshots Series)", "description": "Amazing Facts contains a range of incredible facts and figures, arranged into specific areas of interest . Subjects include amazing feats, animals, the human body, o uter space, planet Earth, sports and countries of the world. '"}]