[{"id": "1250122295", "genre": "Children's Books", "title": "Vivid: Poems & Notes About Color", "description": "Playful poems and facts celebrate the colors of the rainbow in this beautiful nonfiction picture book. Orange you sweet? Orange you plump and juicy? Orange you my favorite fruit?Hey - you’re a tangerine!B-lime-y.With information about the science of sight and perception, pigment origins in art and textiles, colloquial expressions and word associations, there's so much to see in each vivid spread―a wonderfully sensory read.- GODWIN BOOKS -"}, {"id": "1941082491", "genre": "Children's Books", "title": "Words for School: Level 1", "description": "This book teaches your child to read and write over 50 important vocabulary words in math, science, language arts, and social studies, using an engaging visual approach. If your child can recognize and write short words, this book will build on that foundation."}, {"id": "B06ZXXVWHW", "genre": "Children's Books", "title": "Latin Lessons", "description": "Vincentia had just returned from a summer at Bryn Mawr College where she was studying Latin to keep up with her boyfriend, Lyle, the class valedictorian. But when she lands herself at the train station the night she arrives home again Lyle isn’t there as promised to pick her up. He sends her messages on her cell phone about how she should mind the ablative case. It will do her in every time if she doesn’t watch it when she is translating Cicero. But at the same time he keeps telling her he is being mobbed by his father’s legal clients. They are massing on his office in downtown Tucson with complaints and dark looks. Lyle’s father is bogged down in court. Lyle cannot reach him. And somehow Vincentia can’t reach her boyfriend as the shadows deepen at the train station and everyone else leaves. She is left all alone waiting for Lyle. And when she finally sees his car and runs for it, it starts up. And it isn’t Lyle at all. It is some strange boy driving his car taking her somewhere other than home.Latin Lessons is brought to you by Edward Ware Thrillers YA, an imprint of Cheops Books, LLC. If you liked this young adult thriller by Dora Benley you will also like Dark 3 and Mary’s Gone. Look for new thrillers by Dora Benley coming soon."}, {"id": "0763680125", "genre": "Children's Books", "title": "Leroy Ninker Saddles Up: Tales from Deckawoo Drive, Volume One", "description": "Yippie-i-oh! Saddle up for the first in a spin-off series starring favorite characters from Kate DiCamillo's New York Times best-selling Mercy Watson books.Leroy Ninker has a hat, a lasso, and boots. What he doesn't have is a horse – until he meets Maybelline, that is, and then it's love at first sight. Maybelline loves spaghetti and sweet nothings, and she loves Leroy, too. But when Leroy forgets the third and final rule of caring for Maybelline, disaster ensues. Can Leroy wrestle fate to the ground, rescue the horse of his heart, and lasso loneliness for good? Join Leroy, Maybelline, and a cast of familiar characters – Stella, Frank, Mrs. Watson, and everyone's favorite porcine wonder, Mercy – for some hilarious and heartfelt horsing around on Deckawoo Drive."}, {"id": "1422220028", "genre": "Children's Books", "title": "Myths and Legends (100 Things You Should Know About)", "description": "Introduces myths and legends from various cultures that offer different views on the origins of the world, animals, human behavior, heroes, monsters, the end of the world, and other topics."}]