[{"id": "B00FTDK71K", "genre": "Children's Books", "title": "Discover Fireworks: Level 3 Reader (Discover Reading)", "description": "Discover Reading Early Reader   Ooh! Aaah!   People all over the world celebrate with fireworks.   From America's Independence day to Chinese New Year to New Year's Eve, fireworks always draw a crowd. Learn all about fireworks in this level three reader from author Calee M. Lee. Each page features 2-3 sentences and a full-color photo. Kids can power up their reading skills with pyrotechnics and parents and teachers can utilize the key word list and learning activities in the back of the book for further instruction. Get your kids reading this 4th of July with FIREWORKS.   Find More Great Options for Kindle Kids Books! Xist Publishing Children's Books  Choose from over 180 illustrated children's books!  "}, {"id": "0635023113", "genre": "Children's Books", "title": "North Carolina Indians (Hardcover)", "description": "One of the most popular misconceptions about American Indians is that they are all the same-one homogenous group of people who look alike, speak the same language, and share the same customs and history. Nothing could be further from the truth! This book gives kids an A-Z look at the Native Americans that shaped their state's history. From tribe to tribe, there are large differences in clothing, housing, life-styles, and cultural practices. Help kids explore Native American history by starting with the Native Americans that might have been in their very own backyard! Some of the activities include crossword puzzles, fill in the blanks, and decipher the code."}, {"id": "154547205X", "genre": "Children's Books", "title": "My Fishing Adventures: Fishing Journal for Kids", "description": "Kids Love Fishing! This 6x9 Fishing log, is perfect to tuck away in a tackle box to record fishing and camping memories. 100 pages alternating between lined and blank so you can draw pictures of the big fish that got away and write the details of the fun adventures you've shared with your fishing buddies. If your little fisherman loves fly fishing, salmon fishing, ocean fishing, lake fishing, kayak fishing, trout fishing or just tying string to a stick at the pond - this a great kids journal for them to log their memories on all their adventures! A great gift for the young fish lover in your life! Fishing Journals are great for all sorts of things: Holiday gift for grandchildren Christmas gift for kids Birthday gift for children of all ages Boredom buster for reminiscing on past fishing trips"}, {"id": "0449817814", "genre": "Children's Books", "title": "Good Night, Dora! (Dora the Explorer) (Pictureback(R))", "description": "Nickelodeon's Dora the Explorer says goodnight in this bedtime lift-the-flap storybook. With lift-the-flap surprises on every page, this interactive storybook will send girls ages 3–7 to sleep with smiles on their faces."}, {"id": "0590101765", "genre": "Children's Books", "title": "Going Solo", "description": "The fascinating story of Roald Dahl's life continues in Going Solo, a marvelous evocation of the author's wartime exploits. As a pilot in World War II, Roald Dahl had some wonderfully exciting -- and frighteningly near-death -- experiences including encounters with the enemy, battles with deadly snakes, and incredible dogfights. Told with the same irresistible appeal that has made Dahl one of the world's best-loved writers, Going Solo brings you directly into the action and into the mind of this brilliant man."}]