[{"id": "1681521512", "genre": "Children's Books", "title": "Birds Build Nests (Animal Builders)", "description": "A beehive looks neat from the outside, but have you ever wondered how those busy bees built it? From bird nests to beehives, this illustrated narrative nonfiction series explains how animals use their special skills to make a home that fits their needs. Range maps show where each animal lives and a hands-on activity in each book encourages kids to try the animals' building techniques for themselves. A robin, a bald eagle, a woodpecker, a cliff swallow, and a flamingo all build nests to keep their eggs safe in this illustrated narrative nonfiction book. Includes a range map and a \"Build Like a Bird\" hands-on activity, plus glossary and further resources."}, {"id": "0761921850", "genre": "Children's Books", "title": "Getting Ready for Court: Civil Court Edition: A Book For Children (Interpersonal Violence: The Practice Series)", "description": "A counterpart to the Getting Ready for Court: Criminal Court Edition workbook, this child-friendly book is a first step in helping prepare primary aged children to testify in civil cases involving abuse."}, {"id": "1534100504", "genre": "Children's Books", "title": "Permaculture (21st Century Skills Library: Global Citizens: Environmentalism)", "description": "Using the new C3 Framework for Social Studies Standards, these books explore environmentalism through the lenses of History, Geography, Civics, and Economics. In Permaculture, the text and photos look at the history, basic philosophies, and geography of this environmental issue. As they read, students will develop questions about the text, and use evidence from a variety of sources in order to form conclusions. Data-focused backmatter is included, as well as a bibliography, glossary, and index."}, {"id": "B00Z7C17EE", "genre": "Children's Books", "title": "I'll Catch You If You Fall", "description": "In the spirit of Someday and Guess How Much I Love You comes a lyrical and endearing picture book about the people in our lives who are always there to look out for us.Who will keep the boy safe? “I will,” said his mother. “I will hold him close... and never let him lean too far.” Big or small, near or far, we all need someone to watch over us. This touching picture book is a reassuring tale about a journey and the people who are with us as we travel through life. It is for anyone who has wondered, Who will keep me safe? and for anyone who has answered, I will."}, {"id": "1588454967", "genre": "Children's Books", "title": "Rhythm and Rhyme Nursery Rhymes", "description": "The Rhythm and Rhyme Book and CD Collection gives preschoolers the opportunity to learn by seeing, reading, singing, and doing!Filled with charming and colorful illustrations, this special book takes youngsters on delightful romp through nursery rhymes. The audio CD that is included features a medley of rhymes, a sing-along, interactive activities, and a lullaby. By exploring the book and CD together or separately, children will learn the nursery rhymes as well as important pre-reading skills, such as word recognition and rhyming sounds.These unique features make learning fun:•Audio CD can be used alone or with the book.•Soothing songs with delightful accompaniment.•Charming illustrations that reinforce learning.•Easy-to-follow directions that allow for independent learning and play.•Teaching guide with additional learning suggestions.Discover these other titles in the Rhythm and Rhyme Collection: Alphabet, Fairy Tales"}]