[{"id": "0613228774", "genre": "Children's Books", "title": "Is There Life In Outer Space? (Turtleback School & Library Binding Edition) (Let's-Read-And-Find-Out Science: Stage 1)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Discusses some of the ideas and misconceptions about life in outer space and speculates on the existence of such life in light of recent space explorations."}, {"id": "1887734465", "genre": "Children's Books", "title": "The Three Billy-Goats Gruff (Early Readers)", "description": "The classic tale of the three billy-goats and how they trick an evil troll into letting them cross the bridge to the beautiful meadow on the other side."}, {"id": "1416938419", "genre": "Children's Books", "title": "Dora Saves Mermaid Kingdom! (Dora the Explorer)", "description": "A mean octopus has dumped garbage all over Mermaid Kingdom! The only way to save the mermaids is to find the magic crown! Come along with everyone's favorite explorer, Dora, as she crosses the Seashell Bridge, goes through Pirate Island, and then goes to the Silly Sea. Will Dora be able to save her ocean friends?"}, {"id": "1628324570", "genre": "Children's Books", "title": "The NBA: A History of Hoops: New York Knicks", "description": "This high-interest title summarizes the history of the New York Knicks professional basketball team, highlighting memorable events and noteworthy players such as Willis Reed."}, {"id": "B005133JGS", "genre": "Children's Books", "title": "Middle School, The Worst Years of My Life - Free Preview: The First 20 Chapters", "description": "Rafe Khatchadorian has enough problems at home without throwing his first year of middle school into the mix. Luckily, he's got an ace plan for the best year ever, if only he can pull it off: With his best friend Leonardo the Silent awarding him points, Rafe tries to break every rule in his school's oppressive Code of Conduct. Chewing gum in class-5,000 points! Running in the hallway-10,000 points! Pulling the fire alarm-50,000 points! But when Rafe's game starts to catch up with him, he'll have to decide if winning is all that matters, or if he's finally ready to face the rules, bullies, and truths he's been avoiding.Blockbuster author James Patterson delivers a genuinely hilarious-and surprisingly poignant-story of a wildly imaginative, one-of-kind kid that you won't soon forget."}]