[{"id": "B077Y6FQWS", "genre": "Science Fiction & Fantasy", "title": "Wetworld (Alien Rebellion Book 1)", "description": "New Bali is a swamp world located 20 light-years from Earth. Colonized by humans almost two hundred years before, the planet is also home to an intelligent, methane-breathing race of amphibians. The natives have a unique culture that precludes war and vengeance, but recent events have begun to unravel a once fragile peace.Sophie Singh, heir to a vast conglomerate, must decide whether to retain her family's control of Wetworld while Brother Moises Borbon, a conflicted Jesuit researcher, races against time to unlock the true meaning behind an alien art form that might be the key to truly understanding the natives.These and many more unforgettable characters will experience critical choices ahead in the first part of this science fiction saga on colonialism, war, and sociopolitical upheaval."}, {"id": "1490988122", "genre": "Science Fiction & Fantasy", "title": "Letters From The Looney Bin", "description": "LETTERS FROM THE LOONEY BIN is a #1 Amazon Bestseller! In the late 1970s the Emerson Rose Asylum became completely abandoned - all the patients, doctors, staff, vanished and were never seen again. The events circling this mass exodus have been one of the most baffling disappearances in history. Until now. A stack of bundled letters was found inside a tattered asylum mattress during the Emerson demolition. These letters, all addressed to the pseudonym Dr. Quill, were written by the patients as they documented the demise of the Emerson Rose Asylum. The patients innocently convey their dire pasts while the events occurring hint toward dark happenings outside their doors. Haunting, their words conjure feelings both grim and promising, as they secretly conjure a plan of mass exodus from the volatile institution. The names have been changed, but the stories have not. Though their identities are protected, the essence of these patients’ challenges, triumphs, corruptions, salvations, and most of all, their human spirit, remains untouched. Their journey will become your journey as the patients chronicle their final months in these, Letters from the Looney Bin. www.LooneyLetters.com Follow at: www.facebook.com/LettersFromLooneyBin"}, {"id": "B01MTMUJZL", "genre": "Science Fiction & Fantasy", "title": "Utopia", "description": "Sealed in a compound.Zia knows little about the outside world until she learns a dangerous secret, one that will cause her to question everything.To survive, she must break out before she’s removed.In the son of an alcoholic, Zia finds an unlikely kindred spirit, and together with his gang they plan their escape.But the greatest resistance will come from within."}, {"id": "0521016576", "genre": "Science Fiction & Fantasy", "title": "The Cambridge Companion to Science Fiction (Cambridge Companions to Literature)", "description": "Science fiction is at the intersection of numerous fields. It is literature which draws on popular culture, and engages in speculation about science, history, and all varieties of social relations. This volume brings together essays by scholars and practitioners of science fiction, which look at the genre from different angles. It examines science fiction from Thomas More to the present day; and introduces important critical approaches (including Marxism, postmodernism, feminism and queer theory)."}, {"id": "1555603270", "genre": "Science Fiction & Fantasy", "title": "High Tech & Low Life: The Art of Shadowrun", "description": "This special collection features the finest work of the many talented artists who have brought the world of Shadowrun to life over the years. Fan and artist favorites from the entire spectrum of Shadowrun products are brought together in one volume, from cover paintings to black-and-white illustrations."}]