[{"id": "1543917518", "genre": "Children's Books", "title": "Alfred: A Christmas Tree Destined to Shine", "description": "Alfred, an evergreen tree, arrives into a family as a young sapling in a cup. Carefully nurtured by his family, he faces challenges on the way to discovering his true calling. Over time, he grows into a towering Christmas tree that dances with the breeze and shares light, joy, and wonder with the community."}, {"id": "1634498038", "genre": "Children's Books", "title": "Buddy and Bully Goat", "description": "Buddy is a biddy goat, itty bitty ninny goat! The sing-song chant followed Buddy, the new pygmy goat on Hope Farm, wherever he went. When he prayed for help, he was more than a little surprised by the answer he received.  Immediately the tables were turned and the singer of the chant, Bully Goat, was the one being laughed at by the other animals on Hope Farm. Only Buddy couldnt join in and laugh; now he actually felt sorry for Bully Goat, even more so when Bully Goat runs away from Hope Farm.  Speedy Steve the Rocket Rabbit and Benjamin the Plain Brown Bunny are the only ones to join Buddy when he organizes a search party. Its a Hope Farm Adventure you wont want to miss as the unlikely friends find the power of true forgiveness."}, {"id": "B00TXSM6J8", "genre": "Children's Books", "title": "Fox and the Goat lisitsa i kozata Children's Picture Book English-Bulgarian (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump. Kratka istoriya za edna lisitsa i kozel . Istoriyata prosledyava lisitsa tŭrsi voda i koza lisitsata vzaimodeĭstva s .Vŭz osnova na basnyata ot Ezop s izpolzvane na dumata na glagoli tichaĭte , i skochi ."}, {"id": "1624314783", "genre": "Children's Books", "title": "I Know Soccer (21st Century Basic Skills Library)", "description": "This Level 3 book introduces and examines the different aspects of soccer. Students will develop word recognition and reading skills while learning about the history and rules of soccer, as well as how to play the game. Additional text features and search tools, including a glossary and an index, help students locate and review important information."}, {"id": "1782767665", "genre": "Children's Books", "title": "Dragons: Riders of Berk The Collectors Edition", "description": "New comic adventures starring the cast of the How To Train Your Dragon movie and the Dragons: Riders of Berk spin-off.     Contains two Dragons stories (reprinting Dragons digest Vols #1 and 2) at a larger, prestige format, showcasing the beautiful artwork by Iwan Nazif. These stories are 'Dragon Down' and 'Dangers of the Deep'.     In 'Dragon Down', Meatlug's dragon goes missing and the race is on to find it before Alvin the Treacherous and his Outcasts do. In 'Dangers of the Deep', something huge and sinister lurks in the mysterious Veil of Mists... and Stoick and Hiccup are about to face it..."}]