[{"id": "B075BMBQG9", "genre": "Children's Books", "title": "Good Night My Jungle Friends!", "description": "Parents looking for a a bedtime story that is sure to please and a perfect book for the end of the day.As the monkey says good night to his jungle friends,  one by one and then also to his parents as he falls asleep - it is sure to also lull your child to sleep.   The illustrations focuses on the common jungle animals that kids love such as the lion, camel, elephant, giraffe, and zebra.   And of-course the main character - the monkey."}, {"id": "B00875HUBW", "genre": "Children's Books", "title": "101 Hilarious Cat Jokes For Kids - Jokes That Will Have them Purring and Howling with Laughter", "description": "What did the cat use to build a bird house? A claw hammerCats are cute. Cats are cuddly. Cats are also very funny. In 101 HILARIOUS CAT JOKES FOR KIDS, kids of all ages are certain to find a favorite feline joke. As the subtitle says, after a few jokes, readers will be purring and howling with laughter.What kind of cat is smart as a whip? A cat o'nine tails"}, {"id": "1633730603", "genre": "Children's Books", "title": "Glome's Valley", "description": "When Ethan and his dad go to Heavener, Oklahoma to read an ancient runestone, he is sure he’s going to be bored all summer. But Ethan quickly makes new friends—so what if they're ghosts? What began as a trip to Dullville suddenly becomes a fantastic adventure. There are other creatures living in the valleys near the runestone—energetic fairies, beautiful wood nymphs, and smelly old trolls.  Ethan stumbles into the midst of an ancient war, and the only person that can save him is his archaeologist dad—with a little help from Thor and the phone app that summons him."}, {"id": "1548938874", "genre": "Children's Books", "title": "Nathan Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "1410980529", "genre": "Children's Books", "title": "Spies and Codebreakers (Heroes of World War II)", "description": "The year is 1939. Germany, led by Adolf Hitler, has invaded Poland. The world is about to enter into the biggest and most terrible war in history. But from the depths of despair rose some very courageous, selfless individuals, such as ‘Garbo’ (Juan Pujol), ‘Agent Zigzag’ (Eddie Chapman) and Alan Turing, who risked their lives for the sakes of others in need, often for no gain and with no recognition. Here are some of their incredible stories…"}]