[{"id": "0375805834", "genre": "Children's Books", "title": "Baseball's Greatest Hitters (Step-Into-Reading, Step 5)", "description": "Here are the fascinating stories of Ty Cobb, Babe Ruth, Ted Williams, and Hank Aaron, and their rise to superstardom. This newly updated edition includes the recent record-breaking home run seasons, the alleged wrongdoings that threaten to alter the game of baseball, and the current crop of hard-hitting stars."}, {"id": "B01G1XDL2S", "genre": "Children's Books", "title": "Oliver Ryan Meets the Final Alchemist", "description": "Nine year old Oliver Ryan meets a mysterious Alchemist called Algenon secretly living in a deserted mansion house. Oliver is initiated into the ways of the alchemist and does battle with a hideous giant slug living in a local landfill dump who is trying to destroy the final alchemist, his allies and his friends.   Oliver seeks out help from his friends and together they set out to battle the giant slug Mohrlog.  Will they be successful ?  could a small handful of children battle and destroy a monster the size of Mohrlog?  Who will prevail in this struggle between right and wrong ?"}, {"id": "060600002X", "genre": "Children's Books", "title": "Why? (Turtleback School & Library Binding Edition) (26 Fairmount Avenue Books (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. World War II is raging in Europe, and Tomie finds that life has changed in many ways. Now he has to wear an extra sweater to school because they're trying to conserve coal. Then tragedy brings the war home to the dePaola family, and all Tomie can do is ask \"\"Why?"}, {"id": "0836852508", "genre": "Children's Books", "title": "Anne Frank (Trailblazers of the Modern World)", "description": "A biography of Anne Frank, including the historical events which forced her to hide with her family in an attic in Nazi-occupied Holland for two years."}, {"id": "0713664282", "genre": "Children's Books", "title": "The Actor, the Rebel and the Wrinkled Queen (Tudor Tales)", "description": "Old, ailing Elizabeth I is on the throne - but a rebellion to overthrow her is being plotted by the dashing Earl of Essex. One of the rallying points for the uprising will be the Globe Theatre. When the Queen learns of the plan, the plotters are defeated, and she throws Master Shakespeare's theatre company into the most putrid prison in the land. Can James, a boy actor, and the bard himself think of a way to earn the Queen's forgiveness - and be freed? Don't miss www.teary-deary.com - the author's own fantastic website, with detailed information about all our books, plus others, about Terry as a writer, as well as extracts, quizzes, games and activities."}]