[{"id": "B005IY4ZUO", "genre": "Science Fiction & Fantasy", "title": "Aeryn Daring and the Scientific Detective, Chapter Four", "description": "Aeryn Daring and the Scientific Detective is a serial adventure novel set in an unlikely late 19th / early 20th century. Join experimental test pilot Lady Aeryn Foxxe-Grace Tallhat, aka Aeryn Daring, on her high-flying adventures across Frisland and beyond. Witness daring feats of aerial acrobatics and thrill to adventures of scientific romance in a past not exactly ours.Chapter Four contains two parts -- Part I: The Gemini ELECTRIFIED, in which the dirigible enters a storm, and Our Heroes make a shocking discovery; and Part II: The Sky Serpent, in which the Gemini encounters an impossible denizen of the middle atmosphere."}, {"id": "076534887X", "genre": "Science Fiction & Fantasy", "title": "The Crippled God: Book Ten of The Malazan Book of the Fallen", "description": "Savaged by the K'Chain Nah'Ruk, the Bonehunters march for Kolanse, where waits an unknown fate. Tormented by questions, the army totters on the edge of mutiny, but Adjunct Tavore will not relent. One final act remains, if it is in her power, if she can hold her army together, if the shaky allegiances she has forged can survive all that is to come. A woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, Tavore Paran of House Paran means to challenge the gods―if her own troops don't kill her first.Awaiting Tavore and her allies are the Forkrul Assail, the final arbiters of humanity. Drawing upon an alien power terrible in its magnitude, they seek to cleanse the world, to annihilate every human, every civilization, in order to begin anew. They welcome the coming conflagration of slaughter, for it shall be of their own devising, and it pleases them to know that, in the midst of the enemies gathering against them, there shall be betrayal.In the realm of Kurald Galain, home to the long lost city of Kharkanas, a mass of refugees stand upon the First Shore. Commanded by Yedan Derryg, the Watch, they await the breaching of Lightfall, and the coming of the Tiste Liosan. This is a war they cannot win, and they will die in the name of an empty city and a queen with no subjects.Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon, from her eternal prison. Once freed, she will rise as a force of devastation, and against her no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, and once more, there will be dragons in the world."}, {"id": "0473419025", "genre": "Science Fiction & Fantasy", "title": "Nighter (The Vesper Series) (Volume 1)", "description": "Lifein the Special Forces can be too much for some people to bear. Yes, it is alife of action and adventure, but it's also a life of constant fear andsecrecy, where the risk of death waits around every corner. For other people,that life is their calling, and the surge of adrenaline is as addictive as anydrug.  Vesperis one such addict, a young man ready to sacrifice everything to serve hiscountry. He joins a secret unit of the International Security Agency, where heis given a new life, a new identity, and a new mission: control the renegadethreat without letting the general public discover that it exists.  Therenegades are not merely men fighting for a cause, though. They are vampires, viciousblood-drinkers who choose to live by their own violent code rather than followingthe rules of their more civilized brethren, the Nighters.  Therenegades are growing at a dangerous rate, and developing ever more brutalmethods to harvest the fresh human blood they crave. Vesper is faced with adifficult choice: as a human, he is not strong enough to stand against therenegades. Should he sacrifice everything and become a Nighter, in the name ofthe greater good? "}, {"id": "1912069679", "genre": "Science Fiction & Fantasy", "title": "Flames of Love: Truth of the Holy Grail (Holy Flames Trinity) (Volume 1)", "description": "Since the beginning of Earth’s creation, there has been a great plan at work – a great play acted out on the stage of life. Every person has been re-positioned as pawns on a chessboard with each new incarnation, to keep the great play alive. What is the great play? What will be the final scene, and what is your part? We are living at the precise moment in our evolution when the final curtain will come down. This is your clarion call: every one of us has a role to play. The dark forces would see us extinct before they relinquish control. But if we are to survive as a species, we must evolve together, past the crisis phase. This sacred text is the lynchpin to trigger universal awakening, the catalyst to ignite our memories of who we are and what we are here to do. Each one of us is an unwitting player in the greatest love story ever written. Based on a true story. The Lady of the Lake has returned to Earth, and she has come to herald humanity's ascension."}, {"id": "B016DWD2OY", "genre": "Science Fiction & Fantasy", "title": "Clash of Heroes: Nath Dragon meets The Darkslayer (Book 1 of 5)", "description": "Old enemies rise in the world called Nalzambor …The Thunder Stones have been stolen from the Apparatus of Ruune. Nath Dragon and company are called upon to recover them, but this quest will have dire consequences. Long ago, Nath and Brenwar crossed paths with a dangerous foe, Corzan the Necromancer. The goblin-like magic user has been simmering for decades and plotting vengeance on Nath Dragon. Now, harnessing the power of the Thunder Stones, the evil mage unleashes a trap that should dispatch Nalzambor's greatest hero forever. New adversaries surge in the world of Bish …Suffering one great loss after the other, the underlings unleash a drastic plan. Using their lethal arcane powers they attempt to summon a monster of incalculable power from the mystic realm beyond.  Instead, Nath Dragon, with black scales from his arms to his neck, emerges from the portal, but without his memories. The underlings deceive Nath and turn him loose and send him to hunt down and kill the legendary Darkslayer.  What will happen when these two titans of battle finally clash? Who will triumph in the end?  Only one thing is for sure, this will be an awesome, unprecedented, one-of-a-kind adventure that you will never forget!"}]