[{"id": "0237520397", "genre": "Children's Books", "title": "Shirley Hughes (Tell Me About series)", "description": "Targeted at younger readers, the books in this series tell the lives of famous people from the past. They are also suitable for older readers with learning difficulties. The text is accompanied by photographs of key events, people, and places. This title tells the life story of Shirley Hughes—from her early days in Liverpool to her first ventures into the world of illustration, and finally to her award-winning books."}, {"id": "B009DLGPN8", "genre": "Children's Books", "title": "#5 The Ancient Formula: A Mystery with Fractions (Manga Math Mysteries)", "description": "A puzzle left behind by Sifu Faiza's grandfather has everyone stumped. A circle divided into wedges shows part of the formula for an ancient medicine. But some of the wedges are blank, and no one knows how or why the original formula disappeared! Joy, Adam, Amy, and Sam will have to use clues—and fractions—to discover the truth about . . . The Ancient Formula."}, {"id": "B00ZPUMIJ6", "genre": "Children's Books", "title": "Euphemia Fan: Spy Girl", "description": "It was spying that got me into this pickle… Euphemia Fan, the only Chinese-American teenage girl in Brackybogue, Long Island, has a knack for spying on her neighbors. No empty house is unexamined, and no resident is ignored. Her eyes are sharp and her wits are keen. But when she sees her great uncle Jiu Jiu murder a man in cold blood, she must put her skills to the ultimate test. How could Jiu Jiu, her elderly uncle who barely speaks English, commit murder? Is he leading a double life? Who is he working for? When her father goes missing and the police prove to be useless, Euphemia must use her spy skills to uncover the truth. With the help of a swoon-worthy co-spy named Tyler and her older sister, Lillian, Euphemia embarks on the adventure of her life. But can she save her family before it’s too late?"}, {"id": "B01FWNS47K", "genre": "Children's Books", "title": "History in a Hurry: Aztecs", "description": "John Farman, the genius (for want of a better word) responsible for the best-selling A VERY BLOODY HISTORY OF BRITAIN (WITHOUT THE BORING BITS), now tackles all the great periods of history - in less than 10,000 words.History in a Hurry is so short that there just isn't room for any boring bits!All you need to know (and a little bit less*) about the Aztecs.(*Quite a lot less, actually. Ed.)"}, {"id": "1635174856", "genre": "Children's Books", "title": "Derek Carr", "description": "Introduces readers to the life and career of basketball star Russell Westbrook. Colorful spreads, fun facts, interesting sidebars, and a map of important places in his life make this a thrilling read for young sports fans."}]