[{"id": "1419701371", "genre": "Children's Books", "title": "10 Little Penguins Stuck on the Fridge", "description": "WARNING: Choking hazard--Small parts. Not for children under 3 years.From bestselling author-illustrator duo Jean-Luc Fromental and Joelle Jolivet comes a new way to enjoy the playful penguins from 365 Penguins: magnets! Create new scenes, combine characters, and learn a little about counting and numbers along with the mischievous penguins and their friends. Featuring an original booklet from the authors with ideas for play and explanations of new concepts, as well as dozens of magnets, this is the perfect book-and-toy combination for kids who can’t get enough of the penguins."}, {"id": "0836863054", "genre": "Children's Books", "title": "Electricity and Forces (Real World Science)", "description": "Real World Science is science made simple! This series introduces eight major topics in the science curriculum that students must master. A lively text relates factual information to familiar events and situations in the everyday world. Colorful artwork, fascinating fact boxes, and loads of easy-to-do experiments will engage students and help them understand the science concepts on which they will be tested."}, {"id": "0713664584", "genre": "Children's Books", "title": "101 Youth Soccer Drills: Age 12 to 16", "description": "Designed specifically for players aged 12 to 16, this manual contains a wide range of progressive practice drills to help young players develop. Fun, educational and challenging, all drills are illustrated and cover the essential technical skills including: warming up dribbling and running with the ball passing shooting heading crossing goalkeeping warming down.As well as easy-to-use instructions, each drill contains information on the equipment needed, the space required and how to organise the players."}, {"id": "1481464612", "genre": "Children's Books", "title": "The Heart of Everything That Is: Young Readers Edition", "description": "From bestselling authors Bob Drury and Tom Clavin comes the epic, untold story one of the most powerful Sioux warriors of all time, Red Cloud—now adapted for a younger audience!“I have but a small spot of land left. The Great Spirit told me to keep it.” —Red Cloud This young readers edition of the New York Times bestseller of the same name tells the long forgotten story of the powerful Oglala Lakota chief, Red Cloud. At the height of Red Cloud’s power the Sioux claimed control of vast parts of the west. But as the United States rapidly expanded, the country brutally forced the Indians off their lands. Fighting for the survival of the Sioux way of life, Red Cloud successfully secured the loyalty of thousands of fierce fighters, including Crazy Horse, and is the only American Indian in history to defeat the United States Army in a war. Thanks to the rediscovery of Red Cloud’s long-lost autobiography, and painstaking research by two award-winning authors, and with the help of a world-class adapter, the story of the nineteenth century’s most powerful and successful Indian warrior can finally be told."}, {"id": "1602701679", "genre": "Children's Books", "title": "The Titanic (Graphic History)", "description": "England, 1912. The largest, most luxurious ship on the ocean set sail. The unsinkable Titanic had been outfitted and boarded. Now, the 1,316 passengers were setting off for America. Despite the warnings of other ships, the builder wanted to set speed records. This decision proved disastrous. Experience the impossible sinking of The Titanic in this epic graphic novel."}]