[{"id": "1627125094", "genre": "Children's Books", "title": "Alchemy and Chemistry (Is It Science?)", "description": "Is it science? shows the scientific method at work. Each volume in the series explores a branch of modern science or a major scientific milestone, comparing and contrasting it with an older idea that has been proved wrong or fails to meet the standards of science."}, {"id": "0670062014", "genre": "Children's Books", "title": "Angelina's Invitation to the Ballet (Angelina Ballerina)", "description": "Angelina Ballerina is the winner of two tickets to a ballet?who will she choose to take with her? The answer can be found in the six envelopes inside this book! Readers can pull out letters, invitations, tickets to the performance, and a special keepsake poster as they follow along with the story. Featuring a padded cover with eye-catching foil details, this charming book will make an excellent gift for any Angelina fan."}, {"id": "B00FR6LX0I", "genre": "Children's Books", "title": "The Penitent Boy or, Sin Brings Sorrow", "description": "This touching, old-fashioned story tells the story of a young boy who lied to cover up a mistake, and the soul-searching he went through until he made things right. It is a short story, but one that impresses the importance of telling the truth. It is very much from a Christian viewpoint, and emphasizes the great sin of lying in a way that may seem foreign to many in modern culture. This book is a great teaching tool to help young people develop a tender conscience that will recognizing the value of honesty and the problems caused by stretching, hiding, or outright denying the truth."}, {"id": "0789478870", "genre": "Children's Books", "title": "A Journey Through Time", "description": "Take a journey back through time, digging deep into the Earth's crust, and watch the dramatic story of life on Earth unfold. A Journey Through Time is a thrilling excavation of life on Earth. Beginning in the present day on an excavation site, a time tunnel is dug deep into the ground, taking the reader back in time. Relics of the past are uncovered as layer upon layer of the Earth's crust is removed. Lavish illustrations bring the past to life, while flaps lift open to expose key points in the Earth's history. The palaces and temples of ancient civilizations, the ice-bound landscape one home to woolly mammoths, the prehistoric seas swarming with exotic life, and the violent, volcanic surface of the young Earth are revealed in sumptuous detail. A Journey Through Time is a mine of historical treasures and an indispensable guide to what has happened since the Earth began."}, {"id": "0152014772", "genre": "Children's Books", "title": "All by Herself", "description": "Amelia Earhart, Golda Meir, Pocahontas, Rachel Carson, Wanda Gág, Wilma Rudolph, and other determined young women--both famous and less familiar--took risks and made sacrifices to do brave things. Each of these inspiring poems proves that every girl, no matter who she is or where she lives, is capable of making a difference."}]