[{"id": "B071L58GZB", "genre": "Children's Books", "title": "Where's My Sandwich?", "description": "Join Nellie and her dog, Archie as they go on a picnic. When Nellie’s sandwich goes missing, she sets out through the Australian Bush to find the one who took it. Along the way she meets some Australian animals and learns a little about what they eat. Do you think you know who took it?Do you think you know who took Nellie’s sandwich?"}, {"id": "1630586781", "genre": "Children's Books", "title": "3-Minute Devotions for Boys: 90 Exciting Readings for Men Under Construction", "description": "For Boys Under Construction Hey guys—you can make three minutes for God’s Word, especially when it’s presented in the fun, appealing package of 3-Minute Devotions for Boys? Created just for guys ages 8 to 12, this book offers 90 readings that speak directly to the interests, needs, and dreams of you “men under construction”—with plenty of fun references to sports, video games, machines, and all those things you enjoy. In three minutes’ time, you can 1) consider a relevant scripture selection; 2) read a devotional that explains God’s Word in light of what boys experience in life; and 3) read a prayer designed to help you jump-start a conversation with God. "}, {"id": "0241331404", "genre": "Children's Books", "title": "LEGO Women of NASA Space Heroes (DK Readers Level 1)", "description": "Meet four amazing women - astronauts, scientists and mathematicians - who helped make space travel a reality. Illustrated with photography from the new LEGO (R) Ideas Women of NASA set, this book for children learning to read is a fun way to discover the achievements of some of space travel's greatest pioneers. Read about Mae Jemison, the first African American women to travel in space. Find out how Sally Ride inspired future scientists after her career as an astronaut. Discover how Margaret Hamilton created computer software for the Apollo mission, and see the stars with Nancy Grace Roman through the giant Hubble Telescope. Learn about NASA, and explore what life is like aboard the Endeavour Space Shuttle!Presented with fun images, simple vocabulary and lots of word repetition to engage young readers and help them build their literary skills, DK Reader LEGO Women of NASA reading book celebrates achievements in science, technology, engineering and mathematics. (c)2018 The LEGO Group."}, {"id": "1614791775", "genre": "Children's Books", "title": "Marvel Age Wolverine First Class 2: Hand in Hand", "description": "Wolverine, Daredevil, and Elektra battle ninjas who pursue Kitty Pryde through a museum trying to grab the mystical mask she protects."}, {"id": "147877584X", "genre": "Children's Books", "title": "Chunky Monkey in Pink Tights", "description": "Chunky Monkey in Pink Tights is your friend and would like you to be her friend. She is introducing you to her world and friends! We look forward to many fun adventures!"}]