[{"id": "0316129062", "genre": "Science Fiction & Fantasy", "title": "Caliban's War (The Expanse)", "description": "The second novel in James S. A. Corey's SF New York Times bestselling Expanse series. Now a major television series! We are not alone.On Ganymede, breadbasket of the outer planets, a Martian marine watches as her platoon is slaughtered by a monstrous supersoldier. On Earth, a high-level politician struggles to prevent interplanetary war from reigniting. And on Venus, an alien protomolecule has overrun the planet, wreaking massive, mysterious changes and threatening to spread out into the solar system.In the vast wilderness of space, James Holden and the crew of the Rocinante have been keeping the peace for the Outer Planets Alliance. When they agree to help a scientist search war-torn Ganymede for a missing child, the future of humanity rests on whether a single ship can prevent an alien invasion that may have already begun . . .Caliban's War is a breakneck science fiction adventure following the critically acclaimed Leviathan Wakes. The Expanse Leviathan WakesCaliban's WarAbaddon's GateCibola BurnNemesis GamesBabylon's AshesThe Expanse Short Fiction The Butcher of Anderson StationGods of RiskThe ChurnThe Vital Abyss"}, {"id": "041593950X", "genre": "Science Fiction & Fantasy", "title": "Decoding Gender in Science Fiction", "description": "From Frankenstein to futuristic feminist utopias, Decoding Gender in Science Fiction examines the ways science fiction writers have incorporated, explored, and revised conventional notions of sexual difference. Attebery traces a fascinating history of men's and women's writing that covertly or overtly investigates conceptions of gender, suggesting new perspectives on the genre."}, {"id": "1477636560", "genre": "Science Fiction & Fantasy", "title": "Debatable Actions", "description": "Debatable Actions: The Non-Combat Resolution Sourcebook is a PDF that focus on the arena of resolving conflict without violence but with words. The PDF creates three systems can be used to adjudicate debates of various types from legal to political to economical. Simple debates are used for minor confrontations, \"super-simple\" debates for easily decided sidetracks, and complex debates for situations central to the plot of the campaign. It's up to the GM to decide which is appropriate for the circumstances. This 23 page PDF includes a 36 card deck to help with gameplay is just the sort of thing needed for GMs to add depth to any great Pathfinder campaign world, including NeoExodus: A House Divided. This sourcebook includes: - Simple and Complex Debate Rules - Debate Maneuvers - New Uses for Skills like Appraise, Diplomacy and Perform - Over 15 New feats including Arbitrate Dispute, Determine Objective, Looking For Trouble, Public Support and Sense Of The Room. - Nearly 20 New Spells including Absorb Information, Cryptic Mark, Forget, Instant Fact, Scyjack and Weaken Resistance. - Nearly 15 New Wondrous items including Clever Table, Courier's Pouch, Echo Gem, Loyal Pen and Shrinking Vellum."}, {"id": "B019VMICMK", "genre": "Science Fiction & Fantasy", "title": "Pima County Mesa Creek: Andromeda series. Science Fiction. Parallel Universe, Parallel World.", "description": "A collection of very rare and real pictures taken by 2 mp, 10 mp and 22 mega pixel cameras over the years. Believed by many as the real depiction from the Parallel Worlds, primarily from Parallel Earth World, the factual surreality conforms with sci fi based facts."}, {"id": "1629894559", "genre": "Science Fiction & Fantasy", "title": "Aramid", "description": "She's everything they ever wanted. And that's the problem.\"She\" is Aramid. The year is 2080, and Human Replacement robots - or Reps - are an integrated part of society. At Ledgewood High in Los Angeles, five Advanced Robotics students build a female Rep named Aramid with plans to register her in a cut-throat competition to find the nation's most lifelike robot. But complications quickly arise. The students begin to use Aramid for their own means, illegally extracting her \"morality chip.\" The Rep begins to unravel, exhibiting many of the same problems as her teenage creators - lying, stealing, jealousy and, worst of all, rage, which threatens to turn her into a killing machine.Enter Sam Phenix, a brilliant new student with a tortured soul who hopes to reverse Aramid's rogue state and shield her from his classmates' ulterior motives. Sam's sensitivity draws the admiration of another student named Beth. The two of them enter into a tentative relationship while emerging as guardians for Aramid. Against all odds, the Rep begins to improve, developing feelings of love, consciousness, and a longing to sleep like real people. In her desire to become human, Aramid discovers her life's purpose - an explosive secret that even Sam doesn't know about.Unfortunately, Sam and Beth's reclamation efforts may be too late. Authorities are closing in on Aramid's trail, intent on destroying her. Will she live long enough to fulfill her dream? Their pursuit sets up a shocking ending in this riveting sci-fi thriller whose characters face a web of moral dilemmas with no easy answers."}]