[{"id": "1607531887", "genre": "Children's Books", "title": "Basketball and Other Ball Sports (Olympic Sports)", "description": "\"An introduction to a variety of ball sports of the summer Olympics, including field hockey, volleyball, tennis, basketball, and more. Also explains rules, records, and famous Olympic athletes in each sport.\" --Provided by publisher."}, {"id": "1602799830", "genre": "Children's Books", "title": "Water Park (Community Connections: How Did They Build That?)", "description": "Tall, twisting slides, gigantic wave pools, and powerful waterfalls are all common sights at a water park. Readers will find out what it takes to plan and build these fun places."}, {"id": "1684011582", "genre": "Children's Books", "title": "The Adventures of Young Shep: Young Shep Saves the Game", "description": "When Sterling \"Young Shep\" Shepard finds a pair of shoes in a trash can, little does he know they're magical! He can catch every pass and run faster than ever. But at the big championship game, his shoes break! Will Young Shep still be able to lead his team to victory? NFL player Sterling Shepard teams up with his sister Ashleigh for a fun story about believing in yourself."}, {"id": "0307987698", "genre": "Children's Books", "title": "Another Monster at the End of This Book (Sesame Street Ser.)", "description": "In this beautifully illustrated sequel to the much-loved classic The Monster at the End of This Book, Grover, now with pal Elmo by his side, has heard that there’s something lurking on the last page of the book. Grover tries his best in all sorts of hilarious ways to stop the reader from turning the pages. But, Elmo, curious as always, slips by every wacky barrier. Toddlers will find it hard to resist turning the pages too."}, {"id": "B01N6I48HK", "genre": "Children's Books", "title": "The Gay Illusion", "description": "Come with John as he learns that he never was gay as he had thought, nor indeed ever could be, and that gayness is a destructive illusion. THIS BOOK DOES NOT DESCRIBE GAY ACTS OR CONTAIN ANY SEXUAL CONTENT."}]