[{"id": "B00B9ZO434", "genre": "Children's Books", "title": "Everything Real Justin Bieber Fans Should Know & Do", "description": "Facts essential to official Justin Bieber fandom are collected in an entertaining one to 100 format that lists everything Bieber, from trivia to must-do activities. Those with Bieber fever who follow the pop star on Twitter, have seen Justin Bieber: Never Say Never, or attended a concert will be thrilled to take in such details about the young artist as his musical inspirations, the origins of “Kidrauhl,” and the identities of the recording artists who fought to produce Justin’s first record. The tidbits and trivia featured in the book include Justin’s relationship with his fans, his love life, the celebrities he considers friends, and his ventures outside of music. Appealing to both the fan who wishes to know more and the die-hard who thinks they know it all, this fun read is a lighthearted way for fans to celebrate the singer that captured their hearts."}, {"id": "0486818438", "genre": "Children's Books", "title": "Design Your Own Sugar Skull Sticker Activity Book (Dover Little Activity Books)", "description": "This colorful little activity book is loaded with the spooky fun of sugar skulls, the Mexican folk art tradition associated with the Day of the Dead. Two plain skulls can be decorated and re-decorated with 50 vivid stickers, which include psychedelic eyeballs, scarlet lips, teeth in rainbow hues, wild eyebrows and lashes, and a host of other flamboyant ornaments."}, {"id": "1633221695", "genre": "Children's Books", "title": "101 Books to Read Before You Grow Up: The must-read book list for kids (101 Things)", "description": "An Amazon Best Book of the Month Selection for October 2016!101 Books to Read Before You Grow Up provides a comprehensive list of kid-friendly books for children to read before they grow up. This must-read review list acts as an interactive journal where kids can document the books they read, why they like them, and how they rate them. Divided into sections by subject, from fairy tales and fantasy to sports and nonfiction, 101 Books to Read Before You Grow Up celebrates the importance of reading and encourages family participation to develop lifelong readers. The perfect reference guide for book lovers of all ages, 101 Books to Read Before You Grow Up helps both kids and parents decide which books to read next!"}, {"id": "B015NIAYVS", "genre": "Children's Books", "title": "Fantastic Facts About Ducks: Illustrated Fun Learning For Kids", "description": "Welcome to the Fantastic Facts Book Series!Bestselling children's author Miles Merchant presents \"Fantastic Facts About Ducks\". This book uses captivating images and expertly written words to teach children about \"Ducks\".Perfect reading for any occasion and especially ideal for bed times, long journeys or for bonding with your child. Fun Filled Learning for Your Child (and you!)Every one of our books is lovingly researched, illustrated and put together to outstand, awe and inspire the reader. Our beautiful images help explain and enlighten each well-written fact.We loved compiling this book and even learned a few things along the way and hopefully you will too.Get this book at this SPECIAL PRICE exclusive to the Amazon Store. *** Your child will love it - this is guaranteed.***PLEASE Leave an honest review after reading this booK! It REALLY helps us to understand what you would like to see and read about! Thank you."}, {"id": "0862725593", "genre": "Children's Books", "title": "Buildings, Bridges and Tunnels (Tell Me About)", "description": "Focusing on buildings, bridges and tunnels, this is one of a series of picture books in question-and-answer format. It looks at the way things are built and their importance, and features some famous and historical structures. There are also eight projects involving things to make and do."}]