[{"id": "1491824557", "genre": "Science Fiction & Fantasy", "title": "2: Different Coins in the Fountain: Volume II of II", "description": "Volume I contains 54 stories. Volume II which is a continuation of Volume I has 42 stories. The stories are stand-alone stories, that is, they are independent from each other, so that these books can be read in any sequence the reader chooses. There is no particular reason why they should be read in the way the author sequenced them. The reader can select stories based on the time there is to read one or more stories. The books are designed for busy people who need to escape from the problems of work, family, or self-imposed rituals for governing activities of the day. Please read these stories to explore and enhance that which is not yet part of your day or evening accomplishments."}, {"id": "076539541X", "genre": "Science Fiction & Fantasy", "title": "The Black Tides of Heaven (The Tensorate Series)", "description": "\"Joyously wild stuff. Highly recommended.\" ―The New York TimesThe Black Tides of Heaven is one of a pair of unique, standalone introductions to JY Yang's Tensorate Series, which Kate Elliott calls \"effortlessly fascinating.\" For more of the story you can read its twin novella The Red Threads of Fortune, available simultaneously.Mokoya and Akeha, the twin children of the Protector, were sold to the Grand Monastery as infants. While Mokoya developed her strange prophetic gift, Akeha was always the one who could see the strings that moved adults to action. While Mokoya received visions of what would be, Akeha realized what could be. What's more, they saw the sickness at the heart of their mother's Protectorate.A rebellion is growing. The Machinists discover new levers to move the world every day, while the Tensors fight to put them down and preserve the power of the state. Unwilling to continue as a pawn in their mother's twisted schemes, Akeha leaves the Tensorate behind and falls in with the rebels. But every step Akeha takes towards the Machinists is a step away from Mokoya. Can Akeha find peace without shattering the bond they share with their twin?"}, {"id": "1936781492", "genre": "Science Fiction & Fantasy", "title": "Cat & Mouse for Pathfinder Roleplaying Game", "description": "Who Do You Trust? In the cool streets and blazing bazaars, the word is out: a great treasure has gone missing in the Everlasting City of the Cat, and some very ambitious people have set their sights on it. Many paws and claws are out, and everyone is sniffing around for something rich and strange. It’s an odd time for a catfolk thief and a gnoll merchant to make very tempting offers to strangers in town. Or, perhaps it’s not odd at all. Get caught up in the hunt with Cat and Mouse by Richard Pett, the acclaimed Paizo adventure path author!  This Pathfinder Roleplaying Game adventure for 1st-level characters is a perfect introduction to the Southlands campaign setting, and it fits neatly into any desert city where cats are sacred and rats are cautious and sly."}, {"id": "076537563X", "genre": "Science Fiction & Fantasy", "title": "The Swarm: Volume One of The Second Formic War", "description": "New York Times bestselling authors Orson Scott Card and Aaron Johnston return with an all-new prequel trilogy to Ender's Game, The Second Formic War, with book one, The Swarm A coalition of corporate and international military forces beat back the first invasion of Earth, in the First Formic War. But it was a near thing, and the devastation of much of Earth has shocked the planet into cooperation. The war is not won. The single ship that did so much damage was only a scout ship. There is another, much bigger, colony ship on its way into our system, and Earth really doesn’t have any defenses against it. They only have a few months to find some.  Here is the Second Formic War, and the threat to all humanity that led to the creation of the Hegemony, and the Battle School, and the genetic program that led to the birth of Ender Wiggin.The Second Formic War#1 The Swarm"}, {"id": "1601258925", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Path: Strange Aeons Part 2 - The Thrushmoor Terror", "description": "After escaping from the waking nightmare of Briarstone Asylum, the former captives venture to the dismal town of Thrushmoor to unravel the enigma of their lost memories. Upon arrival, the adventurers discover that the town’s leadership has either fled town or gone missing, and a rash of kidnappings and rumors of the Briarstone Witch spread terror through the people of Thrushmoor. As the adventurers investigate the unsettling mysteries, they uncover a secretive cult who plans to use Thrushmoor’s ancient monuments to grow their strength and power. Will the adventurers discover the secret to their affliction and find an answer in an uninviting town, or will they fall victim to the ruthless cult that wants to slay the people of Thrushmoor as a sacrifice?  “The Thrushmoor Terror” is a Pathfinder Roleplaying Game adventure for 4th-level characters. The adventure continues the Strange Aeons Adventure Path, a twisted delve into madness that pits the heroes against the cosmic horrors of the Cthulhu Mythos. A selection of new monsters, a gazetteer of the town of Thrushmoor, details on the Great Old One Hastur, and the next installment of a new Pathfinder’s Journal round out this volume of the Pathfinder Adventure Path.  Each monthly full-color softcover Pathfinder Adventure Path volume contains an in-depth adventure scenario, stats for several new monsters, and support articles meant to give Game Masters additional material to expand their campaign. Pathfinder Adventure Path volumes use the Open Game License and work with both the Pathfinder RPG and the world’s oldest fantasy RPG."}]