[{"id": "1481476769", "genre": "Children's Books", "title": "1-4: The Rider Woofson Collection: The Case of the Missing Tiger's Eye; Something Smells Fishy; Undercover in the Bow-Wow Club; Ghosts and Goblins and Ninja, Oh My!", "description": "Join Rider and the PI Pack on their grrreat adventures with this purrfect four-book collection!Rider is the greatest dog detective in Pawston—maybe even the world. And with the help of his pals in the Pup Investigator’s Pack, criminals don’t stand a chance. Even if they commit the purrfect crime. Join Rider and the PI Pack as they dig up clues to reclaim a precious statue, expose a fishy impostor, solve a musical mystery, and track down a sacred scroll in this action-packed four-book collection that includes: The Case of the Missing Tiger’s Eye; Something Smells Fishy; Undercover in the Bow-Wow Club; and Ghosts and Goblins and Ninjas, Oh My. With easy-to-read language and illustrations on almost every page, the Rider Woofson chapter books are perfect for emerging readers."}, {"id": "B008M6L2G0", "genre": "Children's Books", "title": "Miss Content – Single and Content! (Singles Street Life)", "description": "Is it possible to enjoy your single life?  Yes it is! Miss Content is a testimony that you can be single and content.Learn more about what makes her tick in this book, her background her love languages and how she would relate in a relationship. About The Author...Ade D'Almeida is passionate about encouraging those who are single to enjoy and maximise life. With a mix of humour and straight talk she provides insights, tips, advice on dating, courtship, relationships and marriage. Single for many years herself until she married in her 40s she feels qualified to talk about the highs and lows of single life.  Her life is a testimony of how to break free from the negative perceptions and views singles often have to face as they just get on with everyday life. Her articles and books truly inspire."}, {"id": "1432925288", "genre": "Children's Books", "title": "Silkworm (2nd Edition) (Life Cycle of a . . .)", "description": "Why do silkworms live on farms? What do silkworms eat? How do silkworms make silk? Explaining concepts through stunning photographs and simple text, 'Life Cycle of a Silkworm' takes an in-depth look at this familiar but fascinating animal."}, {"id": "B01IN98RKE", "genre": "Children's Books", "title": "Love Monster and the Scary Something", "description": "It's way past bedtime o'clock in Cutesville . . . . but somebody can't  sleep. The harder he tries to nod off, the more wide awake Love Monster  is, and the later and darker and spookier it gets. When he hears a rustle rustle, then a creeeak, scuffle-shuffle BUMP,  he's just sure there's a hungry, scary something on its way to get him.   So Love Monster musters up his courage . . . . and discovers that the  something scary isn't so scary after all. It's just his friend coming to  pay Love Monster a visit. Turns out Love Monster's pal couldn't sleep,  either."}, {"id": "1568999615", "genre": "Children's Books", "title": "Mallard Duck at Meadow View Pond (Smithsonian's Backyard Book & Toy Set) (Mini book with stuffed toy animal)", "description": "Growing up on the pond, Mallard Duck and his siblings have all sorts of adventure! Children will follow them as they grow from little hatchlings to young adults ready to migrate south for the winter. Reviewed by the Smithsonian Institution for accuracy, Mallard Duck at Meadow View Pond is a fun and informative story with beautifully detailed illustrations. Watch your children have a blast reading and learning about the animals that live in an American backyard! Also included is an adorable stuffed duck plush toy for hours of playtime fun! Other titles from Smithsonian's Backyard Book & Toy Set series include \"Alligator at Saw Grass Road\", \"Bullfrog at Magnolia Circle\", \"Cottontail at Clover Crescent\", \"Red Fox at Hickory Lane\", and many more fun and educational Smithsonian Backyard book and toy sets with cute toy animals!"}]