[{"id": "0824818202", "genre": "Children's Books", "title": "Tales from Within the Clouds: Nakhi Stories of China (Kolowalu Books)", "description": "South of the clouds, in the land of the Jade Dragon Snow Mountain, dwell the descendants of a once pastoral people, the Nakhi. In ancient times, family names were passed from mother to child, there were no marriages, and women alone raised children. (In the Nakhi language, there is no word for \"father.\") Today there are still Nakhi who follow these traditions, and Nakhi folktales reflect these beliefs. In the legends presented here we are introduced to a fantastic cast of characters: plants, insects, animals-all of them female! We discover why the Sun, hot-tempered and impetuous, is unpleasant to look at, while the graceful Moon attracts us with her silvery light; why the goat complains and her sister, the sheep, only murmurs \"ba-ba\"; why the azalea, for all her beauty, lives the shortest and saddest of lives. The ten stories, each illustrated with delightful paintings by celebrated artist Li Ji, welcome us into the unique and little-known world of the Nakhi."}, {"id": "0736846301", "genre": "Children's Books", "title": "Booker T. Washington: Great American Educator (Graphic Biographies)", "description": "A biography telling the life story of Booker T. Washington, along with his accomplishments toward promoting the education of African Americans. Written in graphic-novel format."}, {"id": "1933390514", "genre": "Children's Books", "title": "The Haunted House (Choose Your Own Adventure - Dragonlarks)", "description": "The Haunted House by R. A. Montgomery takes YOU on an adventure through a spooky, old house in search of your dog (and best friend), Homer. Your 6-8 year old reader will discover a hidden movie theater, encounter a crying crocodile, a talking turtle, and follow a mysterious mouse down a dark tunnel!   Choose Your Own Adventure The Haunted House is an interactive adventure book in which YOU decide what happens next.   If you follow Homer into the house, will you meet a ghost or ghoul? Do you trust the unicorn to fly you over the moon?   For readers that enjoyed other titles from the Choose Your Own Adventure Dragonlark series including: Ghost Island by Shannon Gilligan, Sand Castle by R. A. Montgomery, and Return to Haunted House by R. A. Montgomery."}, {"id": "0749652330", "genre": "Children's Books", "title": "Jew (Beliefs and Cultures)", "description": "This series explores major world religions from a personal viewpoint and includes interviews and craft activities to bring to life the beliefs, history and culture of each faith."}, {"id": "0446563846", "genre": "Children's Books", "title": "100 Great Poems for Girls", "description": "Reading any great poem for the first time is always a thrilling discovery, even if it's only four lines long, and this collection brings together some of the best ever to read, memorize, or recite. Girls of all ages will enjoy reading poems catered specifically to them, whether it means envisioning adventures with princesses and witches, or laughing at the antics of mischievous little girls. The book is divided into eight sections: Nature, Imagination, Love & Friendship, Inspiration, Animals, Nursery Rhymes, Limericks & Tongue Twisters, and Fun & Nonsense. 100 GREAT POEMS FOR GIRLS is a perfect introduction for those encountering poetry for the first time, but readers who grew up with poems will also cherish this treasury of classics."}]