[{"id": "140349147X", "genre": "Children's Books", "title": "Assassination in Sarajevo: The Trigger for World War I (Point of Impact)", "description": "Discover how one assassination led to world war. This book focuses on the assassination in Sarajevo, analyzing how it came about, describing it, and discussing its consequences on history. Investigate the timeline to understand crucial dates surrounding the assassination. Read the debate section so you can consider the arguments and weigh the evidence about its role in history. Clear photographs, maps, contemporary views, a glossary, and tips for future research are included to help you to understand the importance of this turning point in history."}, {"id": "B00UA0WZW6", "genre": "Children's Books", "title": "Thor Thorsen's Knock Knock Jokes For Kids", "description": "Kids of all ages love Knock Knock jokes. They are a perennial favorite. Each joke is presented in a series of colorful, fun images."}, {"id": "0679884688", "genre": "Children's Books", "title": "Arthur's Really Helpful Bedtime Stories", "description": "Arthur, D.W., and their friends bring a touch of their own personalities and senses of humor to this sprightly collection of classic bedtime stories. \"Could you please be more careful--you're drooling on my cape,\" says D.W. to the wolf in \"Little Red Riding Hood.\" \"Lucky I'm not afraid of heights,\" proclaims Francine as she climbs to the top of the mattresses in \"The Princess and the Pea.\" Master weaver Arthur has the last laugh in \"The Emperor's New Clothes.\" Each short, fun-to-read story has just the right mixture of the familiar tales with the contemporary spin of Arthur and his friends. \"The Frog Prince,\" \"The Three Bears,\" \"The Three Little Pigs,\" and others round out this big, heavily illustrated hardcover bonanza for parents. Yes, it's really helpful in getting the kids settled down and ready for bed!  "}, {"id": "1600141811", "genre": "Children's Books", "title": "Skid Steer Loaders (Blastoff! Readers: Mighty Machines) (Blastoff Readers. Level 1)", "description": "Skid steer loaders are small construction machines that can do many different jobs. They are very useful for working in small places. Follow a skid steer loader as it drills a hole, lifts up a tree, or moves dirt."}, {"id": "B074M78C8C", "genre": "Children's Books", "title": "Body Goo Volume 6 The Sticky Bits: Funny Childrens Book How the body works Science Biology", "description": "Bodies can be a bit of a mystery! People are sometimes shy about theirs. The amazing ways our bodies look after us shouldn’t be such a secret - and that’s where this book comes in!From sweaty armpits to what comes up when we cough; from what exactly is going on when someone goes for a sleepwalk (and how you can help) to tickles and itches - you won’t want to miss out. We even have an incredible section on yawning that won’t put you to sleep!Play our Goo or False game to separate truth from fiction and read our gooiest ever jokes! Packed with slimy, gooey, wobbly, itchy facts about how your body works, this is the perfect mix of yucky and interesting! So, if you think you can stomach it, let’s goo!"}]