[{"id": "1930353537", "genre": "Children's Books", "title": "13: The Mysterious Guest House (Sammy and Brian Mystery Series)", "description": "An expensive and dangerous weekend at the Smoketown Village Guest House in Lancaster Co., Pa., opens up new doors for amateur sleuths, Sammy and Brian, as they uncover another mystery. Written for ages 9-13, this is #13 in the \"Sammy and Brian\" Mystery Series. (108pp. Gaslight Pub., 2002.)"}, {"id": "B071K6KGNZ", "genre": "Children's Books", "title": "Betty Before X", "description": "In Detroit, 1945, eleven-year-old Betty’s house doesn’t quite feel like home. She believes her mother loves her, but she can’t shake the feeling that her mother doesn’t want her. Church helps those worries fade, if only for a little while. The singing, the preaching, the speeches from guest activists like Paul Robeson and Thurgood Marshall stir African Americans in her community to stand up for their rights. Betty quickly finds confidence and purpose in volunteering for the Housewives League, an organization that supports black-owned businesses. Soon, the American civil rights icon we now know as Dr. Betty Shabazz is born.Inspired by Betty's real life--but expanded upon and fictionalized through collaboration with novelist Renée Watson--Ilyasah Shabazz illuminates four poignant years in her mother’s childhood with this book, painting an inspiring portrait of a girl overcoming the challenges of self-acceptance and belonging that will resonate with young readers today.Backmatter included."}, {"id": "0899193498", "genre": "Children's Books", "title": "The Little Red Hen (Paul Galdone Classics)", "description": "Little Red Hen is a time-tested cautionary tale about how we reap what we sow. When the hen asks a cat, dog, and mouse for help planting some wheat, she gets no takers: \"‘Not I!’ said the cat. ‘Not I!’ said the dog. ‘Not I!’ said the mouse.\" They won’t water, cut, or grind the wheat . . . or help bake a cake with it, either. So guess who eats the cake by herself in the end? The Caldecott Honor artist Paul Galdone’s delightfully detailed ink and wash illustrations—packed with charming details—add plenty of sly humor to the well-loved story that not only offers a sage message but also shows children what it takes to make a cake from the ground up!"}, {"id": "0606354255", "genre": "Children's Books", "title": "Chickens Don't Fly (Turtleback School & Library Binding Edition) (Did You Know...?)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Offers fun and unusual facts about animals of all shapes, sizes, speeds, and species, revealing that some salamanders breathe through their skin and that elephants can detect water from twelve miles away."}, {"id": "1500887102", "genre": "Children's Books", "title": "The Adventures of Mama Rabbit: a Bilingual Version", "description": "Follow the adventures of the resourceful Mamá Rabbit in both Spanish and English as she meets characters whom she begs to help save her baby, Jesús, from Papá Fox. The colorful animals will make you smile, and hold you in suspense, as they interact with Mamá."}]