[{"id": "0618800689", "genre": "Children's Books", "title": "Curious George at the Aquarium", "description": "Beluga whales! Sea lions! Sharp-toothed piranhas! Curious George at the Aquarium is a lively story based on H. A. and Margret Rey’s popular primate and painted in the original watercolor and charcoal style. The aquarium is the perfect place for a little monkey to get into big trouble. A full-color twenty-four-page paperback with bonus activities and fun facts about sea life from the director of Connecticut’s Mystic Aquarium. Splash! For more monkey fun, investigate www.curiousgeorge.com and discover all the latest on Curious George books, promotions, games, activities, and more!"}, {"id": "1932457046", "genre": "Children's Books", "title": "Celebrating Chinese New Year: An Activity Book", "description": "Celebrating Chinese New Year is a fun-filled craft, activity and resource book for the Chinese New Year. In addition to basic facts and history of the Chinese New Year, you can make a dragon parade, a paper lantern, and red lucky envelopes following simple directions and examples in this activity book. You will also have fun learning about your Chinese Zodiac signs. This classroom tested copy-ready activity book is an excellent resource for parents and teachers with children ages 5 to 10. A must for celebrating Chinese New Year!"}, {"id": "1624870147", "genre": "Children's Books", "title": "Prepper Pete's Twelve Days of Prepper Christmas (Prepper Pete & Friends)", "description": "Another original Prepper book for kids!    Prepper Pete works very hard to keep his loved ones safe by preparing for events that may happen in the future.    His family decides to thank him by giving gifts based on a  longstanding tradition... with a Prepper twist!  Children (and you're whole family!) will love singing this adapted version of a well-known classic!    *****    \"Some people prepare because they are afraid.    Our family does not have to be afraid...  because we are prepared!\"  -Prepper Pete    *****    A note for grownups!    Teaching kids the importance of being prepared doesn't have to be harsh or scary. Regardless of why you (or someone you may know) prepare, remember that the single most important thing you can teach your kids is how to think!    All the preps in the world don't mean a thing if people don't know how to think clearly. Teach useful skills to all of the kids you know, to include critical thinking, problem solving, and the most important one of all - how to be resourceful!    Prepper Pete and Friends are the first and only Prepper books on the market designed especially for kids!  Check back often for new releases!    Keep preppin'!1"}, {"id": "0739814907", "genre": "Children's Books", "title": "The Travels of Vasco Da Gama (Explorers and Exploration)", "description": "Describes the journey of Portuguese explorer Vasco da Gama around Africa's Cape of Good Hope, which opened up an important trade route from Portugal to the East Indies."}, {"id": "B074TW21TJ", "genre": "Children's Books", "title": "Counting, Counting, 1 Through 12", "description": "Do you have a little reader that has shown an early interest in counting?  Counting, Counting, 1 Through 12 gives you the opportunity to interact with your little reader through vivid pictures and numbers.  Each page visualizes each number with not only a number, but also with the word and representation via objects.  All with a narrative that will lead your little reader from 1 through 12."}]