[{"id": "0810853655", "genre": "Science Fiction & Fantasy", "title": "Not Your Mother's Vampire: Vampires in Young Adult Fiction", "description": "Not Your Mother's Vampire analyzes twenty current young adult vampire novels and also addresses Buffy the Vampire Slayer-all vampire representations aimed at younger audiences. The book's structure includes an overview of vampire scholarship, an analysis of vampire characters (featuring an exploration of vampire conventions and vampires and sexuality), an analysis of human characters (featuring an exploration of those humans who fight vampires and those who date vampires), and an analysis of the vampire characters from the Buffyverse."}, {"id": "1501167715", "genre": "Science Fiction & Fantasy", "title": "Something Wicked This Way Comes: A Novel", "description": "One of Ray Bradbury’s best-known and most popular novels, Something Wicked This Way Comes, now featuring a new introduction and material about its longstanding influence on culture and genre.For those who still dream and remember, for those yet to experience the hypnotic power of its dark poetry, step inside. The show is about to begin. Cooger & Dark’s Pandemonium Shadow Show has come to Green Town, Illinois, to destroy every life touched by its strange and sinister mystery. The carnival rolls in sometime after midnight, ushering in Halloween a week early. A calliope’s shrill siren song beckons to all with a seductive promise of dreams and youth regained. Two boys will discover the secret of its smoke, mazes, and mirrors; two friends who will soon know all too well the heavy cost of wishes…and the stuff of nightmares. Few novels have endured in the heart and memory as has Ray Bradbury’s unparalleled literary masterpiece Something Wicked This Way Comes. Scary and suspenseful, it is a timeless classic in the American canon."}, {"id": "1909640107", "genre": "Science Fiction & Fantasy", "title": "Beauties in the Deep", "description": "SST NOVELETTE SERIES FACSIMILE SIGNATURE LIMITED PAPERBACK EDITION. Ivory was only supposed to go fishing with her father. She was never supposed to run off and get into trouble. But that's what she's done. And now the cries of a drowning boy beckon her into icy waters, into a madness which lurks deep inside the lake, waiting to paint her world black."}, {"id": "B002LEI6RM", "genre": "Science Fiction & Fantasy", "title": "LOVE WITHOUT GUN CONTROL & Other Fantasy, Horror and Science Fiction Stories", "description": "\"Unique and truly fascinating,\" writes Mike Resnick! M. Christian isn't as good as his peers say - he's better!  This \"best of\" collection, featuring the cream of his fantasy, horror, and science fiction stories, is a dazzling achievement.  Only M. Christian could have imagined what happens when a boy's uncle blows Tibetan days powder in his face, or when a woman gave birth to a new species … but not one of flesh and blood, or when the Goddess of the Road gave the gift of beauty to a mortal man. You will find these and eleven other unforgettable tales from the man Stephen Dedma, author of The Art of Arrow Cutting and Shadows Bite, hails as \"A chimera, an amazing combination of tour guide and magician. Whether he's writing science fiction, horror or fantasy, he can take you to places you've never imagined, show you sights no-one else will get to see, introduce you to some fascinating people, and guarantee that the trip will be memorable from start to finish.\" Among the contemporary classics featured in this stellar collection are: Some Assembly Required, The Rich Man's Ghost, Medicine Man, Wanderlust, Buried & Dead, Nothing So Dangerous, Shallow Fathoms, and Constantine in Love. M. Christian's fantasy and science fiction has appeared in Talebones, Space & Time Magazine, Skull Full Of Spurs, Graven Images, Horror Garage, Song of Cthulhu, and other science fantasy publications."}, {"id": "0786907517", "genre": "Science Fiction & Fantasy", "title": "Monstrous Compendium, Appendix III (Planescape; Advanced Dungeons & Dragons, 2nd Edition, Accessory/2635)", "description": "Very Good in Wraps; 4to; Paperback; 128 pages; B/W Illustrations; Subtitled: Being a Guide to previously Unknown Inner-Planar Creatures, both Malevolent and Benign, and Including selected Revised Entries from Older Sources; Minor rubbing and shelf wear to wraps; Browning to edges of text; Text unmarked but smells of smoke."}]