[{"id": "4805310790", "genre": "Children's Books", "title": "A Treasury of Japanese Folktales: Bilingual English and Japanese Edition", "description": "Learn Japanese and enjoy folktales at the same time with this whimsically illustrated multicultural children's book!This bilingual edition of A Treasury of Japanese Folktales—presented in both English and Japanese—contains 12 of the best Japanese legends and fairy tales, told to generation after generation of Japanese children. Originally written in English by Yuri Yasuda, based on her interpretations of traditional Japanese tales, these charming stories of rich imagination are now accompanied by Japanese text by Yumi Matsunari and Yumi Yamaguchi. The Japanese text includes basic kanji accompanied by furigana to help beginning learners to recognize and learn the characters.Adventures carry us, on turtle-back, to the splendors of the underwater palace of the dragon princess, to the beautiful hills where Kintaro plays with his animal friends, and to a temple where we discover a \"tea kettle\" that is really a cunning badger in disguise.The 98 color illustrations bring to life the charming characters of these heart-warming tales of old Japan, which include:Shitakiri Suzume, the Tongue-Cut SparrowKintaro, the Strong BoyKaguya Hime, the Luminous PrincessMomotaro, the Peach BoyBunbuku Chagama, the Lucky Cauldron"}, {"id": "0836826310", "genre": "Children's Books", "title": "Cheetahs: Cheetah Magic for Kids (Animal Magic for Kids)", "description": "Describes the physical characteristics, habitat, and behavior of this swift African cat through the viewpoint of Beth, an eleven-year-old daughter of wildlife photographers."}, {"id": "0766065405", "genre": "Children's Books", "title": "Carl Linnaeus: Genius of Classification (Genius Scientists and Their Genius Ideas)", "description": "Recounts the life and accomplishments of the eighteenth-century Swedish botanist, who established the modern system of classifying plants and animals."}, {"id": "0763671150", "genre": "Children's Books", "title": "Lady Liberty: Candlewick Biographies: A Biography", "description": "A powerfully moving, authentic portrait of the Statue of Liberty, told through the eyes of those who created her and illustrated in glorious detail.\"Soon America will be one hundred years old. I share my dream of a birthday gift.\"It begins in 1865 as a romantic idea, but ten years later ï¿½douard Laboulaye's dream catches fire and takes shape. Sculptor Auguste Bartholdi gives the dream the form of a lady, holding a torch to \"enlighten the world.\" Engineers, plasterers, carpenters, coppersmiths -- many of them immigrants -- work together to turn the lady into a monument over 100 feet tall. Joseph Pulitzer calls on readers to help fund a pedestal, and hundreds send in nickels, dimes, and even roosters for the cause. Doreen Rappaport's historically accurate, poetic vignettes and Matt Tavares's magnificent images remind us of the true origins of a national symbol -- and show that it took a lot of people to make the Lady.Back matter includes statue dimensions, a time line, an author note, an illustrator note, sources, and suggestions for further reading."}, {"id": "0756658322", "genre": "Children's Books", "title": "Pyramid (DK Eyewitness Books)", "description": "Illus. with full-color photos. Unlock the secrets to the  mysterious monuments of the ancient world--from Egyptian pyramids, built before the invention of the wheel, to amazing Aztec and Maya edifices.  "}]