[{"id": "154723041X", "genre": "Children's Books", "title": "Happy 78th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 78 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B074LZ1SKY", "genre": "Children's Books", "title": "Dan, The Newsboy (Annotated & Illustrated)", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors.Horatio Alger tells the story of young boy from New York, thrust into the heart of poverty, but who makes his way up in the world through a combination of pluck and luck."}, {"id": "1772780103", "genre": "Children's Books", "title": "My Beautiful Birds", "description": "Behind Sami, the Syrian skyline is full of smoke. The boy follows his family and all his neighbours in a long line, as they trudge through the sands and hills to escape the bombs that have destroyed their homes. But all Sami can think of is his pet pigeons―will they escape too? When they reach a refugee camp and are safe at last, everyone settles into the tent city. But though the children start to play and go to school again, Sami can’t join in. When he is given paper and paint, all he can do is smear his painting with black. He can’t forget his birds and what his family has left behind.One day a canary, a dove, and a rose finch fly into the camp. They flutter around Sami and settle on his outstretched arms. For Sami it is one step in a long healing process at last.A gentle yet moving story of refugees of the Syrian civil war, My Beautiful Birds illuminates the ongoing crisis as it affects its children. It shows the reality of the refugee camps, where people attempt to pick up their lives and carry on. And it reveals the hope of generations of people as they struggle to redefine home."}, {"id": "068981528X", "genre": "Children's Books", "title": "The Three Little Wolves and the Big Bad Pig", "description": "When it comes time for the three little wolves to go out into the world and build themselves a house, their mother warns them to beware the big bad pig. But the little wolves' increasingly sturdy dwellings are no match for the persistent porker, who has more up his sleeve than huffing and puffing. It takes a chance encounter with a flamingo pushing a wheelbarrow full of flowers to provide a surprising and satisfying solution to the little wolves' housing crisis. Eugene Trivizas's hilarious text and Helen Oxenbury's enchanting watercolors have made this delightfully skewed version of the traditional tale a contemporary classic."}, {"id": "1599150549", "genre": "Children's Books", "title": "Stories from the Crusades  (Yesterday's Classics)", "description": "Brings the Crusades to life through stories of its most famous participants. Relates how Peter the Hermit, with the Pope's blessing, gathers men to his side and leads the first crusade, resulting in the capture of Jerusalem and installation of Godfrey as defender of the holy sepulchre. After the Muslims recapture Jerusalem, three great kings of Europe vow to regain the Holy City: King Richard the Lionhearted of England, King Philip of France, and the Emperor Frederick of Germany. Despite winning many battles in this third crusade and capturing the city of Acre, they fail to win back the city of Jerusalem. King Louis of France launches the last crusade, but dies before achieving his objective. Throughout the narrative we meet all sorts of men. Some, like Bohemond and Baldwin, fight for selfish ends; others, such as Tancred and Louis, do battle like the great knights they are; while a few, Francis among them, carry goodwill wherever they go."}]