[{"id": "1598450522", "genre": "Children's Books", "title": "Thomas Edison: Wizard of Light And Sound (Inventors Who Changed the World)", "description": "Explores the life and work of Thomas Edison, including his childhood, education, and invention of such items as the phonograph, light bulb, and kinetoscope."}, {"id": "1417677600", "genre": "Children's Books", "title": "Hamster Champs (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Three daredevil hamsters devise a stunt with the help of a ramp and a protractor to measure the angles to keep them one step ahead of Hector the cat."}, {"id": "074870650X", "genre": "Children's Books", "title": "Q. Science: Communications - Listen", "description": "A book in the \"Communications\" theme of the \"QScience\" series. It is a story book, told principally through pictures and with minimal text, which describes different sounds heard by children in their everyday lives. Readers are encouraged to imitate many of the sounds themselves."}, {"id": "155453786X", "genre": "Children's Books", "title": "Franklin's Halloween", "description": "Franklin and his friends are excited about the Halloween party. But things get scary when Franklin begins to think that there might be a real ghost at the party in this Franklin Classic Storybook."}, {"id": "0688040454", "genre": "Children's Books", "title": "Mufaro's Beautiful Daughters (Reading Rainbow Books)", "description": "A Caldecott Honor and Reading Rainbow book, this memorable retelling of Cinderella is perfect for introducing children to the fairy tale as well as the history, culture, and geography of the African nation of Zimbabwe.Inspired by a traditional African folktale, this is the story of Mufaro, who is proud of his two beautiful daughters. Nyasha is kind and considerate, but everyone—except Mufaro—knows that Manyara is selfish and bad-tempered.When the Great King decides to take a wife and invites the most worthy and beautiful daughters in the land to appear before him, Mufaro brings both of his daughters—but only one can be queen. Who will the king choose?Award-winning artist John Steptoe’s rich cultural imagery of Africa earned him the Coretta Scott King Award for Mufaro’s Beautiful Daughters. The book also went on to win the Boston Globe-Horn Book Award. This stunning story is a timeless treasure that readers will enjoy for generations.Coretta Scott King Award for IllustrationCaledcott HonorReading Rainbow BookBoston Globe-Horn Book"}]