[{"id": "0152005986", "genre": "Children's Books", "title": "The Space Atlas", "description": "Here is an astronomical overview that takes young readers on a thrilling guided tour of our universe. This informative book features Earth, its artificial satellites, the moon, the planets, stars, asteroids, and comets. With double-page spreads of maps, photographs, easy-to-read charts, and diagrams, The Space Atlas offers an exciting way to learn about the cosmos."}, {"id": "0756955408", "genre": "Children's Books", "title": "No Bones about It (Katie Kazoo, Switcheroo (Pb))", "description": "The class 3A trip to the Natural History Museum is turning out to be a disaster: Many of Katieas excited classmates are acting up, and they turn on Katie and call her a goodie-goodie when she wonat join in! Even worse, their tour guide, Mr. Weir, is a big meanie! Still, when Katie turns into Mr. Weir and causes a big disaster of her own, itas up to her to make things rightaand save Mr. Weiras job!"}, {"id": "0525470247", "genre": "Children's Books", "title": "Go Fly a Bike! The Ultimate Book of Bicycle Fun, Freedom, and Science", "description": "A funny and comprehensive guide, Go fly a Bike! is crammed with everything a rider wants to know about his or her favorite sport. A bicycle is the kids vehicle-from about age six until they drive cars, kids play, socialize, compete, explore, sense freedom, and ride to school on bikes.  This is the book for them-and there's nothing like it available.  From how bikes work to the coolest BMX stunts, from crucial safety information to a step-by-step guide for planning the perfect bike hike, this expertly organized book has something for all readers, whether their interest lies in history, trivia, physics, extreme sports, or just a quick spin around the block.   "}, {"id": "B00085KDE0", "genre": "Children's Books", "title": "Babar and Zephir,", "description": "In the most fantastical of the classic Babar stories, we follow Zephir, Babar’s monkey friend, home on school holiday. The monkey princess, Isabelle, has been kidnapped by the horned monster Polomoche, and everyone is very worried. But Zephir, with the help of a tiny mermaid named Eleanore, is certain that he can save the princess himself."}, {"id": "1432922726", "genre": "Children's Books", "title": "Is It Living or Nonliving? (Living and Nonliving)", "description": "'Is It Living or Nonliving?' introduces young learners to the characteristics of living and nonliving things in different habitats around the world. Readers learn to determine whether something is living or nonliving by asking a series of simple questions. This Acorn Read-Aloud title is an excellent tool for introducing young learners to the differences between living and nonliving things."}]