[{"id": "1621574709", "genre": "Children's Books", "title": "Freddy the Frogcaster and the Flash Flood", "description": "Freddy the Frogcaster and his friends are hoping for rain. Their town of Lilypad is dry, and plants and trees are brown because of a terrible drought. Freddy gets excited as he sees a storm coming that could bring water to thirsty trees and grass. He leaps into action to warn everyone to \"be prepared!\" Suddenly there’s a change in the forecast that could affect everyone’s plans―and make Freddy wonder if he’s meant to be a frogcaster. Sometimes valuable life lessons can be learned from making mistakes. Once again, award-winning meteorologist Janice Dean introduces young readers to different weather conditions and gives valuable information to help them understand and avoid dangerous weather situations. The fifth title in this series, Freddy the Frogcaster and the Flash Flood, explains droughts, storms, floods, and flash floods, and encourages kids of all ages to be weather ready, just like our friend Freddy!"}, {"id": "0142414123", "genre": "Children's Books", "title": "Three Cups of Tea: One Man's Journey to Change the World... One Child at a Time (Young Reader's Edition)", "description": "This young readers edition of the worldwide bestseller Three Cups of Tea has been specially adapted for younger readers and updated by Greg Mortenson to bring his remarkable story of humanitarianism up to date for the present. Includes new photos and illustrations, as well as a special interview by Greg’s twelve-year-old daughter, Amira, who has traveled with her father as an advocate for the Pennies for Peace program for children."}, {"id": "1550289837", "genre": "Children's Books", "title": "SK8ER (Lorimer Sports Stories)", "description": "Jordy Lee and his friends spend all their free time on their skateboards, navigating the crowded streets of Toronto's Kensington Market. They are thrilled when a new skateboarding park opens and offers a youth competition with a rich prize. The talented Alisha might be able to coach Jordy to a win, but what will his friends think about Jordy getting advice from a cute girl?  Steven Barwin is a novelist, television writer, and teacher. His previous Sports Stories novels, Slam Dunk and Roller Hockey Blues, were both Canadian Children's Book Centre Our Choice selections. He lives in Toronto, Ontario with his family."}, {"id": "0805021345", "genre": "Children's Books", "title": "Seven African Amercian Scienti (Achievers : African Americans in Science and Technology)", "description": "Examines the lives and achievements of seven black Americans who left their mark through scientific work, from Benjamin Banneker to Matthew Henson"}, {"id": "0152010289", "genre": "Children's Books", "title": "Verdi", "description": "Young Verdi doesn’t want to grow up big and green. He likes his bright yellow skin and sporty stripes. Besides, all the green snakes he meets are lazy, boring, and rude. When Verdi finds a pale green stripe stretching along his whole body, he tries every trick he can think of to get rid of it--and ends up in a heap of trouble. Despite his efforts, Verdi turns green, but to his delight, he discovers that being green doesn’t mean he has to stop being himself. “Cannon is on a roll, her gift for creating memorable characters and scenes on glorious display in this tale of a feisty python hatchling.”--Publishers Weekly"}]