[{"id": "B01J6FFI6A", "genre": "Children's Books", "title": "The Wither Trials (Book 1): The Portals (An Unofficial Minecraft Book for Kids Ages 9 - 12 (Preteen)", "description": "GENRE: Children’s Adventure(An Unofficial Minecraft Book for Kids Ages 9 - 12 (Preteen)Book 1: The Portals Herobrine has brought to life a creature of legends: the Wither.Under the promise of an ancient artifact known as the Nether Star, Herobrine has tasked the Wither to three tasks, the first of which is to light some portals scattered across the Overworld. But this will be no easy task for the Wither, as each portal is heavily guarded by the wits and magic of the one known as Steve. How will the Wither ever compete with the powers of Steve himself?Other books in this amazing series:Book 1: The Portals, https://www.amazon.com/dp/B01J6FFI6A/Book 2: The Fortress, https://www.amazon.com/dp/B01J6FFKKO/Book 3: The Battle, https://www.amazon.com/dp/B01J6FFM3E/Author’s Note: This short story is for your reading pleasure. The characters in this \"Minecraft Adventure Series\" such as Steve, Endermen or Herobrine...etc are based on the Minecraft Game coming from Minecraft ®/TM & © 2009-2013 Mojang / Notch"}, {"id": "0976408252", "genre": "Children's Books", "title": "Yes, I Can!: The Story of the Jamaican Bobsled Team", "description": "The story of the original Jamaican Bobsled Team is one about having the courage to pursue your dreams, persevering in the face of all difficulties and defining success in your own terms. When Devon Harris, Michael White, Dudley Stokes and Christian Stokes decided to follow their dreams to the Olympics they knew nothing about their sport and had only a few months to get ready. Ice? They didn t have any. Jamaica is a tropical island famous for sun ,sea and surf, Support? They didn t have any. Many people laughed at them and thought they were a joke. Money? They didn t have any . They sold T-shirts to raise the funds they needed. Equipment? They didn t have any. They rented an old inferior sled in order to compete Olympic dreams die hard. With dogged determination and a belief in themselves and each other they did the impossible by qualifying as the members of their nation s first Winter Olympic Team. With personal and national pride on the line these underdogs competed fiercely at the 1988 Winter Olympic Games in Calgary, Canada. The awesome foursome didn t win a medal but they won the heart of the entire world. They have taught us that we can still succeed against seemingly insurmountable odds if we believe in ourselves and say Yes, I Can! Here s to following your dream!"}, {"id": "1546572104", "genre": "Children's Books", "title": "Wordsearch for Kids: Minecraft Edition (Unofficial)", "description": "A fun puzzle book packed with wordsearches for Minecraft fans. Full solutions are provided, and to suit children of all ages, there are three difficulty levels too! Will provide hours of entertainment for kids who love the massively popular video game."}, {"id": "0062398814", "genre": "Children's Books", "title": "Frazzled #2: Ordinary Mishaps and Inevitable Catastrophes", "description": "Abbie Wu is FRAZZLED as she navigates locker thieves, diabolical cats, and other hazards of middle school.This is the second book in a New York Times bestselling graphic novel series that NPR's All Things Considered called \"hilarious\"!Things are looking up for Abbie Wu: this year she’ll run for class president and get a brand-new shiny locker. Until—she doesn’t…In her second tumultuous misadventure, Abbie Wu tackles more unbelievably unfair and calamitous middle school days. From facing locker thieves and battling diabolical cats to having absolutely no idea what to build for her science project, Abbie Wu is still in perpetual crisis. From author and professional doodler Booki Vivat, this second story follows Abbie Wu, your favorite hilariously neurotic middle school girl, as she tries to come up with solutions to what seems to be a series of inevitable catastrophes.Akin to Smile by Raina Telgemeier, Frazzled: Ordinary Mishaps and Inevitable Catastrophes is heavily illustrated, embarrassingly honest, and sure to appeal to anyone hoping to figuring out how to survive the ordinary mishaps of middle school."}, {"id": "1974318095", "genre": "Children's Books", "title": "Best Coach Ever: Football Coach Gifts (Football Notebook Journal)(Football Books For Kids)(V12)", "description": "The Best Gift Ever For Football CoachesDo you have that special football coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your football coach will appreciate the thoughtful gift and use it for seasons to come. Or he will spike it into the dirt in excitement when you get a touch down or make the game winning tackle.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any football player’s tastes. Great football books for kids to give as gifts.Grab your football notebook journal today. "}]