[{"id": "1452118140", "genre": "Science Fiction & Fantasy", "title": "How to Speak Klingon: Essential Phrases for the Intergalactic Traveler (Star Trek)", "description": "Master the harsh, guttural language of Klingon with this indispensable audio phrasebook. This amusing and enlightening primer on ill-tempered and proud Klingon culture uses a built-in sound module to teach readers an array of crucial compliments (\"You bludgeon divinely.\"), toasts (\"Today is a good day to die\"), and insults (\"Your mother has a smooth forehead\") as well as phrases used commonly in intergalactic travel (\"Passport? My fist is my passport!\"), theatergoing (\"Two for Romulan and Juliet\"), and more. Illustrated scenarios set the scene and offer additional useful phrases, making How to Speak Klingon an essential guide for any Star Trek® fan."}, {"id": "0819566659", "genre": "Science Fiction & Fantasy", "title": "Caesar's Column: A Story of the Twentieth Century (Early Classics of Science Fiction)", "description": "Published in 1890, Caesar's Column is an account of a trip to New York City in 1988 by a visitor from the Swiss colony of Uganda. The great metropolis dazzles with its futuristic technology, but its ostentatious wealth and luxury mask the brutal repression of the laboring classes by their rich bosses. The workers, aided by international terrorists, stage a violent revolt and the narrator flees the devastated city by airship to found an agrarian utopia in Africa. Fueled by outrage at social conditions, Caesar's Column was the first major dystopian novel in the English language. Its author, Ignatius Donnelly, was the most famous--and controversial--American populist politician of the day, and his book became a huge bestseller and was often compared to such utopian works as Edward Bellamy's Looking Backward (1888) and William Morris's News from Nowhere (1890). This Wesleyan edition includes an insightful introduction and notes by Nicholas Ruddick."}, {"id": "0765354675", "genre": "Science Fiction & Fantasy", "title": "Cadmian's Choice: The Fifth Book of the Corean Chronicles (Corean Chronicles, Book 5)", "description": "L. E. Modesitt, Jr., author of the bestselling Saga of Recluce fantasy series, opens the door into a marvelous new world.Millennia ago, a magical disaster caused the fall of a great worldwide civilization, the end of a golden age. New civilizations have fought their way up from the ancient destruction and chaos, knowing little of the lost world that preceded them or the details of its fall. Corus today is a world of contending countries, of humans, but also of strange animals and supernatural creatures. It is a place of magical powers, and of a few people who are talented enough to use them.The time is fast approaching for the transfer of the whole population from the old world, nearly bled dry of life force, to Corus. But neither Dainyl and the other Alectors (who will be reduced in status when the real powers arrive) nor Mykel and the local humans (who seem destined to become little more than cattle) are ready.The Corean ChroniclesLegaciesDarknessesSceptersAlector’s ChoiceCadmian’s ChoiceSoarer’s ChoiceThe Lord-Protector’s DaughterLady-ProtectorOther series by this author:The Saga of RecluceImager PortfolioThe Spellsong CycleThe Ghost BooksThe Ecolitan Matter"}, {"id": "0345356365", "genre": "Science Fiction & Fantasy", "title": "3: The Wishsong of Shannara (The Shannara Chronicles)", "description": "ONE OF THE MOST POPULAR FANTASY TALES OF ALL TIME. NOW AN EPIC SPIKE TV SERIES.   An ancient evil is stirring, intent on the complete destruction of all life. The Druid Allanon sets out on a dangerous journey to save the world, reluctantly aided by Brin Ohmsford, daughter of Wil Ohmsford—for she alone holds the magic power of the wishsong. But a prophecy foretells doom, as evil nurses its plan to trap the unsuspecting Brin into a fate far more horrible than death.   Praise for Terry Brooks   “Shannara was one of my favorite fictional worlds growing up, and I look forward to many return trips.”—Karen Russell, author of Swamplandia!   “If Tolkien is the grandfather of modern fantasy, Terry Brooks is its favorite uncle.”—Peter V. Brett, author of The Skull Throne   “A great storyteller, Terry Brooks creates rich epics filled with mystery, magic, and memorable characters.”—Christopher Paolini, author of Eragon"}, {"id": "0853235945", "genre": "Science Fiction & Fantasy", "title": "Narrating Utopia: Ideology, Gender, Form in Utopian Literature (Liverpool Science Fiction Texts and Studies LUP)", "description": "Utopian societies exhibit a variety of ways of organizing the financial, political and emotional relationships between people. For all this diversity, however, one thing that exhibits far less variation is the story, the framing narrative that accounts for how the narrator reaches the more perfect society and obtains the opportunity to witness its distinctive excellences. Narrating Utopia is about that story, the curious hybrid of the traveler’s tale and the classical dialogue that emerges in the Renaissance, but whose outlines remain clearly apparent even in some of the most recent utopian writing.\"... a well-written and worthy addition to the filed of utopian studies.\"—SFRA Review"}]