[{"id": "1495931919", "genre": "Children's Books", "title": "The Adventure's Of Braylon Whiskers", "description": "This is a story of a young bunny rabbit who is chosen by the Easter bunny to take his place for this Easter by doing his job and making sure the Easter egg's are hidden for the children,but he run's into a huge peril on the way."}, {"id": "B00LPPEOD8", "genre": "Children's Books", "title": "Twenty-Four Vincent van Gogh's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Vincent van Gogh's Paintings. Twenty-Four Vincent van Gogh's Paintings for Kids There are colorful, youthful, and inspirational."}, {"id": "0061689580", "genre": "Children's Books", "title": "All We Know", "description": "New York Times bestselling artist Jane Dyer and acclaimed author Linda Ashman collaborate on this tender story of a mother’s unconditional love for her child.A seed knows how to sprout. A lamb knows how to bleat. A bee knows where the nectar is to make the honey sweet. Stars shine, seasons change, and waves rise and fall. Invoking the majestic beauty of the natural world, a mother affectionately explains that some things just come naturally—like a parent’s love.  With poignant illustrations and a timeless theme, All We Know celebrates discovery, new life, and above all, the love between parent and child."}, {"id": "1442494468", "genre": "Children's Books", "title": "Olivia Helps with Christmas (Classic Board Books)", "description": "Everyone’s favorite piglet helps to make the holiday season brighter than ever in this board book edition of an Olivia favorite....Not a piglet was stirring. Well, maybe just one. Christmas is coming, and Olivia is incredibly busy. She has to wait for Santa, make sure Dad sets up the tree, watch Mom make the Christmas dinner, oversee the care with which the stockings are hung, and, of course, OPEN HER PRESENTS! Whew, being helpful during the holidays is exhausting! Lovingly told and lavishly illustrated, this board book edition of Olivia Helps with Christmas is the perfect stuffing for any stocking."}, {"id": "1496197380", "genre": "Children's Books", "title": "Gilbert the Grasshopper", "description": "Gilbert the Grasshopper is the tale of an overly curious grasshopper… who ends up on an airplane! This book is designed to be a crossover book for those children that are attempting to graduate from pictured storybooks to chapter-length books. With simple, black-and-white illustrations on each page, kids will focus on the words. And with the book being broken up into short chapters, confidence in reading will increase with each page. The authors use alliteration throughout, introducing new vocabulary to prepare children for intermediate school. Gilbert the Grasshopper also sparks a child's interest in travel and exploring new places… along with the theme of sharing your knowledge with others."}]