[{"id": "B005GLJGP8", "genre": "Children's Books", "title": "Famous Men of the Middle Ages", "description": "Famous Men of the Middle Ages features attractive biographical sketches of thirty-five of the most prominent characters in the history of the Middle Ages, from the barbarian invasions to the invention of the printing press. Each story in this book by John Haaren is told in a clear, simple manner, and is well calculated to awaken and stimulate the youthful imagination. Notable characters featured in Famous Men of the Middle Ages include Attila the Hun, Charlemagne, William the Conqueror, Frederick Barbarossa, Marco Polo, and William Tell. Somewhat surprisingly, Famous Men of the Middle Ages also includes a chapter about one woman: Joan of Arc."}, {"id": "B005M4C28M", "genre": "Children's Books", "title": "I'm a Scientist: Kitchen", "description": "Super-sized science in bite-sized guides, each book in this new series for younger readers contains spreads featuring fun, kid-friendly experiments with lift-the-flap conclusions. I'm a Scientist: Kitchen introduces kids to a wealth of experiments they can do right in their own kitchen."}, {"id": "0431178968", "genre": "Children's Books", "title": "Ramps and Wedges (Very Useful Machines) (Very Useful Machines)", "description": "What are ramps and wedges? How do ramps and wedges work? Why do highways have so many ramps? For the answers to these and many other questions, read Ramps and Wedges. See how wedges are actually two ramps put together. Find out about ramps that have strange shapes. Discover how your teeth work like wedges. This book describes what ramps and wedges are and how they work, different types of ramps and wedges and their uses, and other facts about these simple machines."}, {"id": "B008SLFMAQ", "genre": "Children's Books", "title": "Arthur the King (Hopscotch Adventures)", "description": "Delightful stories under 400 words provide new readers with books they can read independently. Based on well-known stories such as Robin Hood and King Arthur, these stories provide a good foundation for further literacy development."}, {"id": "1491485868", "genre": "Children's Books", "title": "Hockey Stats and the Stories Behind Them: What Every Fan Needs to Know (Sports Stats and Stories)", "description": "A fun and smart look at hockey, this book will allow young fans to better understand and enjoy the game. The text explains the common statistics used to judge players and teams, along with the math and history behind those stats."}]