[{"id": "0613563697", "genre": "Children's Books", "title": "Figure Skating Champions", "description": "  Figure skaters are jumping higher, skating faster and pushing artistic and technical boundaries like never before. Figure skating is one of the most popular events at the Olympic Games, with millions more watching on television around the world.    Everyone who watches the events and follows the champions will welcome this book, which contains the very best breathtaking photographs taken at ringside at the world's greatest competitions including the Salt Lake City 2002 Winter Olympics.    Complete with detailed profiles, statistics and the exciting stories behind today's figure skating stars, Figure Skating Champions is an exciting look at today's biggest figure skating stars including:    Michelle Kwan  Sarah Hughes  Elvis Stojko  Todd Eldredge  Jamie Salé and David Pelletier  "}, {"id": "1608863573", "genre": "Children's Books", "title": "Peanuts Vol. 3", "description": "The latest heartfelt collection of brand-new Peanuts adventures and classic Charles Schulz strips!The entire gang has a chance to shine in this brand new volume of all-new PEANUTS adventures and classic Charles Schulz strips. Featuring stories starring the Flying Ace, Linus, Lucy, Pig-Pen, Schroeder, Sally, Marcie, Franklin, Peppermint Patty, Rerun, and of course, Good Ol' Charlie Brown. Good grief!"}, {"id": "1974321355", "genre": "Children's Books", "title": "Best Coach Ever: Soccer Coach Gifts (Soccer Notebook Journal)(Soccer Books For Kids)(V37)", "description": "The Best Gift Ever For Soccer CoachesDo you have that special Soccer coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your Soccer coach will appreciate the thoughtful gift and use it for seasons to come.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any Soccer player’s tastes. Great Soccer books for kids to give as gifts.Grab your Soccer notebook journal today. "}, {"id": "0870686550", "genre": "Children's Books", "title": "Joseph and Me: In the Days of the Holocaust", "description": "The author describes her experiences as a Jewish child living in hiding with a Dutch family in Amsterdam during World War II. Additional text and illustrations include further details of the Nazi persecution of the Jews and the fate of those that survived."}, {"id": "1423112245", "genre": "Children's Books", "title": "Disney High School Musical: Along for the Ride", "description": "Now High School Musical fanatics can find out what it's like to be behind the scenes of the High School Musical Concert Tour. Disney High School Musical: Along for the Ride is a backstage pass to all the fun and excitement that takes place in front of and behind the curtains. It's filled with dozens of photos of all the stars, including Ashley Tisdale, Corbin Bleu, Vanessa Anne Hudgens, and Lucas Grabeel, all taken by a professional photographer--who just so happens to be Lucas's best friend! See the performers onstage, Ashley in her dressing room, Vanessa getting her makeup done, and much, much more!"}]