[{"id": "B00BEZ056O", "genre": "Children's Books", "title": "How to Draw Birds (how to draw comics and cartoon characters Book 10)", "description": "how to draw birds step by stepthis drawing book will teach you how to draw birds step by step easily.40 pages will teach you how to draw all you need to know about drawing birds. if you are interested in drawing of birds or birds drawing step by step than this is the best book for you and it will teach you how to draw all kinds of birds in an way step by step using a unique and the most simple techniquethe author and illustrator Amit Offir teaches you to draw and succeed in a short time even if you dont know how to draw at all!everybody can draw and now you can too!a unique technique that will give you great drawing tools and lead you to success.recommended for age 6 and all ages (for adults that want how to draw easily also)in this book you will learn how to draw birds, cartoon characters and comicsfigures that will help you to draw anything you like in the subjectthis is a practical guide for anyone that love drawing and illustrating"}, {"id": "B002RAR2Y8", "genre": "Children's Books", "title": "Who's That Knocking on Christmas Eve?", "description": "Every year, trolls knock down Kyri's door and gobble up her Christmas feast. But this year, the trolls are in for a surprise: a boy and his pet ice bear on their way to Oslo have come in from the cold. And once the ice bear is finished with the trolls, you can bet they won't come knocking next Christmas Eve!  Once again, Jan Brett creates an original Christmas story full of warmth and magic. Featuring beautiful borders, intricate illustrations, and a stunning display of the Northern Lights, Who's That Knocking on Christmas Eve? will rightfully take its place among Jan's Christmas favorites with the whole family."}, {"id": "1550373528", "genre": "Children's Books", "title": "Hairs on Bears", "description": " This book is a galloping romp through silly-rhyme-land. Geraldine Ryan-Lush wields a jolly pen; the trials of the calamitous shedding dog, and allergy sufferers vs. pet lovers, are told in a rollicking style that never lets up:  Hairs on fingers hairs on toes hairs right up Aunt Bertha's nose  Now you see them now you don't Now guests come and now they won't.  Normand Cousineau's outrageous, stylized illustrations, with deep saturated colors, never fall a single step behind. They reflect and enrich the uproarious fun of the poem to perfection. As a special bonus, the endpapers have been designed for use as a board game - a \"snakes and ladders\" course incorporating the elements of the story. It can be played with checker pieces and a die. "}, {"id": "1599612232", "genre": "Children's Books", "title": "Robert Gould's Time Soldiers", "description": "Follows the adventures of the time soldiers as they save a tyrannosaurus rex, rescue a sea captain's daughter, and encounter thieves and an angry pharaoh."}, {"id": "0330370626", "genre": "Children's Books", "title": "Unzip Your Lips", "description": "This paperback edition contains 100 poems to say aloud, from contemporary poets including Charles Causley, Brian Patten, and Brian Moses. The book fe atures one poem by each poet."}]