[{"id": "1941588352", "genre": "Science Fiction & Fantasy", "title": "Dreamdrifter (Sylvan Cycle) (Volume 2)", "description": "The full moon revealed the beast within her. Now she has become the monster they most fear. Katja’s skinshifting abilities are becoming more powerful, and more dangerous. A rare madness is overtaking the werecat’s mind, making her more savage and unpredictable with each full moon. As war rages on the Sylvan Continent, Katja and her allies must seek out the sacred Keystones and use their power against the deadwalkers. How can Katja defend her packmates from the dangers of their new journey when she can’t even protect them from herself? What hope does she have for a cure when a vampire carries the key to recovering her sanity?"}, {"id": "1521054460", "genre": "Science Fiction & Fantasy", "title": "Dream Static", "description": "When successful environmental prosecutor, Angela Bane, goes in for her annual synaptic backup, she's just as reluctant as always. After all it's just a routine procedure. Until she wakes up twenty-two years later in a chaotic surgery room, disoriented and unable to speak. As she slowly recovers from the Resus operation and learns about her fate, she struggles to deal with a world that's gone on without her. Her father's dead, her fiance, Jordan, has become an old man in her \"absence,\" and her body hasn't aged at all since the day it was littered with bullets. With no memory of her murder and no bearings in this place and time, Angela begins both physical and emotional therapy to try and adjust. Unable to deal with the chasm of time that's opened up between them, she sends Jordan away determined to suffer in solitude. Then the dreams begin. A dark parking garage, a close colleague, and the obscured face of a man lifting his gun and pointing it in their direction. Could she actually be remembering something that happened after her backup? \"It's called Dream Static. Sometimes the old brain tissue still retains bits of memories and, upon reanimation, those synapses can connect and reincorporate with the ones that were backed up.\" Before long, someone comes to visit her in the hospital. A dark brooding presence, Maddox was the original detective assigned to her murder. And now that she's alive, maybe, just maybe she holds the key to bringing the man responsible to justice. Over time, the dreams bring Angela closer and closer to finding the identity of her killer. As her heart draws her closer and closer to Detective Maddox. And in the end the killer might just find her… Again."}, {"id": "1624560296", "genre": "Science Fiction & Fantasy", "title": "The Selling of Suzee Delight (Tales from The Longview)", "description": "When slavery is virtue, who will fight for vice? When Suzee Delight, famous Cheegoth courtesan, murders the five most powerful Pact Worlds' Administrators during a private summit, the owner of The Longview Death Circus struggles against conspiracy to win the bidding for her execution. Meanwhile, Suzee’s powerless supporters race to save her, while the leaders of worlds pull strings to guarantee her death. The TALES FROM THE LONGVIEW Series Overview Inhabited by a crew of misfits fleeing nightmare pasts, with a cargo of Condemned slated to die at the hands of the highest bidders, and with a passenger roster made up exclusively of people not who they claim to be, The Longview serves the hidden agenda of an eccentric recluse bent on playing puppetmaster to all of Settled Space."}, {"id": "1523863862", "genre": "Science Fiction & Fantasy", "title": "The Gates of Iron (The Absent Gods) (Volume 3)", "description": "The Frostmarch has come!    Shanis Malan must unite her broken country and unlock the secret of the Silver Serpent. With Galdora at war, Larris must unravel a conspiracy that threatens his nation from the inside. Oskar enters the order of saikurs, but does the secret to victory over the Ice King lie hidden behind the Gates of Iron?    Powerful forces collide and secrets are revealed in the thrilling conclusion to The Absent Gods!       “A enjoyable blend of adventure, intrigue, and humor. Fans of Terry Brooks and David Eddings could easily enjoy The Silver Serpent.” Fantasy Book Critic      “A superb story told believably and unpretentiously by a superb new author.” Hugo Award Winner Ron Miller"}, {"id": "B00VXWO2C6", "genre": "Science Fiction & Fantasy", "title": "Outcaste: A Tale of Alterra: Undiscovered Realms", "description": "As the desert folk are fond of saying, “The Wheel Turns.” Mindless evil cannot hold sway forever, as five small but determined clans have realized. Different from their forebears, they seek to climb from the pit into which they were cast—to live in peace—and for that they are named “Outcaste.”  They run, hide, and move on, pursued relentlessly by their evil brethren.  There are not many hiding places left.  Only one young Outcaste has summoned the strength to seek aid from his former enemies, for he has nowhere else to turn. But how can he convince them, given what they have suffered?  He stands before them a twisted, ugly creature, asking for their help, putting his life—and the lives of all his people—in their hands.  To aid the Outcastes, everyone must put their fears aside. Can the Unforgivable be forgiven?"}]