[{"id": "0750284420", "genre": "Children's Books", "title": "10 Minute Crafts: No-Bake Makes", "description": "Make tasty cakes and delicious biscuits without turning on an oven! Easy-to-follow, step-by-step instructions show children aged 5+ how to bake their way through the book, creating and improvising as they go, to create a range of tempting treats.Learn how to make chocolate-drizzled lemon meringue bite, create sprinkle-covered cake pop bites and prepare rocky road packed with marshmallows and chocolate chips!Using readily available and seasonal ingredients, the 10 Minute Crafts series is packed full of fun crafts for special occasions. The perfect tool for teachers looking for original ideas as well as parents looking for fun ways to keep kids entertained."}, {"id": "0778704653", "genre": "Children's Books", "title": "Life in an Anishinabe Camp (Native Nations of North America)", "description": "Introduces the daily life, customs, and culture of the Anishinabe people who lived in the Western Great Lakes region of North America."}, {"id": "B01AWVKOFC", "genre": "Children's Books", "title": "Forest Secrets: A Magical Mystery Novel", "description": "The half-tree, half-human beings lived a secret existence deep in the old growth forest.Until now.When 11-year old Daisy Castillo discovers a plot to destroy the forest, she tries to halt the approaching evil while keeping these magical creatures from being discovered.But danger waits in every shadow. For if these corrupt men succeed, the Forest People will die. A few surprises are in store, as some unknown and undiscovered friendships hold the key to her success. Fate hangs in the balance as Daisy faces her deepest fears, including heartbreak from the past, to rise up against all odds.Suspenseful, mysterious, and full of danger, Forest Secrets captures the enchantment of nature and the power of friendship in this classic tale of good vs. evil."}, {"id": "1402288735", "genre": "Children's Books", "title": "Ava and Taco Cat (Ava and Pip)", "description": "Ava desperately wants a pet for her eleventh birthday-but gets way more than she bargained for when she adopts T-A-C-O-C-A-T.  When Ava Wren hears about an injured yellow tabby with mismatched ears, she becomes obsessed and wants to rescue him. She even picks out a perfect palindromic name: T-A-C-O-C-A-T. But when Taco joins the family, he doesn't snuggle or purr-all he does is hide. Worse, Ava's best friend starts hanging out with Zara, a new girl in fifth grade. Ava feels alone and writes an acclaimed story, \"The Cat Who Wouldn't Purr.\" What begins as exciting news turns into a disaster. How can Ava make things right? And what about sweet, scared little Taco? The New York Times called AVA AND PIP \"a love letter to language. \" With this second diary, Girls' Life advice columnist Carol Weston hits another home run. "}, {"id": "1570915652", "genre": "Children's Books", "title": "The ABC Book of American Homes", "description": "Houses in trees, houses on water, houses with wheels! America is a country of diverse people who live in all types of homes--homes made of wood, metal, glass, even snow! In the desert, on a farm, or by the beach, American houses have only one thing in common--they provide shelter and comfort to those who live in them. No matter the size, shape, or location, they are places to call home. This alphabetical survey spans over three centuries of architecture. Vivid illustrations and simple, informative text introduce young readers to the limitlessness of the American imagination. Readers will not only learn about a variety of houses, from yurts to pueblos to farmhouses, but about the variety of people who inhabit them."}]