[{"id": "B01N24I944", "genre": "Children's Books", "title": "Good Night Twin Cities (Good Night Our World)", "description": "Welcome to the magnificent Twin Cities. This board book takes young readers on a tour of their cities’ most cherished destinations, including the Mississippi River, Mall of America, Stone Arch Bridge, Bunker Beach Water Park, Como Park Zoo, Fort Snelling, Minnesota State Fair, Minnesota History Center, Minnesota Children’s Museum, and more."}, {"id": "0375832246", "genre": "Children's Books", "title": "Richard Scarry's The Bunny Book (Little Golden Book)", "description": "This Richard Scarry Golden book is a bunny-rific read!A favorite Richard Scarry Little Golden Book is now in print in a gorgeous Big Golden Book edition! Long a popular Little Golden Book, the tale of a large bunny family wondering what their baby will grow up to be is one of Richard Scarry's best-and is now available in a deluxe hardcover edition. Perfect for springtime gift-giving!"}, {"id": "0531094847", "genre": "Children's Books", "title": "Malu's Wolf", "description": "Malu is permitted to raise a wolf pup which eventually is instrumental in bringing about significant changes to the lives and traditions of the young girl's Stone Age clan"}, {"id": "1936319381", "genre": "Children's Books", "title": "Little Tate and the Say Hey Glove", "description": "Little Tate is a major league rookie when it comes to baseball. He can hardly hold a baseball bat right, strikes out at the plate, and he can't even catch a pop fly with his brand new glove. Poor Little Tate gets made fun of for all of his shortcomings on the baseball field and finds it hard to fit in with his peers. With the help of his dad's old glove, and a little bit of practice, Little Tate soon learns that he has the potential to be quite the ball player, and his teammates realize that they shouldn't have been so hard on a friend that only needed some help and encouragement. Will Little Tate help his team win the big game with his new glove? Find out if he makes the catch like the 'Say Hey Kid' in centerfield!"}, {"id": "0330482661", "genre": "Children's Books", "title": "Shorts (pb)", "description": "This collection features 100 poems that are so short the reader just won't be able to forget them. They feature work by acclaimed modern poets such as Charles Causley, Brian Patten, and Benjamin Zephaniah. The poems are in various forms, and include sonnets, haikus, tankas, and couplets."}]