[{"id": "0977181839", "genre": "Children's Books", "title": "Elephants of the Tsunami", "description": "Elephants of the Tsunami, by Jana Laiz with illustrations by Tara Cafiero, is a picture book for all ages. It is the remarkable true account of eight heroic elephants of Khao Lak Beach in Phuket, Thailand, who risked death in order to save the lives of many people during the December 26, 2004 South Asian Tsunami."}, {"id": "1782853022", "genre": "Children's Books", "title": "Dinosaur Rap", "description": "A rhythmic introduction to the Triassic, Jurassic and Cretaceous eras and their prehistoric creatures combines colorful artwork with comprehensive text by a dinosaur expert, in a volume complemented by a musical recording by popular rapper, Mike Henry, Jr. Simultaneous."}, {"id": "1589478274", "genre": "Children's Books", "title": "Spelling 1 - 2: Over 2,000 Spelling Words", "description": "Grade 1 3 It’s fun to learn to spell with this bright and lively undersea game. After a quick and easy installation, a submarine takes the player to the ocean floor where vibrant sea creatures frolic around during three fun games. Before play begins, the control buttons and icons at the bottom of each screen are explained. The games are represented by a giant shell, a sunken ship, and a spooky cave."}, {"id": "B01JVE4F6K", "genre": "Children's Books", "title": "Body Goo: Volume 2, Burping: Funny Childrens Book Burp Humour", "description": "BUUU-RRRRR-PPPPP!!!Excuse me! This book will tell you everything you ever wanted to and did not want to know about burping. Why do we do burp? Are there different types of burps? Do animals burp?Your questions are answered here in the Body Goo series volume 2. A great book for children and parents Beware of the goo!!!"}, {"id": "B074FFYF2J", "genre": "Children's Books", "title": "Goodnight Pirate: Picture Books for Kids", "description": " FREE for Kindle Unlimited members! *** This picture book title features vivid, full-color layouts with Kindle Text Pop-Up ***Mom always has the perfect bedtime story for her little pirate, Timmy. Tonight's no different. She tells him the story of a great Pirate and his adventures with a wishing Star. From saving an explorer trapped in a jungle filled with dangerous animals; to outwitting a Troll guarding an imprisoned princess, this enchanting adventure will surely capture your heart.Another quality children picture book from the father and daughter team of Michael and Rachel Yu."}]