[{"id": "B00Q1W54KC", "genre": "Science Fiction & Fantasy", "title": "Seeded: Flash Fried Fiction", "description": "Five years travelling faster than light in a colony transport goes slower than you think...But, the credits are worth it.Captain Ona and her crew are ready to collect a tidy sum for delivering the Flock to Paradise. On the cusp of seeding the colony, they encounter a force that will forever change them. This is what happens when science collides with fantasy. This is a short story—flash fried for busy readers who want a tasty snack.Ever tried Flash Fiction before? This is a specialised form of fiction requiring a tight tale, squeezed into around 1500 words or less. It isn't designed to accomplish the detail a reader finds in a novel. It's purpose is to stimulate your imagination, as an entree does your appetite. Discover the origins of Oranica today!Best Selling Epic Fantasy world of the Dragon Choir Series."}, {"id": "1854870785", "genre": "Science Fiction & Fantasy", "title": "How to Write Tales of Horror, Fantasy and Science Fiction", "description": "Twenty-six writers and editors discuss the fiction market, story ideas, plotting, setting, character, naming, suspense, research, avoiding cliches, stereotypes, literary agents, manuscript submission, and editing"}, {"id": "B06XPMTF1D", "genre": "Science Fiction & Fantasy", "title": "Telling the Map: Stories", "description": "There are ten stories here including one readers have waited ten long years for: in new novel-la The Border State Rowe revisits the world of his much-lauded story The Voluntary State. Competitive cyclists twins Michael and Maggie have trained all their lives to race internationally. One thing holds them back: their mother who years before crossed the border \u0085 into Tennessee.Praise for Christopher Rowe:\u0093Rowe’s stories are the kind of thing you want on a cold, winter’s night when the fire starts burning low. Terrific.”\u0097Justina Robson (Glorious Angels)\u0093As good as he is now, he’ll keep getting better. Read these excellent stories, and see what I mean.”\u0097Jack Womack (Going, Going, Gone)\u0093Rowe’s work might remind you of that of Andy Duncan. Both exemplify an archetypically Southern viewpoint on life’s mysteries, a worldview that admits marvels in the most common of circumstances and narrates those unreal intrusions in a kind of downhome manner that belies real sophistication.”\u0097 Asimov’s\u0093As smooth and heady as good Kentucky bourbon.”\u0097 LocusChristopher Rowe’s stories have been finalists for the Hugo, Nebula, World Fantasy, and Theodore Sturgeon awards, frequently reprinted, translated into a half-dozen languages, praised by the New York Times Book Review, and long listed in the Best American Short Stories. He holds an MFA from the Bluegrass Writer’s Studio. Rowe and his wife Gwenda Bond co-write the Supernormal Sleuthing Series for children, and reside in a hundred-year-old house in Lexington, Kentucky."}, {"id": "1588461696", "genre": "Science Fiction & Fantasy", "title": "Fantasy Dice: Scarred Lands", "description": "This box contains a complete set of dice perfect for use in your fantasy campaign. It also comes with a felt bag emblazoned with the Scarred Lands logo. Contents: 1 twenty-sided die, 2 ten-sided, 1 twelve-sided, 1 eight-sided, 3 six-sided, 1 four-sided and 1 felt bag."}, {"id": "1427040850", "genre": "Science Fiction & Fantasy", "title": "1: The Pursuit of the Well-Beloved", "description": "Books for All Kinds of ReadersReadHowYouWant offers the widest selection of on-demand, accessible format editions on the market today. Our 7 different sizes of EasyReadT are optimized by increasing the font size and spacing between the words and the letters. We partner with leading publishers around the globe. Our goal is to have accessible editions simultaneously released with publishers' new books so that all readers can have access to the books they want to read. To find more books in your format visit www.readhowyouwant.com"}]