[{"id": "1416959106", "genre": "Children's Books", "title": "Guess Who?: A Foldout Valentine's Adventure", "description": "Please, don’t paws. Be mine right now… and I’ll show my love with a soft . . . meow. Guess who? I'm a kitten!In this adorable board book, kids can read the riddles and unfold the pages for a giant 14 x 14 inch surprise! The clues on each page hint to which furry, feathered and flippered friend wants to be their valentine. Clever rhymes and big, bold photographs of adorable frogs, kittens, skunks, and even a toothy shark make this book an interactive delight for all!"}, {"id": "1403488983", "genre": "Children's Books", "title": "Election Day (Holiday Histories)", "description": "It is the first Tuesday after the first Monday in November and there are signs on lawns and windows and grown-ups coming in and out of your school. But do you know why? It's Election Day, of course! Turn the pages of this book to find out: who can vote, who can be president, why it is important to vote. Each book in the Holiday Histories series describes one of America's holidays or special days. Explore the history of each day and learn the real reason why it is important. Discover what special meaning each day might have for you."}, {"id": "B00SFZU1GK", "genre": "Children's Books", "title": "The Three Elephants and The Case of the Mysterious Ship: A poem about greed and disunity", "description": "This is a short poem for children which teaches them about greed and its unfortunate outcomes. This is a short poem and we hope that you can read this aloud to your child."}, {"id": "0062455788", "genre": "Children's Books", "title": "A Hundred Billion Trillion Stars", "description": "“This picture book is one in a gazillion.”—Jane O’Connor, the New York Times–bestselling author of the Fancy Nancy seriesDid you know that the earth is covered in three trillion trees? And that seven billion people weigh about the same as ten quadrillion ants? Our world is full of constantly changing numbers, from a hundred billion trillion stars in space to thirty-seven billion rabbits on Earth. Can you imagine that many of anything? The playful illustrations from New York Times–bestselling artist Isabel Greenberg and the friendly, straightforward voice of author Seth Fishman illuminate some of the biggest numbers in the universe—a hundred billion trillion stars—and the smallest—one unique and special YOU. Here is a book for story time, for science time, for math time, for bedtime, and all the times in between.Perfect for curious children, classrooms eager for STEM content, and readers who have devoured Ada Twist, Scientist and How Much Is a Million? "}, {"id": "0395667879", "genre": "Children's Books", "title": "The Amazing Paper Cuttings of Hans Christian Andersen", "description": "Hans Christian Andersen was a gifted artist as well as a storyteller and writer who used his many talents to escape the poverty into which he was born. Beth Wagner Brust tells the story of Hans Christian Andersen as an artist, describing how and why he made paper cuttings, which, like his tales, were innovative and original."}]