[{"id": "0884486230", "genre": "Children's Books", "title": "A Season of Flowers (Tilbury House Nature Book)", "description": "Michael Garland (Daddy Played the Blues) displays his impressive illustration range with the stylized, country-quilt, digital collage illustrations of A Season of Flowers. Snowdrops and crocuses yield to tulips and hyacinths, then dogwood blossoms, iris, lupine, daisies, morning glories, daylilies, geraniums, peonies, sunflowers, roses, and chrysanthemums as spring passes to summer, then autumn. At last the garden slumbers into winter under a blanket of snow, preparing next year’s procession of blooms. Like actors crossing a stage, flowers narrate the passing seasons in the first person, each one briefly proclaiming its unique and vital role in the natural world. Backmatter descriptions complete this child’s introduction to a garden year, in which the passage of time is vividly realized. Fountas & Pinnell Level L Color throughout"}, {"id": "B00ANYC7EA", "genre": "Children's Books", "title": "The Itaipu Dam: World's Biggest Dam (Record-Breaking Structures)", "description": "Disscusses in simple terms, the Itaipu dam, including where it is located, how it was built, and how it provides electricity."}, {"id": "0439785995", "genre": "Children's Books", "title": "Reading & Math Jumbo Workbook: Grade K", "description": "300 skill-building pages that give young learners practice with the alphabet, sight words, handwriting, phonics, numbers, shapes and everything they'll need to succeed as students. For use with Grade K."}, {"id": "1543502075", "genre": "Children's Books", "title": "Human Body Facts or Fibs", "description": "Take a look in the mirror. The human body has baffled doctors and scientists for thousands of years. Sometimes the truth is more complicated than we originally thought. Get the real facts about your body, and drop the fibs!"}, {"id": "098463987X", "genre": "Children's Books", "title": "The Adventures of Little Dooey: The Kite", "description": "Follow the adventures of Little Dooey and his friends as they race to rescue their buddy Snappy Turtle and a runaway kite. Little Dooey is one smart monkey and tries to be a helpful friend to all of his buddies! To keep up with Little Dooey and find out more about his upcoming adventures, become a friend of Little Dooey on Facebook or go to www.theadventuresoflittedooey.com."}]