[{"id": "1566866405", "genre": "Children's Books", "title": "Official Mortal Kombat Trilogy Pocket Kodes (Official Strategy Guides)", "description": " Loaded with every bone-crushing move, unmatched fighting strategy, and secret code to help you win big! Contains all the moves-fatalities, animalitites, friendships, babalities, brutalities, and special moves It's the must-have, pocket-sized guide for the serious gamer! "}, {"id": "1580235107", "genre": "Children's Books", "title": "Be Like God: God's To-Do List for Kids", "description": "Become a real superhero! Learn how to use the powers God gave you to continue the work of creation and repair the world.\"We don't have to pretend to use the powers God has given us. These powers are real and they are super! Our God shares God's powers with us so we can make our lives better and the lives of others better. When we learn how to use God’s superpowers, we become God’s partners― God’s superheroes―on earth.\"―from the IntroductionThis inspirational guide for kids ages eight to twelve is a marvel, showing them (and their families) that it’s easy to become God’s partner on earth: figure out what God does in the Bible, then do it!God creates, blesses, rests, calls, comforts, cares, repairs, wrestles, gives and forgives. For each of God’s superpowers, Dr. Ron Wolfson gives kids stories and suggestions for what might be on their own God’s to-do list― the many ways they can use their superpowers to make a difference in the lives of others, and find meaning and purpose for their own."}, {"id": "0310713390", "genre": "Children's Books", "title": "The Beginner's Bible - Fish's Big Catch (and Jonah's Second Chance) (Beginner's Bible, The)", "description": "Jonah wanted to do his own thing, even though God had a different plan. Take the journey with Jonah and the Big Fish and learn that God forgives us even when we don't obey. The Beginner's Bible is the perfect starting point for children as they discover the life and fun of the Bible, just like millions of children before."}, {"id": "1623708338", "genre": "Children's Books", "title": "Goodnight Soccer (Sports Illustrated Kids Bedtime Books)", "description": "The perfect bedtime book for young soccer fans. From the opening kickoff to the final goal, a young girl says goodnight to her most beloved sport: soccer. With delightful, rhyming text and energetic art, acclaimed author Michael Dahl (Goodnight Baseball, Goodnight Football, Goodnight Hockey), along with illustrator Christina E. Forshay, captures the thrill and excitement of the world's most popular sport. This Sports Illustrated Kids picture book will have soccer fans young and old cheering for bedtime!"}, {"id": "1481461591", "genre": "Children's Books", "title": "It's the Easter Beagle, Charlie Brown (Peanuts)", "description": "Celebrate Easter with Charlie Brown, Snoopy, and the rest of the Peanuts gang in this gorgeous retelling of the beloved Easter special!It’s almost Easter and everyone’s getting ready for the holiday with a big Easter egg hunt. When Marcie mentions she’s never colored Easter eggs, Peppermint Patty decides to show her how. After Marcie ruins two batches by frying and scrambling them, Peppermint Patty tells her the eggs must be boiled…but she forgets to tell Marcie not to crack the eggs. Marcie ends up making a big batch of egg drop soup! Now there are no eggs to be colored! Will the Easter Beagle come to the rescue before the holiday is ruined? This keepsake paperback storybook is the perfect Easter basket addition, and comes with French flaps and eye-catching embossing and foil on the cover. © 2016 Peanuts Worldwide LLC"}]