[{"id": "B00MNRK3M8", "genre": "Children's Books", "title": "Zeide! Why Are You Wearing White Tennis Shoes on Yom Kippur?", "description": "This is a Jewish children's book aimed at children aged 4 and older, especially to be read with grandparents or parents. The title and story came from a real life situation between the author (Zeide) and Bella (his granddaughter). The author has been a cantor for over 35 years as well as a professor of medicine at USC and a writer of both medical texts and family life educational material. This past Yom Kippur as he was preparing to sing Kol Nidre at the young family service, his granddaughter Bella came running up and asked: \"Zeide, why are you wearing white tennis shoes on Yom Kippur\"? Well after Kol Nidre, his thoughts wandered to her question and he realized: Wow, this is the title of a children's book and a perfect way to explain the symbols of the holidays and stimulate further discussion about family traditions. The warm bond between grandfather and granddaughter, the story line, and the beautiful illustrations will make this book a wonderful addition to the children's Jewish holiday literature."}, {"id": "1515727017", "genre": "Children's Books", "title": "Allosaurus and Its Relatives: The Need-to-Know Facts (Dinosaur Fact Dig)", "description": "Allosaurus and its relatives were fierce and dangerous predators. Dinosaurs in this group had deadly claws and razor-sharp teeth. Bold, full-color illustrations, easy-to-read charts and maps, and interesting facts take readers back to a time when these fearsome hunters walked the earth."}, {"id": "1512418455", "genre": "Children's Books", "title": "L'Dor Vador: A Keepsake Coloring Book", "description": "A keepsake collection of beautiful black-and-white coloring pages for parents, children and grandparents to color together and share, featuring Hebrew letters and Judaica images by well-known ketubah artist Judy Freeman. Lay-flat binding for easy coloring."}, {"id": "078074859X", "genre": "Children's Books", "title": "Talking to Dragons (Enchanted Forest Chronicles)", "description": "One day, Daystar's mom, Cimorene, hands him a magic sword and kicks him out of the house. Daystar doesn't know what he is supposed to \"do with the magic sword, but knowing Cimorene, he's sure it must involve a dragon or two!"}, {"id": "1626869650", "genre": "Children's Books", "title": "Legendary Journeys: Ships", "description": "Set sail on an epic journey through maritime history, from early Viking voyages to marauding pirate galleons, from the ill-fated Titanic to modern aircraft carriers.Slide out the cross-sections and lift the flaps to look inside iconic ships and spot famous sailors, explorers, and adventurers such as Christopher Columbus, Roald Amundsen, and Blackbeard. Including great feats of nautical engineering and human endurance, social history, and global voyages, this interactive book takes readers on a adventure on the high seas."}]