[{"id": "0735262845", "genre": "Children's Books", "title": "Anne's Colors: Inspired by Anne of Green Gables", "description": "A must-have board book for Anne of Green Gables fans, with charming, hand-embroidered illustrations.Iconic moments from the beloved L.M. Montgomery classic are celebrated in this adorable concept book. Artist Kelly Hill creates vignettes of the most recognizable scenes from Anne of Green Gables, including Anne and Diana's first meeting, Gilbert pulling Anne's hair, Anne's puffed-sleeve dress and even Anne and Diana sharing raspberry cordial! Each scene has its own color, with simple text and tactile, gorgeous works of art created from cut fabric and embroidery.Part of a series of Anne concept books, Anne's Colors is a perfect way to introduce future fans to this winning character."}, {"id": "B006Y04CM2", "genre": "Children's Books", "title": "Bug in a Bottle", "description": "What's a bug to do when it wakes up in a strange place? The bug thinks up funny scenarios that might have led it away from home.Told from the perspective of a bug in a jar, this is a story that emphasizes the importance of family. Perfect for beginner readers."}, {"id": "B00FPP6QF8", "genre": "Children's Books", "title": "Children's Books: Scientists That Changed the World: The Story of Penicillin, An Educational Comic Book for Kids (A Historical Science Comic Book for Kids 1)", "description": "Scientists That Changed the World, is a Historical Science Comic Book for Kids. Volume 1 deals with the Story of Penicillin - it is an educational comic all about the exciting discovery of Penicillin. And what kid doesn't love comic books?!This biography for kids, all about the scientist Alexander Fleming, shows exactly how he came about making his historic discovery and how it changed the world. The story behind this incredible event that changed history forever leaps off the page in this full color comic graphic novel. If you have a child that is interested in science, biographies or history, this cool comic will show them that a little inspiration, combined with hard work and even a little bit of luck can make for a world changing event. Maybe even one they might make one day. All it takes is one person to change the world!So scroll back up to \"BUY NOW\" and Start Reading This Fantastic  Semi-Biographical Story of Alexander Fleming and the discovery of penicillin Today!"}, {"id": "079444069X", "genre": "Children's Books", "title": "Snuggle Bunnies", "description": "Say goodnight with three snuggly bunnies in this sweet bedtime board book!The pleasures of ordinary life at the end of a long summer's day—from catching fireflies to a snuggle and a story before bed—are all here, rendered in loving detail by best-selling artist Lisa McCue."}, {"id": "B01BMSSR76", "genre": "Children's Books", "title": "Easter is Cancelled! (Rhyming Multicultural Children's Book About Appreciating the Efforts of Others)", "description": "Everyone likes to be appreciated, even the Easter Bunny.Easter comes but once a year. But this year the Easter Bunny was not participating, not taking charge, not helping out. The other animals had their duties and were working well. Not the Easter Bunny! Why? His excuse was that no one ever thanks him for all the work he does to create a special day for kids all over the world. So, he cancelled Easter. Oh my, oh my. A wise and thoughtful owl is consulted. His solution warms the heart of the bunny. What the Easter Bunny is told is important for all kids to know. You’ll have to read the book to find out what that is.Be sure to take a peek at ONE HUNDRED EGGS FOR HENRIETTA, another happy Easter book by Sally Huss.This children’s picture book is part of the wonderful collection of children’s books by Sally Huss."}]