[{"id": "0812496744", "genre": "Children's Books", "title": "The Dead Man in Indian Creek", "description": "At the same time that Matt and Parker find the body of the dead man in the creek, they recognize George Evans, the owner of the antique shop where Parker's mother works. \"Good, well-constructed entertainment.\" -- Kirkus Reviews"}, {"id": "1596436034", "genre": "Children's Books", "title": "Viva Frida (Morales, Yuyi)", "description": "A 2015 Caldecott Honor BookA 2015 Pura Belpré (Illustrator) AwardFrida Kahlo, one of the world's most famous and unusual artists is revered around the world. Her life was filled with laughter, love, and tragedy, all of which influenced what she painted on her canvases. Distinguished author/illustrator Yuyi Morales illuminates Frida's life and work in this elegant and fascinating book.A Neal Porter Book"}, {"id": "B007RMA5J0", "genre": "Children's Books", "title": "The Adventures of Phillip the Rabbit", "description": "Phillip the rabbit has never experienced danger before - outside of his imagination. But when Phillip attracts the attention of town bully Reeves and his gang of thugs, he finds himself facing more danger than he ever bargained for! Can Phillip use his charm and wits to escape Reeves and his gang? "}, {"id": "1250184207", "genre": "Children's Books", "title": "What's Your Favorite Color? (Eric Carle and Friends' What's Your Favorite)", "description": "In this board book, Eric Carle and fourteen other best-loved picture book artists answer the classic kid question: what's your favorite color?Everybody has a favorite color. Some like blue balloons or brown buildings or mint green ice cream cones. Eric Carle loves a yellow sun because children often include one in the corner of their pictures.Beautiful, funny, and heartfelt, these artists' charmingly personal answers to \"what's your favorite color?\" will inspire readers to answer the question themselves. Artists include:Lauren Castillo, Bryan Collier, Mike Curato, Etienne Delessert, Anna Dewdney, Rafael Lopez, William Low, Marc Martin, Jill McElmurry, Yuyi Morales, Frann Preston-Gannon, Uri Shulevitz, Philip C. Stead, Melissa SweetGodwin Books"}, {"id": "1633626652", "genre": "Children's Books", "title": "Smart Shopping (21st Century Skills Library: Real World Math: Personal Finance)", "description": "Do you know how to prioritize your purchases? This book introduces readers to effective shopping skills. Real world examples help readers learn the importance of math skills for money management. Callouts prompt inquiry, further thinking, and close examination of photographs. Additional text features and search tools, including a glossary and an index, help students locate information and learn new words."}]