[{"id": "0590457128", "genre": "Children's Books", "title": "Adventures of the Shark Lady: Engenie Clark Around the World (Scholastic Biography)", "description": "An authorized biography of a courageous and renowned marine biologist shows her in action as she rides whale sharks, explores the ocean in a tiny submersible craft, and much more. Original."}, {"id": "977424432X", "genre": "Children's Books", "title": "The Shipwrecked Sailor: A Tale from Ancient Egypt", "description": "This sailor's yarn from the twentieth century BC is a tall tale of a shipwreck, survival an enchanted isle, and a lordly talking serpent with his own tragic tale to tell. Translated by the poet and Egyptologist John L. Foster and accompanied by the humorous watercolors of Lyla Pinch Brock, this new treatment of a classic poem will delight Egyptologists of all ages."}, {"id": "0061122734", "genre": "Children's Books", "title": "Football Genius", "description": "New York Times bestselling author and former NFL player Tim Green scores a touchdown with this exhilarating and action-packed story about an ordinary boy who becomes a hero you can really root for. Perfect for fans of Mike Lupica.Twelve-year-old Troy White has a phenomenal gift: He can predict football plays before they even happen. Any position. Any player. Any team.When Troy's single mom gets a job working for the Atlanta Falcons, Troy sees this as an opportunity to show what he can do. But first he has to get to the Falcons—and with tight security and a notoriously mean coach, even his mom's field passes aren't much help.Then Troy and his best friends devise a plan to get the attention of star linebacker Seth Halloway. With Seth's playing and Troy's genius, the Falcons could be unstoppable if they'll only listen. But if he can’t convince Seth he’s telling the truth, the Falcons’ championship and his mom’s job are at risk."}, {"id": "1853049719", "genre": "Children's Books", "title": "Garfield Classics: v.2 (Garfield Classic Collection) (Vol 2)", "description": "This classic collection contains three pocket books: number 13 \"In the Pink\"; number 14 \"Just Good Friends\"; and number 15 \"Plays it Again\"."}, {"id": "B00JIAX6KY", "genre": "Children's Books", "title": "Jane Helps the Easter Bunny: An Easter Picture Book for Kids (Ages 4-6) (Jane and Her Friends 1)", "description": "Jane Helps the Easter Bunny is a fun story for kids ages 4 to 6. Jane and her friends help the Easter Bunny get new eggs just in time for his big Easter delivery. They go to the farm, gather the eggs from the hens and even pitch in to help with the decorating.This book is written in rhyme and will have your children wanting to decorate their own Easter eggs, so it also includes a simple recipe for easy Easter egg dying. In addition, Jane Helps the Easter Bunny also has a fun puzzle at the end of the story so your children can put their Easter egg searching skills to work.Take a hip-hopping adventure with Jane and her friends to create a truly fun and inspiring Easter tradition in your home this Easter season."}]