[{"id": "0345341678", "genre": "Science Fiction & Fantasy", "title": "The White Dragon (Dragonriders of Pern Vol 3)", "description": "Volume III of The Dragonriders of Pern®, the influential series by sci-fi/fantasy titan Anne McCaffrey Never in the history of Pern has there been a dragon like Ruth. Mocked by other dragons for his small size and pure white color, Ruth is smart, brave, and loyal—qualities that he shares with his rider, the young Lord Jaxom. Unfortunately, Jaxom is also looked down upon by his fellow lords, and by other riders as well. His dreams of joining the dragonriders in defending Pern are dismissed. What else can Jaxom and Ruth do but strike out on their own, pursuing in secret all they are denied? But in doing so, the two friends will find themselves facing a desperate choice—one that will push their bond to the breaking point . . . and threaten the future of Pern itself."}, {"id": "1411647742", "genre": "Science Fiction & Fantasy", "title": "21 Dicembre 2012", "description": "Il mondo e in scadenza, le profezie ed i profeti si accavallano l'un l'altro in cerca di varie giustificazioni. Il mondo si divide o si aliena. Il mondo si allontana o si avvicina alla fede. Delle fazioni vivono l'avvicinarsi dell'apocalisse a modo loro. Due uomini sanno. E tutti leggerete profezie mai viste. Alessio Adami ci pone davanti un mondo ricco di personaggi sopra le righe, spietati e dannatamente reale. L'ennesima produzione epilettica di Alessio Adami: 21 Dicembre 2012."}, {"id": "154134264X", "genre": "Science Fiction & Fantasy", "title": "Air Pirate (Volume 1)", "description": "Townsman thief-for-hire, Darien North, survives a crash landing when his airship explodes over hostile Woodsman territory. He even manages to ingratiate himself to members of the tribe that finds him, including a beautiful girl with wild hair and deadly archery skills. For the first time in his life, Darien starts to feel at home. But his happiness is cut short when the Town’s commissioner blackmails him into stealing a secret heirloom from the Woodsman tribes. After years of being a loner, Darien is forced to choose between competing loyalties: friends or family, woods or town. And when he learns of an old, deadly weapon that could put all of humanity at risk, he must decide what—or whom—he’s willing to sacrifice to save them all."}, {"id": "0316308633", "genre": "Science Fiction & Fantasy", "title": "After the Crown (The Indranan War)", "description": "The adrenaline-fueled, Star Wars-style sequel to Behind the Throne, a new space adventure series from author K.B. Wagers.Former gunrunner-turned-Empress Hail Bristol was dragged back to her home planet to fill her rightful position in the palace. With her sisters and parents murdered, the Indranan empire is on the brink of war. Hail must quickly make alliances with nearby worlds if she has any hope of surviving her rule.  When peace talks turn violent and Hail realizes she's been betrayed, she must rely on her old gunrunning ways to get out of trouble. With help from an old boss and some surprising new allies, she must risk everything to save her world.The Indranan WarBehind the ThroneAfter the Crow"}, {"id": "1476706743", "genre": "Science Fiction & Fantasy", "title": "Rise of the Federation: A Choice of Futures (Star Trek: Enterprise)", "description": "An original novel set in the universe of Star Trek: Enterprise!A new nation has arisen from the ashes of the Romulan War: the United Federation of Planets, an unprecedented union of diverse species cooperating for the good of all. Admiral Jonathan Archer—the former captain of the Earth starship Enterprise, whose efforts made this union possible—envisions a vibrant Federation promoting galactic peace and a multispecies Starfleet dedicated to exploring strange new worlds. Archer’s former crewmates, including Captain T’Pol of the U.S.S. Endeavour and Captain Malcolm Reed of the U.S.S. Pioneer, work with him to secure that bright future. Yet others within the Federation see its purpose as chiefly military, a united defense against a dangerous galaxy, while some of its neighbors view that military might with suspicion and fear. And getting the member nations, their space fleets, and even their technologies to work together as a unified whole is an ongoing challenge.  When a new threat emerges from a force so alien and hostile that negotiation seems impossible, a group of unaligned worlds asks Starfleet to come to its defense, and the Federation’s leaders seize the opportunity to build their reputation as an interstellar power. But Archer fears the conflict is building toward an unnecessary war, potentially taking the young nation down a path it was never meant to follow. Archer and his allies strive to find a better solution . . . but old foes are working secretly to sabotage their efforts and ensure that the great experiment called the Federation comes to a quick and bloody end."}]