[{"id": "B075W6XNVD", "genre": "Children's Books", "title": "Cassie's Coven 2: The Bad Apples Mystery", "description": "Magic, Mystery and Girl Power!If you were a fan of Trixie Belden, Nancy Drew, the famous five or secret seven – this is the book for your children.When fruit begins to disappear from Witchborough’s orchards Cassie and her friends must find out what is going on before local growers lose their livelihoods. With a little magic help, and a lot of girl power, the four set about to solve the mystery. But along the way they will find out that misusing magic can have dire consequences.The Cassie’s Coven series is based around four young Australian girls who discover that they have been left a magical heritage from their great-great grandmothers to become witches.They find out over the series that they are each a special kind of witch; black, white, green and yellow – each with their own powers and all aimed at protecting the natural world.Each mystery they solve revolves around some kind of environmental issue which has the potential to wreak havoc on their small town.The first book introduces the characters, has them find a magical book, meet their familiars and solve their first mystery.As the series goes on they become more proficient in their powers, find out the background of their town and their ancestors and solve mystery after mystery. "}, {"id": "0061234893", "genre": "Children's Books", "title": "Ted & Me (Baseball Card Adventures)", "description": "With more than 1.5 million books sold, the Baseball Card Adventures series brings the greatest players in history to life! Joe \"Stosh\" Stoshack has an incredible ability. He can travel through time using baseball cards. But the FBI has learned of his talent, and now they have a mission for him: go back to 1941 and warn President Roosevelt about the attack on Pearl Harbor!Stosh is reluctant, until he finds out that his \"ticket\" to 1941 is a Ted Williams card. Williams was one of the greatest hitters of all time, even though he lost years of his career to serve in the Marines. How many more home runs would the Splendid Splinter have hit if he had those years back? What if Stosh can prevent the attack on Pearl Harbor and convince Williams not to serve in the military?With black-and-white photographs and stats throughout, plus back matter separating fact from fiction, Ted & Me is the perfect mix of history and action for every young baseball fan."}, {"id": "1543231071", "genre": "Children's Books", "title": "Leprechaun Leprechaun: Rhyming Leprechaun Picture book for preschoolers and kindergartners perfect for St. Patrick's Day Storytimes and read alouds", "description": "Excerpt from Leprechaun, Leprechaun: \"Leprechaun, Leprehaun. I'm looking for you.\" \"Are you under a bush?\" \"Are you nearby my shoe?\" \"I just saw you dart by, so I do know you're there.\" \"I aim to catch you. I play very fair.\" A young boy attempts to catch a clever leprechaun in an effort to have his wishes granted. He searches for the Leprechaun in many different places. This book features a mix of woodsy photography and graphic illustration for a unique look and feel. It also has a rhyming style which is sure to engage young children during read alouds and storytimes. Visit the author page at: www.Deesignery.com"}, {"id": "B00BCTWU7Y", "genre": "Children's Books", "title": "Sand Castle Bash: Counting from 1 to 10 (Jon Scieszka's Trucktown)", "description": "Rev your engines for another adventure in Jon Scieszka's Trucktown! Perfect for summer or all year long!Join ten of the Trucktown crew in this all new beach adventure as they compete in this truck-themed sandcastle contest hosted by Jack Truck! Count up from contestants one to ten and look for the numbered flags next to the sandcastle to find each truck's sandy creation. The contest hits high gear when all ten sandcastles have been introduced and the trucks are invited to bash their way through each one."}, {"id": "0545868165", "genre": "Children's Books", "title": "Batman: Gotham City's Guardian (Backstories)", "description": "What was Bruce Wayne's childhood like? Why does he dress up like a bat? What compels him to protect Gotham City? How did he become the world's greatest detective? Who are his most trusted allies and fearsome foes? In this biography--complete with black-and-white illustrations, timelines, and fact boxes--young readers will delight in learning the complete history of Gotham's fearless protector."}]