[{"id": "1628323566", "genre": "Children's Books", "title": "Manchester United (Soccer Stars)", "description": "For young fans of UEFA Champions League action, nothing beats a dramatic game of soccer. This series puts readers six and up into the goal-diving action, introducing some of the world's most popular Soccer Stars through brief recaps of their rich team histories. Highlighting important players and managers—in main text and special callouts alike—and noting key periods of success and failure, each book presents action-driven photos and a rundown of Champions League titles as it examines the stellar saga of European football clubs. An elementary introduction to the English soccer team Manchester United, including a brief history since the team's 1878 founding, its main rivals, notable players, and Champions League titles."}, {"id": "1547230487", "genre": "Children's Books", "title": "Happy 85th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 85 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1785913379", "genre": "Children's Books", "title": "A Midsummer Night's Dream (Microwave Shakespeare)", "description": "A Midsummer Night's Dream: Microwave Shakespeare is the perfect introduction to the play for all pupils now having to study the full play in its original language. Each play is retold as a straightforward, pacey narrative in chapter-book format. Plus each book includes visual information to help pupils get to grips with the plot, the key characters and their important relationships in the play. The stories are all presented in the period of the play but with modern day language. These are ideal for reluctant and struggling readers but also perfect for getting all pupils comfortable with the play before they go on to study it in its original form."}, {"id": "0613782941", "genre": "Children's Books", "title": "Wilma Rudolph (African-American Biographies (Pb))", "description": "Wilma Rudolph was one of the best runners in the world. She ran so fast and broke so many records that she was know as the “fastest woman in the world.” This biography tells her story and show how perseverance and unique qualities can continue to set exam"}, {"id": "1930108028", "genre": "Children's Books", "title": "Jeeves, I Need Help!: Tips and Tricks for Kids on the Net", "description": "Provides practical tips and simple strategies for young readers doing research on the Internet, as well as navigation advice and filtering software information."}]