[{"id": "1580862705", "genre": "Children's Books", "title": "Prehistoric World (Usborne World History)", "description": "This is a perfect general introduction to how people lived. It is now published in a new edition providing excellent value for money. \"Usborne World History\" books offer an excellent introduction to history, explaining key topics in clear and simple language. Exploring contemporary opinions of the period from artists and explorers, to the ideas and inventions of the time, the series offers an international perspective on events. Each book also contains a chronology, word list and time chart."}, {"id": "0307960374", "genre": "Children's Books", "title": "Seven Little Postmen (A Little Golden Book)", "description": "This lively poem by the author of Goodnight Moon tells the tale of one little boy’s letter. What happens after the boy drops it into the mailbox? How does it get to his grandma’s house? Children will enjoy this rollicking tale of the seven little postmen who got the mail through."}, {"id": "B00N690MRS", "genre": "Children's Books", "title": "Pocketful Of Poesies: Absolutely All Artful Alliterations", "description": "Pocketful of Poesies is unlike any publication you have ever previously perused and that is quite a phenomenal pursuance.  Pocketful of Poesies is a pick of perfectly plangent dark tales. An astonishing array of very short stories that take alliteration to a completely new level with absolutely EVERY word beginning with the same letter. This mind blowing volume of amazing alliteration, such as “Annie and Adam’s Adventure at Arthur’s Animal Aid Association,” “Betty Bets Billy ‘Bout Blowing Bigger Bubbles Better,” and “Colin Couldn’t Comprehend Chafing Cream” WILL blow your mind.The alphabet may have 26 letters but there is no rule that each word you use has to start with a different one each time and Toula Mavridou-Messer proves just that in Volume One of Pocketful of Poesies."}, {"id": "B017GH5C9I", "genre": "Children's Books", "title": "Ladybug Ladybug (Life Cycle Books)", "description": "Follow the life of ladybugs, as they hatch from eggs and grow from grub to ladybug. Find fascinating photographs that depict the different stages of the ladybug life cycle. "}, {"id": "0547400365", "genre": "Children's Books", "title": "Till Death Do Us Bark (43 Old Cemetery Road)", "description": "When a dog arrives at Spence Mansion, Seymour is overjoyed. His adoptive parents, Ignatius B. Grumply and Olive C. Spence, are less enthusiastic—especially when Secret, the dog, begins barking all night long. Is it possible Secret just misses his old companion, the late Noah Breth, whose children are fighting like cats and dogs over their father’s money? Or does Secret have a secret that, in the end, will make the entire town of Ghastly howl with delight? This third book in the 43 Old Cemetery Road series, a runaway mystery told in letters, limericks, a last will, and loose change, is guaranteed to please anyone who’s ever tried to keep a secret. "}]