[{"id": "B06X9D636F", "genre": "Children's Books", "title": "The Curious Kid's Guide to Donald Trump", "description": "A fully detailed account of the life of Donald Trump, from his birth and childhood in Queens, New York to his stunning upset in the 2016 presidential election. Readers will learn about his varied business interests, his time on the hit show The Apprentice, his marriages, his children, his knack for stirring up controversy, and the passion for politics that carried him to the most powerful office in the world."}, {"id": "0310760097", "genre": "Children's Books", "title": "The Berenstain Bears Respect Each Other (I Can Read! / Berenstain Bears / Living Lights)", "description": "Gramps and Gran go on a picnic with Mama and Papa Bear and the cubs. As the family searches high and low for the perfect picnic spot, they end up learning a few things about good manners and respecting others. The Berenstain Bears Respect Each Other entertains readers while relaying the importance of the golden rule. Young readers will enjoy reading Respect Each Other, the newest Berenstain Bears® Living Lights™ Level One I Can Read."}, {"id": "0756954258", "genre": "Children's Books", "title": "Muscles (Trophy Picture Books (Pb))", "description": "Nearly 700 muscles control the daily life of a human body. That's just one of the facts kids will learn in this picture book by a veteran nonfiction writer. Remarkable for making complicated science clear and understandable.--ALA Booklist."}, {"id": "1480805343", "genre": "Children's Books", "title": "Play a Song for Me", "description": "Inspired by \"Mr. Tambourine Man\" by Bob Dylan, this book of whimsical and colorful paintings brings to life images conceived from this famous song.   The poem that accompanies the illustrations expresses the deep and moving effect that Bob Dylan's music has had on so many people. \"I will remember to follow the sound of the music that never fails to inspire me... It is eternal like the stars and the sea, and like the waves that crash onto the shore, it awakens me.\"  This book can be previewed on the home page of kathythompsonfineart.com - be sure to click on the \"View Fullscreen\" icon."}, {"id": "B073W9N9B8", "genre": "Children's Books", "title": "Disney Manga: Fairies- Vidia and the Fairy Crown (Disney Fairies Book 1)", "description": "When Queen Clarion's crown goes missing on the night of Pixie Hollow's biggest bas, all fingers point to one thief - the rude and standoff-ish fairy Vidia! To keep from being banished from Pixie Hollow forever, Vidia goes on an outrageous hunt for the crown that takes her from one end of Neverland to the other. Can she find the crown in time to save Vida's reputation."}]