[{"id": "0679891161", "genre": "Children's Books", "title": "Wish for a Fish: All About Sea Creatures (Cat in the Hat's Learning Library)", "description": "The Cat in the Hat, Sally, and Dick take an undersea voyage aboard the S.S. Undersea Glubber! Traveling down from the Sunny Zone to the Dark Zone to the Trench at the bottom, Captain Cat and his crew get up close and personal with the different life forms found at each level of the ocean. Along the way, they meet sharks, jellyfish, dolphins, manatees, whales, and sea cucumbers, to name just a few!"}, {"id": "B009F7I984", "genre": "Children's Books", "title": "North America! Learn About North America and Enjoy Colorful Pictures - Look and Learn! (50+ Photos of North America)", "description": "Are your kids interested in North America? Awesome! You have found the right book. Help your children learn more about North America today by reading this book. Here is what is included inside \"North America! Learn About North America and Enjoy Colorful Pictures – Look and Learn!\"... North AmericaNorth America HistoryNorth America AnimalsNorth America PicturesNorth America FactsNorth America GeologyNorth America LandscapeNorth American FoodNorth America EconomyFun North America FactsAnd Lots More! Includes over 50 high quality photos of North America! Other bonuses inside \"North America! Learn About North America and Enjoy Colorful Pictures – Look and Learn!\"...This book has photos of North America.This book has info on North America.This book has facts on North America.This book will help you learn. Buy the \"North America! Learn About North America and Enjoy Colorful Pictures – Look and Learn!\" book right now!"}, {"id": "1634710754", "genre": "Children's Books", "title": "Library (21st Century Junior Library: Explore a Workplace)", "description": "Readers are introduced to the many careers available at a library. Colorful sidebars encourage children to think, create, guess, and ask questions about a career working in a library."}, {"id": "1604536292", "genre": "Children's Books", "title": "Abigail Adams (First Ladies)", "description": "Highlights the life and accomplishments of the wife of the second president of the United States, a dedicated wife and mother who spoke up against slavery and for women's rights."}, {"id": "0544586484", "genre": "Children's Books", "title": "Twilight Chant", "description": "A lyrical exploration of the transition between day and night and of the animals who thrive during this special time.As day slips softly into night, sharp eyes catch glimpses of the special creatures who are active at dusk. Lyrical text and lush art capture the richness and life of this magical time in a sumptuous picture book that will inspire budding naturalists and anyone who has ever chased a lightning bug at twilight. An author’s note about twilight is included."}]