[{"id": "1974093425", "genre": "Children's Books", "title": "7: Baseball Joe in the World Series: Pitching for the Championship (Volume 7)", "description": "Baseball Joe is the fictional hero of a number of children's books written by Howard R. Garis under the name of \"Lester Chadwick\". The series follows the main character, a star baseball player named Joe Matson, from high school to college (at Yale University) and then to success as a professional. In the Baseball Joe series, Chadwick chronicles the adventures of Joe Matson from the sandlots to prep school, the Ivy League, the minors, the majors, and on to a world tour and other adventures."}, {"id": "B00CR3PE6I", "genre": "Children's Books", "title": "Toddy's model yacht", "description": "Toddy, a young boy, is the main character of the book.  On a camping holiday with his family, he sees radio controlled yachts racing on a lake.  He wants one!.     For his next birthday present, his parents give him a radio yacht called 'HotStuff'.  Then the excitement begins.  The Police, local Coastguard and a local fisherman are involved.This is a great little story for young boys, tenderly illustrated by the Author."}, {"id": "B00IERMMXY", "genre": "Children's Books", "title": "The Big Book of Superheroes", "description": "As a child, Bart King  discovered he could punch people into outer space. Sadly, he lost a lot  of friends that way. Today, Bart is one of the world’s most in-demand  superhero experts. So if you’re wondering if you have what it takes to  be a superhero—of course you do! All you need is a burning desire to  fight evildoers. Oh, and also a secret identity, the perfect name, a  cool costume, some terrific superpowers, and an archenemy. Actually, you  know what? You better get this book!   Bart King writes funny books for kids and immature adults. His  titles—including The Big Book of Boy Stuff and The Big Book of Girl  Stuff—have sold more than a half million copies. A longtime  middle-school teacher, Bart is currently wearing his underwear over his  pants. (Don’t ask.) "}, {"id": "B00DPOA0YO", "genre": "Children's Books", "title": "Suriname in Pictures (Visual Geography (Twenty-First Century))", "description": "Suriname in Pictures explores the history and government, economy, people, geography, and cultural life of Suriname. This edition includes comprehensive text with strong curriculum ties, beautiful full-color photography throughout, and interesting, detailed sidebars."}, {"id": "1405278129", "genre": "Children's Books", "title": "Spine-tingling 1001 Stickers (1001 Stickers Fun Books)", "description": "This ghoulishly spooky activity book is packed full of coloring, doodling, puzzles, and activities—plus more than 1000 scary stickers, if you’re feeling brave enough!"}]