[{"id": "B00BRAL7G8", "genre": "Children's Books", "title": "The Day Roy Riegels Ran the Wrong Way", "description": "At the 1929 Rose Bowl, talented center Roy Riegels picked up a fumble and made an incredible sixty-five-yard run. There was just one problem: Roy Riegels was running the wrong way! Renowned author Dan Gutman recreates this painful (but funny) moment in sports history in a picture book play-by-play of the game's most thrilling moments-all framed by a friendly grandpa remembering the game for his grandson. Told with the excitement of a sports announcer calling the greatest game of his life, and shown through vivid, cartoonlike illustrations by Kerry Talbott, The Day Roy Riegels Ran the Wrong Way is a feast of humor and history for any sports fan."}, {"id": "1555467822", "genre": "Children's Books", "title": "West Bank/Gaza Strip (Places and Peoples of the World)", "description": "Surveys the history, topography, people, and culture of the West Bank and the Gaza Strip, with an emphasis on current economy, industry, and place in the political world."}, {"id": "B015VF58H8", "genre": "Children's Books", "title": "The 3D Book of Halloween 2015. Anaglyph images of monsters, costumes, pumpkins and other scary treats.", "description": "3D Photos of Halloween around the world. Includes;Alone in the fieldsAutumn pumpkinBanana monsterBand of skeletonsBasket of treatsBurial chamberCat willy loves halloweenCheeky scullChinese halloweenCity creatureColourful groupCreepy creatureCreepy zombieCurious babyDark alleywayDark skullDemon figureDoorstep greetingDrinking the life awayEerie figureEvil pumpkinsFreaky eyed catFrightening cutter-manFunny halloween pumpkinGarden celebrationGiant pumpkinHalloween decorationHalloween in nycHappy halloweenHappy pumpkinHungry zombieIntricately carved pumpkinNight of terrorParty cityPumpkin and candlelightPumpkin couplePumpkin hoardSay helloScarecrow friendsScary skullScary soldierScene of halloweenSkeleton danceSkeleton enjoymentSpider lurkingStone figureSweet ghost closeupSweet ghostsTilson st halloweenTransformed pumpkinTwin scary skullsWitches festivalWitches potionZaragozaZombie catZombie closeupRequires red-cyan glasses for 3D effect"}, {"id": "1979764247", "genre": "Children's Books", "title": "Adventures for Kids: Fantastic Fun for All Kids and Parents (Kids’ Adventure Stories 4 in 1)", "description": "A bundle of 10 adventures for kids  Get caught up in the fantastic worlds of these kids and adults! A story book of 10 in 1, where you’ll read about zombie invasions, mazes, wars, medieval settings, kings, queens, and villains, dragons, chicken races, spider riders, crazy rainstorms, fish, zombie horses, fights, and friendships. Experience the emotion, the drama, the action and the humor!"}, {"id": "0375840680", "genre": "Children's Books", "title": "Duck, Duck, Goose", "description": "The beloved, classic, and New York Times-bestselling odd couple Duck & Goose are back, and this time their friendship is put to the test! Duck & Goose, Goose & Duck. Feathered friends forever . . . or are they? You see, there's a challenge to their friendship: a little whippersnapper of a duck named Thistle. Thistle is good at everything (or so she thinks), from math to holding her breath to standing on her head. Duck thinks she's fantastic. But Goose does not! And so Goose is faced with a problem close to the hearts of children everywhere: What happens when your best friend makes a new friend?PRAISE FOR THE DUCK & GOOSE SERIES: “Duck and Goose have taken their places alongside Frog and Toad and George and Martha as fine examples of friendship, curiosity and problem-solving.”—Kirkus Reviews “Charming, funny, simple, and surprising. . . . Hills is master of the light comic touch.”—The Boston Globe "}]