[{"id": "1417622369", "genre": "Children's Books", "title": "Ogres Don't Hunt Easter Eggs (Turtleback School & Library Binding Edition) (Adventures of the Bailey School Kids (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The Bailey School kids devise a plan to find out if Mr. Bigg--the man who is fixing up the park for the town Easter egg hunt--is really an ogre as Eddie claims."}, {"id": "1607301083", "genre": "Children's Books", "title": "Dallas Cowboys 101 (My First Team-Board-Book)", "description": "Dallas Cowboys 101 is required reading for every Cowboys fan! From Roger Staubach's game-winning \"Hail Mary\" pass and the Dallas Cowboys Cheerleaders to the five Super Bowl Championships, you'll share all the memories with the next generation. Enjoy all the traditions of America's Team, learn the basics about playing football and share the excitement of the NFL!"}, {"id": "B0147R09I4", "genre": "Children's Books", "title": "Thunderstruck: A Blessed Under Fire Novella", "description": "When a young boy goes missing from a youth shelter, angel-possessed veteran John Holtz sets out to find him and bring him home. Will he succeed when the lines between good and evil blur and he can't be sure who to trust?"}, {"id": "0785767207", "genre": "Children's Books", "title": "Baseball Flyhawk (Turtleback School & Library Binding Edition) (Matt Christopher Sports Classics)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. New to the Royals' baseball team, Chico Romez is accepted by all the players except one, String Becker, the most popular player on the team."}, {"id": "0616003722", "genre": "Children's Books", "title": "Kiesha's Kwanzaa", "description": "Kiesha doesn't understand what is happening to her family. Papa hides behind the newspaper at dinner time. Her big brother Derrick is grumpy and gets into trouble all the time. And Mama just seems unhappy. If not for her precious library books, Kiesha would be unhappy too. When she discovers a family celebration called Kwanzaa, Kiesha thinks she has found a way to help her family. She works hard to create a special family Kwanzaa celebration, but is it too late?    Young readers will learn about how some families celebrate Kwanzaa, but Kiesha's Kwanzaa is really about family and togetherness and the power of love."}]