[{"id": "080506382X", "genre": "Children's Books", "title": "Bembo's Zoo: An Animal ABC Book", "description": "A stylish animal alphabet book with illustrations created from the letters in each animal's name.Bold color and simple yet striking graphics make a unique alphabet book that will appeal to readers of all ages. The Bembo typeface is one of the most elegant of the classic typefaces, and its clean, graceful lines inspired the artist to use the letters in a wholly new way. From antelope to zebra-with such exotic beasts as iguanas and narwhals in between-this menagerie of animals has been created with only the shapes of the letters in each animal's name. Children will have fun playing \"I spy\" with the letters in each picture, and adults will admire the sophisticated art and sleek design of this sumptuous book."}, {"id": "1935493116", "genre": "Children's Books", "title": "The Boy & His Mud Horses: & Other Stories from the Tipi", "description": "Beautifully illustrated by award-winning author Paul Goble, The Boy and His Mud Horses features a collection of 27 traditional stories from different Native American tribes, including the Pawnee, Cheyenne, Blackfoot, and Lakota. Also includes a foreword by Albert White Hat, Sr., a nationally respected Lakota leader and linguist."}, {"id": "1474726364", "genre": "Children's Books", "title": "Floor Exercise: Tips, Rules, and Legendary Stars (Snap Books: Gymnastics)", "description": "Floor exercise requires a lot from a gymnast. You need artistry, precision and skill. But the feeling you get when you nail a complicated tumbling pass makes all your hard work and dedication worth it. Learn everything you need to know to compete in floor exercise."}, {"id": "0764156462", "genre": "Children's Books", "title": "I See a Tractor (Plastic Shapes)", "description": "Each book in this brightly illustrated series consists of 12 durable board pages, but each page serves as a frame around a delightful silk-screen color illustration on a soft plastic surface. Babies learn the words for familiar objects, animals, and toys, while they also develop their tactile sense, touching each page and feeling the difference between glossy cardboard and soft plastic. (Ages Birth to 3)"}, {"id": "1484767225", "genre": "Children's Books", "title": "Cinderella: The Story of Cinderella (Disney Princess (Disney Press Unnumbered))", "description": "When Cinderella's cruel stepmother forbids her from attending the Royal Ball, she gets unexpected help from her mice friends and her Fairy Godmother. Cinderella attends the ball as a mysterious guest and dances with the prince. At the stroke of the midnight, she loses one of her glass slippers and transforms back into a maid. Will the prince ever find her now? This collectible storybook includes beautiful, full color art in the style of the beloved film, Cinderella."}]