[{"id": "B01M9AYSVE", "genre": "Children's Books", "title": "Cloudgirl", "description": "Meet Sophie. She's a precocious five year old who lives in a secret kingdom on top of the clouds. With the help of her friends, the Faeiry Ballerinas, and a magical unicorn named Marina, Sophie keeps the clouds safe from the evil witch Katrina, who threatens the peace within the Kingdom.From the imagination of a seven year old girl, Cloudgirl tells a story of friendship, overcoming obstacles and the importance of standing up for yourself."}, {"id": "1329926897", "genre": "Children's Books", "title": "The One-Hundred", "description": "Every human baby is killed beneath the waves - with one exception. The one hundred thousandth is spared. However, these babies sometimes have gifts. These are the One-Hundreds. They are chosen by the moon or sea, an ancient magic sweeping over them. But when one of the One-Hundreds rises, the darkness chases after her and hunts her down, loving her for his own selfish desires, while another boy who's given up on love is drawn to her. Unless Cressa-la can bring the darkness to his knees and fight the war raging inside of her, the world is doomed.  2015 Wattys Award Winner"}, {"id": "1452128537", "genre": "Children's Books", "title": "Fish Finelli (Book 1): Seagulls Don't Eat Pickles", "description": "When the Whooping Hollow town bully, Bryce Billings, bets Fish Finelli that he can't find Captain Kidd's treasure, Fish and his best buds Roger and T. J. must embark on a quest to find the long-lost booty! Between sneaking into the library to track down Captain Kidd's treasure map, stowing away on a boat, and trespassing on the legendary Lyons Island, Fish and his friends are up to their necks in \"goose poop\" on this adventure!"}, {"id": "1421535475", "genre": "Children's Books", "title": "Pokemon Adventures, Vol. 13", "description": "Adventures inspired by the best-selling Pokémon video games!All your favorite Pokémon game characters jump out of the screen into the pages of this action-packed manga! The Pokémon Gym Leader Exhibition matches have begun. Meanwhile, the Masked Man is plotting to invade the stadium with Team Rocket. The powers of good and evil are about to clash. Will the Trainers be able to join forces, or will Team Rocket finally have their victory?"}, {"id": "B01B3DB9KW", "genre": "Children's Books", "title": "Mission to Moon Farm (Secrets of Bearhaven #2)", "description": "A few weeks ago, Spencer Plain had never been to Bearhaven. He was rebuilding a computer and eating peanut butter toast and going to school. Normal, human things.But now his parents are missing, he's living with a family of bears and learning how to speak Ragayo (the bears' language), and has already been on a rescue mission that saved two cubs and their mother.Spencer's ready to go on more missions, but when he uncovers a secret that every bear's been keeping from him, he storms out of Bearhaven, determined to find his parents. While he's gone, his best bear cub friend, Kate, is kidnapped, and soon Spencer is caught up in a daring mission to bring her back before it's too late!"}]