[{"id": "1547113987", "genre": "Children's Books", "title": "Happy Birthday 34", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B0784VQV2Z", "genre": "Children's Books", "title": "The Giggly Giraffe (Zoe's Rescue Zoo)", "description": "Zoe loves living at her uncle's rescue zoo because there's always something exciting going on. And Zoe also has an amazing secret... She can actually TALK to the animals! Something very exciting has happened at the Rescue Zoo - a giraffe has just been born! Jamie the baby giraffe's wobbly walk on his long legs makes everyone laugh, and he just loves to play tricks! But his tricks can cause trouble, and with the Best Zoo Competition coming up, can Zoe help Jamie behave AND have fun?"}, {"id": "0071343350", "genre": "Children's Books", "title": "Elizabeth Blackwell: First Woman Doctor of Modern Times", "description": "As reported by a fellow student, when Elizabeth Blackwell arrived at her first class in medical school in 1847, \"A hush fell over the class as if each member had been stricken with paralysis...A death-like stillness prevailed during the lecture.\" Elizabeth Blackwell tells the fascinating story of Elizabeth Blackwell, the first female physician in the United States. Blazing trails and overcoming prejudice throughout her education and professional life, denied access to hospitals. Blackwell opened the New York Infirmary for Women and Children and, in 1868, the Women's Medical College, the first of its kind in history."}, {"id": "0613224760", "genre": "Children's Books", "title": "T.D. Jakes (Black Americans of Achievement (Econo-Clad))", "description": "-- Critically acclaimed biographies of history's most notable African-Americans -- Straightforward and objective writing -- Lavishly illustrated with photographs and memorabilia -- Essential for multicultural studies"}, {"id": "B06XK4478S", "genre": "Children's Books", "title": "Among the Farmyard People", "description": "'Among the Farmyard People' includes eighteen charming tales about the everyday life of the farmyard creatures. The tales are told in such a manner that they seem realistic, and are not only entertaining, but educational."}]