[{"id": "B0777T88FF", "genre": "Children's Books", "title": "Stories to Teach Children Kindness: 19 Simple to Read Stories that Kids Love (morals, values, lessons, fun, funny, hilarious)", "description": "Do you love short stories that both parents AND kids enjoy?19 Awe-inspiring short StoriesThese stories are hilarious, and you won't believe the unexpected twists and turns!   Some of the stories are sweet and cute,, some are a bit spooky, and some are adventurous, but once you start reading you won't want to stop!Includes: 1.  Ms. Crow's Big Move2.  The Owl Detective3.  The Chatroom (from Chestnut Elementary)4.  Off the Forbidden Planet5.  The Amazing Mr Woodchuck's Magic Show 6.  Ms. Crow's Family Reunion7.  Santa's Boot's8.  Ms. Crow's Halloween PartyAnd 11 more exciting short stories for kids!!!**Get 19 Great Stories for the Price of just 1!!!   Scroll up and click \"Buy Now\" to reserve your copy!**"}, {"id": "B00FKZZ0DC", "genre": "Children's Books", "title": "Meet The Velociraptor: Fun Facts & Cool Pictures (Meet The Dinosaurs)", "description": "\"Meet The Velociraptor\" - A nonfiction dinosaur book for children.This velociraptor book is filled with cool pictures and interesting facts about these long gone creatures that once roamed the planet.If you want to learn about velociraptors, then this book - \"Meet The Velociraptor\" - gives you the answers to questions, including:- When did the velociraptor live?- What was the velociraptor's feeding habits like?- How did the velociraptor move?- How good was the velociraptor's sense of smell and eyesight?- Did the velociraptors roam in packs or were they solitary?... and more!Velociraptors were amazing creatures and have been studied for many years. So, if you want your child to know more than their teacher about velociraptors then you need to grab a copy of \"Meet The Velociraptor\" right now.Combining fantastic images of the velociraptor with interesting facts, this is a perfect children's book about the velociraptor.This book uses language that is simple enough for children to read on their own or to read alongside a parent, guardian or teacher.This is one of those must have books for kids."}, {"id": "142630840X", "genre": "Children's Books", "title": "National Geographic Kids Everything Ancient Egypt: Dig Into a Treasure Trove of Facts, Photos, and Fun", "description": "The ancient Egyptians thought big and built bigger, leaving behind monuments and messages that have endured for five millennia despite tomb robbers and the ravages of time. Pyramids and mummies tell us about their deaths, but new technologies are peeling the wraps off their mysterious lives. In Everything Ancient Egypt kids will discover all they want to know about the mysteries of ancient Egypt and learn new weird, wacky, and fascinating facts as well. Sections in the book include Rise of the Pharaohs, Death and the Afterlife, Life in Ancient Egypt, and Fun With Ancient Egypt (a section that provides readers with exciting hands-on learning!). Stunning photos and an interactive glossary round out this exciting and engaging new series addition."}, {"id": "B00FRT4YXI", "genre": "Children's Books", "title": "Olympics (Ancient Greek Mysteries Book 4)", "description": "All over the world, people love to watch the athletes of the Olympics compete. But just why are there Olympic Games? Why are they so important? The truth is, the modern Olympics are a return to a mysterious, ancient festival. The ancient Olympics were more than just fun and games; they helped shape Greek culture and its contributions to us.Let the history, legends and myths of ancient Greece capture your imagination, from Alexander the Great's conquest of much of the Middle East to the development of Western philosophy, the tradition of the Olympics, the secrets of reading oracles, and the puzzle of the lost city of Atlantis. This Quick Read, High-Interest, non-fiction series “Ancient Greek Mysteries” engages readers of all ages. Information on Reading Levels: Guided Reading Level: O-P, DRA 36, Spache 4.5, ATOS 4.5-5.9, Lexile 680-950, DRP 54-59"}, {"id": "1538206439", "genre": "Children's Books", "title": "The Roman Catacombs (Crypts, Tombs, and Secret Rooms)", "description": "The subterranean tombs known as the Roman Catacombs are truly time capsules. Some tunnels date to the first century. Both Jewish and Christian graves are found there, including cremated and skeletal remains, and some have only been discovered recently. Its challenging to receive permission to explore these tunnels. Luckily, young historians can find all they need to know in the well-researched pages of this intriguing book, full of extraordinary images and facts. Theyll learn much about the history of Rome and the different cultures that sought to bury their dead beneath the living in this ancient city."}]