[{"id": "B076J1DBD7", "genre": "Children's Books", "title": "Classic Franklin Stories Volume Two: Nine Books in One", "description": "A collection of nine beautifully illustrated stories featuring one of children’s fiction’s most beloved animal characters: Franklin the turtle.   Since 1986, readers everywhere have cherished Paulette Bourgeois’s classic tales about a little turtle named Franklin. Filled with lessons about facing your fears and growing up, Franklin’s adventures are the perfect bedtime stories for kids who need a little help coming out of their shells.   In these nine educational stories Franklin discovers things like the importance of keeping things neat, how to share with his little sister, and that being left out is no fun for anyone. And with each problem he solves, Franklin proves exactly why he’s the friend everyone wants to have.   This ebook includes Franklin and Harriet, Finders Keepers for Franklin, Franklin Goes to the Hospital, Franklin Is Messy, Franklin’s Blanket, Franklin’s School Play, Franklin’s Secret Club, Franklin’s Thanksgiving, and Hurry Up, Franklin."}, {"id": "B006XMM0DY", "genre": "Children's Books", "title": "150 Pictures: Just Horse Photos! Big Book of Horse Photographs, Vol. 1 (150 Pictures: Just Horses!)", "description": "This is a wonderful collection of 150 high-quality beautiful color images of taken by a series of today's top talented professional photographers."}, {"id": "0721418961", "genre": "Children's Books", "title": "Read With Ladybird 01 Ghost House", "description": "Comprising three stories, \"The Ghost House\", \"Time for School\" and \"The Raven and the Jug\", and the rhyme, \"Nightflight\", this book is designed to develop the skills that form the foundation of successful reading."}, {"id": "037593975X", "genre": "Children's Books", "title": "Squirrelly Gray (Picture Book)", "description": "SQUIRRELLY GRAY LIVES in a world without color. His TV is the only fun he has. (And it's really not much fun.) But tonight is an unusual night for the young squirrel. First he meets the Tooth Fairy, who is very nice. And then he meets the Hungry Fox, who is not so nice. So turn off that TV, Squirrelly Gray - the fun is just beginning!Mixing playful verse with comics-inspired illustration, James Kochalka has created a unique picture book and an imaginative fable that will have kids rooting for the always adorable, sometimes courageous Squirrelly Gray.From the Hardcover edition."}, {"id": "B075TJ66RQ", "genre": "Children's Books", "title": "Capsized!: The Forgotten Story of the SS Eastland Disaster", "description": "On July 24, 1915, the SS Eastland, filled to capacity with 2,500 aboard, capsized in the Chicago River while still moored to the pier. The disaster took more passenger lives than the Titanic and stands today as the greatest loss of life on the Great Lakes. Capsized! details the events leading up to the fateful day of the disaster and provides a nail-biting, minute-by-minute account of the ship's capsizing. Kids follow the lives of workers and their families, mostly first- and second-generation Polish and Czech immigrants employed by Chicago's largest manufacturer, Western Electric's Hawthorne Works. From the courage of the survivors to the despair of families who lost loved ones, Capsized! brings the stories of ordinary working people enduring the unthinkable to light. It also raises critical-thinking questions for young readers: Why do we know so much about Titanic's sinking and yet so little about the Eastland disaster? What causes a tragedy to be forgotten and left out of society's collective memory? Why was no one ever held responsible for this catastrophe? What lessons from this disaster might we be able to apply today?"}]