[{"id": "0307476464", "genre": "Science Fiction & Fantasy", "title": "1Q84 (Vintage International)", "description": "“Murakami is like a magician who explains what he’s doing as he performs the trick and still makes you believe he has supernatural powers . . . But while anyone can tell a story that resembles a dream, it's the rare artist, like this one, who can make us feel that we are dreaming it ourselves.” —The New York Times Book Review The year is 1984 and the city is Tokyo.A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector.A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s—1Q84 is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers."}, {"id": "1973181835", "genre": "Science Fiction & Fantasy", "title": "SpecOps (Expeditionary Force)", "description": "The sequel to 'Columbus Day'. Colonel Joe Bishop made a promise and he's going to keep it; taking the captured alien starship Flying Dutchman back out. He doesn't agree when the UN decides to send almost 70 elite Special Operations troops, hotshot pilots and scientists with him; the mission is a fool's errand he doesn't expect to ever return. At least, this time, the Earth is safe, right? Not so much."}, {"id": "1908237120", "genre": "Science Fiction & Fantasy", "title": "Daring Tales of Adventure Compendium 4 (Savage Worlds, TAG30007)", "description": "TAKE A TRIP ON THE PULP TRAIN! Daring Tales of Adventure Take You On A Wild Ride! Daring Tales of Adventure: Compendium 4 contains four two-fisted pulp adventures for the award-winning Savage Worlds roleplaying game."}, {"id": "1536815624", "genre": "Science Fiction & Fantasy", "title": "Phoenix Shadow (Maggie Henning & the Realm) (Volume 3)", "description": "Maggie Henning accomplished what she set out to do. She’s returned Michel from Shadow, but at a cost she couldn’t have foreseen. This isn’t the Michel she’d cared for. He’s different…changed. The Realm Prince who’d given his life to save hers has been replaced by a cold and unfeeling one she’s been forced to pledge herself to. Maggie vows to marry Michel so that she may rescue her father from the prison he’s so long been captive in. Her heart belongs to Luc. Taken from her by a cruel twist of fate, they’re now left with only fleeting dreams that never leave them enough time together. And it’s Luc, paid as a father’s tribute, which the Angels have given a sacred task- The Angel Knight, willing to risk all he is to protect that which he loves most. Time is a fickle mistress. We spend the past looking forward to it, the present rushing through it, and the future wishing for more. Curses revealed and secrets uncovered, but it’s a love that only Destiny herself could have predicted that can save them all now."}, {"id": "1535034939", "genre": "Science Fiction & Fantasy", "title": "Legendary Assassins (Legendary Heroes) (Volume 5)", "description": "Legendary Assassins is the latest volume in our series of class-focused player supplements, and while assassins are typically cast as villains, this book brings you a new take on the assassin as a killer with a code. Adventurers of every kind are quick to deal out death in the name of justice, righteousness, ambition, or greed; the Legendary Assassin simply brings a very particular set of skills to the task. Legendary Assassins brings you a revised version of the assassin class and the many-faced killer archetype, as well as brand-new assassin-focused feats and a gallery of ready-made assassin NPCs using these new rules. Whether your assassins are murderous monsters, contract killers, or principled crusaders, all of them can use the new rules within these pages to wield deception and disguise, stealth and study with deadly precision and clinical detachment to bring their targets to a swift, secret, and sudden end."}]