[{"id": "B076BXDK9W", "genre": "Science Fiction & Fantasy", "title": "The Witcher (6 Book Series)", "description": "From Book 1: The New York Times bestselling series that inspired the international hit video game: The Witcher.For over a century, humans, dwarves, gnomes, and elves have lived together in relative peace. But times have changed, the uneasy peace is over, and now the races are fighting once again. The only good elf, it seems, is a dead elf.Geralt of Rivia, the cunning assassin known as The Witcher, has been waiting for the birth of a prophesied child. This child has the power to change the world - for good, or for evil.As the threat of war hangs over the land and the child is hunted for her extraordinary powers, it will become Geralt's responsibility to protect them all - and the Witcher never accepts defeat.Blood of Elves is the first full-length Witcher novel, and the perfect follow up if you've read The Last Wish collection.Witcher novelsBlood of Elves The Time of ContemptBaptism of Fire The Tower of SwallowsLady of the LakeWitcher collectionsThe Last WishSword of DestinyThe Malady and Other Stories: An Andrzej Sapkowski Sampler (e-only)Translated from original Polish by Danusia Stok "}, {"id": "B00UE759FA", "genre": "Science Fiction & Fantasy", "title": "Ritchie Boss: Private Investigator Manager (Comp-Sci-Fi Book 3)", "description": "When computers got smart enough to program themselves, Ritchie Boss left behind his dreams of being a hacker. For a paycheck he now manages sentient programs--he's a Private Investigator Manager. When a client brings in a mysterious and ancient relic called a \"USB stick\", Ritchie has to demonstrate his hacking abilities in a race against time, with the fate of society hinging on a single critical decision.As a celebration of remix culture this story is released with a Creative Commons license that encourages creative reuse and sharing. See inside for details.Part of the Comp-Sci-Fi seriesThis story is part of a series of short stories honoring visionaries in computer science. This story is dedicated to Dennis Ritchie, the brilliant mind behind the C programming language and much of the internet as we know it.If you like this, you'll also enjoy the reading recommendations on the Geeks mailing list at http://micahjoel.info/geeks"}, {"id": "1937013502", "genre": "Science Fiction & Fantasy", "title": "Degrees of Horror (Savage Worlds, softcover, S2P10311)", "description": "Your boyfriend dumped you. You ve got exams first thing in the morning. And the world s going to end at midnight unless you stop it. Looks like another all-nighter with the study group. Degrees of Horror features a full-length Plot Point Campaign that takes the students from Freshman to Senior, and uncovers a mystery as old as the faculty themselves. The syllabus includes classroom intrigue, dark conspiracy, dusty mysteries from the past, killer exams, massive parties, and new horrors to torment the student body. Degrees of Horror also includes a full course-load of Savage Tales that work equally well with the Plot Point Campaign or your own epic saga. Degrees of Horror is a Plot Point Campaign for East Texas University. It requires that book and the Savage Worlds core rules to play."}, {"id": "1565048083", "genre": "Science Fiction & Fantasy", "title": "Clan Novel: Ravnos (Vampire: The Masquerade)", "description": "One Million Words of Terror  It began with Clan Novel: Toreador.This book, Clan Novel: Ravnos, is the seventh of a 13-book series concerning the Kindred the hugest event ever in the World of Darkness.From small details to grand spectacles, this epic series of over one million words reveals the secrets of this hidden world through the eyes of individuals on both sides of a great conflict. The continued existence of all Kindred, from the youngest neonate to the eldest Methuselah, hangs in the balance.  Tool of the Eye  Khalil Ravanna, a neonate of the Ravnos clan, is under orders to pursue Hesha, a Setite who has duped Khalil ever since he arrived in Calcutta. Khalil seeks revenge, but dares not anger his master, the great Hazimel, who has plans for his Eye now that it surveys the World of Darkness."}, {"id": "B01LPMKNF8", "genre": "Science Fiction & Fantasy", "title": "The Frozen Witch Book One", "description": "She’s in trouble – of the mythic kind. When Lilly White finds a strange box, it changes her life. It ignites the ice that has always lain dormant in her heart. Oh, and it brings her to the attention of him.And who is he? The god of revenge. He drags her into his world. A world of magic, of crime, of retribution.She’ll never escape him. And soon she’ll realize she doesn’t want to….…The Frozen Witch is a five-book action-packed urban fantasy sure to please fans of Odette C. Bell’s Angel: Private Eye. All five books are currently available."}]