[{"id": "B01J6QCFFG", "genre": "Science Fiction & Fantasy", "title": "Containment (Quantum Law Book 1)", "description": "Enter a world where Artificial Intelligence calculates Justice for All.In a society where artificial intelligence runs the judicial system, courts run efficiently, the poor get equal justice, human bias disappears, and law and order prevails because everything runs according to flawless logic… Or so the story goes…Allowed to rejoin the select ranks of Quantum Law Ministry human attorneys, Jerry Simmons will soon find himself in the midst of the case for the ages. His client stands accused of hacking into secret Quantum Law Ministry vaults. The truths he has uncovered will get him a Cryo-freeze sentence, or they will bring the whole system crashing down. Partnering with a synthetic attorney, Jerry Simmons will have to decide whether to safeguard his career, or stand up for what he once believed."}, {"id": "0765393131", "genre": "Science Fiction & Fantasy", "title": "Binti: The Night Masquerade", "description": "The concluding part of the highly-acclaimed science fiction trilogy that began with Nnedi Okorafor's Hugo- and Nebula Award-winning BINTI.Binti has returned to her home planet, believing that the violence of the Meduse has been left behind. Unfortunately, although her people are peaceful on the whole, the same cannot be said for the Khoush, who fan the flames of their ancient rivalry with the Meduse.Far from her village when the conflicts start, Binti hurries home, but anger and resentment has already claimed the lives of many close to her.Once again it is up to Binti, and her intriguing new friend Mwinyi, to intervene--though the elders of her people do not entirely trust her motives--and try to prevent a war that could wipe out her people, once and for all.Don't miss this essential concluding volume in the Binti trilogy."}, {"id": "B016C5XNC8", "genre": "Science Fiction & Fantasy", "title": "The Adventures of Anastasia Hawke: The Celeste Affair", "description": "Celeste is an airship like no other, completely automated, incredibly powerful, and hell-bent on the destruction of Washington, D.C., and the end of Abraham Lincoln's presidency. Anastasia Hawke, an agent for the newly formed Secret Service, and her young daughter are caught up in the chase to stop it. Enlisting the aid of the captain of the British Air Navy's flagship, they race across the Atlantic in a desperate attempt to prevent it from completing its function and prolonging the American Civil War. But tensions rise between Anastasia and the ship's captain, Lucius Bishop, as their personal lives collide. She's left to decide on the course of her and her daughter's future while the future of America teeters in the balance. "}, {"id": "078695745X", "genre": "Science Fiction & Fantasy", "title": "Player's Option: Heroes of Shadow: A 4th Edition D&D Supplement", "description": "For heroes who bask in darkness.The Shadowfell is a cold, grim place through which the spirits of the dead must pass on their way to . . . wherever. Dark, evil things live there, suffused with the power of shadow. Some mortals in the natural world learn how to tap into this source. Assassins. Necromancers. Hexblades. By all accounts, a ruthless lot. However, not all beings that draw strength from the Shadowfell are vile, blackhearted fiends. A few even dare to call themselves heroes, using the power of darkness to fight darkness. Are they evil? No. Deeply disturbed and hounded by their own dark demons? You bet. Player’s Option: Heroes of Shadow™ focuses on characters that fight evil in ways that make others cringe. In addition to exploring the nature of the shadow power source, this book presents races, classes, feats, powers, and other options aimed at players hungry to play the archetypal antihero with a dark edge."}, {"id": "0415970237", "genre": "Science Fiction & Fantasy", "title": "Diana Wynne Jones: The Fantastic Tradition and Children's Literature (Children's Literature and Culture)", "description": "British author Diana Wynne Jones has been writing speculative fiction for children for more than thirty years. A clear influence on more recent writers such as J. K. Rowling, her humorous and exciting stories of wizard's academies, dragons, and griffins-many published for children but read by all ages-are also complexly structured and thought provoking critiques of the fantasy tradition. This is the first serious study of Jones's work, written by a renowned science fiction critic and historian. In addition to providing an overview of Jones's work, Farah Mendlesohn also examines Jones's important critiques of the fantastic tradition's ideas about childhood and adolescence."}]