[{"id": "1772600288", "genre": "Children's Books", "title": "Where Will I Live?", "description": "This stunning photo essay takes a look at the thousands of children around the world who have been forced to flee war, terror, hunger and natural disasters, young refugees on the move with very little left except questions. It's hard to imagine, but the images here will help unaffected children understand not only what this must feel like, but also how very lucky they are. The final message is that children, even with uncertain futures, are resilient and can face uncertainty with optimism. With images from the United Nations High Commissioner for Refugees."}, {"id": "B01LYCQM9N", "genre": "Children's Books", "title": "Kids Want To Know About Unexplained Mysteries: Real LIfe Mysteries (Childrens Mystery Books)", "description": "FREE WITH KINDLE UNLIMITEDDiscover real life mysteries that are both amazing and unsolved!Did you know that a Yeti is suspected of killing 8 Russian students who were on an expedition into the Ural Mountains in 1959?  One of them even took a picture of the Yeti!Did you know that a forest in Romania is known as the most haunted forest in the world?  There are strange lights, sounds, UFOs and even the trees grow in strange ways.Did you know that Black Triangle UFOs have been sighted all over the world?  They have been described as huge and possibly 3 or 4 football fields in length.  Even the governor of Arizona reported seeing one of these monster size UFOs.Many more unsolved childrens mysteries included with pictures"}, {"id": "0307706273", "genre": "Children's Books", "title": "Emily Windsnap and the Castle in the Mist", "description": "Everybody has a secret. Mine's a little different, though. I didn't even know about it until the first day of swim class in seventh grade. You see, I'd never been allowed to go in the water before. As it turns out, swimming comes naturally to me. Very naturally. In fact, so naturally that you might even say . . . well, it's true.           Here's my secret: I figured out that I'm a mermaid."}, {"id": "1481490214", "genre": "Children's Books", "title": "Mrs. Smith's Spy School for Girls", "description": "A girl discovers her boarding school is actually an elite spy-training program, and she must learn the skills of the trade in order to find her mother in this action-packed middle grade debut that’s perfect for fans of Stu Gibbs.After a botched escape plan from her boarding school, Abigail is stunned to discover the school is actually a cover for an elite spy ring called The Center, along with being training grounds for future spies. Even more shocking? Abigail’s mother is a top agent for The Center and she has gone MIA, with valuable information that many people would like to have—at any cost. Along with a former nemesis and charming boy from her grade, Abigail goes through a crash course in Spy Training 101, often with hilarious—and sometimes painful—results. But Abigail realizes she might be a better spy-in-training than she thought—and the answers to her mother’s whereabouts are a lot closer than she thinks…"}, {"id": "1454918039", "genre": "Children's Books", "title": "Can You Canoe? And Other Adventure Songs", "description": "I'm wondering if you'd go wandering with meThrough the wilderness and woodsTo where the winds are blowin’ free.   The Grammy® Award-winning Okee Dokee Brothers—Joe Mailander and Justin Lansing—celebrate the beauty of nature and the joys of being outdoors and unplugged. Their family-friendly music aims to inspire parents and kids to get outside and get creative.Can You Canoe? journeys cross-country in 12 songs, from the rolling hills of Appalachia in the east to the canyons and campfires of the West. Along the way, The Okee Dokee Brothers’ irresistible, boot-stompin’ tunes invite kids to wander through the woods and wilderness, where they’ll discover hungry black bears and tall-tale spinners; quiet canoes and cozy camping tents; a jumpin’ jamboree and a bullfrog opera. Brandon Reese’s lively illustrations, and a CD to sing along with, will make this set a children’s classic."}]