[{"id": "B073K1P4MW", "genre": "Children's Books", "title": "Vanishing Hitchhiker (Urban Legends: Don't Read Alone!)", "description": "Vanishing Hitchhiker in the Urban Legends: Don't Read Alone! series explores the creepy story of the vanishing hitchhiker legend--from history to speculation to scientific explanation. This book is written with a high interest level to appeal to a more mature audience and a lower level of complexity with clear visuals to help struggling readers along. Considerate text includes wild facts (almost too strange to believe!) hold the readers' interest. A table of contents, glossary with simplified pronunciations, and index all enhance vocabulary and comprehension."}, {"id": "0863134416", "genre": "Children's Books", "title": "Let's Go to Wales (Lets Go: Countries)", "description": "Describes Wales' geography language, festivals, history, capital, largest cities, beaches, parks, industry, agriculture, and education"}, {"id": "0142421197", "genre": "Children's Books", "title": "Froggy Goes to Hawaii", "description": "Perennial favorite Froggy says \"Aloha!\" in this great beachy read! The bestselling Froggy is back in another adventure! This time he's off to sunny Hawaii, where his trip, of course, doesn't go quite as planned. From surfing and swimming to learning how to dance the hula, this lovable frog brings trouble wherever he goes."}, {"id": "1599201062", "genre": "Children's Books", "title": "Mummies (Amazing History)", "description": "This is an exploration of the ever-fascinating processes of mummification, from the South American desert mummies and the famous and elaborate Egyptian pharoahs to the doctors of the 19th century experimenting with embalming techniques, and famous modern mummies, such as Lenin. A large section of the book covers bodies that have been mummified accidently, such as those remarkably preserved within the cold dry air of the Sicilian tombs, and bodies preserved through natural chemicals in bogs or frozen in mountain glaciers. Information panels throughout the book lead the reader to further discovery and each chapter offers website links, book lists, places to visit and career information."}, {"id": "B00LFWP5QQ", "genre": "Children's Books", "title": "Twenty-Four Claude Monet's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Claude Monet's Paintings. Twenty-Four Claude Monet’s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}]