[{"id": "B00O6APZ7I", "genre": "Children's Books", "title": "49 Excuses for Not Doing Your Homework (The 49... Series Book 3)", "description": "Forgotten to do your homework?... Heart pounding in your chest?... No one willing to swap for your lunch money?… Here's 49 (extremely silly) excuses for not doing your homework! Join the hilarious adventure of these cheeky kids who will try absolutely anything to wriggle away from the menacing teacher stare. With an illustration for each haphazard attempt you're guaranteed to laugh, smirk, and chuckle for hours. Disclaimer: reading this eBook will definitely get you into trouble! (So if your teacher asks where you heard these excuses you didn’t hear them for me).Recommended Age: 10+"}, {"id": "0590480472", "genre": "Children's Books", "title": "Favorite Norse Myths", "description": "The stories of mythological Nordic creatures, such as Odin and Thor, are brought together in this powerful tale with bold illustration for middle readers. Reprint."}, {"id": "0545091020", "genre": "Children's Books", "title": "The Hunger Games (Book 1)", "description": "A heart-stopping, page-turning first novel of a new YA trilogy from the author of the New York Times bestselling Underland Chronicles series.Format: 9 CDs, UnabridgedKatniss is a 16-year-old girl living with her mother and younger sister in the poorest district of Panem, the remains of what used be the United States. Long ago the districts waged war on the Capitol and were defeated. As part of the surrender terms, each district agreed to send one boy and one girl to appear in an annual televised event called, \"The Hunger Games.\" The terrain, rules, and level of audience participation may change but one thing is constant: kill or be killed. When Kat's sister is chosen by lottery, Kat steps up to go in her place. NARRATED by Carolyn McCormick"}, {"id": "B0781ZMD9K", "genre": "Children's Books", "title": "Marigold's Magic Doors", "description": "Marigold's Magic Doors is a fun filled fantasy with quirky characters.Every Magic Door is another adventure.Sensational spiders spinning bee size stretchers. Fairies painting rainbows. Heavenly Henry polishing the moon. Starlets making the stars shine extra bright. Little Round Puffers blowing up a storm.Mr Know-A-Bit teaching us about the sky."}, {"id": "1897349149", "genre": "Children's Books", "title": "Canadian Flyer Adventures #7: Hurry, Freedom", "description": "An antique sled with amazing powers has taken Emily and Matt across the continent and all through time. They’ve come face to face with pirates, prospectors, the Vikings, and even dinosaurs. Now, in the seventh title in the Canadian Flyer Adventures series, they’re off on their most important journey yet \u0097 helping along the Underground Railroad, where they meet Harriet Tubman and Dr. Alexander Ross. A special section at the back of the book gives readers additional facts about the abolition movement."}]