[{"id": "B009DMMCKM", "genre": "Children's Books", "title": "Caleb's Hanukkah (Cloverleaf Books ™ — Fall and Winter Holidays)", "description": "Caleb is excited to spin the dreidel! His family is celebrating Hanukkah. For eight days, they light candles on the menorah. They eat latkes and open presents. And of course, they play the dreidel game!"}, {"id": "0001979582", "genre": "Children's Books", "title": "Soccer (Faxfinder)", "description": "A collection of useful facts, useless facts and humorous facts about soccer from kick-off to the final whistle. This title is one of a series and can either be used alone or organized into a personalized encyclopedia."}, {"id": "0531071685", "genre": "Children's Books", "title": "Tchaikovsky Discovers America", "description": "Eleven-year-old Jenny, whose family came from Russia to America to start a new life, meets the famous Russian composer on his 1891 trip to the New World and writes about it in her diary."}, {"id": "0764138510", "genre": "Children's Books", "title": "Leonardo and the Flying Boy (Anholt's Artists Books For Children)", "description": "Zoro is a little boy in 17th-century Italy, long before airplanes flew in the sky. But Zoro is also an apprentice to the artist and inventor Leonardo da Vinci―and Leonardo is experimenting with a revolutionary flying machine! This is a title in Barron’s  Anholt’s Artists Books for Children  series, in which author and illustrator Laurence Anholt recalls memorable and sometimes amusing moments when the lives of the artists were touched by children. Anholt’s fine illustrations appear on every page and include reproductions of works by the artists."}, {"id": "1432952439", "genre": "Children's Books", "title": "Yemen (Countries Around the World)", "description": "Yemen offers complete coverage of this fascinating country, including sections on history, geography, wildlife, infrastructure and government, and culture. It also includes a detailed fact file, maps and charts, and a traceable flag."}]