[{"id": "1545014787", "genre": "Children's Books", "title": "Legend of the Fairy Cross", "description": "Deep in the woods in what is now called Virginia, the fairies lived regular lives among the forest animals. One day, a group of fairies from a far-away land arrived at their village. The visitors had been traveling for over 30 years, telling all the fairies of all the lands that the Great Prophecy had been fulfilled. The Savior of the world had been born! Wanting to learn all about the Savior, a small band of fairies was chosen to travel across the great sea to find Him and learn His teachings. But, after a long and perilous journey, will they make it in time … or will their arrival be too late? This book is the story of Jesus, but told from a unique point of view. The events about Jesus are accurately portrayed from the Holy Bible. For ages 9 and up."}, {"id": "1973738724", "genre": "Children's Books", "title": "Kids' Fantasy: Legend of the Sword (Kids’ Adventure Stories)", "description": "Read about the legend of the cursed villagers of Syra and a hero who finds a sword.  Grandma tells her grandchildren about Valerius, a brave young man who faced numerous hordes of filthy creatures and fights for his life. The village of Soriah has a dark past, and fate has caught up with them. The only person standing between an endless life of doom and wandering of undead zombies and skeletons, is a foreign farmer’s boy, who discovers that he has nothing to lose and anything to gain by starting an epic adventure in search of a special sword."}, {"id": "B00Z60N8PI", "genre": "Children's Books", "title": "Anna Banana and the Chocolate Explosion", "description": "Anna Banana is at it again! The lovable tyrant from Sleep Tight, Anna Banana! is up to no good, and so are all of her beloved stuffed animals. In this adorable sequel to the 2014 picture book, Anna Banana and her stuffed pals set out to make a chocolate cake...and end up making a big, big, big mess.With all the charm and whimsy that won reader's hearts in the first book of the series, Anna Banana and the Chocolate Explosion will give Anna Banana's fans more of what they love...and win over new readers."}, {"id": "0786853263", "genre": "Children's Books", "title": "The Mythical World of Atlantis, from Plato to Disney: Theories of the Lost Empire", "description": "An account of the legend of Atlantis in mythology, literature, and popular culture, and in the theories of Ignatius Donnelly and Helena Blavatsky, leads into an introduction to the Disney film and its characters."}, {"id": "1435288297", "genre": "Children's Books", "title": "Arthur and the Dog Show (Arthur Adventure Series)", "description": "The annual Elwood City Dog Show is coming up and Arthur wants Pal to enter. They spend all week practising tricks and commands but when it's Pal's turn in front of the judges he does everything wrong. Arthur feels like all his hard work was for nothing until Pal and the judges show him that you don't have to be good at tricks to deserve a prize."}]