[{"id": "1622127358", "genre": "Children's Books", "title": "Zoo on the Moon", "description": "Zoo on the Moon is a whimsical poem that explores the possibilities that come with weightlessness. Children will be delighted as zoo animals dance, fly, and play in space when there is a Zoo on the Moon.  This delightful poem is told from the perspective of a cheeky Meerkat. It is through his eyes that young readers will envision themselves living out the unexpected and imaginative experiences of this wondrous lunar zoo.    Author Robin Martin-Duttmann has enjoyed working as an Educational Assistant at the Elementary level for the past 12 years. She lives in a beautiful town in Southwestern Ontario, with her husband and two children. She wishes to foster a love of reading and inspire the imagination of children with her writing. Although in the past she has written many stories for children, Zoo on the Moon is her first published work.   Publisher's website:  http://sbpra.com/RobinMartin-Duttmann"}, {"id": "0692648488", "genre": "Children's Books", "title": "Nosey's Wild Ride on the Belle of Louisville (English)", "description": "Zip, Zoom, Whoosh -- this cat is fun!  In this award-winning book, an adventurous cat, Nosey, takes readers on an action-packed journey through the Belle of Louisville, the oldest operating river steamboat in the United States. Nosey scampers on board and leads four children on a wild chase all over the boat. This rascal cat causes pandemonium wherever he goes. In turn, the children learn what makes a steamboat unique.  The book includes the whimsical illustrations of award-winning artist, Susan Andra Lion, and a Seek-&-Find activity for young readers. Both children and adults will enjoy this historically accurate and highly informative book about one very special steamboat, the Belle of Louisville (remarkably, she is over 100 years old, and the only steamboat in the country built during the Great Steamboat Era -- 1820s to the 1920s -- that is still cruising).  AWARDS: Story Monsters Ink Seal of Approval, Mom's Choice Gold Award, Creative Child Magazine 2017 Seal of Excellence, Literary Classics 2017 Gold Award Finalist"}, {"id": "0062404318", "genre": "Children's Books", "title": "Pete the Cat and the Tip-Top Tree House (My First I Can Read)", "description": "New York Times bestselling author and artist James Dean takes readers along for a fun, groovy adventure with Pete the Cat!In Pete the Cat: Tip-Top Tree House, Pete invites all of his friends over to spend time in his tree house. When they climb up, they realize the tree house is not big enough to fit everyone! They all work together to build the coolest tree house ever.Pete the Cat: Tip-Top Tree House is a My First I Can Read book, which means it’s perfect for shared reading with a child."}, {"id": "0590372068", "genre": "Children's Books", "title": "Sensational Trials of the 20th Century", "description": "Eight of America's most important legal battles, including Brown v. Board of Education, the Watergate trials, and the O.J. Simpson trial, are revisited in brief, fast-paced accounts and dramatic black-and-white photographs."}, {"id": "1684151244", "genre": "Children's Books", "title": "Bodie Troll", "description": "What Bodie Troll lacks in ferocity, he makes up in spirit!ALL FEAR THE GUARDIAN OF HAGADORN!  Bodie Troll is a fearsome creature. The villagers of Hagadorn whisper tales of his ferociousness and tread lightly when they cross his bridge. At least . . . that’s what Bodie would like to think. Despite his desires to strike fear in the hearts of others, Bodie is a cute and cuddly grump of a troll. But what he might lack in ferocity, he makes up for in spirit. Alongside his Fairy Godmother and his best friend Cholly, Bodie has a habit of finding trouble and adventure. Whether it’s protecting the village from spellbound beasts or performing shape-changing theater, Bodie Troll is up for the challenge. If he’s lucky, he just might scare someone along the way.  Written and illustrated by Jay Fosgitt (Rocket Raccoon & Groot), Bodie Troll is a rollicking fantasy adventure celebrating the importance of stalwart friendships and being true to oneself."}]