[{"id": "1547097884", "genre": "Children's Books", "title": "Happy 57th Birthday: Birthday Memory Book, Birthday Journal Notebook For 57 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0007179677", "genre": "Children's Books", "title": "The Cow That Laid An Egg", "description": "A madcap, yet moving, story about having the courage of one's convictions, even when others doubt you, from the creator of 'Albie', Andy Cutbill, and the award-winning illustrator, Russell Ayto. Marjorie the cow doesn't feel very special. She can't ride bicycles or do cartwheels like the other cows. But one morning, Marjorie is astonished to discover something extraordinary... She's laid an egg! But does the baby inside the egg really belong to Marjorie? Emotions run high in the farmyard as everyone waits to find out..."}, {"id": "1684101921", "genre": "Children's Books", "title": "Fourth of July (Holidays in Rhythm and Rhyme)", "description": "On the Fourth of July, Americans remember the founding of the United States. On this day, people gather for picnics and watch parades and fireworks. Sing along as you explore Holidays in Rhythm and Rhyme! Includes online music access."}, {"id": "0761352082", "genre": "Children's Books", "title": "Anne Hutchinson (History Maker Bios)", "description": "Each book in this middle-grade series is illustrated with photographs and illustrations while sidebars, a timeline and entertaining cartoons further illuminate each subject's personality."}, {"id": "0241253586", "genre": "Children's Books", "title": "The Lost Words", "description": "THE SUNDAY TIMES TOP TEN BESTSELLER'My top book of the year' Susan Hill, Spectator'Gorgeous to look at and to read. Give it to a child to bring back the magic of language - and its scope' Jeanette Winterson, Guardian 'The most beautiful and thought-provoking book I've read this year' Frank Cottrell-Boyce, ObserverFrom bestselling Landmarks author Robert Macfarlane and acclaimed artist & author Jackie MorrisAll over the country, there are words disappearing from children's lives. These are the words of the natural world - Dandelion, Otter, Bramble and Acorn, all gone. The rich landscape of wild imagination and wild play is rapidly fading from our children's minds.'Gorgeous' ObserverThe Lost Words stands against the disappearance of wild childhood. It is a joyful celebration of nature words and the natural world they invoke. With acrostic spell-poems by award-winning writer Robert Macfarlane and hand-painted illustration by Jackie Morris, this enchanting book captures the irreplaceable magic of language and nature for all ages.'Robert Macfarlane and Jackie Morris have made a thing of astonishing beauty' Alex Preston, Observer"}]