[{"id": "0763692158", "genre": "Science Fiction & Fantasy", "title": "A Monster Calls: A Novel (Movie Tie-in): Inspired by an idea from Siobhan Dowd", "description": "Patrick Ness's #1 New York Times bestseller now in a movie tie-in version with a striking new cover.The monster in Conor's backyard is not the one he's been expecting — the one from the nightmare he's had every night since his mother started her treatments. This monster is ancient. And wild. And it wants something from Conor. It wants the truth. From the final idea of award-winning author Siobhan Dowd—whose premature death from cancer prevented her from writing it herself—Patrick Ness has spun a haunting and darkly funny novel of mischief, loss, and monsters both real and imagined. This paperback movie tie-in edition includes a book group discussion guide."}, {"id": "1784964565", "genre": "Science Fiction & Fantasy", "title": "Legacy of Caliban: The Omnibus", "description": "Omnibus edition of the Legacy of Caliban trilogy, featuring the mysterious Dark Angels Space Marines.Descendents of the First Legion, the Dark Angels are peerless warriors with a knightly heritage from their sundered home world of Caliban. Amongst their hallowed ranks are the lightning fast Ravenwing and the stalwart Deathwing. But the Legacy of Caliban is dark, and the need for atonement is great and echoes through the ages. Ever do the Dark Angels hunt the mysterious Fallen, their greatest shame and their darkest secret. This omnibus edition contains the novels Ravenwing, Master of Sanctity and The Unforgiven, along with the short story collection Lords of Caliban."}, {"id": "0316469106", "genre": "Science Fiction & Fantasy", "title": "The Fifth Ward: Friendly Fire", "description": "In the most dangerous district of the city, the Fifth Ward, Rem and Torval have been perfecting their good cop, bad cop routine while protecting residents from drug-dealing orcs, mind-controlling elves, uncooperative mages, and humans being typical humans.But when a perplexing case of arson leads to a series of gruesome, unsolvable murders, the two partners must challenge their own assumptions and loyalties if they are to preserve their partnership, wrest justice from the chaos, and keep their ward from tearing itself apart. \"A brilliant premise, wonderfully told. A city that breathes, and heroes you can't help but root for.\" -- Nicholas Eames, author of Kings of the Wyld\"A glorious tour through fantasy's seamier side. A wilder ride than Middle Earth, and you'll love every minute of it!\" -- Jon Hollins, author of the Dragon Lords seriesFor more from Dale Lucas, check out The Fifth Ward: First Watch."}, {"id": "B077NYTNSJ", "genre": "Science Fiction & Fantasy", "title": "One Too (46. Ascending)", "description": "Telepathy creates as many problems as it solves, as most of the members of the secret organization x0 would admit. When new member Lola discovers another group of telepaths with a completely different approach, those problems multiply at the speed of thought.Soon, Lola’s family and friends are in danger. Fortunately, she’s not your average budding psychic. Each person with whom she is close has a special gift of their own. That’s good, because it’s going to take every power they possess to keep this other group from destroying x0."}, {"id": "B0761JPBQS", "genre": "Science Fiction & Fantasy", "title": "On Silver Wings (7 Book Series)", "description": "From Book 1: When the Colony on Hayden's world went black, a team was sent to investigate. It was supposed to be a training mission : skip in, find out the Casimir Transmitter had gone dead, report back and wait for resupply from the Fleet. By the time the only surviving member of the team made landfall, it was spectacularly clear that this wasn't a training mission.  Now Sgt Sorilla Aida has a job to do. She has to gather the local survivors, recon the enemy, train a militia, and take the war right to the enemy's doorstep.  Just what she trained for.  De Opresso Liber"}]