[{"id": "B004PGNQHO", "genre": "Children's Books", "title": "Turtles In My Sandbox", "description": "When a diamondback terrapin lays eggs in a girl’s sandbox, she becomes a “turtle-sitter.” She raises the hatchlings until they become big enough to fend for themselves in the wild and then releases them. Along the way, she learns about these unique animals and that she has made an important contribution to their survival. 2006 ASPCA Henry Bergh Children’s Book Award finalist 2009 Everglades Reading List Reviewed by: School Library Journal, Kirkus Reviews, The Bloomsbury Review, Library Media Connection, The Midwest Book Review, CLCD4-6 pg For Creative Minds educational section in the back40-60 pg cross-curricular Teaching Activities and 3 Interactive Quizzes available free on the book’s homepageeBooks with Auto-Flip, Auto-Read and selectable English and Spanish text and audio"}, {"id": "1444933272", "genre": "Children's Books", "title": "Nadiya's Bake Me a Story: Fifteen stories and recipes for children", "description": "Join Great British Bake Off sensation Nadiya Hussain for scrumptious stories and delicious bakes that all the family can enjoy.A unique combination of storybook and cookbook, with all recipes and stories devised and written by Nadiya herself, Nadiya's Bake Me a Story brings families into the kitchen to spend time together sharing stories and cooking. - Make yummy butter-bean patties and, while they are in the oven, enjoy the story of Jack and the Bean-Patty Stalk- Meet Ruby-Red and the Three Bears, then bake your Very-Berry muffins- Join Rapunzel on an adventure, then make her carrot and nutmeg cookies- Bake some pumpkin and spice flapjacks, then curl up with the tale of Cinderella and her pumpkinsCombining playful photography of Nadiya and her children with vibrant illustrations by Clair Rossiter, this glorious celebration of the joy of sharing food and stories is the perfect addition to every family's kitchen!"}, {"id": "B00C2IECUM", "genre": "Children's Books", "title": "Jump Into Science: Coral Reefs", "description": "Earle takes children on an undersea journey to explore an amazing \"underwater city.\" She explains the formation of coral reefs and provides information about the conditions needed for survival. In addition, the author introduces other animals that live in and near the reef and stresses the importance of protecting corals from pollution. Matthews's ink-and-gouache paintings bring the colors and variety of this habitat to life. The book also includes a simple experiment that demonstrates how \"filter feeders\" strain food from the water."}, {"id": "177049801X", "genre": "Children's Books", "title": "1, 2, 3 Cheers for the Toronto Maple Leafs!: An Official Toronto Maple Leafs Book of Numbers", "description": "In 1, 2, 3 Cheers for the Toronto Maple Leafs!, Matt Napier and Melanie Rose take us on a tour of Maple Leafs history though vivid illustration and rhyming verse. For children learning their numbers, it has never been this fun -- whether it's Tim Horton's number SEVEN, Darryl Sittler's TEN points in one game, the Leafs' THIRTEEN Stanley Cups, Rick Vaive's FIFTY-goal year, or celebrating the Leafs' ONE HUNDRED years as a team. This book captures the spirit of \"Canada's game.\" 1, 2, 3 Cheers for the Toronto Maple Leafs! is destined to become a classic that will be handed down from generation to generation."}, {"id": "0887436323", "genre": "Children's Books", "title": "Addition and Subtraction Flash Action Software (School Zone Interactive Flash Action Software)", "description": "Flash Action Addition & Subtraction transforms math into exciting learning games that help children practice addition and subtraction. Audio guidance colorful graphics animated rewards and positive reinforcement motivate learning. (Ages: 6-10 | 1 CD-ROM | Dimensions 8.625x5.625in)"}]