[{"id": "1973790556", "genre": "Children's Books", "title": "The Tale of Squirrel Nutkin", "description": "The Tale of Squirrel Nutkin is a children's book written and illustrated by Beatrix Potter.  The story is about an impertinent red squirrel named Nutkin and his narrow escape from an owl called Old Brown.  The book followed Potter's hugely successful The Tale of Peter Rabbit, and was an instant hit. The now familiar endpapers of the Peter Rabbit series were introduced in the book."}, {"id": "1416905081", "genre": "Children's Books", "title": "Groundhog Day (Robin Hill School)", "description": "Even after the thorough discussion of the traditions of Groundhog Day, Mrs. Connor's students decide that they have much more faith in the predictions of their favorite class pet, Chester the hamster, and so collectively decide to disregard the groundhog outside and watch what Chester does instead! Simultaneous."}, {"id": "0919879934", "genre": "Children's Books", "title": "Blue Whales (Amazing Animals Series)", "description": "An introduction to the blue whale's physical features, habitat, life cycle, and relationships with other animals, as well as conservation efforts and related facts."}, {"id": "B00C81QUQC", "genre": "Children's Books", "title": "Tarsier Man: Scheme For A Theme", "description": "Tarsier Man is back and ready to go on the attack. But humans won't call him for the save, no matter if he is brave. So Tarsier Man devised a plan. What does he need to be able to do a superhero deed? A theme song. One which everyone will want to sing along.Follow Tarsier Man's second adventure with glee, as he sets his theme free. That is if he ever gets one to give a run. You can find out that and more by adding another Tarsier Man adventure from Pat Hatt to your shore."}, {"id": "0394861027", "genre": "Children's Books", "title": "It's Not Easy Being a Bunny (Beginner Books(R))", "description": "This Beginner Book starring P.J. Funnybunny is a bunny-rific tale of discovery that's perfect for springtime reading!Meet P. J. Funnybunny in this humorous and touching Beginner Book by Marilyn Sadler and Roger Bollen. It’s Not Easy Being a Bunny tells the “tail” of P.J. and his quest to become something other than what he is. Is it more fun to be a bear, a bird, or a pig? Read along as P.J. tries to determine who he is—and where he belongs. Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.\"Sick of being a bunny, P. J. Funnybunny takes off to become a bear. Hibernation gets dull, so he tries being a bird. And so it goes, with beavers, pigs, possums, and skunks—till P. J. realizes that bunnyhood is for him. The short, repeating text is ideal for beginners and the bright, humorous cartoons will get immediate attention.\" —School Library Journal.  "}]