[{"id": "B075FYVFYY", "genre": "Science Fiction & Fantasy", "title": "The Rebels of Gold (Loom Saga Book 3)", "description": "A new rebellion rises from the still-smoldering remnants of the five guilds of Loom to stand against Dragon tyranny. Meanwhile, on Nova, those same Dragons fight amongst themselves, as age-old power struggles shift the political landscape in fateful and unexpected ways. Unlikely leaders vie for the opportunity to shape a new world order from the perfect clockwork designs of one temperamental engineer.This is the final installment of USA Today bestselling author Elise Kova's Loom Saga, THE REBELS OF GOLD will reveal the fate of Loom's brilliantly contrasting world and its beloved inhabitants.Books in the Loom Saga:1. THE ALCHEMISTS OF LOOM2. THE DRAGONS OF NOVA3. THE REBELS OF GOLD"}, {"id": "1558780106", "genre": "Science Fiction & Fantasy", "title": "Satellite Down (Twilight: 2000)", "description": "\"In Satellite Down, the characters get to take a trip to sunny Baja California, where they must retrieve some data cassettes from a [Soviet] weather/recon satellite that managed to record the weather patterns of the last three years. Whoever has the information on those tapes will be able to forecast the effects of the climatic changes caused by the war -- and be better able to survive them. The only thing standing in their way is a do-it-yourself messiah and a few hundred fanatic followers.\""}, {"id": "0786902884", "genre": "Science Fiction & Fantasy", "title": "Player's Secrets of Tuornen (AD&D: Birthright Domain Sourcebook)", "description": "Take the throne of Tuornen, rules its proud people, and reap the rewards of its rich lands. But beware, for Tuornen faces threats from many quarters. The scheming Duke of Alamie wants to regain control over the rebellious domain that broke from his grandfather's archduchy - your domain. Your hotheaded lieutenant wants to wage a war Tuornen cannot win. Two powerful regents of neighboring domains want your loyalty for their own...and Rhuobhe Manslayer wants your head on a pike. Player's Secrets of Tuornen includes:A full-color, eight-page foldout cover containing maps of the domain and its holdings.The history of Tuornen and its war of independence from Alamie.Details about political, social, and cultural life.Descriptions of Commander Braedonnal \"Firebrand\" Tuare, Mad Maeve, Baubb the Toymaker, and other colorful personages.Rumors, secrets, and plots against you.Strategy tips for governing Tuornen wise and well.This BIRTHRIGHT domain sourcebook is designed for players who want to run a fighter of rogue character in the role of the duke - or play a vassal who controls holdings within Tuornen, a noble of the court, an itinerant adventurer, or a commoner."}, {"id": "B0137IKZP6", "genre": "Science Fiction & Fantasy", "title": "Moseh's Staff (The Artifact Hunters Book 4)", "description": "                  All things must come to an end...London is in the frozen grip of an unnatural winter and Queen Victoria wants answers. Cara and Nate know who - the Curator. The queen's artifact hunters just don't know what is responsible. Cara is on the trail of an ancient and powerful artifact capable of freezing a city and stirring demons. First she must confront her past and her father's history. Only in learning why her father became a disciple of the Curator can she hope to learn what the old noble seeks and why he is so fascinated by her.Then tragedy strikes and the bond forged by Nefertiti's Heart is severed. Nate without Cara succumbs to his darkness and he lashes out at those he holds responsible for her loss. Meanwhile, in the shadows, Inspector Fraser waits for his opportunity to pull down the man known as the villainous viscount.With London entombed in ice and all hope lost, could this be the end...?"}, {"id": "1517424682", "genre": "Science Fiction & Fantasy", "title": "1: The Untold Stories of Neverbeen Universe: Short Story Collection (Volume 1)", "description": "This awaits you in part one of “The Untold Stories of Neverbeen Universe“: The timetraveller 'Tora' crashlands in the wrong past where he gets arrested and questioned for a crime he did not commit. And while he tries to get his capsule back he encounters people he would not have guessed to meet there on that icy planet; Grumpy Phobos is very confused about his strange relationship with 'the Manipulative Hag' Ayumu. But if he gets past all this denial he might reach some kind of epiphany... Being a god can be hard, especially if the people putting their faith into you decide so for themselves and you have no say in being worshipped. Bál and Rhiannon are two of these Dhias, who are coping very differently as 'gods against their wills'; Childeryk is very contented with going ice bear hunting and sailing the polar seas of Niflheimr, but then his life changes drastically once he gets a peculiar Midgardian for a wife. Five more short stories and nine afterimages fitting to the stories are included and waiting for you to be discovered."}]