[{"id": "0394869257", "genre": "Children's Books", "title": "The People Could Fly: American Black Folktales", "description": "\"The well-known author retells 24 black American folk tales in sure storytelling voice: animal tales, supernatural tales, fanciful and cautionary tales, and slave tales of freedom. All are beautifully readable. With the added attraction of 40 wonderfully expressive paintings by the Dillons, this collection should be snapped up.\"--(starred) School Library Journal.  This book has been selected as a Common Core State Standards text Exemplar (Grade 6-8, Stories) in Appendix B.From the Trade Paperback edition."}, {"id": "1629440450", "genre": "Children's Books", "title": "Burn: Michael Faraday's Candle", "description": "Buy the paperback, get ebook free. Give one, keep one.   COOL SCIENCE THAT WILL AWE KIDSSolid wax is somehow changed into light and heat. But how? Travel back in time to December 28, 1848 in London, England to one of the most famous juvenile science Christmas lectures at the Royal Institution. British scientist Michael Faraday (1791-1867) encouraged kids to carefully observe a candle and to try to figure out how it burned. Known as one of the best science experimenters ever, Faraday's passion was always to answer the basic questions of science: \"What is the cause? Why does it occur?\"Since Faraday's lecture, \"The Chemical History of a Candle,\" was published in 1861, it's never been out of print. Oddly, till now, it's never been published as a children's picture book. Faraday originally gave seven lectures on how a candle burns. Pattison has adapted the first 6000-word lecture to about 650 words for modern elementary students. "}, {"id": "0750234334", "genre": "Children's Books", "title": "Growing Up in the Thirties", "description": "This book features interviews with five people from different walks of life - rich, poor, urban and country dwellers - who grew up during the 1930s. Their memories and reflections combined with historical information give a real picture of what life was like as a child during the Depression era: what their home was like; what food they ate and how much it cost; what games they played; where they went to school and how they travelled around. Readers will learn about special occasions such as Saturday cinema, village fairs and holidays on the beach. The book is illustrated with photographs supplied by the contributors themselves, supplemented by more general photos, posters and artefacts from the time."}, {"id": "0823430693", "genre": "Children's Books", "title": "When the Wind Blows", "description": "While the blowing wind makes \"porch doors sway\" and \"sea waves spray,\" it is responsible for much, much more. These same breezes send electron power traveling down windmills and circuits to ignite electricity. Electrons travel through power lines, and electricity charges the national grid so that lights may be turned on, cold homes may be warmed, and warm homes may be cooled. The guests can help make \"Factories hum / Harbors light up / Smart cars run.\" In a poetic text and sweeping landscape paintings, this picture book explores the many facets of the wind."}, {"id": "1407518925", "genre": "Children's Books", "title": "Bear's Snowy Cave: A Look and Learn Story (Acetate Picture Windows)", "description": "In a book with clear picture windows, a polar bear and her cubs leave their cave to explore."}]