[{"id": "1512456802", "genre": "Children's Books", "title": "John Cook's Civil War Story (Kids in War)", "description": "Gunfire rang out across the countryside as fifteen-year-old John Cook watched his unit struggle during the Battle of Antietam. Union troops were falling fast as they tried to push Confederate forces out of Maryland. With only a few soldiers left standing, John knew he had to do something. Follow John as he joins in, fighting against all odds to defend his unit during the bloodiest day of the Civil War."}, {"id": "B003TO59SW", "genre": "Children's Books", "title": "Whispering Hope (Keystone Stables Book 7)", "description": "\"A wild horse and an angry young woman. Is there a secret to taming them both?Wanda Stallord is a wild, nasty handful when she first comes to Keystone Stables, and Skye is put off by the teenager’s grungy clothes and thirst for trouble. The former gang member is a lot like Keystone’s other recent arrival, a beautiful but uncontrollable Mustang called Rebel.Skye wants to help Wanda, but she seems interested only in shooting pool and handing out insults. But as she practices the gentle art of horse whispering with Rebel, Skye discovers a key that just might open up for Wanda’s fearful, lonely heart to the healing power of God’s love.\""}, {"id": "1429617365", "genre": "Children's Books", "title": "The U.S. Navy (Military Branches)", "description": "Discover the military branches that keep our country safe. Big photographs show the powerful machines, high-tech tools, and brave people that make up the U.S. military."}, {"id": "1554535700", "genre": "Children's Books", "title": "Earth-Friendly Buildings, Bridges and More: The Eco-Journal of Corry Lapont", "description": "Introducing Corry Lapont: 12-year-old and aspiring \"green\" engineer. This dynamic title takes the form of Corry's scrapbook. It's a dazzling collection of postcards, brochures and other memorabilia documenting Corry's research into green design. Kid-friendly language explains the engineering behind some of the planet's most cutting edge towers, bridges, tunnels, domes, dams, dikes, locks and levees. These structures include the Vizcaya Bridge in Spain, where gondolas transport cars over the Nervion River, and the Channel tunnel, where trains speed between England and France in just 35 minutes. Readers will explore the environmental impact of structures, such as the pros and cons of dam construction and how rainwater can be used to cool buildings. Complex concepts are clarified with simple activities, as well as colorful drawings, fun facts and the occasional wisecrack from Corry's kid brother, Riley."}, {"id": "0375828370", "genre": "Children's Books", "title": "Hop on Pop", "description": "A condensed, board book version of the classic bestseller, perfect for babies and toddlers. Introduces the youngest readers to the wonderful world of Seussian word play."}]