[{"id": "0761314997", "genre": "Children's Books", "title": "Vince Carter: Fire Burns Brigh (Basketball's New Wave)", "description": "Traces the life and career of the Toronto Raptors star athlete, who also played on the U.S. Dream Team in the Oympics, from his childhood in Daytona Beach, Florida, to his troublesome friendship with cousin and former teammate Tracy McGrady. Simultaneous."}, {"id": "0786821272", "genre": "Children's Books", "title": "Engine Engine Number Nine", "description": "A lively, rhythmic text and bold illustrations bring to life a boisterous train ride as all the passengers--human and animal--board Number Nine to go on a journey to the county fair to have a day of fun."}, {"id": "1425715214", "genre": "Children's Books", "title": "Prince, A Working cat", "description": "Twelve years ago Prince was an indoor cat. One day he got out and disappeared for 3 weeks. When he returned home he was dragging his hind legs. Immediately, his owner took him to the animal hospital. After many weeks the veterinarian made Prince almost as good as new, but nothing could fix his broken back. So he was paralyzed from his waist down. Prince did not see himself as any different from other cats. In his head he was exactly like before, except he now wore a diaper instead of using the litter pan. When Prince left behind his old world for the new he decided to be part of the action and the team. He gave himself jobs. He did not see himself as paralyzed. He saw himself as \"Prince, a Working Cat\". He became a teacher, nurse, helper and friend to the many, many helpless, sick, hurt and frightened animals he saw every day. This new life kept him busy."}, {"id": "1771602856", "genre": "Children's Books", "title": "West Coast ABCs", "description": "Ahoy, away we go! Join bestselling children’s book illustrator Jocey Asnong on another colourful journey as she highlights the West Coast region of Canada in this playful alphabet book.Jocey Asnong's third board book teaches letter recognition while celebrating many familiar landmarks and habitats of coastal British Columbia. Climb with cougars in Cathedral Grove, glide down groomed hills at Grouse Mountain, soar with ravens over rainforests, and watch for whale tails at Wickaninnish Beach. From Vancouver’s harbour to the beaches of Haida Gwaii, and from tidal pools to mountain summits, this early concept board book features many marine mammals, and other ocean dwellers, along with birds and other rainforest animals in showcasing the amazing diversity of this unique region."}, {"id": "0060742364", "genre": "Children's Books", "title": "Lilly's Big Day", "description": "Mr. Slinger has big news.He's getting married.Married!Lilly has big plans.She's going to be the flower girl.(Lilly has always wanted to be a flower girl.Even more than a surgeon or a diva or a hairdresser.)But what's the biggest,the best,the most perfect thing of all?You're invited to the wedding -- so start reading!"}]