[{"id": "1633626458", "genre": "Children's Books", "title": "Athletic Trainer (21st Century Skills Library: Cool STEAM Careers)", "description": "Readers will learn what it takes to succeed as an athletic trainer. The book also explains the necessary educational steps, useful character traits, potential hazards, and daily job tasks related to this career. Sidebars include thought-provoking trivia. Questions in the backmatter ask for text-dependent analysis. Photos, a glossary, and additional resources are included."}, {"id": "1546866361", "genre": "Children's Books", "title": "Fidget Spinner: 20+ Epic Tricks (A Fidget Spinner Tricks Book)", "description": "UPDATED EDITION: We read your reviews! This is the NEW & IMPROUVED version! (4th Aug 2017) Looking for tons of cool Fidget Spinner tricks? Well then, you’ve come to the right place! This book is packed with tons of fun fidget spinner tricks that will keep both kids and adults entertained for hours. With easy to follow step by step instructions you’ll be a fidget spinner pro in no time. These days kids are always stuck on their tablets or smartphones, technology seems to drive families apart even when they are sitting in the same room. Why not go back to the good old days when simple toys provided hours of fun and entertainment for the entire family! Some tricks included are: • The Hot Potato • The Football Trick • The UFO Spinner • The Ten-Finger Spin • Plus Many Many More Grab your copy now! Extra large 8x10 illustrations so kids won't strain their eyes. A great book to coincide with any fidget spinner, finger spinner, hand spinner or tri spinner"}, {"id": "1538326175", "genre": "Children's Books", "title": "Emma Watson: Actress, Women’s Rights Activist, and Goodwill Ambassador (Breakout Biographies)", "description": "Emma Watson is best known for her role as Hermione Granger in the Harry Potter films, but her influence reaches far beyond the silver screen. In the public eye from a young age, Emma Watson has chosen to use her place in the spotlight to advocate for women's rights. She started the gender equality campaign HeForShe, works closely with fair trade garment retailers, and continues to act. Once a young unknown, Emma Watson has broken the mold and uses her place in the limelight to educate the world on pressing issues such as women's rights and ecologically sustainable fashion."}, {"id": "1625883579", "genre": "Children's Books", "title": "Warfare in the 16th to 19th Centuries (Warriors)", "description": "'Warfare in the 16th to 19th Centuries' explores how the face of battle changes over four centuries, as the methods of the Middle Ages gave way to the introduction of firearms and mechanised warfare."}, {"id": "B0091NIQO4", "genre": "Children's Books", "title": "Cowgirl Kate and Cocoa: Spring Babies", "description": "Baby animals are springing up on the ranch. Cowgirl Kate and Cocoa have a lot to do to help these new friends feel at home. But Cocoa’s not sure he wants new friends, especially if they mean more work. With Cowgirl Kate’s gentle nudging\u0097and snacks!\u0097Cocoa’s happy to help out, and work is as fun as play. Erica Silverman’s sweet easy-to-read chapters lassoed to Besty Lewin’s charming illustrations makes a sure-fire finale for this favorite early reader series."}]