[{"id": "160219663X", "genre": "Children's Books", "title": "Good Night Sharks (Good Night Our World)", "description": "Good Night Sharks features great white sharks, whale sharks, spinner sharks, blue sharks, hammerhead sharks, leopard sharks, mako sharks, tiger sharks, bull sharks, thresher sharks, angel sharks, blacktip sharks, cookiecutter sharks, and more.This book is part of the bestselling Good Night Our World series, which includes hundreds of titles exploring iconic locations and exciting themes.Young divers will explore the fascinating world of sharks while learning about different species and their watery environments."}, {"id": "B0779JHMTB", "genre": "Children's Books", "title": "Raccoon Tales", "description": "Raccoon Tales takes readers on a year-long adventure with five orphaned baby raccoons. What will happen to Shadow, Meeko, RC, Lucy, and Chatter?Author Joy DeKok shares this true life journey in the first year of the lives of these little ''washbears.''Written in easy-to-read verse, she tells their story with tenderness and energy.Readers will leave the story glad they came, knowing more about raccoons, and what a wild animal rescue and release looks like. Illustrator Leslie Helen Colwin's delightful illustrations bring the story to life."}, {"id": "0689849095", "genre": "Children's Books", "title": "Hans Brinker or The Silver Skates (Aladdin Classics)", "description": "Hans Brinker or The Silver Skates was published in 1865 and received more reviews than any other children's book that year. Today it continues to delight countless readers with its story of a virtuous family who inspires us all to have the courage to pursue our dreams."}, {"id": "0749656409", "genre": "Children's Books", "title": "I Work In A Nursery (Just the Job)", "description": "An informative resource looking at the working lives of various members of the community. This particular title explores a day in the life of a nursery worker."}, {"id": "1467793809", "genre": "Children's Books", "title": "Record-Breaking Building Feats (Infographic Top 10s)", "description": "What is the oldest building in the world? How big is the largest space station? How tall are the biggest skyscrapers? Find out all about the brilliant buildings that set world records from the tallest and longest to the busiest and the most expensive all in stunningly designed infographics."}]