[{"id": "0802852971", "genre": "Children's Books", "title": "Brigid's Cloak", "description": "The wind groaned and swirled that night and likely it seemed to tearthe thatch from the roof. But when the baby gave her first cry, thewind shushed to a whisper and the stars began to sing.Brigid's Cloak retells an ancient tale about one of Ireland's most beloved saints. On the day she is born Brigid receives a brilliant blue cloak from a mysterious Druid. Years later, the young girl still wears the now tattered but beloved cloak while she tends her sheep. Is it her imagination that suddenly takes her to an unfamiliar land? Or is it something far greater that leads Brigid to a crowded inn in a town called Bethlehem?Bryce Milligan's eloquently told story about Brigid is a moving tale of compassion and wonder. Beautifully illustrated by Helen Cann, Brigid's Cloak sparkles with the timelessness of legend and the transcending power of faith."}, {"id": "0448443600", "genre": "Children's Books", "title": "Who Was King Tut?", "description": "Ever since Howard Carter uncovered King Tutankhamun’s tomb in 1922, the young pharaoh has become a symbol of the wealth and mystery of ancient Egypt. Now, a two-and-a-half-year-long museum exhibit of Tut’s treasures is touring major cities in the U.S., drawing record crowds. This Who Was . . . ? is complete with 100 black-andwhite illustrations and explains the life and times of this ancient Egyptian ruler, covering the story of the tomb’s discovery, as well as myths and so-called mummy curses."}, {"id": "0986044172", "genre": "Children's Books", "title": "The Nicene Creed: Illustrated and Instructed for Kids", "description": "Every week in worship services around the world hundreds of millions of Protestants, Catholics and Orthodox confess their faith by reciting the Nicene Creed. Now comes the first-ever book to teach children about this most widely accepted statement of the Christian faith. It will help parents, grandparents, and teachers engage 5 to 12 year olds in the marvelous light of God’s love for them. The lucid commentary will help children understand what we affirm by reciting the Creed, and why each of its affirmations is important to the Christian faith. The artwork will introduce children and adults to an ancient Christian style by evoking, but not imitating, the beautiful visual art of iconography. Added features include “Why Teach the Creed to Children,” and “Keywords For Kids” to help them grasp that even though some of the language may sound grown-up they can understand it and claim it for their own. The author wrote and illustrated this book for his own children and children everywhere."}, {"id": "1534413103", "genre": "Children's Books", "title": "Texas Trail to Calamity: A Miss Mallard Mystery (QUIX)", "description": "World-famous duck-tective Miss Mallard must thwart a thief in this mystery that launches QUIX, a new line of fun-to-read short chapter books that are perfect for emerging readers.A runaway horse and a mysterious ranch in the Texas prairie have the intrepid Miss Millard on the trail of a plot to steal priceless artifacts! Bestselling author Robert Quackenbush’s super-sleuth is on the case to solve the latest mystery!"}, {"id": "0763626902", "genre": "Children's Books", "title": "All Together Now", "description": "\"Gentle, sweet illustrations perfectly match the positive message about families. . . . Although each child is different, Mommy Rabbit loves them all the same, deeply and unconditionally.\" —CHILDREN'S LITERATURE\"All together now!\" Mommy Rabbit says, and Bunny, Little Duckling, and Miss Mouse sing their little Honeys song. Each of them finds a special meaning in this song—which reminds them of how much they are loved and of how, all together, they are a family. From Anita Jeram, illustrator of GUESS HOW MUCH I LOVE YOU by Sam McBratney and author-illustrator of BUNNY, MY HONEY, comes an endearing story that will delight and comfort little readers as it reveals how this unique family came together."}]