[{"id": "B074MDZN82", "genre": "Children's Books", "title": "Rupert's Ambition (Annotated & Illustrated)", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors.Rupert is a young man down on his luck. His father's business crumbled due to the dishonesty of a business partner. This difficulty indirectly led to his father's death and Rupert is responsible (at age 16) to support his mother and invalid sister. To make matters worse, Rupert is fired from his job as a clerk because of the tough financial times. In a fortuitous turn of events, Rupert makes a valuable acquaintance. He helps Mr. Sylvester and is handsomely rewarded and eventually supplied with a job for himself as well as a good situation for his mother and sister. Mr. Sylvester gives Rupert a chance to succeed and recommends him for a job as a bell boy in a hotel. This job allows Rupert to prove himself and make interesting acquaintances. Rupert is ambitious, as the title states and finds ways to rise to the the top and overcome the stifling circumstances"}, {"id": "0763635669", "genre": "Children's Books", "title": "What's the Matter in Mr. Whiskers' Room?", "description": "\"Oh, to be a kid in Mr. Whiskers' primary science classes! The next best thing is doing hands-on explorations at school or at home with this guide.\" -- KIRKUS REVIEWSMr. Whiskers, the teacher, has that wild look in his eyes again. That's the look that means, Get ready for hands-on science! This time the subject matter is . . . matter. Using seven science stations, Mr. Whiskers encourages his kids to use all their senses to make observations and draw conclusions. Everyone's a scientist in Mr. Whiskers' class, where hands-on mini-experiments lead to Big Ideas -- and promote an ongoing passion for independent, open-ended discovery.Back matter includes supplemental activities."}, {"id": "1623709113", "genre": "Children's Books", "title": "Spies!: The History of Secret Agents and Double-Crossers", "description": "Explore the dangerous, daring world of real-life spies! From World War I to the Cold War and beyond, experience the most notorious, ingenious spies of the 20th century through present day. With vivid, full-color photographs, detailed maps, and thoroughly researched time lines, get to know the unknowables, including cyber spies, secret agents, deep-cover spies, and no-good double-crossers. From prolific history writer Allison Lassieur and Rebecca Langston-George, Spies! is the espionage book you’ve been hunting for!"}, {"id": "0448465779", "genre": "Children's Books", "title": "What Was the Gold Rush?", "description": "In 1848, gold was discovered in California, attracting over 300,000 people from all over the world, some who struck it rich and many more who didn't. Hear the stories about the gold-seeking \"forty-niners!\" With black-and white illustrations and sixteen pages of photos, a nugget from history is brought to life!"}, {"id": "0545770882", "genre": "Children's Books", "title": "The King of Kazoo", "description": "Scatterbrained Cornelius, King of Kazoo, and his resourceful daughter, Bing, explore a mysterious cave at the top of Mount Kazoo. There they discover a famous alchemist named Quaf is planning a dangerous and forbidden experiment. Now Cornelius, Bing, and the brilliant royal inventor Torq must go all out to stop Quaf before his crazy undertaking threatens the entire kingdom."}]