[{"id": "1547209437", "genre": "Children's Books", "title": "Happy 25th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 25 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1439569428", "genre": "Children's Books", "title": "Yes We Can: A Biography of Barack Obama", "description": "The great American leader uses his voice to change history, alter politics, and bring hope of a brighter future to generations to come. Born in the U.S.A., the son of an African father and an American mother, a boy who spent his childhood in Indonesia and Hawaii, Barack Obama is truly a citizen of the world. In kindergarten, he wrote an essay titled, \"I Want to Become President,\" and now, with his fierce optimism, exuberant sense of purpose and determination, and above all, his belief that change can happen, Barack Obama, the first African-American president of the United States, has made that dream come true. In Yes We Can, Garen Thomas takes us through the life of Barack Obama, from his struggle to fit in with his classmates, and concern about not knowing his biological father, through his term as an Illinois senator, and the long campaign for president, to his historic victory."}, {"id": "B007BOBID6", "genre": "Children's Books", "title": "Cauldron Spells", "description": "Max Pendragon is not  looking forward to attending Morgana Le Fay's summer Spell School. Not  only is his battered cauldron producing slimy sludge instead of perfect  spells, but ever since he and his sister Olivia foiled evil Morgana's  plot against King Arthur, they have been wary of her plans for revenge.Max  and Olivia soon discover that Spell School has more in store for them  than they ever imagined. With the help of Merlin and a mysterious bard,  Caradoc, will they be able to outwit Morgana and save Arthur for a  second time?  Join Max and Olivia for more magical fun in their second hilarious adventure!"}, {"id": "077105484X", "genre": "Children's Books", "title": "The Complete Screech Owls, Volume 1", "description": "Celebrating ten years and more than one million books in print!New four-in-one edition!The first four Screech Owls mysteries are now collected in one volume:#1 — Mystery at Lake Placid#2 — The Night They Stole the Stanley Cup#3 — The Screech Owls' Northern Adventure#4 — Murder at Hockey CampScreech Owls books have won the Our Choice Award and the Manitoba Young Reader’s Choice Award. They have been endorsed by the Canadian Toy Testing Council and shortlisted for the Silver Birch Award, the Red Cedar Award, the Arthur Ellis Award, the Ottawa-Carleton Award, and the Palmarès de Communication-Jeunesse."}, {"id": "1760294675", "genre": "Children's Books", "title": "Say Yes: A Story of Friendship, Fairness and a Vote for Hope", "description": "Once there were two little girls who were best friends. They did everything together. As they got older they weren't allowed to do the same things anymore. Because they looked different. Because of the law. This is a story about the landmark 1967 Referendum, the two women who came together to change the law . . . and how the Australian people said YES."}]