[{"id": "B00EJ32IPE", "genre": "Children's Books", "title": "Marvel Heroes Save the Day A Panorama Sticker Storybook", "description": "A follow-up to the popular Power Quest Panorama Sticker Storybook, Marvel Heroes Save the Day offers Marvel fans another fun-filled opportunity to create their own unique Super Hero scenes and action, using the colorful reusable stickers and gatefold.After reading the action adventure storybook, kids can use it as inspiration to create their own Super Hero battles and adventures by placing the character stickers on the large illustrated play scene that extends from the book. All the favorite Super Heroes including Spider-Man, Iron Man, the Avengers, and the X-Men are featured in this book. And since the stickers are removable, kids can create countless combinations of super scenes! "}, {"id": "B0056KOL7M", "genre": "Children's Books", "title": "Ryan's 4th of July Celebration", "description": "A picture book by one tot to yours! Ryan narrates this story of how he spends the 4th of July. From a cookout to watching the fireworks. Babies -3."}, {"id": "1250166519", "genre": "Children's Books", "title": "One Question a Day for Kids: A Three-Year Journal: Create Your Own Personal Time Capsule", "description": "A fun and clever way for kids to keep track and look back.One Question a Day for Kids is a guided journal with fun and thoughtful questions for each day of the year. By answering the same question every day for three years, children will be able to see how their thoughts, creativity, and even handwriting changes from year to year. Prompts are short and sweet, allowing kids to answer as concisely (or elaborately) as they want.Questions include:If you could have a super power, what would it be?What's the grossest thing you've ever seen?Which of your friends do you trust the most?What's one thing your parents don't know about you?Rate your teachers from favorite to least favorite."}, {"id": "B00U5012O8", "genre": "Children's Books", "title": "Fox and the Goat Lisa i Koza Children's Picture Book English-Russian (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump.Rasskaz o lise i kozy. Istoriya sleduyet lisa , glyadya na vodu i kozy lisa vzaimodeystvuyet s .Na osnovanii basni Ezopa s ispol'zovaniyem slova glagolov bezhat', idti, i pryzhok."}, {"id": "163229205X", "genre": "Children's Books", "title": "Beyond the Western Deep Volume 2", "description": "As conflict looms between ancient enemies, the fragile truce that held civilization together has begun to unravel. A small peace envoy travels north to prevent war, while a ragtag army of rebels marches south to create it. Experience the latest chapter of this all-ages fantasy saga in its second collected volume!"}]