[{"id": "0064443191", "genre": "Children's Books", "title": "Detective Dinosaur Undercover (I Can Read Level 2)", "description": "When a detective goes undercover, it usually means they are in disguise, right? Not if it’s Detective Dinosaur!The bumbling but bighearted star of Detective Dinosaur and Detective Dinosaur Lost and Found is back with three new silly cases to investigate. How this charmingly clueless gumshoe goes undercover—in the most surprising ways—is the kind of irresistible goofiness beginning readers love.This third book of comic misadventures by James Skofield, brought to life as only the inspired illustrations of R. W. Alley can do, is sure to please mystery lovers and dinosaur fans alike."}, {"id": "1452110735", "genre": "Children's Books", "title": "What Brothers Do Best", "description": "This delightful board book by renowned author-illustrator team Laura Numeroff and Lynn Munsinger celebrates all the wonderful things brothers can do! Brothers can push you on a swing, make music with you, and take you to the library. But what do brothers do best? The answer is clear in this appealing board book, celebrating brothers and the everyday things they do."}, {"id": "1590844580", "genre": "Children's Books", "title": "100 Things You Should Know About the Wild West", "description": "Presents a collection of facts about the peoples of the American West and their way of life during the nineteenth century, and offers quizzes and instructions for making related projects."}, {"id": "132868394X", "genre": "Children's Books", "title": "Happy Easter, Country Bunny (shaped board book)", "description": "Mother Cottontail must leave home for one night to deliver Easter eggs, but her twenty-one little boy and girl bunnies are up to the challenge! Two by two, they cook, clean, and care for each other, and when Mother Cottontail returns with a big basket of Easter eggs for them, she is pleased—but not surprised—that all was well while she was away.   Du Bose Heyward and Marjorie Flack’s The Country Bunny and the Little Gold Shoes, a classic story of determination and love, has been an Easter favorite since 1939. This egg-shaped board book is an opportunity to introduce the youngest children to a gorgeous vignette from this popular holiday story. "}, {"id": "1772990329", "genre": "Children's Books", "title": "West to the Bay", "description": "In 1750, Thomas Gunn, along with three friends, join the Hudson's Bay Company and sail from Stromness on the Orkney Islands of northern Scotland to York Factory fort on Hudson's Bay. They believe they are starting a new and exciting life in what is called Rupert's Land, but tragedy follows them, striking for the first time on the ship. At the fort Thomas finds his older brother, Edward, who had joined four years earlier. He also meets Little Bird, sister of Edward's wife, and her family. During the first year Thomas takes part in the goose and duck hunts, the fishing, the woodcutting, Guy Fawkes Day, the Christmas celebrations, and the burial of a friend. He also deals with the snowfall, the cold, the boredom, and a suicide, and learns how to survive in the lonely and sometimes inhospitable land."}]