[{"id": "B00HNXC3MA", "genre": "Children's Books", "title": "#08 Newt Nemesis (S.W.I.T.C.H.)", "description": "Summer camp was going great for Josh and Danny until mad scientist Petty Potts showed up. Sure, her serum turned them into frogs to help them save their new friend Charlie. But the serum didn't completely wear off: all three kids still have frog feet! They are running out of time to find right antidote before their parents show up. Their best option is to ask Petty to use her S.W.I.T.C.H. formula again. But of course, things don't turn out quite as planned. Do two frogs and a newt stand any chance in a world of hedgehogs, dogs, and poisonous snakes? Josh, Danny, and Charlie are about to find out."}, {"id": "B00H2D76VE", "genre": "Children's Books", "title": "Francis Frog Finds a Home", "description": "How do you talk about moving to a child, especially if that move is not a happy one? Today with the financial difficulties many face, people have had trouble keeping their homes.  Foreclosures are at an all time high in the United States, but people have to move for many reasons. Often those reasons are not understood and young children are afraid.  When my cousin was recently divorced, she and her young son came to live with us.  I wrote this book for Stephen Francis because he loved frogs and Francis Frog finding a home made him feel that he too would find a permanent home with the people he loved.When Francis Frog finds his puddle has grown smaller and smaller in the sun, Francis has to find a new home.  Come and see what and WHO he finds in his adventure.  A great read aloud for preschoolers or easy read for primary school children.  If you like this book, please come back and write a review so others can find it. Click on the book, and then the stars. http://goo.gl/xyXPfXThank you,Theresa Lepiane"}, {"id": "1406345970", "genre": "Children's Books", "title": "How Watson Learned the Trick", "description": "A charming and exquisite recreation of the miniature Sherlock Holmes story from the library of Queen Mary's famous Dolls' House, on display at Windsor Castle.This lavish cloth-bound gift edition faithfully recreates in beautiful detail the Sherlock Holmes story Arthur Conan Doyle wrote especially for the Library of Queen Mary's Dolls' House in 1922. In this classic story, Watson tries to mimic Holmes's mastery of the art of deduction with very funny results, making this a book for both adults and children to delight in. Alongside the miniature book, which measures just 38.5 x 30 mm, the edition also contains an informative booklet with a transcript of the story and information about the Dolls' House. Queen Mary's Dolls' House is the largest and most famous of its kind in the world, and has a library containing miniature works by all the major writers and artists of the day."}, {"id": "140486394X", "genre": "Children's Books", "title": "What If There Were No Bees?: A Book About the Grassland Ecosystem (Food Chain Reactions)", "description": "Grassland ecosystems can be found on nearly every continent. Countless animals and plants live in them. So what difference could the loss of one animal species make? Follow the chain reaction, and discover how important honey bees are."}, {"id": "0736852557", "genre": "Children's Books", "title": "The B-2 Spirit Stealth Bomber (Cross-Sections)", "description": "Provides an in-depth look at the B-2 Spirit Stealth Bomber, with detailed cross-section diagrams, photographs, and additional facts and information."}]