[{"id": "0606156593", "genre": "Children's Books", "title": "On Board the Titanic", "description": "Seventeen-year-old Jack Thayer explores the Titanic and forms a brief friendship with another passenger before experiencing the wreck of the giant ocean liner"}, {"id": "153452441X", "genre": "Children's Books", "title": "What's Gun Control? (What's the Issue?)", "description": "Gun control is a popular topic of debate on news programs and online, but these debates are sensationalized and often do not fully explain the issue and the points of view of people on both sides of it. Readers are given a clearer picture of what gun control means and why people support and oppose it through fact-filled text and relevant, full-color photographs. Fact boxes and graphic organizers supply readers with additional details to help them develop their own informed opinion on this topic and understand those whose opinion differs from theirs."}, {"id": "B00EP01ZLY", "genre": "Children's Books", "title": "15 Weird Facts You Don't Know About Halloween  (Deluxe Edition with Videos)", "description": "*** Deluxe Edition with Videos ***People Love Reading 15 Weird Facts You Don't Know about Halloween“We always look forward to Halloween; it’s one of the best holidays. Thanks for these facts, now I’ll enjoy it even better!” – Keith Carlsoni>“My kids and I love Halloween! Trick or treating is always fun. Thank you for putting these facts together,” – Candice GreenbergEducational facts and videos make this series a best buy. You will get a great insight on Halloween that you might have thought you knew a lot about.We have created a layout that not only educates, but also entertains the readers. This makes learning fun and is a great way to encourage further reading. The \"Weird Facts\" series creates an environment for children to independently read and learn.Scroll up and Buy this book now by clicking on the Orange button - your child will love going back to it again and again."}, {"id": "1512777137", "genre": "Children's Books", "title": "Divine Elements: A God-Centered Introduction to Chemistry (Student Edition)", "description": "Chemistry becomes a lot simpler once you look at it through a Christian worldview. Whether you’re studying chemistry for the first time or just brushing up on introductory principles, this textbook will show you how God’s divine elements work. You’ll learn about:•    quarks, protons, neutrons, and electrons •    basics of the periodic table •    electron configurations •    ionic and covalent chemical bonds •    chemical equations and how to balance them •    gas laws, polarity, stoichiometry, equilibriumThis is the only basic chemistry text that brings together the essentials of first-year chemistry with Christian theology. The Christian chemistry student will explore the way God put the universe together at the most fundamental level.Aimed at secondary schools and introductory college level courses, this text offers a look at chemistry in the context of biblical principles. Engaging in the study of chemistry through this lens, you will discover how chemistry reflects the character of God."}, {"id": "B007Y35JW0", "genre": "Children's Books", "title": "Read All About It!", "description": "Tyrone rules the school!He's king of the monkey bars, a math machine, and a science whiz.The only thing he doesn't like about school is reading. Books are so boring! But when strange visitors start dropping by the classroom for story hour, Tyrone discovers there's more to books than just words on pages. Tyrone and his friends are swept up in a mysterious adventure that lands them in a most unexpected place. Mrs. Laura Bush and her daughter Jenna create a classroom adventure that will leave readers racing to the shelves! A portion of proceeds to benefit Teach for America and The New Teacher Project."}]