[{"id": "1577681983", "genre": "Children's Books", "title": "Little Red Riding Hood", "description": "In this beloved tale, Little Red Riding Hood is uneasy when her grandmother looks suspiciously like a sly wolf that she met along the way. Children will eagerly continue reading to see what will happen when the wolf shows how big and sharp his teeth are! --Between the pages of the Brighter Child(R) Keepsake Stories books are the classic tales of magic, imagination, and inspiration that will delight children again and again. From the hard-working Red Hen to the foolish Gingerbread Man, these stories will capture children's interest and spark their imagination page after page, inspiring a lifelong love of literature and reading. Each book includes 32 pages of fresh, captivating illustrations, and measures 8\" x 8\"."}, {"id": "0763680095", "genre": "Children's Books", "title": "Wish (Emma Dodd's Love You Books)", "description": "This new addition to Emma Dodd's much-loved sequence of animal books features a tenderly composed rhyming text, heartwarming illustrations, and flurries of foil throughout. Exploring the loving relationship between a wolf and pup, this beautifully designed picture book is certain to become a bedtime favorite."}, {"id": "0394710541", "genre": "Children's Books", "title": "Norwegian Folktales (The Pantheon Fairy Tale and Folklore Library)", "description": "Long a treasure in Norway, the folktales collected by Peter Christen Asbjørnsen and Jørgen Moe have been acclaimed for their richness of humor, fullness of life, and depth of understanding since they first appeared in translation more than a hundred years ago. The Norwegian folktales, said Jacob Grimm, “surpass nearly all others.” Within these captivating tales we meet witches, trolls, and ogres; sly foxes and great, mysterious bears; beautiful princesses and country-lads-turned-heroes. Collected here in a sparkling contemporary translation by Pat Shaw Iversen and Carl Norman, these tales brim with the matchless vitality and power of their original telling. Included also are the wonderfully evocative original illustrations of Erik Werenskiold and Theodor Kittelsen.With black-and-white drawings throughoutPart of the Pantheon Fairy Tale and Folklore Library "}, {"id": "197312601X", "genre": "Children's Books", "title": "Adult Coloring Book - Beautiful Faces: Grayscale Illustrations of Gorgeous Women for Relaxation", "description": "Each illustration on a separate sheet. Varied styles, techniques and level of detail."}, {"id": "0823417638", "genre": "Children's Books", "title": "Anansi and the Magic Stick", "description": "It's a fine bright day, and all the animals are working--all except Anansi, that is! He's sleeping, as usual. Warthog, Lion, and Zebra laugh so hard at his messy house that they wake him up. Anansi stomps off in a huff--right into an amazing secret! Hyena has a magic stick that follows his orders. If Anansi steals the stick, he'll never have to work again, and his home will be the neatest one in town. Is the magic stick his secret for success? Or the beginning of disasters he can't even imagine?"}]