[{"id": "B01KPIFLCS", "genre": "Children's Books", "title": "Joan: Sunshine and Shadows (The Joan Murray Series Book 2)", "description": "Joan's 1930s adventures continue when the worst of the Great Depression is fading, but the possibility of war is casting a shadow over the lives of many people. Joan and her family continue to live in Black Rock, Melbourne, with special fun times away at the family's holiday house in Rosebud on the Mornington Peninsula."}, {"id": "0571322220", "genre": "Children's Books", "title": "Mr. Mistoffelees: The Conjuring Cat (Old Possum Picture Books)", "description": "Was there everA cat so cleverAs magical Mr. Mistoffelees!Following Arthur Robins' critically acclaimed picture book of Macavity (already sold 10k) he turns his attentions to the magical Mr. Mistoffelees with delightfully hilarious results. Perfect for ages 3+, children (and parents) will love reading aloud about the Original Conjuring Cat. To sit alongside other classics such as The Gruffalo, The Tiger Who Came to Tea, and Spot."}, {"id": "1607477203", "genre": "Children's Books", "title": "Buzzy Bee Plays Hide and Seek", "description": "In Buzzy Bee Plays Hide and Seek, a little bee initiates a game of hide and seek. After counting to ten, he buzzes off to find his friends. One hides behind a straw hat, another in a pot of flowers, a third in a birdfeeder. Through innovative sound technology, kids can push a button in the corner of the book to bring the little bee to life with buzzing sounds and accompanying vibrations. These interactive elements help young children develop cognitively while enhancing the book's entertainment value."}, {"id": "0763696307", "genre": "Children's Books", "title": "Open Very Carefully: A Book with Bite", "description": "What would you do if you were settling down for a quiet bedtime story and you realized that a crocodile had fallen into your storybook and was — not to put too fine a point on it — wreaking havoc? Would you slam that book shut and cram it back onto the bookshelf? Or would you be brave enough to peek?"}, {"id": "B015G3FC4O", "genre": "Children's Books", "title": "Children Book : The Magical Zoo #1 (Illustrated childrens books & Great bedtime stories)", "description": "Containing creative illustrations and endless imagination, this book will entertain your child and you.This is Sally. She is twelve years old and loves to read. Sally lives in a small town called Durham in North Carolina, and she visits the library almost two times a week. People say Sally is addicted to reading.When Sally goes to the library, she takes Milkshake, her cat. Milkshake likes to sit on the tall stool in the library and watch Sally while she is looking for a good book to read.Sally believes that Milkshake understands her completely, even if he can't talk to her.It was Monday morning, and Sally did not have to go to school since it was a holiday.  What she didn't know is that this day was going to be special.  Book #1 in the Series Scroll Up and Grab your Copy today"}]