[{"id": "1416986030", "genre": "Science Fiction & Fantasy", "title": "Grip of the Shadow Plague (Fablehaven)", "description": "Danger lurks everywhere at Fablehaven, where someone has released a plague that transforms beings of light into creatures of darkness. In dire need of help, the Sorensons question where to turn, now that long trusted allies have been revealed as potential foes. Kendra embarks on a special mission that only she can attempt because of her new abilities as fairykind, while Seth stays behind and discovers an incredible new talent of his own. The siblings are put to the test as the threat grows both abroad and home at the Fablehaven preserve, and Brandon Mull spins his richest and most thrilling fantasy tale yet in this third title of the popular fantasy series."}, {"id": "0664229018", "genre": "Science Fiction & Fantasy", "title": "The Gospel according to Science Fiction: From the Twilight Zone to the Final Frontier", "description": "In this thorough and engaging book, Gabriel McKee explores the inherent theological nature of science fiction, using illustrations from television shows, literature, and films. Science fiction, he believes, helps us understand not only who we are but who we will become. McKee organizes his chapters around theological themes, using illustrations from authors such as Isaac Asimov and H. G. Wells, television shows such as Star Trek and The Twilight Zone, and films such as The Matrix and Star Wars. With its extensive bibliography and index, this is a book that all serious science fiction fans--not just those with a theological interest--will appreciate."}, {"id": "B00HAEI9MU", "genre": "Science Fiction & Fantasy", "title": "Event Horizon (Hellgate Book 6)", "description": "With the worlds of the Deep Sky declaring their independence and the super-carrier battle groups assigned to quell the Colonial War by any means, Neil Travers and Curtis Marin find themselves in an explosive situation. On the one hand, the London and the Avenger are poised to move against Jagreth and Borushek ... on the other, the Zunshu continue to strike out of the massive Hellgate storms ... and caught between them are the most powerful ships on either side of the frontier. Richard Vaurien’s Wastrel -- a salvage tug designed to work the fragmented space on the edge of Hellgate. And Mark Sherratt’s Lai’a -- with the body of a warship and the mind of a Resalq super-AI. A Freespacer crew pledged to fight for the freedom of the Deep Sky ... a unique artificial intelligence bred and born for the region beyond Hellgate -- the realm that has become known to a handful of pilots as transspace. From a searing battle fought in the shadow of Oberon to the depths of Zunshu space beyond The Blood Gate ... from the cool, green forests of Jagreth to the most alien worlds Marin and Travers could never imagine, and a first contact that will change the future ... this is Event Horizon."}, {"id": "1535245905", "genre": "Science Fiction & Fantasy", "title": "Egyptian Heroes", "description": "Egyptian Heroes brings you 8 richly detailed, ready-to-play pregenerated characters, created specifically to shine in any Pathfinder Roleplaying Game campaign delving into the ancient and accursed (yet treasure-filled) ruins of a long-fallen civilization. Featuring classic races and classes, as well as newer or more unusual options, these characters make ideal allies, rivals, cohorts, contacts, or even replacement PCs, and include: Asep Arukhet, human sorcerer Dorian Masuud, human slayer (grave warden) Kephenes Enterra, human cleric of the God of Magic (ecclesitheurge) Merradine Feist, dhampir bard (archaeologist) Namala Ikenwe, half-elf arcanist (school savant) Parvanah Lisay, catfolk rogue (cat burglar) \"Val\" Valdeseer Harringer, human paladin (holy gun) and last but not least, the mysterious Ziyadi Sahrebe, human oracle (dual-cursed) Each character includes a detailed backstory, roleplaying tips, special equipment, and links to each other and to official published Egyptian-themed adventures, with suggestions for advancing the character and fantastic character portraits with foldable paper miniatures for every character! If you are looking for terrific characters where modern adventurers delve into the secrets of the ancients, get this 34-page product today and Make Your Game Legendary!"}, {"id": "B00F8VESKE", "genre": "Science Fiction & Fantasy", "title": "Clara (Stories of Lorst Book 1)", "description": "Read the thrilling sequel, Clara's Return!Clara will have to see through both the fog of war and the fog of her own heart to save a nation...A mute and a slave, Clara's life extends no further than the castle kitchens and their garden. However, she carries within herself a precious gift: the ability to see the future. When a vision prompts her to prevent a murder, Clara is shoved not only into the intrigues of the nobility but also into a civil war. As events unfold, she begins to unearth chilling secrets about the war and her supposed friends. Driven to learn the truth, Clara embarks on a journey that takes her from her beloved mountains to the very Capital itself, Bertrand. There, she is confronted by an evil as old as the mountains--and it's using her anger and prejudices against her. If she is not careful, not only will the entire nation be lost, but Clara's own soul as well."}]