[{"id": "0802796699", "genre": "Children's Books", "title": "Louisa May's Battle: How the Civil War Led to <i>Little Women</i>", "description": "Louisa May Alcott is best known for penning Little Women, but few are aware of the experience that influenced her writing most-her time as a nurse during the Civil War. Caring for soldiers' wounds and writing letters home for them inspired a new realism in her work. When her own letters home were published as Hospital Sketches, she had her first success as a writer. The acclaim for her new writing style inspired her to use this approach in Little Women, which was one of the first novels to be set during the Civil War. It was the book that made her dreams come true, and a story she could never have written without the time she spent healing others in service of her country."}, {"id": "B0765ZYJWD", "genre": "Children's Books", "title": "Best 25 Recipes of Delicious Pies with Fruits: quick and easy recipes", "description": "*** Buy your copy now in English, German, French, Spanish, Italian, or Portuguese ***Fruits contain many important vitamins for human health, especially for children,To give your family this fruit in a lovely way,This book present to you the best 25 quick and easy recipes to prepare Delicious pies with fruit."}, {"id": "B00HOZGHS8", "genre": "Children's Books", "title": "Davy, the Wild Little Donkey and the Wonderful Thing that he Did: a Palm Sunday story", "description": "A child's Bible story about Palm Sunday as told through the eyes of the unbroken donkey himself. One spring morning, Davy puts himself in great danger when he answers the call to come to Jesus."}, {"id": "0756544912", "genre": "Children's Books", "title": "3: Displaying the Shot: Photography (Photography for Teens)", "description": "You took the picture. Now what? How do you share it with the world or at least your friends? And how do you make it look its best? Flip inside for tips on loading files onto your computer, cropping shots and fixing red eyes, and displaying your photos in fun, unique ways."}, {"id": "1454921552", "genre": "Children's Books", "title": "HTML for Babies (Code Babies)", "description": "CODING FOR KIDS . . . Because it’s never too early to start developing!   Coding and web-design skills are becoming more and more important in our technological world. These concept books will familiarize young ones with the kind of shapes and colors that make up web-based programming language and give them the head start they need. ABC, 1 2 3 . . . HTML! Just as kids learn the alphabet or numbers, it’s important for them to learn HTML. This colorful introduction teaches the rudiments of this language—including markup code and letter forms—and helps prepare them for our digital age."}]