[{"id": "1454919043", "genre": "Children's Books", "title": "Ella WHO?", "description": "Mom . . . there’s an elephant in the living room.  It’s moving day—and look who slipped in the door: an elephant! But when a little girl tries to tell her family about their unusual guest, the distracted grown-ups just say, “Ella WHO?” Even as children giggle at the girl’s adventures with the smallish pachyderm, and at the fun, recurring refrain, they’ll relate to the poignant theme about making—and sometimes letting go of—new friends."}, {"id": "1423382307", "genre": "Children's Books", "title": "Hana's Suitcase: A True Story", "description": "In March 2000, a suitcase arrived at a children’s Holocaust education center in Tokyo, Japan. On the outside, in white paint, were these words: Hana Brady, May 16, 1931, and Waisenkind – the German word for orphan. Children who saw the suitcase on display were full of questions. Who was Hana Brady? What happened to her? They wanted Fumiko Ishioka, the center’s curator, to find the answers. In a suspenseful journey, Fumiko searches for clues across Europe and North America. The mystery of the suitcase takes her back through seventy years, to a young Hana and her family, whose happy life in a small Czech town was turned upside down by the invasion of the Nazis. “Like the very best of museum exhibits, Hana’s Suitcase shows how facts and objects can be put together to honour its subject in a very personal and loving way. Highly recommended.” – The Toronto Star “Skillfully, and with great sensitivity, Levine weaves together the two stories, alternating that of a young life shattered in increments and that of Fumiko Ishioka’s relentless search for answers.” – The Globe and Mail"}, {"id": "B00S41UCCI", "genre": "Children's Books", "title": "20 Fast Meals In a Mug", "description": "Many people are busy and don't have time to cook themselves a fast,good meal.They eat unhealthy fast-food junk because that is a fast solution.Or you just wake up in the morning and you're late and need a meal in a hurry.There are certain recipes that can be cooked in just a mug!You prepare it,microwave it and then just eat it.It takes no longer than 5 minutes to microwave them.Here i have compiled 20 of them which include recipes for any time of the day.These mug recipes seem to be very popular among busy people and it's no surprise.They are a life-saver.Check them out and you will see how useful they are.This ebook can be accessed directly from your smartphone,you just read the ingredients,how to cook them,and VOILA!,you got yourself a meal."}, {"id": "0688112501", "genre": "Children's Books", "title": "Pablo Remembers", "description": "From October 31 to November 2, people in Mexico celebrate the festival of el Dia de Los Muertos, the Day of the Dead. This photodocumentary follows Pablo and his family as they prepare to honor the memory of Pablo's grandmother. Ancona's \"photographs catch the affirmation of life that fills the Mexican festival arising from both Aztec and Christian customs honoring the dead....Joyful.\"--Chicago Tribune. \"This intriguing book makes an excellent offering during the Halloween season.\"--School Library Journal. Also available in a Spanish Language edition, Pablo Recuerda."}, {"id": "140344837X", "genre": "Children's Books", "title": "Ancient Greece (Excavating the Past)", "description": "The 'Excavating the Past' series presents information on classical civilizations and the archaeological work carried out to reveal how our ancestors lived long ago. The series is designed for children working at Key Stage Two."}]