[{"id": "0545436486", "genre": "Children's Books", "title": "Ten Lucky Leprechauns", "description": "Fiddle-de-fizz, 'tis magic, it is!When leprechauns find each other.Count from one to ten as one little leprechaun looking for treasure magically becomes ten silly leprechaun friends at the end of the rainbow! A humorous, rhyming celebration of St. Patrick's Day!"}, {"id": "B071FRSRCB", "genre": "Children's Books", "title": "Billy Eat Your Veg: Funny Bedtime Story for Children Kids (Billy Series Book 4)", "description": "Billy is a six-year-old boy who has a great imagination. He loves to play and sometimes daydreams with funny results. Billy does not like to eat vegetables. A visit from his alien friends helps to show him why he should eat vegetables. Pamela Malcolm has created the perfect tale to read with any child who do not like to eat vegetables. With memorable illustrations and an important message, Billy Eat Your Veg is a wonderful bedtime story that will be treasured by children and parents alike."}, {"id": "0753473801", "genre": "Children's Books", "title": "Life Cycles: Grassland", "description": "Discover which creatures are at the top and bottom of three grassland food chains, and learn what happens at each stage of their life cycle. At the end of each spread, use the picture clue to guess which grassland predator is waiting to pounce! Explore the African grasslands, the South American pampas, and the North American prairies to find out which creatures live there. . . and which will make a tasty snack!Each book in this essential series reveals the life cycles of eleven fascinating living things in a particular habitat. The life cycles link together to create three food chains. At the end of the book is a simple overview of how the three food chains interact to create a food web. With clear text and punchy photographs, this is a captivating introduction to habitats and ecosystems."}, {"id": "0794421687", "genre": "Children's Books", "title": "Busy Day Bunnies: A Carry Along Treasury (Carry Along Books)", "description": "From noted illustrator Lisa McCue, this short story of a very busy day for a bunny family is presented in the best-selling CarryAlong® format.Each of the ten spreads in this book focuses on a different moment during a typical bunny day. From eating breakfast together to playing on a slide, kids will find a familiar activity on each page. Winsome illustrations by Lisa McCue enhance the simple story that’s perfect for bedtime reading. With a handle that’s perfect for little hands, kids can carry their book anywhere they go."}, {"id": "B01A2YJ3OM", "genre": "Children's Books", "title": "To Eat Or Not To Eat?  The Grains Group - Food Pyramid (2nd Grade Science Series Book 4)", "description": "It is important to teach your child about healthy food while they are still young. This is to set a foundation that would allow them to choose the right food as they grow older, and move away from home. Sometimes though, a child would need to be convinced that healthy food is yummy food, and that's where this book will step in. Grab a copy today!"}]