[{"id": "0448449021", "genre": "Children's Books", "title": "Hockey (Sticker Stories)", "description": "We shoot! We score! It’s Sticker Stories on ice! Kids will love learning all about hockey positions, rules, penalties, game food, and other fun hockey facts as they add stickers to every spread."}, {"id": "0062410946", "genre": "Children's Books", "title": "Stick Dog Craves Candy", "description": "Perfect for fans of Big Nate, Diary of a Wimpy Kid, and the previous Stick Dog books, Tom Watson’s hilarious series continues with Stick Dog Craves Candy—a fun Halloween adventure!Stick Dog and the gang are on their usual hunt for food, but there is something unusual going on. Little humans are dressed up as creepy witches and spooky ghosts, all carrying big orange buckets!Their search leads them to something unexpected and delicious and sweet—candy! Once they get a taste, they will stop at nothing to get more. The gang will have to avoid terrifying witches and even escape a creepy haunted house! Will Stick Dog's smarts, courage, and patience be enough to lead his buddies to the best treats ever?Witches, and ghosts, and goblins...and Stick Dog and friends! Oh my!"}, {"id": "0977734072", "genre": "Children's Books", "title": "The Nutcracker Cats of the Kremlin", "description": "A twisted tale of decption in a magical fantastical kindgom with rare and unsual riches being exploited by a band of devious rats disguised as heroes. Five unique cats are chosen to defend the kingdom from renegade foxes, checkerbox bunnies and scheming rats. A sinister story of power and greed, high jinx and hilarity"}, {"id": "1628324414", "genre": "Children's Books", "title": "The NBA: A History of Hoops: Charlotte Hornets", "description": "This high-interest title summarizes the history of the Charlotte Hornets professional basketball team, highlighting memorable events and noteworthy players such as Larry Johnson."}, {"id": "1561459100", "genre": "Children's Books", "title": "Madeline Finn and the Library Dog", "description": "Madeline Finn does NOT like to read. But she DOES want a gold star from her teacher. But, stars are for good readers. Stars are for understanding words, and for saying them out loud.Fortunately, Madeline Finn meets Bonnie, a library dog. Reading out loud to Bonnie isn't so bad; when Madeline Finn gets stuck, Bonnie doesn't mind. As it turns out, it's fun to read when you're not afraid of making mistakes. Bonnie teaches Madeline Finn that it's okay to go slow. And to keep trying.With endearing illustrations, Lisa Papp brings an inspiring and comforting book to all new readers who just need a little confidence to overcome their fears."}]