[{"id": "1481419145", "genre": "Children's Books", "title": "The Baby Swap", "description": "A jealous big sister learns a very loving lesson in this warm and funny picture book about sibling rivalry, featuring charming text and retro-nostalgic artwork.Caroline Crocodile is not thrilled with her baby brother. He drools. A lot. But all Mama Crocodile ever says is how GORGEOUS he is! And so Caroline ventures into a baby shop to swap out her brother. Unfortunately, the baby panda is a fussy eater, the giraffe is missing scales, and the piglet isn’t green. Turns out, the best younger sibling around might just be her own yellow-eyed, sharp-clawed, drooling baby brother."}, {"id": "B01CBT3ZG8", "genre": "Children's Books", "title": "The Three Knights: A Children's Book", "description": "Princes John, Walter and Henry are three knights but they are rather childish and do not leave the castle as much as they should. But when their mother, the Queen, recieves a letter from some damsels in distress asking to be rescued, the knights are booted out of the house on a quest to save them.But not all is as it seems...A tongue-in-cheek, children's short story for all the family from author and writer Aiden Francis Luke."}, {"id": "B011GO9QM6", "genre": "Children's Books", "title": "Ducky Day or Yucky Day ~ You Choose", "description": "Daffnee duck wakes up each morning seeing sunshine even on a cloudy day. Everyday is ducky to her! Her brother, Davie would rather stay in bed all day because his days are just plain yucky! When the two of them are separated from their Mama, their attitudes become a point of conflict. Find out who wins the battle of the attitudes in Ducky Day or Yucky Day ~ You Choose.View a Ducky Day Book Trailer @ https://www.youtube.com/watch?v=awmgFNfzhmI"}, {"id": "0763673056", "genre": "Children's Books", "title": "Maisy's Tractor", "description": "Maisy is busy on her farm in a shaped board book full of fun and learning.Chug, chug! Jump aboard Maisy's tractor as she plows the field, stopping to feed and milk the cows and bring the lambs back to the barn. But wait a minute—one of the lambs has gone missing! Will Maisy be able to find her woolly friend?"}, {"id": "B00YQAKUFU", "genre": "Children's Books", "title": "The adventures of Marlin the Monkey: none", "description": "Marlin the monkey and Garth the gorilla got themselves into situations that touched on humor, compassion, loyalty and romance in an amusing and enjoyable read."}]