[{"id": "B005ZOBEF6", "genre": "Children's Books", "title": "Mallard Duck at Meadow View Pond - a Smithsonian's Backyard Book", "description": "Growing up on the pond, Mallard Duck and his siblings have all sorts of adventure! Children will follow them as they grow from little hatchlings to young adults ready to migrate south for the winter. Reviewed by the Smithsonian Institution for accuracy, Mallard Duck at Meadow View Pond is a fun and informative story with beautifully detailed illustrations. Watch your children have a blast reading and learning about the animals that live in an American backyard!Book Features:- An informative storyline and colorful illustrations- Appropriate for ages 3-9- Hardcover dimensions: 12 x 8 3/4 inches"}, {"id": "1458737551", "genre": "Children's Books", "title": "The Kid's Guide to Social Action: How to Solve the Social Problems You Choose-and Turn Creative Thinking into Positive Action", "description": "You can get involved, get noticed, and get results! In THE KIDS'S GUIDE TO SOCIAL ACTION, you'll find: Real stories about real kids and teens who are making a difference at home and around the world; Step-by-step guides to social action Power Skills: letter-writing, faxing, emailing, Internet research, interviewing speechmaking, surveying, fundraising, getting and handling media coverage, and more; Ideas for working with government, including tips for lobbying local, state, and federal lawmakers, and for using your social action skills with the courts; Real social action tools, ready to copy and use, including petitions, proclamations, letters, and news releases; An up-to-date resource guide with addresses, phone numbers, and Web sites for other social action groups, federal and state government offices, and awards and recognitions for kids. Designed for kids to use on their own and at their own pace, THE KID'S GUIDE TO SOCIAL ACTION is also ideal for schools, clubs, groups, troops, and other youth organizations."}, {"id": "1580896677", "genre": "Children's Books", "title": "The Inventor's Secret: What Thomas Edison Told Henry Ford", "description": "* 2017 NSTA Best STEM Book List K-12* * NSTA Outstanding Science Trade Book for Students K-12 *Thomas Edison and Henry Ford started off as insatiably curious tinkerers. That curiosity led them to become inventors--with very different results. As Edison invented hit after commercial hit, gaining fame and fortune, Henry struggled to make a single invention (an affordable car) work. Witnessing Thomas's glorious career from afar, a frustrated Henry wondered about the secret to his success. This little-known story is a fresh, kid-friendly way to show how Thomas Edison and Henry Ford grew up to be the most famous inventors in the world--and best friends, too. "}, {"id": "0761323783", "genre": "Children's Books", "title": "Unlikely Pairs (Bob Raczka's Art Adventures)", "description": "Invites the reader to discover fourteen funny stories produced by pairing twenty-eight paintings from different eras and styles."}, {"id": "0486423824", "genre": "Children's Books", "title": "Trolls, Elves and Fairies (Dover Coloring Books)", "description": "A wonderland of wee folk, this imaginative coloring book is populated by gremlins, pixies, giants, and other fantasy characters. In addition to mermaids, leprechauns, and other familiar creatures, these 29 images encompass a variety of lesser-known spirits:• Befana, a good house-fairy from Italy, who brings toys and sweets on Twelfth Night• Sandman, an English nursery spirit who lulls the children to sleep by sprinkling magical dust in their eyes• Puddlefoot, the Scottish household brownie who both tidies up unfinished work and makes a mess of completed chores• The Cloud People, spirits believed by Pueblo Indians to bring water to crops• Alberich, the dwarf king, who possesses a magic ring, a cloak of invisibility, and a sword with special powers• Mab, Empress of Fairies, who rides a magical coach drawn by three butterfliesColorists of all ages are certain to fall under the spell of these beguiling images."}]