[{"id": "B00R57VHKS", "genre": "Children's Books", "title": "Happy St. Patrick's Day, Hello Kitty", "description": "It's St. Patrick's Day, and Hello Kitty is getting ready for the big parade. Hello Kitty is working on a St. Patrick's Day poem, but she's having trouble thinking of the perfect ending. Maybe her friends will help her. She puts on her green dress and meets her friends at the parade. Everyone is so festive! Look at all the floats! Listen to all the music! Just as the friends begin their Irish jig, it starts to rain. Oh no! Will it ruin the parade? Little does Hello Kitty realize that the rain will bring the perfect ending to her poem."}, {"id": "160886796X", "genre": "Children's Books", "title": "Steven Universe Vol. 2", "description": "Back to Beach City!It is never an average day in the life of Steven Universe! From helping the Crystal Gems fight creatures to helping out a friend in need, Steven is always up to something. Join Garnet, Amethyst, and Pearl as they keep Beach City weird! Written by international indie all-star Jeremy Sorese (A REMINDER, ADVENTURE TIME™) and illustrated by the insanely talented Coleman Engle (REGULAR SHOW™), STEVEN UNIVERSE™ explores the magical world of the hit Cartoon Network show with all new adventures sure to make your gem shine."}, {"id": "B07464VHLM", "genre": "Children's Books", "title": "Poppy & Daisy: The Cats That Sailed The South China Sea (A Children's Animal and Action Adventure Series)", "description": "A short story prequel to the Tails From Clowder Cottage Series taken from the book, Catalysts (due out shortly)Long before Poppy and Daisy found a new home at Clowder Cottage, they lived a very different life in Thailand. One act of bravery by their mother sent them on a whirlwind adventure across the South China Sea, where sailors, sea captains, dangerous storms, and one pesky rat leads them through the most eventful days of their young lives in and out of the water. Follow their high seas adventure and cheer them on as they say goodbye to their homeland and encounter new, exciting, and sometimes, dangerous experiences, meeting a cast of quirky characters along the way.Can they survive the seas and make it to their long-awaited destination?** Story Updated 14 Aug 2017**"}, {"id": "0028653874", "genre": "Children's Books", "title": "Atlas of the Evolving Earth (MacMillan Science Library)", "description": "Arranged chronologically, details and illustrates the development of Earth and its life forms, from the beginning of the solar system to the present day."}, {"id": "B018TD1KJ4", "genre": "Children's Books", "title": "Awesome Opossum Visits a Farm (The Adventures of Awesome Opossum)", "description": "Awesome Opossum explores a farm. On his adventure, he helps young readers identify animals, machines, and everyday things. Awesome is a cute character, who was inspired by Dr. Seuss, and Beverly Cleary's \"The Mouse and the Motorcycle.\" Awesome Opossum likes to rhyme, some of the time, and unlike other possums, he likes to have fun in the sun. Each book in The Adventures of Awesome Opossum, will transport your child away to a place where their imagination can grow in a smart, healthy manner.These books have large, easy to read print and are filled with colorful pages that will hold a child's attention raptly. The illustrations of Awesome the Opossum were done by award winning artist, Jack Hoyle, of T-rexstudios.com, and the text content, background clip-art, and layouts were designed by award winning K-3rd grade author, M. K. Mathias"}]