[{"id": "194190100X", "genre": "Children's Books", "title": "Mad Maggie's Adventures: You're My Friend Too", "description": "A Children's Fantasy Book with Poetry, a Dragon, and Adventure! An Exciting Read Along!  Mad Maggie and Richard the Dragon meet with their friend, Winston. They soon deal with the issues that come up when there are three people in a group of friends and one member of the group feels left out. Read along as Richard the Dragon learns about accepting change and that it is possible to have more than one best friend."}, {"id": "1617954721", "genre": "Children's Books", "title": "The Adventures of Pajama Girl: The Coronation of the Cupcake Queen", "description": "A cute, illustrated story about a girl's imagination and her magical pajamas. In this adventure, Ellie's cupcake pajamas pave the way for she and her Sis to take a journey to a land filled with all kinds of sweet treats. Their journey quickly turns into an adventure to help the Cupcake Queen find the missing sprinkles needed for her coronation ceremony. In searching for the missing sprinkles, Ellie and Sis uncover a life lesson that is important for every child to learn."}, {"id": "1542945240", "genre": "Children's Books", "title": "Matt Ryan and the Atlanta Falcons: Then and Now: The Ultimate Football Coloring, Activity and Stats Book for Adults and Kids", "description": "Hours of fun for grown-up's and kids alike with this detailed Atlanta Falcons coloring book full of Falcons stars from past and present. Read player bio's, compare statistics, create and learn about plays, design logos, helmets, uniforms and more!   Desmond Trufant, Matt Ryan, Alex Mack, Austin Hooper, Deion Jones, Devonta Freeman, Julio Jones, Eric Weems, Jacob Tamme, Justin Hardy, Keanu Neal, Matt Bryant, Mohamed Sanu, Patrick DiMarco, Taylor Gabriel, Tevin Coleman, Vic Beasley, 6 surprise Falcons Legends and many more!   Guaranteed to bring a smile to any true Falcons fan!   100 pages. No backside printing (1 player per page).   Go Falcons!  "}, {"id": "B00WEVJ9EQ", "genre": "Children's Books", "title": "10 True Tales: Crime Scene Investigators (Ten True Tales)", "description": "Ten true stories of real-life crime scene investigators!A gold ring has been discovered at a murder scene, but police have little else to go on. Can State Patrol Investigator Richard Havel use that clue to track down the killers? A bomber is terrorizing a western community. What forensic clues can Investigator Jack Charles gather to stop and solve the bombings?Enter the secret world of crime scene investigators who use the latest forensic techniques to solve mysteries and bring criminals to justice. You will never forget these incredible true stories."}, {"id": "1634506634", "genre": "Children's Books", "title": "Hacks for Minecrafters: Command Blocks: The Unofficial Guide to Tips and Tricks That Other Guides Won't Teach You", "description": "From the author of Hacks for Minecrafters comes the most encompassing guide ever to command blocks in the world of Minecraft!With Hacks for Minecrafters: Command Blocks, kids will learn everything they need to know about manipulating and programming command blocks within Minecraft. As well as clearly explaining the commands and how to use them, this book has tons of fun tricks and projects for making your own custom maps and mini-games. Other tips cover:Giving and getting lootPutting any enchantment on a weaponCustomizing villagersSupercharging mobs with data tagsCreating a massive fireworks displayCombining command blocks to make programsPacked with expert tips, cheats, and hacks on command blocks, including a reference to commands, and block, item, and entity IDs, and exactly how you use them, and with over one hundred screenshots, Hacks for Minecrafters: Command Blocks shows exactly how the experts wield command blocks and make fun modifications to the Minecraft world."}]