[{"id": "0448440210", "genre": "Children's Books", "title": "Places, Everyone! (Angelina Ballerina)", "description": "Now the whole family can dine with Angelina Ballerina. There are eight different scenes to color, and each one is 131/2 x 103/4 inches, large enough to use as a place mat!"}, {"id": "0060596023", "genre": "Children's Books", "title": "Cinderella and Other Tales by the Brothers Grimm Book and Charm (Charming Classics)", "description": "For almost two hundred years, the Brothers Grimm have transported readers into a world of magic and adventure with their enchanting fairytales.  From classics such as Cinderella and Snow White to lesser–known gems like The True Bride and Mother Holle, these timeless tales never fail to delight. Enter the wonderful world of witches and fairies, elves and giants, and princes and princesses in this collection of thirty beloved stories!  Ages 8+"}, {"id": "0448489449", "genre": "Children's Books", "title": "Room on the Broom Big Activity Book", "description": "Based on the bestselling Room on the Broom, this 48-page activity book is packed full of things to make, do, and color in; games to play and puzzles to solve; and more than 200 reusable stickers! With plenty to keep young readers busy for hours, it's the most fun any child could have without a broomstick."}, {"id": "1543500315", "genre": "Children's Books", "title": "Arabian Horses (Horse Breeds)", "description": "With its floating trot and head held high, an Arabian horse attracts admirers wherever it goes. This all-around horse excels in endurance competitions, but its willing attitude and trainability make it a solid performer in almost any area. It's easy to see why these spirited, proud horses are every bit as valued by their owners today as they were thousands of years ago."}, {"id": "1567114687", "genre": "Children's Books", "title": "Speed! - Boats", "description": "Start your engines -- here are the world's fastest, most powerful, most advanced vehicles. The Speed! 6-vol. series is filled with the most up-to-date information on the world's most amazing machines. Find out all about the world's fastest jet plane, the world's largest steam train, the world's fastest electric car, the world's fastest sailing vessel, the world's fastest motorcycle, and the most destructive military vehicle ever built. With large-format photographs and fascinating text, the Speed! series offers every reader a full blast of excitement!"}]