[{"id": "B005Q714UW", "genre": "Children's Books", "title": "Gold and Silver, Silver and Gold: Tales of Hidden Treasure", "description": "Pirates and Spanish galleons, clues to undiscovered hoards, and more—here is a collection of rich lore and legends, facts and myths, that will appeal to the treasure-seeker in everyone. “I doubt that today’s kids will be able to resist Alvin Schwartz’s new collection of stories . . . It’s just as exciting as his earlier gatherings of tales.” —The Washington Post Book World “An excellent work on a high-interest subject, this will be a natural for book talks.” —Starred, Booklist An NCSS-CBC Notable Children’s Trade Book in the Field of Social Studies"}, {"id": "0881106615", "genre": "Children's Books", "title": "Robotics (Usborne New Technology)", "description": "Robotics looks at the world of real robots which build cars, explore the solar system and carry out many other difficult and dangerous jobs with great efficiency."}, {"id": "0823962318", "genre": "Children's Books", "title": "A Day in the Life of a Colonial Sailmaker (Library of Living and Working in Colonial Times)", "description": "Describes a typical day in the life of James Forten, who was born in Philadelphia to free black parents, learned to be a sailmaker, and later became a wealthy, respected businessman with his own shop."}, {"id": "0670013102", "genre": "Children's Books", "title": "Two is for Twins", "description": "What makes two? All sorts of things. A bicycle's wheels. A bluebird's wings. And twins, as you can plainly see, Are just as two as two can be. This brightly illustrated board book is a buoyant, bouncy ode to the joys of twindom. Perfect for children who are twins, and just as perfect for children who aren't!"}, {"id": "0310749239", "genre": "Children's Books", "title": "The Berenstain Bears Father's Day Blessings (Berenstain Bears/Living Lights)", "description": "In The Berenstain Bears Father’s Day Blessings, Mama, Gran, and the cubs plan an adventure to honor Papa Bear and Gramps on Father’s Day.Papa Bear and Gramps are the best dads in Bear Country and the cubs want to show their love. Working together with Mama and Gran, a special fishing trip and picnic are planned for Father’s Day. Will Papa and Gramps bring in a big catch of fish … or will they catch something else even better?"}]