[{"id": "B074Q6YSWP", "genre": "Children's Books", "title": "The Golden City Captives", "description": "Captured. Sold. Enslaved. Displayed.Keio’s dream of seeing the Golden City turns into a nightmare. He and his friend, Clara, get swept up by Fire Fairies along with the other youths in their village. They’re quickly sold to the local lord. The man seeks something very special that only certain young people possess, and he’s willing to threaten anyone to get it. But his daughter has other plans.Like it or not, Keio and Clara land in the middle of a brewing war. They’re going to have to pick a side soon, and if they choose wrong, their lives aren’t the only ones forfeit.Interview questions:Q: What makes The Golden City Captives special? A: It’s a classic story of good vs. evil wrapped in a world full of magic and mystery. Q: Is there a sequel?A: Not yet. One day, I hope to expand the world as I’m quite certain there are tons of untold tales here. Keio and Clara have a long road ahead of them. This is just the beginning.Q: What theme(s) make it special?A: Family. Friendship. Responsibility. Destiny. (All the cool stuff.)"}, {"id": "B076QC12QL", "genre": "Children's Books", "title": "Children's books: Ernie The Elephant And The Teddy Bear: bedtime stories for kids ages 2-6", "description": "Children's Books Ernie The Elephant And The Teddy BearIs your child afraid of the dark? Does he or she have a favorite toy?The comfort of a favorite toy in the dark helps us face our fears.When Ernie the Elephant loses his favorite teddy bear, he overturns tables and furniture to find it with no luck.How will he be able to sleep without Plum the teddy bear?With the help of Martin, the Mouse, he retraces his steps more carefully around his home.Will Martin and Ernie find Plum the teddy bear, or will Ernie have to face the darkness at bedtime alone?Ernie the Elephant and the Teddy Bear is a delightful children's story set in rhyme.Your child will delight in the colorful illustrations of Ernie and his family and then connect with him as he searches for his beloved bear. This is a perfect bedtime story that reassures any child that all is safe before he or she falls asleep. ideal for reading to your kids at bedtime"}, {"id": "073689408X", "genre": "Children's Books", "title": "Amelia Earhart (First Biographies - Trailblazers and Legends)", "description": "Text and photographs introduce the biography of Amelia Earhart, the first woman pilot to fly an airplane alone across the United States, and the Atlantic and Pacific Oceans."}, {"id": "1576582353", "genre": "Children's Books", "title": "Jim Elliot: A Light for God (Heroes for Young Readers)", "description": "As a boy, young Jim Elliot (1927-1956) dreamed of bringing God's light to exciting and faraway lands. When he grew up, Jim bravely faced both the wonders and the dangers of the South American jungle to share God's love with the feared and isolated Auca people. His martyrdom at their hands ignited a flame for missions that spread to Christians everywhere.Children, parents, and teachers love the adventurous Christian Heroes Then & Now biographies and unit study curriculum guides. Now Heroes for Young Readers introduces younger children to the lives of Christian heroes! Whether reading for themselves or being read to, children love the captivating rhyming poems and unforgettable color illustrations of the Heroes for Young Readers series."}, {"id": "1403448477", "genre": "Children's Books", "title": "What's Living Inside Your Body? (Hidden Life)", "description": "Did you know that many living things are too small to see? That your body is home to millions of tiny organisms? That some of them can grow to be thirty feet long…inside you? Discover your body through a powerful microscope and see tiny creatures as giant monsters. Look at the viruses and germs that cause colds and sore throats. Check out the parasites that want to live inside you. Learn about the thousands of tiny living things that are normally invisible to the naked eye―a world of hidden life."}]