[{"id": "0981656919", "genre": "Children's Books", "title": "Annie Funk: Lived to Serve, Dared to Sacrifice (More Than Conquerors)", "description": "Annie Funk: Lived to Serve, Dared to Sacrifice is the first book in the \"More than Conquerors Series\", a series of picture book children s stories telling about the lives of Christian men and women who endeavored to follow Christ in difficult circumstances. This book tells the story of a missionary to India, who started a girls school in the city of Janjgir in 1908. On a return trip to the United States aboard the Titanic, she sacrificed her life so that a mother could join her children in a lifeboat."}, {"id": "1439592578", "genre": "Children's Books", "title": "Fashion Kitty", "description": "What if things had worked out a little differently for Cinderella? What if the evil stepmom wasn't exactly horrible and the step sisters weren't entirely evil? If all those things were true, would there still be a prince who falls for the lonely and sad maiden? For Lucy, the answer seems to be a resounding.no. When her father remarries, Lucy's old life is turned upside down. She moves from her West Coast home to a suburb on Long Island and feels like a total outcast. With no friends in her future, a blank social calendar, and a huge crush on the prince of the varsity basketball team, Lucy's life doesn't seem to have the makings of \"happily ever after.\" But Lucy soon finds out that happy endings do happen-just not scripted as she had planned."}, {"id": "073642976X", "genre": "Children's Books", "title": "GOOD NIGHT, LIGHTNIN", "description": "A bedtime board book featuring Lightning McQueen and friends from Disney/Pixar Cars! It's bedtime in Radiator Springs, but before Lightning McQueen can go to sleep, he has to say goodnight to all of his friends from Disney/Pixar's Cars! This glow-in-the-dark board book, featuring glow on every page, is the perfect way to get children ages 0-5 ready for bed."}, {"id": "1547139854", "genre": "Children's Books", "title": "Happy Birthday 10: Birthday Books For Girls,  Birthday Journal Notebook For 10 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1683423852", "genre": "Children's Books", "title": "Stems (A Closer Look at Plants)", "description": "Ever wonder how plants reach toward the sun? Or how water gets from the roots to the leaves? A plant’s stem is like a highway, transporting water and food where it’s needed. Dig in to discover how stems work to support a plant’s survival."}]