[{"id": "0859655016", "genre": "Children's Books", "title": "100 Reasons to Love Ryan Gosling", "description": "Actor. Musician. Heartthrob. Feminist icon (sort of). There’s only one Ryan Gosling. Women want him. Men want to be him. Most Tumblr blogs are about him. No mere Hollywood pretty boy, he’s symbolic of everything modern manhood should aspire to. Did you see The Notebook? Exactly. Packed with trivia, jokes, and over 100 full-color photos that graphically illustrate his physical perfection, 100 Reasons to Love Ryan Gosling provides scientifically irrefutable evidence of exactly why Ryan is so damn loveable.Is it because he takes his mom to film premieres? Plays in a hip indie band? Carries his dog through airports? Breaks up street fights? Furthered the feminist cause without even trying? Has no problem with nudity even when the script doesn’t strictly require it? It’s all these things \u0097 and more."}, {"id": "B00XQ9RNVQ", "genre": "Children's Books", "title": "Dognapped (Childrens Picture Book Series #1)", "description": "Dognapped is an adorable children’s picture book comprising 13 beautiful illustrations about an adventurous and adorable dog Jack who lives in a red and yellow house in Aberdeen, Scotland.A great book that can be read to those younger than 5, a read alone or with guidance book for kids age 5-8, or as a read alone tale for kids 9-12 who are looking for a new sort of hero. Who doesn’t want to know about a dog who is brave enough to outsmart a dognapping gang? This book is beautifully illustrated and designed to captivate the imagination of every child enjoying it.A wonderful addition to any library, especially those collecting kids picture adventure books for the Kindle or picture books about dogs, cats or other animals.This story is appropriate for reading to children anytime including at bedtime."}, {"id": "1634139437", "genre": "Children's Books", "title": "Finance 101 for Kids: Money Lessons Children Cannot Afford to Miss", "description": "How do we equip the next generation with money management skills that they can carry forth into their adult lives?  One of the most important lessons that you can teach your kids is how to handle their money. Unfortunately, for most parents, giving their kids a sound financial education is an afterthought at best. Frustrated by the lack of resources that apply the concept of finance to real life situations for his own children to learn from, author Walter Andal was inspired to create an informative and entertaining book to help children get on the right path to making smart personal financial decisions.  In Finance 101 for Kids, children and parents will explore: * How money started * How to earn and make money * Saving and investing * What credit is and the dangers of mishandling credit * What the stock market is * Economic forces that can affect personal finance * What currencies and foreign exchanges are * The importance of giving back to the community  And much, much more! "}, {"id": "B076CLLSQ7", "genre": "Children's Books", "title": "MEMES: Ultimate Memes & Jokes 2017 – Impossible No Laugh Challenge – Funniest Memes on the Planet: Funny Memes 2017, Dank Memes, Memes For Kids, Memes Free, Memes xl, Pikachu Books, Roasts", "description": "NEW MEMES IN EVERY BOOK! Fresh and hilarious memes from 2017  FREE BONUS BOOKS INSIDE!Download for FREE using Kindle Unlimited Dank. Fresh. Hilarious.This book contains over 3000 pages of memes! I’ve gathered here the best memes on the internet for you to easily browse in one place. Since we love laughing at funny memes and pictures, we decided to create a series of books showcasing hilarious memes we find throughout the day from all over the internet. We’ve even found some memes in that old crusty sock you keep under your bed…Book is not appropriate for young kids. May have adult language or adult themes. Reader discretion is advisedHAVE FUN!  And let us know what you liked and where we can improve by leaving a review! "}, {"id": "B00TQCH04W", "genre": "Children's Books", "title": "St. Patrick's Day: Fun Short Stories For Kids (Children's Book: Cute, Bedtime Stories for Beginning Readers Book 3)", "description": "KINDLE UNLIMITED & AMAZON PRIME members can read this book for FREE!Welcome in St. Patrick's Day with these Kid Friendly Short Stories about Leprechauns and Four Leaf Clovers.  The perfect read for Early and Beginning Readers, filled with Cute Illustrations.  Great for Bedtime Stories, Waiting Rooms and Road Trips."}]