[{"id": "B00I16QMNO", "genre": "Children's Books", "title": "The Frog-Along Party", "description": "First place winner 2013, NE GA Writers Children's Book. Tickle your child's imagination with this richly illustrated story about King Frog, Fin, who invites 5 year old Lillie to a late night Frog-Along Party. A delightful mix of rhyme and story-telling, with an unusual twist when Lillie saves Fin.  An impressive debut book for pre-school through elementary age children. Illustrations contributed by note-worthy fine artists Sylvia Pimental, Dot Bunn, and Reveille Kennedy."}, {"id": "0750222247", "genre": "Children's Books", "title": "A Flavour Of The Caribbean (Food and Festivals)", "description": "Focusing on the Caribbean, this book is part of a series which introduces the food and eating customs of countries around the world through their festivals. The featured festivals also introduce the Caribbean's major religions, and a section on farming and step-by-step recipes are included."}, {"id": "1624311393", "genre": "Children's Books", "title": "Raspberry Pi (21st Century Skills Innovation Library: Makers As Innovators)", "description": "The Raspberry Pi is a small computer that allows almost anyone to learn about computer programming. Readers will discover new processes, integrate visual information with text, and and learn technical word meanings as they find out how the Raspberry Pi was invented and how makers are using it today. They will also learn how to set up and begin programming their own Raspberry Pis."}, {"id": "0143108670", "genre": "Children's Books", "title": "The Fox and the Star", "description": "From the award-winning designer of the iconic Penguin Hardcover Classics comes a beautifully illustrated fable about loss, friendship, and courage The Fox and the Star is the story of a friendship between a lonely Fox and the Star who guides him through the frightfully dark forest. Illuminated by Star’s rays, Fox forages for food, runs with the rabbits, and dances in the rain—until Star suddenly goes out and life changes, leaving Fox huddling for warmth in the unfamiliar dark. To find his missing Star, Fox must embark on a wondrous journey beyond the world he knows—a journey lit by courage, newfound friends, and just maybe, a star-filled new sky.  Inspired by the Arts and Crafts movement and the art of William Blake, The Fox and the Star is a heartwarming, hopeful tale which comes alive through Bickford-Smith’s beloved illustrations, guiding readers both young and grown to “look up beyond your ears.”"}, {"id": "0688147852", "genre": "Children's Books", "title": "Gator Halloween (The Gator Girls)", "description": "Amy and Allie, two alligator friends, hope their costumes will win a prize at the Swamp Street Halloween Parade, but they risk missing the contest to find a lost pet lizard"}]