[{"id": "B00J90F43U", "genre": "Science Fiction & Fantasy", "title": "The 10th Victim", "description": "It’s the twenty-first century and the ugliness of war no longer exists, except on a very personal level. Nowadays, people like Marcello Polletti, seller of Roman sunsets, and Caroline Meredith, lithe, beautiful, blond, and backed by corporate sponsors and the Roy Bell Dancers, hunt, chase, and kill one another for sport and for the entertainment of the masses—until something oddly like personal human feelings pops up to confuse the players and up the stakes as each of them seeks to kill a tenth victim and rise in the ranks of the hunters.   From the very beginning of his career, Robert Sheckley was recognized by fans, reviewers, and fellow authors as a master storyteller and the wittiest satirist working in the science fiction field. Open Road is proud to republish his acclaimed body of work, with nearly thirty volumes of full-length fiction and short story collections. Rediscover, or discover for the first time, a master of science fiction who, according to the New York Times, was “a precursor to Douglas Adams.”"}, {"id": "1540565963", "genre": "Science Fiction & Fantasy", "title": "Clockwork Legion (Aboard the Great Iron Horse) (Volume 4)", "description": "Events are spiraling out of control inside Dragonwall, as Shayla's enemies seek to turn the tables on her, and Kale finds his position as the knights' commander challenged. When the queen asks Kale to report to a nearby village that has been raided, he jumps at the chance to getaway from the politics and intrigue. Little does he realize he's about to uncover a terrifying secret that may change the course of history...Meanwhile, the Iron Horse makes a surprise stop when Socrates and his team discover a train wreck filled with the mummified remains of an ancient crew. While studying the site, they make another unexpected discovery:The crater beyond Dragonwall is home to a previously unknown civilization; a race of humans living in a city of pyramids and possessing strange, powerful new technologies.The crew's excitement is soon tempered by the realization that these timid farmers are not just shy of strangers... they are in fact slaves. Worse yet, their overseers are a race of creatures unlike any the crew have previously encountered. They are dangerous. They are powerful. And they are legion.Clockwork Legion is Book 4 of Sedgwick's \"Iron Horse\" series, a follow-up to the best-selling steampunk series \"The Tinkerer's Daughter.\""}, {"id": "B01H4FMPGU", "genre": "Science Fiction & Fantasy", "title": "2nd Edition: The Perfect Sense (Razor's Edge) (Perfect Seasoning Book 3)", "description": "We are going walkies. I love to feel the sunshine on my skin, but Master never does anything without a reason. Is he offering me a chance to run away to my freedom, or is this a power play to prove who is the real master?"}, {"id": "B000FBJFC8", "genre": "Science Fiction & Fantasy", "title": "The 34th Rule (Star Trek: Deep Space Nine Book 23)", "description": "For once, business is going well for Quark, not that anyone on Deep Space Nine™ truly appreciates his genius for finding profit in the most unlikely of circumstances. Quark is even looking forward to making the deal of a lifetime -- when he suddenly finds himself stuck right in the middle of a major dispute between Bajor and the Ferengi Alliance. It seems that the Grand Nagus is refusing to sell one of the lost Orbs of the Prophets to the Bajoran government, which has responded by banning all Ferengi activity in Bajoran space.  With diplomatic relations between the two cultures rapidly breaking down, Quark loses his bar first, then his freedom. But even penniless, he still has his cunning and his lobes, and those alone may be all he needs to come out on top -- and prevent an interstellar war!"}, {"id": "B0174W3W6A", "genre": "Science Fiction & Fantasy", "title": "Winds of Aerathiea (Chronicles of Aerathiea Book 1)", "description": "The Winds of AerathieaThe first volume in the new epic fantasy series, The Chronicles of Aerathiea.Young Liam Waite has already survived the unspeakable horrors of living in a post-apocalyptic St. Louis.  Nothing could have prepared him when a mysterious airship burst from the sky one October morning and asked for him by name.From there, he is whisked into a world he is utterly unprepared for and is made to answer for the sins of his parents."}]