[{"id": "B010IU2IQU", "genre": "Science Fiction & Fantasy", "title": "Accessing the Future: A Disability-Themed Anthology of Speculative Fiction", "description": "The fifteen authors and nine artists in this volume bring us beautiful, speculative stories of disability and mental illness in the future. Teeming with space pirates, battle robots, interstellar travel and genetically engineered creatures, every story and image is a quality, crafted work of science fiction in its own right, as thrilling and fascinating as it is worthy and important. These are stories about people with disabilities in all of their complexity and diversity, that scream with passion and intensity. These are stories that refuse to go gently."}, {"id": "1556341849", "genre": "Science Fiction & Fantasy", "title": "GURPS Fantasy Bestiary reprint (GURPS: Generic Universal Role Playing System)", "description": "A guide to 250 fantastical creatures form folklore and legends. Includes their habitat, eating habits, physical descriptions, connection with people, and tables to easily find the creature you need. All the creatures are easily customizable."}, {"id": "1530803985", "genre": "Science Fiction & Fantasy", "title": "Ponyfinder - Tribes of Everglow", "description": "A detailed look into the minds and societies of all the varied pony tribes of Everglow. See how they view each other and the other races of the world, how they handle birth, life, and death, and their unique perspectives shown in contrast with one another.  *Over a hundred new feats *Class Archetypes *Dozens of Alchemy Discoveries *Rogue tricks *Prestige class *New equipment *New spells *New Lore and history *A whole new tribe, the short legs."}, {"id": "0606320873", "genre": "Science Fiction & Fantasy", "title": "World War Z (Movie Tie-In Edition) (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. An account of the decade-long conflict between humankind and hordes of the predatory undead is told from the perspective of dozens of survivors who describe in their own words the epic human battle for survival, in a novel that is the basis for the June 2013 film starring Brad Pitt. Reissue. Movie Tie-In."}, {"id": "1555602126", "genre": "Science Fiction & Fantasy", "title": "Battletech Tactical Handbook", "description": "TACTICAL HANDBOOK is an advanced rules supplement for the Battletech universe. The book provides rules and equipment that enable players to add new depth and intensity to their games. Guidelines for creating long-term campaigns and double blind games, formulas for caculating the combat values of all Battletech combat units, detailed descriptions of advanced weapon systems and more..."}]