[{"id": "B0090KOI9U", "genre": "Science Fiction & Fantasy", "title": "Just Cause: Revised & Expanded Edition (Just Cause Universe Book 1)", "description": "A NEW HERO FOR A NEW ERAMustang Sally has some speedy shoes to fill. This young superhero has waited her whole life to join Just Cause – the premiere team of American heroes. Now she’s hoping her super-speed will earn a spot on the same team to which her parents and grandparents belonged.AN OLD GRUDGE FROM AN OLD ENEMYA chance encounter with the villain who killed her father changes everything. Even though she’s only an intern, Sally devotes herself to finding the man known as Destroyer. With the help of her eagle-winged best friend Sondra and her super-strong love interest Jason, her investigations uncover a sinister plot stretching all the way back to her grandparents’ era. Sally and Just Cause must risk everything to halt Destroyer’s plans and save the entire world.BONUS FEATURESBeyond the revised original text, this volume contains three all-new short stories that expand upon the history of Mustang Sally's family line in the context of the Just Cause Universe. It also contains a summary of the historical and contemporary superhero teams that have been part of the legendary history."}, {"id": "076537692X", "genre": "Science Fiction & Fantasy", "title": "American Craftsmen: A Novel (American Craft Series)", "description": "Ancient magic meets SEAL Team Six―with the fate of the United States hanging in the balance―in Tom Doyle's American Craftsmen.US Army Captain Dale Morton is a magician soldier-a \"craftsman.\" After a black-ops mission gone wrong, Dale is cursed by a Persian sorcerer and haunted by his good and evil ancestors. Major Michael Endicott, a Puritan craftsman, finds gruesome evidence that the evil Mortons have returned, and that Dale might be one of them. Dale uncovers treason in the Pentagon's highest covert ranks. He hunts for his enemies before they can murder him and Scherie, a new friend who knows nothing of his magic.Endicott pursues Dale, divided between his duty to capture a rogue soldier and his desire to protect Dale from his would-be assassins. They will discover that the demonic horrors that have corrupted American magic are not bound by family or even death itself.The American Craft Trilogy#1 American Craftsmen#2 The Left-Hand Way#3 War and CraftThis edition of the book is the deluxe, tall rack mass market paperback."}, {"id": "B005N2X6AG", "genre": "Science Fiction & Fantasy", "title": "Kumbaya Much (Apocalypse Babes Book 4)", "description": "Book 4. When a mysterious faction at the Fugere compound resorts to extreme measures for crowd control, problems intensify, threatening not only life and limb, but the already fragile estate between the Apocalypse Babes and the Others--especially as things heat up between Seffy and Trent."}, {"id": "1545259682", "genre": "Science Fiction & Fantasy", "title": "Agent of Enchantment (Dark Fae FBI) (Volume 1)", "description": "The fae live among us. And one of them is a serial killer. I thought this would be a simple profiling case. Just another Jack-the-Ripper wannabe, prowling London’s streets, searching for easy kills. I was wrong. This killer is fae, and he’s as elusive as smoke on the wind. But I’m an FBI profiler, and it’s my job to track him down. It doesn’t matter that one of the main suspects--a lethally alluring fae--is trying to seduce me… or kill me, I’m not sure which. I won’t be stopped, not even when panic roils through the streets of London, or when the police start to suspect me. As I close in on the killer, I follow him to a magical shadow realm that’s like nothing I ever expected, where I’m hunted like prey. Fine. Bring it on. I’m an FBI Agent. And it turns out I have magical powers of my own."}, {"id": "B01F7ZH9TC", "genre": "Science Fiction & Fantasy", "title": "Dragon Born: Chronicles of Dragon Aerie (Plague Born Book 1)", "description": "She craves adventure, but it comes with a price she's unwilling to pay.*RECENTLY EXPANDED TO A FULL-LENGTH NOVEL*Wylan craves an escape from her simple life as a water farmer. The thought of dragons and faraway places fuels her fantasies, and her need for adventure. Despite evidence of the destructive power of dragons all around her, Wylan can’t help but feel dragons are beautiful, misunderstood creatures. They can’t all be bad, can they?But they are, and when dragons come calling, Wylan’s dragged into an adventure with a price so steep, she wishes she’d never heard of dragons.Filled with dangerous dragons, magic, elves, and a kingdom in peril, The Chronicles of Dragon Aerie is a non-stop fantasy ride!Don't wait! Join the adventure when you buy today!"}]