[{"id": "076131329X", "genre": "Children's Books", "title": "Al Gore:Vice-Pres.Update/Edit (Gateway Biographies)", "description": "Traces the life and career of Vice President Gore, describes his experiences in Vietnam, and explains how he developed an interest in environmental issues"}, {"id": "0786822740", "genre": "Children's Books", "title": "Hercules: The Man, the Myth, the Hero", "description": "The legendary ancient Greek hero narrates the story of his life and adventures, from his birth as the son of Zeus, his trials with his sworn enemy Hera, his twelve labors, and his heroic ascent to Mount Olympus."}, {"id": "1782949003", "genre": "Children's Books", "title": "New KS2 Complete SATS Practice Papers Pack: Science, Maths & English (for the 2018 tests) - Pack 1", "description": "This brilliant-value pack from CGP contains six full sets of super-realistic KS2 Practice Papers: two sets for the KS2 Maths SATS, two sets for the KS2 English SATS and two sets for KS2 Science. Everything's fully up-to-date for the latest National Curriculum, and carefully written to match the style and content of the SATS in 2018 and beyond. What's more, complete answers, mark schemes and instructions are included for each subject, so it's easy to find out how well children are progressing. There's no better way to prepare for the SATS and Science assessments in Year 6! For even more practice, check out Pack Two (9781782949015)."}, {"id": "8415619979", "genre": "Children's Books", "title": "Kuku and Mwewe: A Swahili Folktale", "description": "A wonderful tale inspired by an old Swahili legend, The Chicken and the Eagle will reveal an amazing secret, and Kuku and Mwewe will live in your imagination forever.Guided Reading Level: M, Lexile Level: 770L"}, {"id": "0613511190", "genre": "Children's Books", "title": "Simpsons Comics Unchained (Turtleback School & Library Binding Edition) (Simpsons Compilation (Prebound))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The Simpson family shelters momentarily-rich computer geeks, goes to court over a history presentation based on Histrionik Comics, and deals with addictive donuts."}]