[{"id": "1576877566", "genre": "Children's Books", "title": "Just Like Daddy", "description": "A vivdly illustrated day in the life of a little boy and his daddy, this charming picture book paints a gently ironic comparison of how the day unfolds for each of them.      The toddler is filled with glee as he tackles each new challenge, while the dad faces his day with a a more grown-up combination of perseverance and resignation--yet he finds himself inspired by his son's open-hearted optimism. Spreads alternate between perspectives--the little boy's excitement at driving his toy car around compared with his father trying to navigate traffic, for example. The tension is resolved by a transcendent final spread that shows what makes it all worthwhile. In its unvarnished yet loving acceptance of the travails of being a working parent, Just Like Daddy is a perfect Father's Day gift for today's dads.  "}, {"id": "0823412164", "genre": "Children's Books", "title": "Count Silvernose: A Story from Italy", "description": "When her two foolish younger sisters vanish after going to work for a mysterious man with a nose made of polished silver, a clever young woman becomes suspicious and devises a plan to outfox the silver-nosed villain."}, {"id": "1467760730", "genre": "Children's Books", "title": "Experiment With a Plant's Roots (Lightning Bolt Books)", "description": "Roots help keep plants alive. They take in water and minerals. But do you know how much of a plant is made up of its roots? Or whether roots always grow down? Let's experiment to find out! Learn more about plants in the Plant Experiments series—part of the Lightning Bolt Books™ collection. With high-energy designs, exciting photos, and fun text, Lightning Bolt Books™ bring nonfiction topics to life!"}, {"id": "B01IPSEH7U", "genre": "Children's Books", "title": "How to Live Like a Caribbean Pirate (How to Live Like...)", "description": "It's 1718 and the world goes dark for Jamie Flynn, who's been snatched from the docks to join Blackbeard's crew of the fearsome pirates. Join him on board as he learns to fight with a cutlass and pistol, and follow him as he storms a treasure ship and shares in the spoils. You'll need your sea legs and strong nerves to live like a Caribbean pirate!"}, {"id": "0761316035", "genre": "Children's Books", "title": "The 1930s: Directions (Century Kids)", "description": "In the summer of 1936, Tony runs away from his home above his family's Italian restaurant in Chicago, while in Berlin David is present at the Olympics and prepares to move to America."}]