[{"id": "1623701872", "genre": "Children's Books", "title": "Secrets Beneath the Sea (Mermaid Kingdom)", "description": "Like most 12-year-old girls, Shyanna, Rachel, and Cora deal with the daily dramas of growing up. Unlike most 12-year-old girls, they deal with it underwater as mermaids. The allure of life on land is a constant presence in the life of a mermaid, and friendships are tested with secrets, lies, and jealousy."}, {"id": "1584691379", "genre": "Children's Books", "title": "Around One Log: Chipmunks, Spiders, and Creepy Insiders", "description": "Years after a great oak tree tumbled to the ground, a whole community of animals made it their home. Roly-polies and daddy longlegs prowled here and there, while chipmunks and salamanders dashed everywhere. Question: Is the old tree alive? Or is it now dead? This lighthearted book offers a marvelous insight into a unique and easily-accessible community of forest animals. Jennifer DiRubbio's vivid close-up illustrations bring these fascinating creatures to life. Parents and teachers: the author offers over a dozen activities, projects, and lots of cool ideas ranging from suggestions for an animal diary, readers theatre, finger play, and much more that will help make learning fun."}, {"id": "1613749775", "genre": "Children's Books", "title": "The US Congress for Kids: Over 200 Years of Lawmaking, Deal-Breaking, and Compromising, with 21 Activities (For Kids series)", "description": "An interactive guidebook to the history and inner workings of the legislative branch of the U.S. Government Providing a historical perspective on all that is going on today, US Congress for Kids examines the major milestones in congressional history, including the abolition of slavery, extending the vote to African Americans and to women, and investigating misconduct in both government and private institutions. Kids will be engaged by the focus on dramatic stories, personalities, and turning points while also benefitting from the clear discussions of Congressional purpose, structure, history, and ongoing issues. Educational, hands-on activities that illuminate the workings of the U.S. Congress include making a House ceremonial mace, creating congressional money, making a capitol dome, and designing a Congressional Medal of Honor."}, {"id": "0780798163", "genre": "Children's Books", "title": "Amanda Pig and Her Best Friend Lollipop (Amanda Pig (Prebound))", "description": "In four short stories for beginning readers, Amanda Pig and her best friend Lollipop play make-believe together. Amanda loves playing at Lollipop's house, because her room is purple, Amanda's favorite color, and Lollipop has a cute baby sister. But when Amanda sleeps over, she finds she likes her own house best at night."}, {"id": "1426321058", "genre": "Children's Books", "title": "When Fish Got Feet, When Bugs Were Big, and When Dinos Dawned: A Cartoon Prehistory of Life on Earth (National Geographic Kids)", "description": "Here are the three books of Hannah Bonner's award-winning When series under a single cover, with updated scientific facts and a new section of engaging activities and extra information.Featuring cartoons and Common Core alignment activities for teachers and kids, this book is a wonderful addition to any science class, library, or home bookshelf. Enjoy a humorous stroll through 200 million years of life on Earth, from when plants and animals first crawled onto land all the way to the dawn of dinosaurs. Along the way you will encounter fearsome fish, giant insects, towering trees, bizarre sea monsters and much more, served up with great illustrations and plenty of humor.From the Trade Paperback edition."}]