[{"id": "0374305889", "genre": "Children's Books", "title": "Did You Eat the Parakeet?", "description": "A little girl can't find her parakeet―her kitty must have eaten it! Right? Where else would it have gone? It was just here! She shouts, she accuses, and she laments her loss. But her cat might be trying to tell her something . . . With rhyming text and adorable art, Did You Eat the Parakeet? is a sweet and silly picture book that will have children laughing through the final page."}, {"id": "1981512500", "genre": "Children's Books", "title": "The Cat Wore A Santa Hat", "description": "The cat wore a Santa Hat up upon his head. Read along and see all the things the cat did, before time to go to bed."}, {"id": "B01C60XOVS", "genre": "Children's Books", "title": "Sing a Song of Sixpence: (Illustrated)", "description": "A brand new sixpence fresh from the Mint! How it sparkled and glittered in the dancing sunlight! Such a treasure for a small girl to possess! But then, on the other hand, what a heavy responsibility!  All day long it had been burning a hole in her pocket, and as for learning lessons, not an idea would enter her head. Everything went in at one ear and out of the other, as Miss Primmer sternly remarked when Nellie could not say her poetry. But, indeed, Nellie did try hard to learn her lessons; she squeezed her eyes together as tightly as possible, though how shutting her eyes was to prevent the lessons from coming out of her ears was not very clear.   \"But I must learn them now,\" she sighed, \"or Miss Primmer will keep me in tomorrow, and I shan't be able to go out with Nursie and Reggie to spend my sixpence. Oh dear! I wish I could learn my poetry and keep it in, I guess I'd better get a bit of cotton wool to put in my ears and then it can't come out. There, now!"}, {"id": "0984493840", "genre": "Children's Books", "title": "The Magic Museum (The Isaacson Series in Youth Literature) (Volume 1)", "description": "A young skateboarder finds himself headed for the art museum to fulfill a school assignment.  He can think of a thousand things he would rather be doing--until a Degas picture whispers to him from the museum wall.  There follows a painting by painting detective hunt as Degas' depicted characters reveal the secrets of their lives and times.  This elegant, wonderfully illustrated book demonstrates that past masters and masterpieces need not be \"dead\" for young people.  Viewed as a treasure trove of fascinating lore and legend, these paintings can catch the imagination of young people, motivating them to value the \"rush\" of great art as surely as they love the rush of jumping on their skateboards."}, {"id": "1465447180", "genre": "Children's Books", "title": "Ultimate Sticker Book: Dinosaurs", "description": "Packed with dinosaur activities — from creating scenes to putting a Spinosaurus back together — Ultimate Sticker Book: Dinosaur contains more than 250 reusable stickers of kids' favorite prehistoric creatures. Featuring T.Rex, Stegosaurus, Pterodactyl, and more, interesting facts about these scaly creatures that roamed the Earth millions of years ago is paired with bright, eye-catching stickers, encouraging children to return to this new sticker book again and again to learn even more.Taking subjects that kids love, from dinosaurs to baby animals to transportation, DK's Ultimate Sticker Book series is being refreshed and updated and now features more than 250 fun, reusable stickers. Packed with activities that allow children to create scenes, match pairs, and complete jigsaws, the activities throughout each book are simple enough for the child to do independently, but engaging enough to keep their interest and help develop dexterity, making these books products parents can trust, and ones that kids will want to keep picking up to learn more about their favorite subjects."}]