[{"id": "0967156556", "genre": "Children's Books", "title": "Giggles the Green Bean Turns Stinkytown into Greentown", "description": "Giggles the Green Bean Turns Stinkytown into Greentown is the first book in the Giggles the Green Bean series. In this fun story the young reader will learn the 5 special secrets Giggles learns in order to turn Stinkytown back into Greentown. Giggles teaches kids important green concepts and skills including recycling, water conservation, healthy eating, and energy conservation using tangible, real-world examples that even the youngest readers will be able to adopt and discuss with family and friends. In keeping with the environmental message, a portion of net proceeds will be donated to the U.S. Forest Service Plant-A-Tree Program."}, {"id": "1910512060", "genre": "Children's Books", "title": "Knights & Armour (Heroic History)", "description": "Step inside the chivalrous lives of knights, their heroic steeds and discover the secrets of their military might during the Middle Ages. Knights and Armour uncovers the heroic achievements of Europe’s famous warriors and their role in shaping the Kingdom of England."}, {"id": "1569318417", "genre": "Children's Books", "title": "Hamtaro Hamster Care Guide", "description": "Hamsters have a long history of popularity with children everywhere, and in Japan their popularity has skyrocketed. Driving the phenomenon is Ritsuko Kawai’s hugely popular manga series, Hamtaro Tales. Now kids who want to raise real hamsters can do so with the help of this colorful illustrated guide. The process of choosing and raising a hamster is covered, and photos of hamsters in precarious situations engage readers."}, {"id": "0763664588", "genre": "Children's Books", "title": "Skit-Scat Raggedy Cat: Candlewick Biographies: Ella Fitzgerald", "description": "A swinging bio of young Ella Fitzgerald, who pushed through the toughest of times to become one of America's most beloved jazz singers.When Ella Fitzgerald danced the Lindy Hop on the streets of 1930s Yonkers, passersby said good-bye to their loose change. But for a girl who was orphaned and hungry, with raggedy clothes and often no place to spend the night, small change was not enough. One amateur night at Harlem's Apollo Theater, Ella made a discovery: the dancing beat in her feet could travel up and out of her mouth in a powerful song --and the feeling of being listened to was like a salve to her heart. With lively prose, Roxane Orgill follows the gutsy Ella from school-girl days to a featured spot with Chick Webb's band and all the way to her number-one radio hit \"A-Tisket, A-Tasket.\" Jazzy mixed-media art by illustrator Sean Qualls brings the singer's indomitable spirit to life.Back matter includes resources for further information, and an index."}, {"id": "0792253841", "genre": "Children's Books", "title": "National Geographic Investigates: Ancient Africa: Archaeology Unlocks the Secrets of Africa's Past", "description": "Archaeology reveals the rich histories of complex cultures in the cradle of humankind. Study the Dogon people of Mali. Explore the ancient city of Jenne-jeno. Learn how computer technology has recreated the Kushite temples at Jebel Barkal and how artifacts bring new insights, helping scientists to piece together the puzzle of ancient Africa.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}]