[{"id": "B00MMQ89M6", "genre": "Children's Books", "title": "Tina Tumbles", "description": "Tina Tumbles is a delightful story which inspires confidence, focus, and perseverance. After watching gymnasts flip across the T.V. screen, Tina wants to do nothing but gymnastics at all hours of the day. But Tina learns that even a cartwheel is not as easy as it looks. She just can't land on her feet. Now it's time for her first gymnastics lesson. Will Tina gain the confidence she needs to complete the skill without falling?"}, {"id": "0486816478", "genre": "Children's Books", "title": "See and Say: A picture book in four languages", "description": "\"In 1953, Time magazine called Antonio Frasconi America's foremost practitioner of the ancient art of the woodcut. Four decades later, Art Journal called him the best of his generation.\" ― The New York TimesIn this New York Times Best Book of the Year, internationally renowned artist Antonio Frasconi presents beautiful and brightly colored woodcuts depicting a variety of everyday items — a boat, Christmas tree, dog, train, birthday cake, and many other eye-catching objects. The word for each image is given in English (printed in black), Italian (blue), French (red), and Spanish (green), and accompanied by pronunciation guides. A page of common expressions such as \"Good morning!\" and \"What time is it?\" in each language appears at the end.For the very young, this is a delightful picture book; for older children, it offers useful illustrated language lessons. All will enjoy the whimsical images and accompanying words and phrases."}, {"id": "0778736164", "genre": "Children's Books", "title": "Space Tech: High-tech Space Science (Techno Planet)", "description": "Presents information about ways we already benefit from space technology, including enriched baby food and laser eye surgery."}, {"id": "1635175488", "genre": "Children's Books", "title": "Emmanuel Macron", "description": "Introduces readers to the political career of French President Emmanuel Macron. Engaging infographics, thought-provoking discussion questions, and eye-catching photos give the reader an invaluable look into France and the office of its current leader."}, {"id": "0440414067", "genre": "Children's Books", "title": "In Care of Cassie Tucker", "description": "Thursday, August 17, 1899, had been as ordinary as dishwater for Cassie Tucker, who lives near Blue Hill, Nebraska. Up until nightfall, that is, when the telegram arrives saying an orphaned cousin is traveling to their farm. Cousin Evan fits in at first, but his independent ways set him apart from Preacher Tucker's family.As a carefree Indian summer propels the Tuckers toward year's end, Mother Nature tests them with everything from drought to dust storms to a blinding blizzard. Cassie fears she could become an orphan, too, as the family becomes separated and she and Evan must fight for their lives."}]