[{"id": "8416147205", "genre": "Children's Books", "title": "Moon's Messenger", "description": "Moon´s Messenger reminds us of the importance of conserving and respecting the environment, and that we can all help to protect nature and biodiversity.Guided Reading Level: P, Lexile Level: 880L"}, {"id": "0789478927", "genre": "Children's Books", "title": "DK Share-a-Story: Don't Rock the Boat", "description": "A group of animal friends share a boat ride so that they will keep nice and clean on their way to Dottie the Donkey's party."}, {"id": "1848694393", "genre": "Children's Books", "title": "When the Bees Buzzed Off!", "description": "Uh-oh! The bees have buzzed off and now the minibeasts are in a pickle. Who will pollinate the fruit and flowers? It's up to three brave bugs to bring those buzzy bees back! Packed with fun flaps, fascinating facts and hilarious asides throughout, When the Bees Buzzed Off! is the perfect book to encourage little ones to think about important environmental issues and explore the natural world! This energetic romp through the wild outdoors is brought to life with bright and engaging illustrations from talented illustrator Stephen Bennett."}, {"id": "B0768JG6BG", "genre": "Children's Books", "title": "Why Do We Celebrate Halloween? Holidays Kids Book | Children's Holiday Books", "description": "What were the origins of Halloween? Why do we celebrate it until today? This edutaining book for kids contains explanations on the celebration. It’s important that kids learn the why’s and the how’s of events to inculcate a deeper understanding and appreciation of the festivities. The book contains select texts and information to attract and retain the attention. Grab a copy now!"}, {"id": "0340911166", "genre": "Children's Books", "title": "Can Anyone Be As Gloomy As Me?: Poems About Being Sad (Poemotions)", "description": "Ideal for ages 3-7, these simple poems get to the heart of childhood emotional experience. They are hugely entertaining in their own right, and wonderfully supplemented by the witty and humorous illustrations, thus making them ideal for literacy work. They also make a great starting point for discussion about feelings and behavior."}]