[{"id": "1786271222", "genre": "Science Fiction & Fantasy", "title": "Action and Adventure: Movie Trump Cards", "description": "Muscle your way to the top of the pack in an all-action, all-fighting line up of the best action films ever made. Which has the craziest stunts, the most violence and the best quotes?  Jaws  or Spartacus ?  Goldfinger  or  Gladiator ?  Kill Bill  or  King Kong ? Battle your friends in the ultimate conflict with these 32 trump cards."}, {"id": "1946777277", "genre": "Science Fiction & Fantasy", "title": "Tales from the Canyons of the Damned: Omnibus No. 3: Color Edition (Volume 3)", "description": "This Third Omnibus edition of Tales from the Canyons of the Damned consists of Fourteen sharp, suspenseful, thought provoking short stories - from Twelve of todays top speculative fiction writers.  Tales from the Canyons of the Damned (canyonsofthedamned.com) is a dark science fiction, horror, & slipstream magazine we've been working on since 2015. What is Dark Science Fiction and Horror? Think of it as a literary Twilight Zone, Night Gallery, or Outer Limits, it's Netflix's Black Mirror in the short story format. And it's a bargain. Each monthly issue has three-to-five sharp, suspenseful, satirical tales from today's top speculative fiction writers. These are Dark Sci Fi Slipstream Tales like you've never read before."}, {"id": "B071RQZ9CL", "genre": "Science Fiction & Fantasy", "title": "As You Wish (A Summerhouse Novel)", "description": "New York Times bestselling author Jude Deveraux returns with the highly anticipated third installment in her beloved Summerhouse series, where three women have the coveted opportunity to answer the age-old question: What would you do differently if you could do it all again?One fateful summer, three very different women find themselves together in Summer Hill, Virginia, where they find they have much more in common than they realized…Sixty-year-old Olivia’s first marriage was long and unhappy, but now she is a newlywed, thrilled to finally be starting her life with the man she’s always truly loved—even if they are getting a late start. Kathy is in her forties and married to a handsome, successful businessman. Theirs would be a fairy-tale romance if it weren’t for one problem: He’s passionately in love with someone else! Twenty-something Elise is also in a troubled marriage, stuck with the man her wealthy parents chose for her. Now that he has a pregnant mistress, he seems willing to go to drastic lengths to take Elise out of the picture.Though each of them wound up at the Summerhouse for separate reason, it’s not long before they begin to open up about their regrets, their wishes and their dreams. And when they’re presented with the opportunity of a lifetime—a chance to right the wrongs of their past—all three discover what can happen when dreams really do come true.A heartfelt, magical tale, As You Wish is a shining example of Jude Deveraux’s enchanting storytelling that will charm longtime fans and delight a new generation of readers."}, {"id": "0980531993", "genre": "Science Fiction & Fantasy", "title": "Moon Zero (The Dreamer Chronicles) (Volume 3)", "description": "Episode III of the Dreamer Chronicles finds our two young heroes hurled into a terrifying race against time! 99c SPECIAL PRE-ORDER & LAUNCH PRICE!Sarina, now 13, has a big problem, and it’s way bigger than the one she thinks she has. She’ll have to save the world. Again.Sarina is one of Professor Harrison’s most powerful Dreamer Kids: highly creative children who can communicate in their dreams with people in other universes ... and in Sarina’s case, actually travel between them.The Consortium wants to get its hands on the Professor’s secret invention—a REM-collider that multiplies creative dream power—and they want to turn it into a powerful weapon, for sale to the highest bidder.Despite her young age, Sarina is focused on teaching kids to paint. But the art program’s benefactor, Sir John Drysdale, has made it clear that her art lacks emotion and something inside her is missing.Strange, seemingly unconnected occurrences provoke unrest across two worlds: severe weather patterns threaten to destroy a township; her old enemy, Makthryg, is making plans to escape his prison; in Australia, a prominent observatory has reported an unusual and worrying aberration in the Moon’s orbit.And Sarina is kidnapped.When her friend, Nathan, discovers a frightening message on Professor Harrison’s computer, these events conspire to trigger a destructive domino effect. One that will catapult the young adventurers on a wild journey to do battle with the cosmos itself.But for them to be successful, Sarina must fix whatever is missing inside her and confront her arch-enemy once again."}, {"id": "141761840X", "genre": "Science Fiction & Fantasy", "title": "2 Towers (Lord of the Rings)", "description": "The standard hardcover edition of the second volume of The Lord of the Rings includes a large format fold-out map. Frodo and his Companions of the Ring have been beset by danger during their quest to prevent the Ruling Ring from falling into the hands of the Dark Lord by destroying it in the Cracks of Doom. They have lost the wizard, Gandalf, in a battle in the Mines of Moria. And Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape, the rest of the company was attacked by Orcs. Now they continue the journey alone down the great River Anduin -- alone, that is, save for the mysterious creeping figure that follows wherever they go."}]