[{"id": "1683423860", "genre": "Children's Books", "title": "Leaves (A Closer Look at Plants)", "description": "Some are bigger than a school bus. Others are as small as a candy sprinkle. Some make people itch. What are they? Plant leaves! Find out why leaves are a certain shape and size, how they help plants grow, and perform your own experiment to find out just what leaves need to grow."}, {"id": "0531145212", "genre": "Children's Books", "title": "The Journey of a Whale (Lifecycles)", "description": "A look at the migratory cycle of a whale, explaining when and why it migrates, the distance covered, and the problems it must overcome at different stages of the journey. Part of the LIFECYCLES series, illustrated with colour artwork. Suitable for National Curriculum Key Stage 1-2."}, {"id": "0060518308", "genre": "Children's Books", "title": "Lily's Ghosts", "description": "Lily is Furious.She can't believe she has to move again after her mom's break-up with the latest boyfriend. Now they're broke and they'll have to spend the winter in Uncle Wes's creepy summerhouse in Cape May, New Jersey.And the place is crawling with ghosts. From the spiteful teenager who mistakes Lily for her high school nemesis to the restless spirit of her eccentric Uncle Max, Lily is haunted by a host of unhappy phantoms. But why are they here? And what do they want? With the help of some mysterious clues, Lily and her new friend, local boy Vaz, uncover a sinister plot. If they don't foil the villainous plan in time, they may end up doing some eternal haunting of their own."}, {"id": "0803718233", "genre": "Children's Books", "title": "The Giant Carrot", "description": "A TALL tale about the power of teamworkWhen sweet Little Isabelle?s family plants a carrot seed one day, tall Papa Joe, wide Mama Bess, and strong Brother Abel all do their part. But when Little Isabelle wants to help too, Brother Abel just laughs. ?What can you do?? he asks. ?I?ll sing and dance to the carrot to make it grow,? she says. ?And come summer, we?ll have little cups of sweet carrot puddin?.? Sure enough, that carrot takes a fancy to Little Isabelle?s singing and dancing and grows to an amazing height?proving that great things can be accomplished when everyone works together.Based on an old Russian folktale, and complete with a scrumptious recipe for carrot puddin?, this wonderfully humorous story shows the strength of teamwork and the power of a touch of imagination."}, {"id": "1632293668", "genre": "Children's Books", "title": "Miraculous: Tales of Ladybug and Cat Noir: Bug Out", "description": "Ladybug and Cat Noir must face off against three more of Hawk Moth’s akumatized victims. Chloé, after an argument with her hero Ladybug, turns into Antibug, her evil twin with the exact same powers! Then, while Marinette is babysitting Manon, the young girl gets upset and becomes Puppeteer, gaining the ability to control some of Ladybug’s former foes, including Lady Wifi, Evillustrator and Rogercop. Finally, Lila, who is humiliated in front of her crush Adrien, becomes the villain of illusions, Volpina. Will the two greatest superheroes in all of Paris be able to stop so many villains at once? Find out in the final volume of season one!   SPOTS ON, CLAWS OUT!  Collects MIRACULOUS #22-24."}]