[{"id": "0060574135", "genre": "Children's Books", "title": "The Berenstain Bears' Dinosaur Coloring Adventure", "description": "Join your favourite family on a dinosaur adventure in this 48–page colouring book. It comes with jumbo crayons for extra value. Ages 3 – 7"}, {"id": "0448489155", "genre": "Children's Books", "title": "Paris: A Book of Shapes (Hello, World)", "description": "Introducing Hello, World, an exciting new board book series that pairs early learning concepts with colorful, stylish illustrations of cities around the world. Paris is a treasure trove of fascinating shapes: there are triangles at the Louvre Museum, rectangles at Notre-Dame Cathedral, arches at the Arc de Triomphe, and stars in a beautiful Parisian night sky. Explore shapes all over Paris in this gorgeous board book!"}, {"id": "1783122536", "genre": "Children's Books", "title": "Bugs: Interact with Augmented Reality Creepy Crawlies (iExplore)", "description": "With its amazing high-tech AR, this book brings bugs to life!     Want to watch a Goliath bird-eating tarantula crawl across your table, a Giant Wetapunga Cricket jump on your friend’s hand, or the world’s biggest butterfly flutter around your bedroom? All it takes is this book and a smartphone or tablet! With its unique high-tech features, Bugs allows kids to interact with nature’s most remarkable creepy-crawlies. Eleven fact-packed profiles supply all the need-to-know info about each insect—their size, habitat, anatomy, diet, and other extraordinary features. Then open the app to trigger the AR action, use the controls to make the bugs life-size or bigger, rotate them for a closer 3D look, make them walk or fly around the room—and have fun.NEW: Click on the iExplore feature window to access complementary educational content, featuring facts, stats, quizzes, and more!"}, {"id": "1429650184", "genre": "Children's Books", "title": "Motocross Racing (Dirt Bike World)", "description": "With jaw-dropping jumps and tight turns, a motocross course can look nearly impossible to get through. But for these steel-nerved riders, its all in a days work. Find out how the sport that shaped the modern dirt bike still keeps fans on their feet after almost 100 years."}, {"id": "1484717791", "genre": "Children's Books", "title": "7 Ate 9", "description": "6 has a problem. Everyone knows that 7 is always after him. Word on the street is that 7 ate 9. If that's true, 6's days are numbered. Lucky for him, Private I is on the case. But the facts just don't add up. It's odd.Will Private I put two and two together and solve the problem . . . or is 6 next in line to be subtracted?"}]