[{"id": "B076H9TFHZ", "genre": "Children's Books", "title": "Misunderstood Shark", "description": "Every beachgoer knows that there's nothing more terrifying than a... SHARRRK! But this shark is just misunderstood, or is he? In a wholly original, side-splittingly funny story, New York Times bestselling author Ame Dyckman and illustrator Scott Magoon take this perennial theme and turn it on its (hammer)head with a brand-new cheeky character. The filming of an underwater TV show goes awry when the crew gets interrupted by a... SHARRRK! Poor Shark, he wasn't trying to scare them, he's just misunderstood! Then he's accused of trying to eat a fish. Will Shark ever catch a break? After all, he wasn't going to eat the fish, he was just showing it his new tooth! Or was he? Explosively funny, extraordinarily clever, and even full of fun shark facts, this surprisingly endearing story gets to the heart of what it feels like to be misunderstood by the people around you. With a surprise twist ending, our Misunderstood Shark will have kids rolling with laughter!"}, {"id": "1482451417", "genre": "Children's Books", "title": "Myths and Legends (100 Facts You Should Know)", "description": "Myths and legends reveal much about a culture, including its most prized values and significant beliefs. Fables may feature animal characters, but they offer morals for real life. This fascinating book is bursting with 100 facts about the stories that have been handed down by different cultures around the world as well as accompanying images, quizzes, and activities, including crafts. Not only is each bite-sized topic interesting in itself, but readers will find connections to modern life, such as the origin of Valentines Day. These myths and legends offer unique opportunities for a truly entertaining and educational reading experience."}, {"id": "1481435779", "genre": "Children's Books", "title": "The Foolish Tortoise (The World of Eric Carle)", "description": "The timeless tale of The Foolish Tortoise, illustrated by Eric Carle, is now available in a Level 2 Ready-to-Read edition!The foolish tortoise is tired of being so slow. He decides that the easiest way for him to move faster is to get out of his heavy shell. The only problem is, once he leaves his home, he’s too scared to walk anywhere! This silly tortoise learns the hard way that there’s no place like home.Children will enjoy this jubilant tale of a tortoise on a journey of self-discovery! Now available as a Level 2 Ready-to-Read, this charming story with rhyming text is perfect for young readers!"}, {"id": "B01JAEGHG2", "genre": "Children's Books", "title": "International Space Station (You Choose: Space)", "description": "This book explores various perspectives surrounding the International Space Station and the men and women who work onboard. Readers are immersed in the action as their choices guide the narrative."}, {"id": "1981320849", "genre": "Children's Books", "title": "Box Turtle: Amazing Fun Facts and Pictures about Box Turtle for Kids", "description": "Box Turtle: Amazing Fun Facts and Pictures about Box Turtle for Kids"}]