[{"id": "0979988578", "genre": "Children's Books", "title": "Quickly: The Magic Spatula", "description": "Jeryl Abelmann and Miriam Kronish bring the enchanting story of Quickly: The Magic Spatula to life. This warm childhood memory describes a touching family story. Quickly is discovered in the upstairs attic in an old dusty box. This seemingly magical spatula brings the warmth of Mommy's kitchen to life. What is the real secret of Mommy's Sunday morning pancakes? How did Quickly get its name? A story for children of all ages, Quickly will bring a smile to your lips and a tug at your heart. This universal story celebrates those heartfelt family moments that become treasured with time."}, {"id": "B00S4A6S72", "genre": "Children's Books", "title": "The Fox and the Grapes : Children's Picture Book English-Urdu (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week."}, {"id": "1499436351", "genre": "Children's Books", "title": "Exploring the Outer Planets (Spectacular Space Science)", "description": "Introduces early beliefs about the planets Jupiter and Saturn, the discovery of Uranus and Neptune, and how scientists have learned more about the atmosphere, surface, features, and moons of these planets."}, {"id": "0060238011", "genre": "Children's Books", "title": "Snowshoe Thompson (An I Can Read Book)", "description": "One winter John Thompson skis across the Sierra Nevada Mountains and creates a path upon which mail and people may travel, thus earning his nickname \"Snowshoe Thompson\""}, {"id": "B00XLZVXZ2", "genre": "Children's Books", "title": "Age of Power (2 Book Series)", "description": "From Book 1: Book 1 in the Age of Power Series:  Vaughn Hagen’s life was just beginning. About to graduate high school, his life beckons to him with college, parties, and girls.  Until the asteroid.  As the asteroid, called Yama, nears Earth, it forces Vaughn to confront the very real fact that everything will end in his life. His family and friends will die. And by the end, he knows that nothing can stop the coming of Yama.  Until the Avatar flies.  His name is Alex Shaw, a friend of Vaughn Hagen. Along with the rest of humanity, Vaughn sees Alex fly into the sky. But while the world is saved, as Alex destroys the asteroid, something deep within Vaughn has changed.  And he is not alone.  For Alex has left a legacy. The legacy of a new age.  The Age Of Power.  And now on Amazon, the further adventures of Vaughn Hagen. Rodina: Book 2 in the Age of Power. "}]