[{"id": "B075JHFT97", "genre": "Science Fiction & Fantasy", "title": "The Crossing", "description": "In this thrilling dystopian novel from the New York Times bestselling author of The Returned, the world is at war and two siblings are forced on the run, challenged to do whatever it takes to save themselves—and each other Twins Virginia and Tommy Matthews have been on their own since they were orphaned at the age of five, surviving a merciless foster care system by relying on each other. Twelve years later, the world begins to collapse around them as a deadly contagion steadily wipes out entire populations and a devastating world war rages on. When Tommy is drafted for the war, the twins are faced with a choice: stay and accept their fate of almost certain death, or run. Virginia and Tommy flee into the dark night.Armed with only a pistol and their fierce will to survive, the twins set forth in search of a new beginning. Encountering a colorful cast of characters along the way, Tommy and Virginia must navigate the dangers and wonders of this changed world as they try to outrun the demons of their past.With deft imagination and breathless prose, The Crossing is a riveting tale of loyalty, sacrifice and the burdens we carry with us into the darkness of the unknown."}, {"id": "1556345275", "genre": "Science Fiction & Fantasy", "title": "GURPS Lensman", "description": "Based on the Classic Novels by E.E. \"Doc\" Smith  The Galactic Patrol is the army and police force of the Civilization that fills two galaxies. Its prime agents are the Lensmen . . . incorruptible, powerfully psionic, ready for anything. They stand between Civilization and the ancient evil of Eddore. The Eddorians infiltrate with drugs, crime and corruption. The Lensmen fight back with everything from blasters to space fleets.  Players take the part of Lensmen, ultra-tech warriors for good from many alien races. Major characters, important planets, weapons, and the Lens itself are described for player and GM use. The \"Space Opera Combat System\" lets referees quickly moderate space battles to determine who won and what happened to the major characters."}, {"id": "1536990922", "genre": "Science Fiction & Fantasy", "title": "1: Slayer (Volume 1)", "description": "Derek Moffat just wants the good life. What he has is a crack whore of a wife, a single wide trailer, and no future. Until his brother offers him an opportunity for easy money as an employee of Lilith Corporation delivering pharmaceuticals. The company is clearly a front for a drug cartel, but Derek doesn't care. This is his chance, and he's not about to let it pass him by. But Lilith Corporation is more than a drug cartel. Founded by Satan, managed by demons, souls are traded as easily as highs. Turns out Derek is no ordinary worker. Crossed by his bosses, his chances of making employee of the month go straight out the window along with his humanity."}, {"id": "B0763ZHB49", "genre": "Science Fiction & Fantasy", "title": "The Death and Life of Dominick Davidner: A Middle Falls Time Travel Novel", "description": "Dominick Davidner was a forty year old high school teacher who risked his life to save a student. When that gamble failed, he opened his eyes to find himself back in his childhood bedroom and body, all of his memories intact. All he can think about is Emily, the love of his life, his wife he left behind when he died. Unfortunately, she is now an eight year old girl, living thousands of miles away. How can a middle-aged man in a child's body find his way back to the woman he loves, and what could he say if he finds her?"}, {"id": "0553582445", "genre": "Science Fiction & Fantasy", "title": "Fool's Errand (Tawny Man #1)", "description": "For fifteen years FitzChivalry Farseer has lived in self-imposed exile, assumed to be dead by almost all who once cared about him. But now, into his isolated life, visitors begin to arrive: Fitz’s mentor from his assassin days; a hedge-witch who foresees the return of a long-lost love; and the Fool, the former White Prophet, who beckons Fitz to fulfill his destiny.   Then comes the summons he cannot ignore. Prince Dutiful, the young heir to the Farseer throne, has vanished. Fitz, possessed of magical skills both royal and profane, is the only one who can retrieve him in time for his betrothal ceremony, thus sparing the Six Duchies profound political embarrassment . . . or worse. But even Fitz does not suspect the web of treachery that awaits him—or how his loyalties will be tested to the breaking point.   Praise for Robin Hobb and Fool’s Errand   “Fantasy as it ought to be written . . . Robin Hobb’s books are diamonds in a sea of zircons.”—George R. R. Martin    “[Robin] Hobb has created a world brimming with detail and complexity [and] once again proves herself a full master of the epic fantasy.”—Tulsa World   “Splendid . . . Despite some truly wrenching twists, there is a welcome sense of new beginnings.”—Locus"}]