[{"id": "0787664839", "genre": "Children's Books", "title": "5: Outlaws, Mobsters & Crooks", "description": "Presents the lives of seventy-five North American criminals including the nature of their crimes, their motivations, and information relating to the law officers who challenged them."}, {"id": "B00VS3KNZK", "genre": "Children's Books", "title": "Glome's Valley", "description": "When Ethan and his dad go to Heavener, Oklahoma to read an ancient runestone, he is sure he’s going to be bored all summer. But Ethan quickly makes new friends—so what if they're ghosts? What began as a trip to Dullville suddenly becomes a fantastic adventure. There are other creatures living in the valleys near the runestone—energetic fairies, beautiful wood nymphs, and smelly old trolls.  Ethan stumbles into the midst of an ancient war, and the only person that can save him is his archaeologist dad—with a little help from Thor and the phone app that summons him."}, {"id": "0983274037", "genre": "Children's Books", "title": "Strangers in the Stable", "description": "The narrator wonders, \"Hundreds of tents are pitched in that field nearby. Why would anyone go camping on a winter day such as this?\" So begins a night she and her stable mates would never forget. The words created by Jim Laughter and the illustrations that bring his words to life will be a book readers will not easily forget."}, {"id": "0531147576", "genre": "Children's Books", "title": "Faith Ringgold (Getting to Know the World's Greatest Artists)", "description": "Presents a brief biography of the African-American artist who created the painted story quilt, an art form that combines rich oral history with colorful paintings on quilted fabric and canvas."}, {"id": "151241624X", "genre": "Children's Books", "title": "Elmer and the Race (Elmer Books)", "description": "The young elephants want to have a race to prove who is fastest, so Elmer and Wilbur organize a course. With each racer decorated a different color, they set off around the course and discover things about themselvesBlue is first, Orange is second, White is kind, Pink and Violet are funny, and Yellow is a cheat. Luckily Yellow also learns he is very good at saying sorry, so each young elephant gets a medal from Elmer."}]