[{"id": "1402292473", "genre": "Children's Books", "title": "Monster Machines! On the Farm", "description": "Any visit to the farm wouldn't be complete without visiting the machines that help keep it running! Children will be fascinated by cultivators, apple pickers and other farm machines, including:  • plows  • mowers • corn pickers ...and more!"}, {"id": "178255100X", "genre": "Children's Books", "title": "Pass! No Puppy Guarding iPlaySoccer)", "description": "Bailee Kate and her dog Thor love to play soccer, but Thor always gets in the way. Coach says the team shouldn't act like Thor because it is puppy guarding. See if they have learned as they take on the fierce Yellow Dragons. This fully illustrated book is intended to help youth soccer players break the bee-swarming kick and pack-chase mentality as children begin to comprehend spacial relationships to one another on the field of play. iPlaySoccer! Books are instructional stories focused on advancing youth player development. The illustrated children's books teach foundational concepts and vocabulary in a fun way that allows children, parents and coaches to develop together in the beautiful game. The series is not intended to replace the instruction of a coach or the learning derived from actual play. Rather, the purpose of these books is to assist the player in mastering concepts as the game becomes more complex. To that end, no matter the level of play, the coach is the teacher, the player is the student, and this series is merely the provider of fun educational tools designed to reinforce what should be learned on the training ground."}, {"id": "B00RY7WDZ2", "genre": "Children's Books", "title": "The Fox and the Grapes De vos en de druiven : Children's Picture Book English-Dutch (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week.De vos is hongerig en ogen lekkere druiven. De vos probeert opnieuw en opnieuw aan de druiven in deze krijgenuitgebreide versie van de vos en de druiven met de vos doet interessante dingente proberen en krijgen de druiven. Leert dagen van de week."}, {"id": "1523501359", "genre": "Children's Books", "title": "Sticky Facts: Construction", "description": "A totally new idea in sticker books, combining the joy of learning with the joy of stickers. It’s an innovative, kid-friendly approach to beloved topics for ages 6 and up, featuring a cutting-edge sticker sheet design that allows for text and color images to appear underneath the sticker. Here’s how it works: Read a question, then peel off the corresponding sticker to reveal the answer underneath. The fun doesn’t stop there—place the sticker on the facing activity page to create a book of facts and images that can be enjoyed again and again. Once all the stickers are peeled, kids are left with a beautifully designed, information-rich book full of diagrams, facts, and personalized pages to read again and again.Sticky Facts: Construction features dozens of stickers of sky-high cranes and earth-scraping excavators, monster trucks, and clattering power tools. It shows how to create a construction site—and lets kids learn all about the special tools and vehicles we use to build.  "}, {"id": "1416991255", "genre": "Children's Books", "title": "Click, Clack, 123 (A Click, Clack Book)", "description": "Join Doreen Cronin and Betsy Lewin's hilarious farmyard animals as they help readers count from 1 to 10. From \"1 farmer sleeping\" to \"10 fish ready to go,\" children are sure to enjoy counting like never before. Clever text and hilarious scenes have never made counting so much fun! This 6 x 6 board book is based on Click, Clack, Splish, Splash but has a refreshed concept-driven cover and is ideal for little hands."}]