[{"id": "083688843X", "genre": "Children's Books", "title": "Why Do We Have Laws? (Know Your Government)", "description": "Introduces the concept of law in the United States, discussing why laws are needed, how they are created, changed, and enforced, and what happens to people who are accused of breaking the law."}, {"id": "1584156015", "genre": "Children's Books", "title": "Abby Wambach (Robbie Readers) (Robbie Readers No Hands Allowed)", "description": "Few soccer fields have seen a player as fearless as Abby Wambach. From the time she fought to keep up with her older brothers and sisters to today, as she fights to make a goal, she has been unstoppable. She gets knocked down, run over, and injured but just keeps going. Even a gash requiring 11 stitches couldn t keep her off the field during the 2007 Women s World Cup. As tough as she is, Wambach is also a terrific teammate and a lot of fun to share the field with. Find out what makes this player so special starting with her first fearless step onto a diving board."}, {"id": "B00MK391R8", "genre": "Children's Books", "title": "The Runaway Rice Cake", "description": "It's the Chinese New Year, and the Chang Family has only enough rice flour to make one nián-gão, a special New Year's rice cake, for the entire family to eat. But this delicious little nián-gão has other ideas. \"Ai yo! I don't think so!\" it cries, coming to life and escaping.  Ming, Cong, little Da and their parents chase the nián-gão all over the village until it runs into a hungry, old woman and sends her tumbling to the ground. Though Da is a small boy, his heart is big enough to share the treat with her, even though that leaves Da's family with nothing to eat for their own celebration. But the Changs' generosity doesn't go unnoticed. When they return home, they find the Kitchen God has left a wonderful surprise for them.  Ying Chang Compestine's heartwarming story conveys an important and poignant message about sharing and compassion. Tungwai Chau's soft and evocative illustrations complete this tender holiday story."}, {"id": "078763901X", "genre": "Children's Books", "title": "World War II Reference Library", "description": "The \"World War II Reference Library\" includes three important sources of information about World War II. The \"World War II: Almanac\" provides students with the information they need to write reports and complete class assignments. \"World War II: Biographies\" profiles more than 30 men and women involved in the war and features 65 photographs and illustrations. \"World War II: Primary Sources\" allows students to study 16 speeches, diary entries, newspaper accounts and other original source documents related to the period. Also included are sidebars, glossary, timeline, sources for further study and indexes.For table of contents, sample pages or other volume specific information see the entry for the \"Almanac, Biographies\" or\" Primary Sources.\""}, {"id": "0064402754", "genre": "Children's Books", "title": "The Best Christmas Pageant Ever", "description": "Laughs abound in this bestselling Christmas classic by Barbara Robinson! The Best Christmas Pageant Ever follows the outrageous shenanigans of the Herdman siblings, or “the worst kids in the history of the world.” The siblings take over the annual Christmas pageant in a hilarious yet heartwarming tale involving the Three Wise Men, a ham, scared shepherds, and six rowdy kids. Ralph, Imogene, Leroy, Claude, Ollie, and Gladys Herdman are an awful bunch. They set fire to Fred Shoemaker’s toolshed, blackmailed Wanda Pierce to get her charm bracelet, and smacked Alice Wendelken across the head. And that’s just the start! When the Herdmans show up at church for the free snacks and suddenly take over the Christmas pageant, the other kids are shocked. It’s obvious that they’re up to no good. But Christmas magic is all around and the Herdmans, who have never heard the Christmas story before, start to reimagine it in their own way.This year’s pageant is definitely like no other, but maybe that’s exactly what makes it so special."}]