[{"id": "1981280022", "genre": "Children's Books", "title": "Children's Book: An Amazing Animal Picture Book about White Lion for Kids", "description": "Children's Book: An Amazing Animal Picture Book about White Lion for Kids"}, {"id": "1404237089", "genre": "Children's Books", "title": "Id-Ul-Fitr (We Love Holidays)", "description": "Give your learners insight into the culture and the traditions of Id-ul-fitr in an engaging format. The key symbols, foods, dress, and religious practices of this lovely holiday are discussed, as well as its historical and contemporary celebrations."}, {"id": "0142406864", "genre": "Children's Books", "title": "Santa's Stuck", "description": "This playful picture book answers the age-old question: Just how does Santa shimmy up and down chimneys? Not very easily sometimes! When the rotund fellow with a sweet tooth overdoes it on the snacks, he gets stuck inside a chimney. The reindeer on the roof try pulling him out, to no avail. A dog, a cat, and some kittens try pushing from below, with no luck. It takes a tiny, ingenious mouse to come up with the way to POP! Santa out so that Christmas can go on. Good show—ho, ho, ho!"}, {"id": "006445097X", "genre": "Children's Books", "title": "Switch On, Switch Off (Let's-Read-and-Find-Out Science 2)", "description": "The switch goes up -- the light goes on,The switch goes down -- the light goes off.It seems like magic! It's not -- it's electricity. But how does a light actually work? In this clear and simple book learn all about electricity, how it's produced, and how it can be used. At the end you'll learn how to conduct fun experiments that will let you generate electricity yourself!"}, {"id": "B00CF5PLQQ", "genre": "Children's Books", "title": "Lyle, Lyle, Crocodile Storybook Treasury (Lyle the Crocodile)", "description": " Every home should have a crocodile! Splish, splash. Fifty years ago the Primms moved into the house on East 88th street and found a crocodile soaking in the bathtub. Since then, Lyle has won the hearts of all he meets. This anniversary collection features an introduction by Bernard Waber, Lyle’s creator, an MP3 download of Mr.Waber reading Lyle, Lyle, Crocodile, and four complete books: The House on East 88th Street Lyle, Lyle, Crocodile Lyle and the Birthday Party Lyle Walks the Dogs"}]