[{"id": "1499437528", "genre": "Children's Books", "title": "The Totally Gross History of Ancient Egypt", "description": "Mummies—dead bodies elaborately wrapped up—might rank pretty high on the scale of all things disgusting. But readers should be ready for an eye-opening read on some of ancient Egypt’s gross history, such as the dirty details of what really happens to bodies as they’re prepared for mummification, in this book. This gleefully gut-churning volume offers up some very vile medicinal practices, culinary delicacies, political and battle practices, and more. Readers will come away from this memorable read with a fresh perspective on the lives and customs of this famous (and now famously gross) ancient civilization."}, {"id": "076603402X", "genre": "Children's Books", "title": "Adam Sandler: Celebrity With Heart (Celebrities With Heart)", "description": "Adam Sandler is one of the biggest comedy film stars in the world today. He starred in many box-office smashes, from THE WATERBOY, to THE WEDDING SINGER, to FUNNY PEOPLE. What many do not know, however, is how much time and money Sandler has generously devoted to charitable causes, including charities that help fight autism, research treatments for spinal cord injuries, and give aid to those suffering in the war-torn region of Darfur in Africa."}, {"id": "1416928103", "genre": "Children's Books", "title": "The Hoboken Chicken Emergency", "description": "SOMETHING'S FOWL IN HOBOKEN.   When Arthur Bobowicz is sent out to bring home the family's Thanksgiving turkey, he returns instead with Henrietta -- a 266 pound chicken with a mind of her own. Feathers fly when this colossal clucker descends upon Hoboken, New Jersey. Thus begins the hilarious hen-tastic tall tale that has kept readers in stitches since Henrietta first pecked her way onto the scene in 1977.   Revised with brand new illustrations by Pulitzer Prize winner Tony Auth, this new edition of The Hoboken Chicken Emergency will have readers crowing so hard with laughter, they may just lay an egg!"}, {"id": "1438215142", "genre": "Children's Books", "title": "Jameelah Gets Dressed (Mini Mu'min Du'a Series)", "description": "Mini Mu'min Du'a Series #8(Supplications and manners related to dressing)  Jameelah loves to pick out clothes! She digs through her closet, drawers, and shelves putting together a very \"unique\" outfit. Along the way your child will learn the supplications for getting dressed, when you wear something new, when someone else is wearing something new, and undressing.Series Overview: The Mini Mu'min Du'a Series is a collection of 17 colorful storybooks that help your child learn over 40 essential Islamic supplications and how they fit into their everyday lives. Using easy to understand language and charming rhymes, this series is perfect for read aloud story time! Series Supplement: Don't forget to take a look at our Mini Mu'min Du'a Series: Coloring Workbook (260+ pages), available here on Amazon, to help your child review and reinforce information learned in the storybooks- plus hours of coloring fun!"}, {"id": "B00KFVQNDW", "genre": "Children's Books", "title": "The Pink Princess & The Friendship Picnic (Princess Avril Book 1)", "description": "Princess Avril is a kind, caring, fun and friendly princess who goes on wonderful adventures that often teach important life lessons. In this first book of the Princess Avril series, the pink princess learns that kindness is the simplest way to make unexpected new friends. This book is geared for children ages 2 to first grade."}]