[{"id": "1338032224", "genre": "Children's Books", "title": "When I Grow Up: Misty Copeland (Scholastic Reader, Level 3)", "description": "Misty Copeland is one of the most famous dancers in the world. But before she was dancing for millions of fans, Misty was just a young girl who loved ballet, even though she didn't look like the typical ballerina. Learn how she made it all the way to the top in this exciting level 3 biography!"}, {"id": "B01D7GDW5S", "genre": "Children's Books", "title": "All The Engines: The Complete Collection (The Engine Series Book 7)", "description": "Meet all the engines, characters big and small, in this collection of all six stories from The Engine Series.Puff along with engines: Little Titch, Gideon, Toc Toc, Rust Bucket, Sally Steamy and not forgetting, Minnie Millie the engine lookerafterer."}, {"id": "0803718985", "genre": "Children's Books", "title": "The Legend of the Windigo: A Tale from Native North America", "description": "Although the Windigo is said to be a horrid monster that walks the earth, is made of stone, stands taller than the trees, and is a ferocious cannibal, the fearful villagers decide not to run away but instead bravely choose to stand their ground."}, {"id": "B073QS76HB", "genre": "Children's Books", "title": "The Show Tails of Buster the Corgi", "description": "This is the second instalment of the Buster the Corgi series.  Buster is a Corgi who likes to tell tales, or in his case tails, of his life to his four legged friends. This book covers his adventures in the show ring leading all the way to Crufts, including having to overcome the dirty tricks used by other dogs to try to put him off his game.  Does he succeed?  Did he actually ever go to Crufts and do the things he claims or is he just a good storyteller?  Who knows, who cares, his doggie friends still love his stories!!Look out for more long tails coming soon!!"}, {"id": "0613084705", "genre": "Children's Books", "title": "Of Two Minds (Point Fantasy)", "description": "\"Changing the world was impossible. Creating another one was worse. And escape was out. She was trapped.\" A collaboration between acclaimed writers Carol Matas and Perry Nodelman, this roller coaster of an adventure is filled with twists and turns, excitement and fun. It is an extraordinary creative fantasy about empowerment that compels readers not to take everything at face value. \"A spellbinding fantasy...proof positive that two heads are better than one.\" -SLJ Best Books of the Year. \"Strong...a solid fantasy about thinking for oneself, thinking other people's thoughts, and the power of the imagination.\" -Kirkus Reviews. \"Original, unpredictable...a kaleidoscope of character, cultures, and events that offers both entertainment and enrichment.\" -School Library Journal, starred review."}]