[{"id": "1532140894", "genre": "Children's Books", "title": "Misfit Mechs 6 (Guardians of the Galaxy: Rocket Raccoon)", "description": "When the Intergalactic Council of Justice orders Rocket to pay back the money he stole from his ex-girlfriends, he takes on a series of jobs and including helping a mech robot find its kidnapped friends. Aligned to Common Core Standards and correlated to state standards. Spotlight is a division of ABDO."}, {"id": "B00DZ71BJE", "genre": "Children's Books", "title": "Antique Cars! Basic Learning About Antique Cars - Basic Learner Series! (Over 46+ Photos of Antique and Old Cars)", "description": "Antique Cars? Yep, Kid's love old cars and so do you!*** Surprise Added Bonus: Get An Online & Offline Puzzle Kit Inside The Book ****** Your Kids Can Make 3 of Their Own Puzzles FREE ****** Your Kids Can Also Play 3 FREE Online Puzzles From The Book ****** Links Only Valid For People That Purchase The Book ***Here is What Is Inside \"Basic Learning About Antique Cars - Basic Learner Series!\"...Antique CarsAntique Car PicturesAntique Car FactsOld Cars DrivingOld Cars RacingAnd Lots More!Buy the book \"Basic Learning About Antique Cars - Basic Learner Series!\" Right Now!"}, {"id": "1442444169", "genre": "Children's Books", "title": "The New Olympians (Pegasus)", "description": "Emily and her companions, including the winged horse, Pegasus, must confront a legion of Olympic enemies in this third book of an action-packed series.When Emily’s father and the goddess Diana return from a visit to Earth, they bring with them disturbing news. There’s a horse called Tornado Warning that’s winning all the races, with times faster than anyone’s ever seen. What could this mean? Emily, Joel, Paelen, Pegasus, and the sphinx Alexis return to Earth to investigate—and discover a CRU plot to clone Olympians and Nirads using DNA retrieved from their previous time in the human realm. The CRU has already created dozens of Nirad warriors, Dianas, Paelens, Cupids, and Pegasuses. Now they want to create their own Emily clone—even if the original is killed in the process. Can Emily and her friends put a stop to the CRU’s plans before Jupiter finds out and carries through on his own threat to destroy the Earth?"}, {"id": "0763646733", "genre": "Children's Books", "title": "Where Is Maisy?: A Maisy Lift-the-Flap Book", "description": "Her favorite hunt-and-find adventures are now reissued with a bold new design. (Ages 2-5)Maisy mavens will love to look for her in WHERE IS MAISY?, a happy lift-the-flap board book adventure from award-winning author-illustrator Lucy Cousins."}, {"id": "0789488841", "genre": "Children's Books", "title": "The Life of Jesus,", "description": "Complete with Biblical quotes, offers twenty-six stories about the life of Jesus, from His miraculous birth in Bethlehem through His later years as a wandering preacher who spread His message of forgiveness and healed the sick. 10,000 first printing."}]