[{"id": "B00P54ZNDK", "genre": "Children's Books", "title": "Aaron Loves Apples and Pumpkins (Step into Reading)", "description": "It’s autumn in this Step 1 Step into Reading early reader by P. D. Eastman, author of Go, Dog. Go! and Are You My Mother? As Aaron the Alligator’s thoughts turn to apples, pumpkins, football, and . . . ghosts, his usual mishaps occur while playing outdoors with his friends. Young readers will giggle along as they tackle the simple words and sentences all on their own. Aaron the Alligator is also a star of The Cat in the Hat Beginner Book Dictionary and a long out-of-print series called Everything Happens to Aaron, the basis for this book. Look for more of Aaron’s Step into Reading escapades: Aaron Is a Good Sport, Aaron Has a Lazy Day, and Aaron Is Cool.   Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story."}, {"id": "B00MPE5CAW", "genre": "Children's Books", "title": "Childrens Book : Fun facts about Egypt: (Ancient Egypt for kids) (Ages 4 - 12) (egypt picture book, pyramids for kids, mummies for kids, hieroglyphs for ... books for kids, egypt history for kids)", "description": "Ancient civilizations for kids (Introduction to ancient Egypt with pictures)This is an amazing and fascinating picture book for your kids. It takes you on an introductory journey of ancient Egyptian civilization. Its easy to comprehend and has lots of fun facts coupled with bright and colourful pictures about the culture and society of ancient Egypt. It is really quick and easy to download this book, and it can be read on an iPad, Kindle, Tablet or other mobile device supporting Kindle books.Scroll to the top and select the \"BUY\" button for instant download.Happy reading!"}, {"id": "1618628534", "genre": "Children's Books", "title": "I Wish I Had a Twin Brother", "description": "Have you ever wondered what it would be like to have a twin brother? What would you do with your twin? Would you ride a bicycle built for two? Would you switch places at school?"}, {"id": "1681853167", "genre": "Children's Books", "title": "Fire Truck Coloring Book", "description": "Where's the fire at? This firetruck-inspired coloring book will bring out the hero in your child! Coloring opens your child's limitless imagination! It is an activity widely recognized to stimulate creativity that would show off your child's ability to complement colors and absorb new techniques quite fast. Grab a copy of this coloring book today!"}, {"id": "1632694719", "genre": "Children's Books", "title": "Play on Word: Bible Playtime Activities for Young Children", "description": "Your young children are ready for the next step in their faith walk. Preschoolers and toddlers learn best through play and we all learn best by experiencing things for ourselves. Why just read Bible stories to your children when you can play Bible stories with your children? This parent/child devotional allows you to experience God's Word together through play. Play on Word contains 52 fun and simple lessons that equip parents to play Bible stories with their children. Each lesson includes thoughtful notes of purpose, short lists of common household materials, and scripts that can be read aloud during this family devotional time. "}]