[{"id": "B00LA9ZDH0", "genre": "Children's Books", "title": "101 Amazing Facts about Queen Victoria", "description": "Did you know that Queen Victoria could speak five different languages? Or that her closest childhood friend was a King Charles spaniel by the name of Dash? What did she ask staff to do instead of knocking on her door? And how did she deliberately annoy Prime Minister William Gladstone? All of these facts and more can be found in this fantastic guide to the long-reigning monarch and Empress of India. This book is perfect for those studying Queen Victoria at school, or even for those who are just interested in learning more about one of history’s most fascinating figures."}, {"id": "B00OA5ALNC", "genre": "Children's Books", "title": "The Shaman's Secret (Kalika Magic Book 2)", "description": "An ancient magic. A broken land. A journey beyond this world.An epic adventure for kids aged 9 and up.At Okowa, when the veil between the worlds is thin, Kai and Indie must leave the Kalika Forest to find their missing father and save their dying land. As the Emperor of Moto gathers his great army and the Dasa warriors prepare for battle, the children search for the shaman who will help them on the journey.But the magic of the mountains is different to the magic of the forest. The only way Kai and Indie can succeed is if they make the perilous journey to the spirit realm to find their power animals. The medicine wheel is turning, their father is calling … but can they trust the shaman? And will they discover the secret of the mountains, before it’s too late?"}, {"id": "1884834302", "genre": "Children's Books", "title": "Those Icky Sticky Smelly Cavity-Causing but . . .: Esos sucios pegajosos olorosos causantes de caries pero . . . invisibles gérmenes (Spanish Edition)", "description": "The bad-breath germ and the plaque-painting germ join others to help children remember to brush their teeth. Lively, colorful illustrations show the germs that cause cavities and how important tooth brushing is to good dental health. Includes health information."}, {"id": "0836854691", "genre": "Children's Books", "title": "100 Artists Who Changed the World (People Who Changed the World)", "description": "Brief biographies of 100 artists, from ancient Greece to the present day, who played significant roles in the development of sculpture, painting, and photography."}, {"id": "1780973225", "genre": "Children's Books", "title": "Futureworld", "description": "Where will we be in 2025? This fascinating book reveals the technology that's in prototype today, and will be commonplace tomorrow. Whether it's flying cars, space tourism, nanobots or airships, every page reveals an exciting and totally real vision of a future that is almost within our grasp."}]