[{"id": "B0739X4BJ5", "genre": "Children's Books", "title": "Ecosystem Facts That You Should Know - The Fresh and Saltwater Edition - Nature Picture Books | Children's Nature Books", "description": "What goes on in the watery worlds of fresh and saltwater? This exciting book of nature will give you some clues. Your child will be learning some cool facts about the fresh and saltwater ecosystems in this pretty picture book. Learning with visuals will help boost the rate of information absorption. So what are you waiting for? Secure a copy today!"}, {"id": "0613575636", "genre": "Children's Books", "title": "Valentine for Tommy (Rugrats: Ready-To-Read)", "description": "Level 1: Starting to Read  - Simple stories - Increased vocabulary - Longer sentences  Tommy has a very special valentine -- it's Harry the Hippo! Join the babies as they try to spring Harry from a store window display in this heartwarming Valentine's Day adventure."}, {"id": "0448480115", "genre": "Children's Books", "title": "Angelina and the Easter Bonnet (Angelina Ballerina)", "description": "Angelina Ballerina is back in the classic look! In this original 8x8 with a sheet of themed stickers for only $4.99, Angelina and her friends celebrate Easter by making beautiful bonnets to wear in the Chipping Cheddar Easter parade! "}, {"id": "1422232778", "genre": "Children's Books", "title": "Classic Bikes (Classic Cars and Bikes Collection)", "description": "Many of the bikes featured in this book are classics from the heyday of motorbike manufacturing. Sadly a number of these famous names such as Ariel, BSA, and Velocette are consigned to the history books and the bikes themselves have become more and more of a collectors item. Many credit the demise of the British motorbike industry to the invasion of the Japanese manufacturers (Kawasaki, Suzuki, Honda and Yamaha) in the 1970s that changed the face of motorcycling in Britain as they established themselves as a global phenomenon but brands such as Royal Enfield, Norton and Triumph have survived into the 21st Century and now proudly cruise the countrys roads alongside the likes of Harley-Davidson and BMW."}, {"id": "0766041042", "genre": "Children's Books", "title": "Jesse Owens: Legendary Track Star (Famous African Americans)", "description": "\"I always loved running,\" said Jesse Owens, who as a boy could outrun all his playmates. When he competed in the Summer Olympics in Berlin, Germany, people used words like \"express\" and \"comet\" to describe him. Owens won an amazing four Olympic gold medals in track and field events—and demonstrated to the world that Nazi leader Adolf Hitler's theory of racial inferiority was wrong. An athlete, humanitarian, speaker, and author, Owens dedicated his later years to helping the youth of America reach for greatness."}]