[{"id": "1564557596", "genre": "Children's Books", "title": "The Third Ear: A Storytelling Kit A Celebration of Teaching Stories and Songs from the First People Native American Storytelling", "description": "Can you guess what your third ear is? Listen to these stories and find out! Johnny Moses brings you a world filled with people of all kinds - from Coyote, the Boogie Woman, and Poop People - to unexpected heroes like the Stupid, Lazy Girl. He also shares stories from his childhood growing up among the First People of the Pacific Northwest. These irresistibly playful stories come to life with a wide range of character voices, songs, and several Native languages."}, {"id": "0070595984", "genre": "Children's Books", "title": "Just Plane Smart! Activities for Kids in the Air and on the Ground", "description": "parents dreading the fidgeting and whining that usually accompany family airplane travel will welcome this unique new collection of at-the-seat activities. From designing your own airport to finding your way in the sky. . .from crossing time zones to understanding jet lag. . .from who's in the cockpit to what's in the black box. . .Just Plane Smart! is packed with fascinating facts, funny cartoons and riddles, brain-teasing puzzles, and high-flying things to do. Lap-sized, lighthearted, humorously illustrated, this fun-filled travel companion will stretch kids' imaginations, satisfy their curiosity, and keep them occupied--at 30,000 feet or at home on the ground."}, {"id": "1474747906", "genre": "Children's Books", "title": "Extreme Snow and Ice Sports (Edge Books: Sports to the Extreme)", "description": "Extreme snow and ice sports such as snowboarding, skiing, ice climbing, snowmobiling, and sledding can put you on the edge of your seat. Slide in and explore the world from the view of an extreme athlete."}, {"id": "0451473779", "genre": "Children's Books", "title": "Look! What Do You See?: An Art Puzzle Book of American and Chinese Songs", "description": "A puzzle, a work of art, and a collection of classic American songs, all in an innovative book by one of the world's foremost contemporary artists.Every page of this book is filled with secret code. It seems like Chinese calligraphy, but it’s not. It seems like you can’t read it, but you can. Once the pieces of the puzzle start falling into place, you will understand it all. And some of it may even strike you as strangely familiar . . . Twelve traditional American songs, such as \"Take Me Out to the Ball Game\" and \"Yankee Doodle,\" as well as five classic songs from Chinese culture, are written here in artist Xu Bing's unique \"square word calligraphy,\" which uses one-block words made of English letters. From a distance, these pieces are beautiful but unintelligible art. Up close, they are a mystery just waiting to be solved—like the fine art version of \"Magic Eye.\"For readers ages 7 and up, Look! What Do You See? is perfect for long car rides or coded notes to friends. Incredibly intricate and visually engaging, this is a book that children and adults will return to again and again."}, {"id": "B071JMDFQR", "genre": "Children's Books", "title": "Ibiza Ahoy!", "description": "Four friends find themselves on board a sailing yacht at sea while their parents are unavoidably detained onshore. Zoe at 14 struggles to keep up with her best friend, Nicola whose antics have already got the grown ups eyebrows well and truly raised.Thomas and Pedro soon find they have more than they bargained for when they stumble across men who carry guns.All abroad the yacht they escape out to sea only to rescue the mysterious Aissata, who is clinging to a raft.The plot starts in London before moving to the sunny Mediterranean island of Ibiza and then on to the Spanish mainland where nothing is as it seems."}]