[{"id": "0789473658", "genre": "Children's Books", "title": "DK Readers: Jobs People Do -- A Day in a Life of a Firefighter (Level 1: Beginning to Read)", "description": "A Level 1 DK Reader that accurately portrays a day in the life of a real firefighter, perfect for young children who are just learning to read.The fire alarm goes off! Rob Green and the other firefighters go into action. Is there time to save a little girl's dog? Find out in DK Readers: Jobs People Do — A Day in the Life of a Firefighter (Level 1: Beginning to Read).Perfect for 3–5 year-olds learning to read, Level 1 titles contain short, simple sentences with an emphasis on frequently used words. Stunning photographic images with labels provide visual clues to introduce and reinforce vocabulary."}, {"id": "B00QMLW49G", "genre": "Children's Books", "title": "Kwanzaa Klaus: The Night Before Christmas is JUST the beginning...", "description": "A warmhearted family-oriented, multicultural tale about a down-and-out dad who screws up Christmas and tries to make it right -- during the Festival of Kwanzaa."}, {"id": "0684844311", "genre": "Children's Books", "title": "Kaplan Learning Adventures in Science Grades 3 4", "description": "Score Kaplan books are loaded with engaging learning activities to reinforce the skills students need to know in math, science, language arts & more.  This title provides a thorough review of critical science skills for grades 3-4."}, {"id": "0431177813", "genre": "Children's Books", "title": "Hampsters (A Pet's Life)", "description": "This series aims to help children develop an understanding of how to care for pets and the needs of different pets. Each book looks at the needs of common pets at different stages of their life-cycles from babies to old age. They take a chronological approach through the differing requirement so of the pets as they grow. Information is provided on the particular animal and the different types that people keep as pets. The books cover the key requirements including the pet's new home, feeding and cleaning."}, {"id": "1428110054", "genre": "Children's Books", "title": "Froggy Rides a Bike", "description": "Froggy just got his very first bike, and it?s exactly what he wanted. Almost. Finishing touches like a bell and a horn have to be added before Froggy is ready to ride. Then, surrounded by cheering friends, Froggy starts to pedal. Oops! He falls off. He tries again. Oops! Riding a bike is hard! After a long day, and a few bumps and bruises, Froggy finally learns to ride?and once he does, he can?t wait to go again. Froggy Rides a Bike is a reassuring reminder that practice makes perfect?and it?s sure to make kids eager to learn to ride on their own."}]