[{"id": "0778705196", "genre": "Children's Books", "title": "What Are Light Waves? (Light & Sound Waves Close-Up)", "description": "This engaging title introduces readers to the science of light waves. Relatable examples, accessible text, and a creative design challenge help readers discover the properties of light waves and their essential role in seeing our world."}, {"id": "1614791481", "genre": "Children's Books", "title": "Benny and Penny in Just Pretend (TOON Books)", "description": "Benny wants to play pirates without his little sister Penny, so he tries to get rid of her, but when Penny really disappears, Benny is worried."}, {"id": "0739336304", "genre": "Children's Books", "title": "2: The Mercy Watson Collection Volume II: #3: Mercy Watson Fights Crime; #4: Mercy Watson: Princess in Disguise", "description": "Mercy Watson Fights CrimeOne night, Mercy hears a noise. An unlikely thief is robbing the Watsons! But as the thief soon discovers, crime doesn’t pay. Not when there is a very large pig involved.Mercy Watson: Princess in DisguiseIt’s Halloween on Deckawoo Drive, and Mr. and Mrs. Watson have decided on the perfect costume for Mercy. Mercy is encouraged by the promise of treats. For what could be better than a treat-getting adventure? Especially if it happens to involve a chase. . . ."}, {"id": "1416918256", "genre": "Children's Books", "title": "A Pop-Up Book of Nursery Rhymes: A Classic Collectible Pop-Up", "description": "Matthew Reinhart's phenomenal paper engineering, as evidenced in Cinderella and The Jungle Book brings an added dimension -- literally -- to the classic telling of Mother Goose's most treasured nursery rhymes. With six spreads of of pop ups and and mini book, this book is a phenomenal family keepsake to read for years to come.Six spreads with full pop ups on each spread and mini books with pops throughout; book will be shrinkwrapped."}, {"id": "B00X96VQW8", "genre": "Children's Books", "title": "Harry Plotter and The Chamber of Serpents, A Potter Secret Parody", "description": "Austen comes to England knowing as an American he'll stick out at his new school. But when an errant owl lands him at Hogwarts he's in for more than he expected.If it’s not hard enough being the only American at Hogwarts, Austen’s sorted into the most despised of all the houses. Then bumbling around the dungeon while trying to find his common room, he unwittingly helps the monster from the Chamber of Serpents. Will he discover the secret of the Chamber before he becomes another victim of He-Who-Must-Not-Be-Named?Any proceeds from this book will be donated to the The Children's Literacy Initiative, a US based charity."}]