[{"id": "1682973387", "genre": "Children's Books", "title": "Raise the Flag: Terrific flag facts, stories and trivia!", "description": "Packed full of wow-inducing facts and trivia, this book offers much more than the average flag book. Featuring the history of flags, and many different types of flags, it's both a comprehensive guide and an entertaining read. Find out how Lichtenstein and Haiti discovered they shared the exact same flag and which national flag was designed by a 15-year-old schoolgirl.    Each continent has its own atlas-style chapter with the history of significant flags fully explored. Themed sections then introduce the many different types of flags, great moments in flag history (flags at the poles and in space for example) and  how we communicate using flags. There's also a design-your-own flag activity and a fabulous flag quiz at the back of the book.   "}, {"id": "0635014734", "genre": "Children's Books", "title": "Susan B. Anthony: Civil Rights Crusader (4) (1000 Readers)", "description": "Susan B. Anthony was a courageous and smart woman. She never backed down from doing what she believed was right. She spoke out against slavery. She campaigned for women's rights. America owes a lot to this civil rights crusader.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "B001G8WDR8", "genre": "Children's Books", "title": "The Moon Riders", "description": " Myrina has prepared for thirteen years to join the Moon Riders—learning the sacred dances, the art of using a weapon, and listening to her mother and grandmother's tales of their time spent with the Moon-maidens. Finally, the day arrives when she will leave her family and devote herself to the Old Woman, Atisha, and her tribe of fearless young warriors.   No sooner do Myrina and the Riders leave camp when a stowaway is discovered: Cassandra, the troubled young princess of Troy. Myrina is skeptical of Cassandra's \"visions\" of death and destruction in Troy; and yet when her predictions begin to come true, she and the other Moon Riders have no choice but to get involved. The events that unfold as the Trojan War wages on will affect Myrina, Cassandra, and the Moon Riders in unimaginable, unforgettable ways.   Acclaimed British author Theresa Tomlinson expertly brings to life the legend of the Amazons and sets it against a backdrop of one of the most mythic, imagination-inspiring battles in all of history. "}, {"id": "0613293843", "genre": "Children's Books", "title": "William Bradford: Plymouth's Faithful Pilgrim (Turtleback School & Library Binding Edition) (Men of Spirit)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Tells the story of Bradford who established Plymouth colony and was re-elected as its governor more than thirty times"}, {"id": "051624258X", "genre": "Children's Books", "title": "Let's Get Ready for Independence Day (Welcome Books: Celebrations)", "description": "A young girl explains the meaning of Independence Day and describes how she and her family celebrate the Fourth of July."}]