[{"id": "1937013863", "genre": "Science Fiction & Fantasy", "title": "The Sixth Gun Role-Playing Game (Savage Worlds, S2P11100)", "description": "The Sixth Gun comic series a pop interpretation of the supernatural Western by writer Cullen Bunn and artist Brian Hurtt follows the journey of six ancient and mystical weapons with the power to remake all of Creation. Now Pinnacle Entertainment Group, creators of Deadlands, brings the world of The Sixth Gun to your Savage Worlds tabletop roleplaying game!"}, {"id": "B075429Y1S", "genre": "Science Fiction & Fantasy", "title": "Eydis: The Island of the Dragon Bride", "description": "The clouds in front of him began to shade over, their airy inscriptions spelling out a message of welcome—or maybe a warning—as the promise of land became clear. Eydis. As an accomplished Viking warrior, Sterlig Kyvansson always found a way to get what he wanted—until he wanted Arja Freydottir. After Sterlig is denied the right to marry Arja, he is determined to do anything in his power to claim her as his own—even if it means slaying the dragon that guards the cursed island of Eydis. With his brother’s sword at his side and Arja’s hand on the line, Sterlig sets out for Eydis with his friends. When they arrive, they quickly find that the rumors of Eydis are all true, including the irresistible beauty of the Princess of Eydis, Brynja the Bride. With her blessing, Sterlig heads out into battle with the dragon. But near that battle’s end, Sterlig discovers the terrifying secret behind Eydis’ power. Is it already too late, or can his discovery still make a difference?"}, {"id": "B00QQS6PJ0", "genre": "Science Fiction & Fantasy", "title": "A Time to Live (The Legend of Carter Gabel Book 2)", "description": "Carter Gabel had to overcome a lot in the last year, and time travel as a side effect of his “genetic disease” was only the beginning. He’s lost his mother, reunited with his estranged father, crippled a city and destroyed his school. If he thought he could fade into the sunset, Carter has another thing coming. A terrorist group known as Pirates has infiltrated his hometown to overthrow the Program designed to monitor those with potentially harmful abilities. Carter is a teenager, but he’s forced back into the mix as his grandson, David, has been put into a coma. He will have to try and stay out of sight as much as possible and work with new Eventuals along the way in order to stop the Pirates from turning Lincoln Square into a ghost town. "}, {"id": "B0058KRVIG", "genre": "Science Fiction & Fantasy", "title": "The Hour of the Time", "description": "'The Hour of the Time' is a short story by Vincent Hobbes. It was first published in 'The Endlands' (Jan. 2011) Charlie is a man who follows the rules. He is a man who is never late. He is a man who always obeys.This is the most important day of Charlie's life, and he is running late."}, {"id": "B0773XZLG1", "genre": "Science Fiction & Fantasy", "title": "Dragon Kin (9 Book Series)", "description": "From Book 1: It's not always easy being a female warrior with a nickname like Annwyl the Bloody. Men tend to either cower in fear--a lot--or else salute. It's true that Annwyl has a knack for decapitating legions of her ruthless brother's soldiers without pausing for breath. But just once it would be nice to be able to really talk to a man, the way she can talk to Fearghus the Destroyer.Too bad that Fearghus is a dragon, of the large, scaly, and deadly type. With him, Annwyl feels safe--a far cry from the feelings aroused by the hard-bodied, arrogant knight Fearghus has arranged to help train her for battle. With her days spent fighting a man who fills her with fierce, heady desire, and her nights spent in the company of a magical creature who could smite a village just by exhaling, Annwyl is sure life couldn't get any stranger.She's wrong.&#160; .&#160; .And just wait until you meet the rest of the family.&#160; .&#160; ."}]