[{"id": "1588465942", "genre": "Science Fiction & Fantasy", "title": "Werewolf: The Forsaken Character Sheet Pad", "description": "Know Your Tribe   Descended from Luna and Father Wolf, werewolves are the heirs of a mythic and glorious heritage. Or, they would be if not for their grievous ancestral crime against nature itself. How does the shame of being forsaken stain your character's soul - and character sheet?   Make your Mark   Continuing its line of tools for the Storytelling System , White Wolf provides this indispensable collection of pre-printed Werewolf: The Forsaken character sheets. Each pad contains a character sheet for each of the six Tribe and Auspice combinations.."}, {"id": "1505217105", "genre": "Science Fiction & Fantasy", "title": "Alien In a Small Town", "description": "It is the 24th century, and the Mennonites of rural Pennsylvania live much as they always have, while the world around them has changed enormously. Indira left this place years ago to travel the Earth and beyond, but now for personal reasons she has returned. It is here, of all places, that she encounters \"Paul\" (his real name unpronounceable), a lumbering, stone-skinned, yet soulful alien who has now settled on Earth as penance for a crime he committed long ago. This is their story."}, {"id": "B073SLRLFF", "genre": "Science Fiction & Fantasy", "title": "Highland Moon #1: BBW Scottish Werewolf Shifter Romance", "description": "Life is short in the old village where Muira, a young girl blossoming into womanhood, has spent all her days, but her life is about to begin when she begins her new position as servant to Castle Campbell. The old laird and the old castle are cold compared to her home with her mother and brother, but the innocent girl will learn the pleasures of womanhood when she stumbles on a dark secret. The secret consumes her and leaves her breathless for more of what she knows is sinful, but nobody told her sin would feel so good."}, {"id": "B0160BFLGA", "genre": "Science Fiction & Fantasy", "title": "Lovecraft's Southern Vacation: A Robert E. Howard LitCrit TriplePunchPack!", "description": "But how about Howard vs. Lovecraft?I’ve known of the versus for a long time (see my remarks on the Howard-Lovecraft correspondence in the first issue of Necrofile back in 1992), with their ongoing debates known by the overarching term “Barbarism vs. Civilization” — but I credit my awareness of the rivalry specifically manifesting itself in “Pigeons from Hell” to none other than Brian Leno.--- Don Herron, from the Afterword to Lovecraft's Southern VacationLovecraft’s Southern Vacation collects the crème de la crème of Cimmerian Award-winning essayist Brian Leno’s Robert E. Howard criticism together for the first time under one set of covers, with an Introduction and Afterword by Don Herron.The title essay rocked standard perceptions of a classic supernatural tale that everyone thought they knew inside and out — as Leno took Howard’s “Pigeons from Hell” and showed convincingly how it satirized the New England horror fiction of H. P. Lovecraft.Then Leno took to the texts again to investigate one of the long-standing puzzles of Howard’s life: Did he or did he not see the 1933 film King Kong before his death in 1936?And trust to Leno to come up with an unexpected source for Howard’s popular tale “The Frost-Giant’s Daughter,” featuring the Texan’s most famous creation, Conan the barbarian.If you enjoy Howardian litcrit, Leno’s got the knack.\"I’ll be adding info that helps to confirm your theory in re: 'Pigeons'—a brilliant observation & deduction—in my REH chapter of Lovecraft’s Great Tales!\"--John D. Haefele, author of A Look Behind the Derleth Mythos"}, {"id": "B013VW2Z9M", "genre": "Science Fiction & Fantasy", "title": "First Fleet #4: Memory", "description": "The thrilling conclusion of Stephen Case's First Fleet Saga!Spoiler Alert!  If you haven't read First Fleet #1-3, major plot points of the previous books are revealed below...With Beka and Jens reunited, they must now find a way to get off the rogue planet's surface. The alien beings on the planet appear to have been long dead, but as the survivors experience strange visual and mental hallucinations, they realize that they are not as alone as they thought.With Admiral Tholan on his way to destroy the fleet and anyone who has been in contact with the alien beings, the survivors must find a way to get off the planet and end the war once and for all."}]