[{"id": "1412774314", "genre": "Children's Books", "title": "Disney Princess: Musical Pop-Up Treasury (Disney Princess (Random House Hardcover))", "description": "This Disney Princess Musical Pop-Up Treasury is filled with magic and adventure. This book has 10 pop-ups and different melodies for children to follow along. Great book for all princess fans."}, {"id": "1402778511", "genre": "Children's Books", "title": "Kids' Quickest Comebacks", "description": "Every child wants to be a comeback kid. That cherished goal is within reach with these hundreds of smart-alecky answers to stupid questions youngsters hear at home and in school. Why apologize to the teacher who asks: Why are you always daydreaming? Just say: I’m trying to come up with a formula to make homework disappear. No child will ever have to think, \u0093Wish I’d said that!” again."}, {"id": "1933293624", "genre": "Children's Books", "title": "Luna Maris", "description": "We all have questions...even the moon. On his night off, the moon decides to journey to the earth in search of the answer to a burning question: What is the ocean for? Children and parents alike with enjoy this whimsical story with dream-like illustrations."}, {"id": "0062691309", "genre": "Children's Books", "title": "Harriet Tubman: Conductor on the Underground Railroad", "description": "This quintessential middle grade biography of Harriet Tubman now features a cover by NAACP Image Award winner and Caldecott Honor illustrator Kadir Nelson, a foreword by National Book Award finalist Jason Reynolds, and additional new material. Harriet Tubman: Conductor on the Underground Railroad was praised by the New Yorker as “an evocative portrait,” and by the Chicago Tribune as “superb.” It is a gripping and accessible portrait of the heroic woman who guided more than 300 slaves to freedom and who is expected to be the face of the new $20 bill.Harriet Tubman was born a slave and dreamed of being free. She was willing to risk everything—including her own life—to see that dream come true. After her daring escape, Harriet became a conductor on the secret Underground Railroad, helping others make the dangerous journey to freedom.This award-winning introduction to the late abolitionist, which was named an ALA Notable Book and a New York Times Outstanding Book, also includes additional educational back matter such as a timeline, discussion questions, and extension activities. "}, {"id": "B06XK2PDBZ", "genre": "Children's Books", "title": "Mayhem from Moon Palace (Power Rangers)", "description": "Get inside the mind of the Red Ranger in this brand-new adventure from the Power Rangers.Lord Zedd, Emperor of Evil, has recently seized control by banishing Rita Repulsa from the Moon Palace. His first command to his villainous minions is to crush the leader of the Rangers, Jason Lee Scott, for good. While Billy and the team prepare for a science fair, Goldar and company pay Angel Grove High School a visit. Can the Red Ranger keep Zedd’s minions at bay, or will darkness prevail in this battle of good versus evil?"}]