[{"id": "1782942610", "genre": "Children's Books", "title": "10-Minute Tests for 11+ Verbal Reasoning (Ages 10-11) - CEM Test", "description": "This CGP book is perfect for providing children with realistic CEM-style 11+ Verbal Reasoning preparation in bite-sized chunks. It contains more than thirty 10-Minute Tests, each covering a mixture of topics and skills - with step-by-step answers included in a pull-out booklet. There are also fun puzzle pages throughout to challenge children's Verbal Reasoning skills in a more relaxed style, plus a progress chart at the back of the book. Separate CGP 10-Minute Test books are also available for CEM 11+ Non-Verbal Reasoning (9781782942603) and Maths (9781782942597)."}, {"id": "0983036128", "genre": "Children's Books", "title": "Squeaky The Selfish Squirrel", "description": "With colorful illustrations and two lovable main characters, \"Squeaky the Selfish Squirrel\" will keep you on the edge of your seat as you read about Squeaky and his sister, Tinsel. Squeaky learns a lesson in kindness from Tinsel that completely changes his life. On their suspense filled journey in the backyard of 1947 Oakview Lane, they both learn that Wisdom always knows best. As they climb oaks and sycamores, their favorite tree is the wise old oak, aptly named Wisdom.  This book is the first in a series of nine books called “Fruitful Wisdom”. Wisdom, the fatherly giant oak tree, keeps watch over 1947 Oakview Lane as his backyard friends learn valuable life lessons involving the Fruits of the Spirit: love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. Wisdom loves his backyard friends and so will you as you watch them learn and grow."}, {"id": "0606173013", "genre": "Children's Books", "title": "Aunt Eater's Mystery Halloween: Level 2 (An I Can Read Book)", "description": "Aunt Eater the anteater finds plenty of mysteries to solve when she attends a Halloween costume party"}, {"id": "1845071468", "genre": "Children's Books", "title": "Yi-Min and the Elephants: A Tale of Ancient China", "description": "Yi-Min, the smallest and most indulged daughter of the Chinese Emperor, longs to see an elephant. Her father agrees to take her on an elephant hunt, but when Yi-Min sees a big wolf, she mistakes it for an elephant, and the same happens with a stripey tiger and a shaggy brown bear. Finally, she catches sight of the creatures she's been seeking, and her delight leads to a delightful birthday promise."}, {"id": "0531144569", "genre": "Children's Books", "title": "Race to the Moon: The Story of Apollo 11 (Expedition)", "description": "Describes the events leading up to the Apollo 11 flight that put the first man on the moon and the technological advances that made this and later flights possible."}]