[{"id": "B0718XGVVX", "genre": "Science Fiction & Fantasy", "title": "Killer &Victim", "description": "Alexander, the first crowd-sourced city, has come to rival NYC as the premier metropolis in America. It's known as The Paradise City, the first step of a new era. But tonight: A haunting art performance. A killer's quest for redemption. And a photo shoot in a field set aflame. These plant in Alexander seeds of chaos that, when they blossom, will see paradise tearing itself apart."}, {"id": "1628541326", "genre": "Science Fiction & Fantasy", "title": "Aslyn's Unicorn", "description": "\"\"Together, the two glowing animals disappeared into the dark forest and vanished from sight...\"\" A young girl, not yet twelve, decides to follow in her mother's footsteps and go questing for one of the mystical creatures in the Land of Faerie. In Aslyn's Unicorn, this girl decides to capture a unicorn, only to find that some things are better left free."}, {"id": "B00UZ8OC42", "genre": "Science Fiction & Fantasy", "title": "Arcane Forest Anthology: Get Lost in Worlds of Fantasy and Awe", "description": " Get Lost in Worlds of Fantasy and Awe9 First-in-a-Series stories by 9 top-selling authors Read 9 different first books from 9 different Fantasy (romance) series. We hope you enjoy the books you are about to read and meet some new characters to love! Book 1 by W.J. May – Rae of HopeBook 2 by Chrissy Peebles – Eternal VowsBook 3 by Kaitlyn Davis – The Golden CageBook 4 by C.J. Pinard – Enchanted ImmortalsBook 5 by Kristen Middleton - WickedBook 6 by Karin De Havin – Jin in TimeBook 7 by Natasha Brown – FledglingBook 8 by Emma Shade – Finding ObscurityBook 9 by Kate Thomas – Resounding TruthNote: Some of these books are part 1 and may end on cliff hangers."}, {"id": "1519293534", "genre": "Science Fiction & Fantasy", "title": "831: How can you want more, if you don't know more exists? (Volume 1)", "description": "From the ordinary to the extraordinary; follow Rhea's story as she explores a place beyond the ' in love, out of love' cycle. Once initiated into the world of sacred unions Rhea learns to trust the ever growing strangeness in her life until she intuitively enters the ancient natural world of higher love. Leaving cultural and societies norms behind Rhea's new holistic life of wizardry leads her to look at life in an entirely different light.   8 letters 3 words  1 meaning"}, {"id": "1501166220", "genre": "Science Fiction & Fantasy", "title": "The Wind Through the Keyhole: The Dark Tower IV-1/2", "description": "The Dark Tower is now a major motion picture from Dreamworks starring Idris Elba as Roland and Matthew McConaughey as The Man in Black In his New York Times bestselling The Wind Through the Keyhole, Stephen King returns to the spectacular territory of the Dark Tower fantasy saga to tell a story about gunslinger Roland Deschain in his early days.The Wind Through the Keyhole is a sparkling contribution to the series that can be placed between Dark Tower IV and Dark Tower V. This Russian doll of a novel, a story within a story within a story, visits Roland and his ka-tet as a ferocious, frigid storm halts their progress along the Path of the Beam. Roland tells a tale from his early days as a gunslinger, in the guilt-ridden year following his mother’s death. Sent by his father to investigate evidence of a murderous shape-shifter, Roland takes charge of Bill Streeter, a brave but terrified boy who is the sole surviving witness to the beast’s most recent slaughter. Roland, himself only a teenager, calms the boy by reciting a story from the Book of Eld that his mother used to read to him at bedtime, “The Wind through the Keyhole.” “A person’s never too old for stories,” he says to Bill. “Man and boy, girl and woman, we live for them.” And stories like The Wind Through the Keyhole live for us with Stephen King’s fantastical magic that “creates the kind of fully imagined fictional landscapes a reader can inhabit for days at a stretch” (The Washington Post)."}]