[{"id": "1523502746", "genre": "Children's Books", "title": "Eyelike Stickers: Kittens", "description": "Perfect complements to the top-selling EyeLike Stickers: Baby Animals, EyeLike Stickers: Kittens and EyeLike Stickers: Puppies are the newest additions to the bestselling sticker book series that has over 2 million copies in print—with sales that just keep getting better every year.     The full-color photograph stickers are adorable, beautifully detailed, and lifelike, featuring a variety of breeds that will delight every kid and crafter who loves cuddly pets. EyeLike Stickers: Kittens features over 400 baby cat stickers for the feline-inclined. And they’re durable enough to be reusable. Decorate journals, binders, laptops, and phone cases: Stick them on, peel them off, and stick them on again without tearing or losing adhesive.  "}, {"id": "0307976556", "genre": "Children's Books", "title": "Trapped by the Green Goblin! (Marvel: Spider-Man) (Little Golden Book)", "description": "Only the Amazing Spider-Man can stop the sinister Green Goblin when the villain concocts a dangerous trap to test the wall-crawler's most amazing abilities! Boys and girls ages 2 to 5 will love the web-slinging action in this Little Golden Book that features one of the most popular Marvel Super Heroes of all time."}, {"id": "B006CDEJV0", "genre": "Children's Books", "title": "Princesses Are Not Perfect", "description": "Princesses Allie, Mellie, and Libby are very busy at their rose covered palace by the sea. Princess Allie bakes the best cakes you've ever had. Princess Libby is an expert at building things. And Princess Mellie can grow almost anything in her garden.But the princesses are tired of being the best at just one thing. So when it's time to prepare for the Summer Party, the princesses decide to switch places! Allie will build the chairs, Mellie will bake the cupcakes, and Libby will grow berries in the garden. After all, princesses are good at everything. . . . right? "}, {"id": "1944008225", "genre": "Children's Books", "title": "Molly McBride and the Purple Habit", "description": "Molly McBride wants to be a nun, just like her friends, the Children of Mary Sisters. That's why she hasn't taken off the purple nun's habit her mom made for her ever since she got it. But now, everyone is saying she needs to wear a scratchy new dress for her older sister Terry's Big Event. Will Molly and her wolf-pet, Francis, find a way to keep wearing her purple habit? Join Molly and Francis as they learn all about nuns, habits, and being close to Jesus."}, {"id": "0198411529", "genre": "Children's Books", "title": "International GCSE Physics for Oxford International AQA Examinations", "description": "The only textbook that completely covers the Oxford AQA International GCSE Physics specification (9203), for first teaching in September 2016. Written by experienced authors, the engaging, international approach ensures a thorough understanding of the underlying principles of physics and provides exam-focused practice to build assessment confidence. It fully covers the 5 required practicals in the specification, enabling your students to build the investigative and experimental skills required for assessment. This textbook helps students to develop the scientific, mathematical and practical skills and knowledge needed for the Oxford AQA International GCSE Physics exams and provides an excellent grounding for A Level study. This pack includes one print textbook and one online textbook. The online textbook can be accessed on a wide range of devices and the licence is valid until 31st December 2026, for use by one student or teacher. Your first login will be sent to you in the mail on a printed access card."}]