[{"id": "1612549586", "genre": "Children's Books", "title": "The Festive Frolics of Panda and Owl", "description": "Panda and Owl are a hoot! Birthday parties, ice cream, and river games can be fantastic fun - especially when you're with your best friend! Join spontaneous, cheerful Panda and wise but disoriented Owl as they live and laugh together in the Bamboo Forest. In these five stories, Panda and Owl rhyme, sing, walk, eat, and splash through their adventures. But whether they're discovering the bestest activity for the bestest outside day possible or planning surprises for each other, the thing they enjoy more than anything else is spending time together as unlikely yet inseparable best friends."}, {"id": "B00M3Q6O6I", "genre": "Children's Books", "title": "The Boy in Number Four", "description": "“For everyone who loves hockey - young or old, player or spectator - I hope this book inspires you to simply pick up a stick, get together with some friends, and just have some fun playing the best game on earth.”                                                                              —Hockey legend, Bobby Orr from the afterword of The Boy in Number Four Bobby Orr played in the NHL with the Boston Bruins for ten seasons leading them to two Stanley Cup victories. He also played with the Chicago Black Hawks for two more— all the while wearing jersey number 4. In the Boy in Number Four, readers will get a glimpse of this hockey legend as a boy and discover the hard work, commitment, and fun it takes to make a dream into a reality. This book also includes an afterword by Bobby Orr with an inspirational message for kids today. "}, {"id": "0884486419", "genre": "Children's Books", "title": "Welcoming Babies (2nd Edition)", "description": "50,000 copies sold!New Edition! Welcoming Babies draws from experiences around the world to show the diverse ways in which the human family welcomes new life.This redesigned edition features updated content and new backmatter with additional ways of welcoming babies around the world.It’s a powerful concept, exploring the routines and rituals of a child’s first year in diverse cultures and traditions and introducing readers to babies from tiny Luke, who is spending his first days of life in an incubator, to Kasa, who is being introduced to the sunrise by her grandmother. Nontraditional families―biracial, adoptive, and single-parent―are included. The ways in which babies are welcomed into the world are wonderfully varied yet strikingly kindred.   Welcoming Babies is equally appropriate as a gift to new parents or grandparents and a read-aloud for babies. Color throughout"}, {"id": "054487966X", "genre": "Children's Books", "title": "Unstoppable: True Stories of Amazing Bionic Animals", "description": "Chris P. Bacon was born with malformed legs, but with the help of a wheelchair made of construction toys, he’s become a hero to people with similar challenges. Nancy Furstinger profiles Chris P. Bacon and many other animals in Unstoppable—all of whom are making their way around with the help of prosthetics, braces, orthotics and wheelchairs! Readers will meet the caretakers, prosthetists, vets, and loving families that help to make recovery possible. Furstinger offers a glimpse into the cutting-edge technologies, such as 3D printing and brain-controlled prosthetics, that are helping to improve the lives of animals and humans alike.   "}, {"id": "0613178270", "genre": "Children's Books", "title": "Metropolitan Cow (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Although his parents, very cosmopolitan cows, are uncomfortable with the idea, Bennett becomes good friends with Webster, a young pig who moves in next door."}]