[{"id": "1617684422", "genre": "Science Fiction & Fantasy", "title": "DC Comics Deck Building Game Crossover Expansion Pack 3 Legion of Super-heroes", "description": "A legion of young guns from the DC Universe are ready for their time in the spotlight! Play as a founding member of the Legion of Super-Heroes: Lightning Lad, Saturn Girl, Cosmic Boy, and more! Take on Super-Villains like Time Trapper, Emerald Empress, Persuader, and many others. Find interesting new Heroes, Villains, Equipment, Super Powers, and Locations in this set as well.This set features an exciting new keyword sure to throw DC Deck-building Game players for a loop. A time loop, that is! The keyword is Time Travel, and almost every card in this set has it. A Time Travel card can be played while in the Line-Up or on the Super-Villain stack at the cost of discarding a card from hand. It will give you a bonus for the turn, but then you can't buy or gain that card. Players will have interesting decisions to make each turn. If you use a Time Travel ability, it limits your purchase options, and it also means the next player will be able to use that Time Travel card as well. Now you need brains, skill, and timing to beat your foes!This is not a standalone product. DC Comics Deck-building Game, Heroes Unite, Forever Evil, or Teen Titans is required to play.Contents:22 Game Cards6 Oversized Super Hero CardsRules Card"}, {"id": "B00K1PENLG", "genre": "Science Fiction & Fantasy", "title": "Living the Afterlife: A Death and Chronos flash fiction collection", "description": "Thirty stories filled with laughter and mishaps as a Harley-riding Death and anachronistic Chronos create havoc in Purgatory and on Earth. A host of Immortals join in the misadventures.Find out what happens when Death teaches War how to bowl. Can Chronos fix his blunder when he loses a year? What is Gaia going to do when she discovers the invisible sheep? Can you win playing poker with Evil?Step into their world. The Afterlife will never be the same."}, {"id": "0789488531", "genre": "Science Fiction & Fantasy", "title": "Superman: The Ultimate Guide to the Man of Steel", "description": "For 60 years the world famous Man of Steel has used his superpowers to fight for truth, justice, and fair play against the forces of evil and chaos. With unparalleled access to the archives of DC Comics-the creators of Superman-classic art is combined with some never-before-published work to create Superman: The Ultimate Guide. Discover Superman and little known facts about his universe as never before-key locations are revealed, crucial events and characters are profiled, and secrets are unlocked in this comprehensive volume."}, {"id": "B01LYOY2BX", "genre": "Science Fiction & Fantasy", "title": "A Matter of Time: Paranormal, Tattoo, Supernatural, Romance (The Chronicles of Kerrigan Sequel Book 1)", "description": " The highly anticipated Sequel to the Chronicles of Kerrigan series, by international bestselling author, W.J. May It's Time. The past can't stay buried forever...Rae Kerrigan and her friends thought all their problems were solved. The corruption in the Council has been exposed. The hybrids have been released from their unjust prisons. And Jonathon Cromfield—the evil puppet master pulling all the strings—had finally been put in the ground.With the promise of an actual future with Devon, the love of her life, Rae slips the ring back on her finger and turned her eyes towards the horizon. Her heart’s filled with hope.Except fate has other plans...With the return of her father, the infamous Simon Kerrigan who started it all, Rae finds that her newly right world has turned upside down again. The new peace in the tatù realm has shattered once more. Turning friends against friends. Family against family.Why was he imprisoned? What will he do now? More importantly, can Simon Kerrigan ever be trusted again?Rae and her team intend to find out...Prequel Series:Christmas Before the MagicQuestion the DarknessInto the DarknessFight the DarknessAlone in the DarknessLost in DarknessThe Chronicles of Kerrigan SeriesRae of HopeDark NebulaHouse of CardsRoyal TeaUnder FireEnd in SightHidden DarknessTwisted TogetherMark of FateStrength & PowerLast One StandingRae of LightThe Chronicles of Kerrigan SequelA Matter of Time ..."}, {"id": "0982827334", "genre": "Science Fiction & Fantasy", "title": "Priscilla the Great", "description": "Did you ever want a blowtorch for a finger? Meet Priscilla Sumner, an ordinary seventh grader with extraordinary gifts. As if middle school isn't hard enough, not only does Priscilla have to fight pimples and bullies, but genetically enhanced assassins trying to kill her and her family. Armed with wit, strength, and a genius best friend, Priscilla must defeat the Selliwood Institute, a mysterious organization with a mission of turning children into killing machines."}]