[{"id": "B00HHZXAHG", "genre": "Children's Books", "title": "Anything for Thanksgiving?", "description": "Anything for Thanksgiving?” is a children’s story about the Thanksgiving holiday. The story highlights both family traditions and public celebrations of the holiday as it depicts one African American family‘s Thanksgiving.  Its two, very young,  main characters, Asia and Jimmy,  learn about the holiday from their Grandmother as she prepares the family feast.  The children also hear about  a surprising custom that is no longer celebrated but is fondly remembered by their  Grandmother from  her youth in her hometown of Jersey City.  The traditional story of the  origin  of Thanksgiving  is also presented ."}, {"id": "B075CWNL6L", "genre": "Children's Books", "title": "Amazing Amazon: The Taste of Termites", "description": "This is a short memoir depicting a trip in the Amazonian rain forest, as seen through the eyes of a young boy. Illustrated with pictures taken during the trip, it opens our eyes to learning more about one of the most unique habitats on Earth through a child's camera lenses. This essay was awarded a gold key in the Scholastic Writing Awards, Midwest Region."}, {"id": "B0775KDJLM", "genre": "Children's Books", "title": "Old MacDonald Had a Boat", "description": "Old Mac and Mrs. Mac are at it again! This time, these DIY-happy farmers wield a host of noisy tools—from hammers to sanders, and even a blowtorch—to soup up their rusty old fishing boat. With a BANG BANG here and a BUZZ BUZZ there, this silly, summery sequel to the wildly popular Old MacDonald Had a Truck is sure to make a splash—and have the whole family singing along."}, {"id": "B0739V47T6", "genre": "Children's Books", "title": "Women-Centered Holidays from Around the World | Children's Holiday Books", "description": "Did you know that there are many holidays around the world that celebrate women? Let’s get to know them most popular ones by going over the pages of this wonderful picture book for children. Reading is a shared experience that builds word power. So what are you waiting for? Go ahead and grab a copy today!"}, {"id": "1509860355", "genre": "Children's Books", "title": "Christmas Jokes", "description": "A feast of festive fun, filled with seasonal jokes and shaped like a snowman! What is Father Christmas's favorite pizza? One that's deep pan, crisp and even. What happens if you eat the Christmas decorations? You get tinsellitis. What does Tarzan sing at Christmas? Jungle Bells. What squeaks and is scary? The ghost of Christmouse past. What do you get if you cross Father Christmas with a duck? A Christmas Quacker."}]