[{"id": "1609055535", "genre": "Children's Books", "title": "Andy Also (Jump-Into-Chapters)", "description": "\"Whether readers are the 'Preston' or 'Andy' in their own friendships, they'll find this duo's interactions irresistible.\"\u0097Publishers Weekly, starred review for Okay, Andy!Two Andys? Twice the Fun!Andy and Preston are back for a brand-new nutty adventure\u0097only this time there are two of them! Well, not two Prestons. Because Preston has decided that from now on, he is also going to be called Andy. Guess who doesn’t like this, AT ALL? As Andy tries to convince Andy that he should be the only Andy, the buddies share noisy fun, talk about rabbits, and the confusing arrival of\u0085 Dr. Turkeyfeet?"}, {"id": "B0776N1ZYS", "genre": "Children's Books", "title": "Showtime (Dance Trilogy, Book 3)", "description": "The final instalment in this inspiring series about dancing, friendship and following your dreams. From best-loved author Jean Ure, whose books are described by Jacqueline Wilson as “funny, funky, feisty – and fantastic reads!”A big performance looms and Maddy knows that the school has a way of weeding out the weakest dancers. Now is her time to shine. But will Maddy and her friends be celebrating at the end of the year?"}, {"id": "0997025484", "genre": "Children's Books", "title": "Lil Foot The Monster Truck", "description": "AGE 2-5 This illustrated children’s book is for all the little boys and girls that love monster trucks. You’ll encounter Lil Foot, a mud-splashing, wheel spinning, engine-roaring, and car-crunching monster truck. In this fun and heartwarming story, a little monster truck is being teased by his friends. After wishing for a better name, the little monster truck realizes that being kind to others and believing in oneself is what matters most. Highlights of any monster jam show have been beautifully woven into this rhyming story, providing little monster truck enthusiasts with a tale that lets their love for these ginormous trucks come to life. To learn more and to watch the BOOK TRAILER, visit www.Yvonne-Jones.com"}, {"id": "B077NMZMDT", "genre": "Children's Books", "title": "I Love to Keep My Room Clean (english polish  kids books, polish books for children, polish baby books) (English Polish Bilingual Collection)", "description": "English Polish Bilingual children's book. Perfect for kids learning English or Polish as their second language. This children's book can motivate the kids to take responsibility and keep their room organized. Follow along as little bunny Jimmy and his brothers learn their lesson in this picture book. They learn to work together, clean up their room, and organize their toys."}, {"id": "098624452X", "genre": "Children's Books", "title": "The Pudgys in Paradise", "description": "Papa’s promotion propels the Pudgys into perilous, pulse-pounding predicaments in paradise. This merry, alliterative adventure takes the Pudgy family from Pittsburgh, Pennsylvania, to Pogo Pogo in the South Pacific. Penned by the screenwriter whose film credits include “Jumanji” and “Summer of the Monkeys,” it’s packed with whimsical, colorful, distinctive illustrations and portly protagonists. What our readers have said:  “A fun, quirky piece of magical creativity”  “A great story-time book for adults and children to share together”  “Clever fun for young readers”  “The illustrations will delight”  “As a teacher, I can see the possibilities of incorporating the story into many areas of the curriculum” “A wicked tongue-twister”  “Good for all ages”  “The illustrations are as rich and fun as the words”  “An absolutely awesome and absurdly amusing adventure”  “Colorful, intricate illustrations”  “A fun read for the kid in all of us”"}]