[{"id": "B01N1WL3GK", "genre": "Children's Books", "title": "Adam's Odyssey: Ancient myths with a modern twist for parents and children", "description": "The delightful adventures of an 8-year old kid in the land of Homer.Adam's Odyssey is the voice of a young boy as he tells the stories of gods, heroes, temples, and castles, all mixed with his passion for iPads, Clash of Clan, Boom Beach, Fruit Ninja, chocolate, ice cream, and, of course, swimming pools.Extremely interesting...Extremely informative...Extremely enjoyable...A pleasure to read...For both parents and children."}, {"id": "B00AZKLINI", "genre": "Children's Books", "title": "An ABC Escapade through Egypt", "description": "An ABC book for all ages! Discover some of the many wonders of modern-day Egypt on this alphabetical escapade - foods like mangoes and konafa, animals such as foxes and jerboas, and places like the Red Sea and Zamalek. At each letter of the alphabet, stop to explore fun alliterative phrases, fascinating photographs, and interesting facts about the culture, geography, nature, and people of Egypt. The Kindle Edition is formatted for reading on portable devices but still includes over 60 color images.Independent Reading Level: Ages 8 - 12. Appropriate read-aloud book for younger children."}, {"id": "B00701DMLG", "genre": "Children's Books", "title": "Baby's First Punk Book (BAWDYbuilders, Book 2)", "description": "Never mind the bollocks, here comes Baby’s First Punk Book!Book Two in the BAWDYbuilders Series, Baby’s First Punk Book is the perfect way to introduce your young one to the magic of punk culture. Written by leading punk expert Anne R. Key, Baby’s First Punk Book tackles topics such as punk fashion, music and ideology. Baby’s First Punk Book will take you on a fascinating journey, where you and your baby will discover that (Yay!) punk isn’t really dead.36 pages."}, {"id": "0078656133", "genre": "Children's Books", "title": "Civics Today: Citizenship, Economics, & You, Spanish Reading Essentials and Study Guide, Workbook (CIVICS TODAY: CITZSHP ECON YOU) (Spanish Edition)", "description": "Reading Essentials and Study Guide (English and Spanish): Reinforce critical concepts from the text and help students improve their reading-for-information skills with this essential resource, written 2-3 grade levels below the Student Edition"}, {"id": "0399187316", "genre": "Children's Books", "title": "HelloFlo: The Guide, Period.: The Everything Puberty Book for the Modern Girl", "description": "“Full of practical advice, helpful explanations, and messages of encouragement…Period.” —Parents.com“Make[s] girls feel both normal and empowered.... If you have a girl nearing puberty in your life, I recommend grabbing a copy for her.” —Heidi Stevens for The Chicago TribuneFrom the founder of HelloFlo, a modern and insightful guide to periods and puberty for a new generation     When will I get boobs?Does wearing a tampon hurt?What's the deal with menstrual cups?Seriously, when will I get boobs?Honest, funny, and unafraid of the messy, real-life facts about a girl's changing body, this is definitely not your mother’s puberty book. HelloFlo founder Naama Bloom’s mission is to create informed, empowered young women who are unafraid to ask questions and make the best choices for themselves and their bodies. A celebration of women's bodies and all the confusing, uncomfortable, silly, transformative, and powerful changes that occur during puberty.This full-color book—written by HelloFlo founder, Naama Bloom, and journalist Glynnis MacNicol—features bright, diverse, approachable illustrations and infographics, doctor-vetted information, and personal testimonials from real girls and women."}]