[{"id": "0823414612", "genre": "Children's Books", "title": "Fireflies in the Dark: The Story of Friedl Dicker-Brandeis and the Children of Terezin", "description": "In December 1942 Freidl Dicker-Brandeis packed her suitcase for the last time. What did she fill it with? Art supplies. Brushes, paints, and paper were her luggage when she was forced by Nazi soldiers to move to the Terezin concentration camp. An artist and art instructor, Freidl used her limited supplies to bring a world of beauty and fantasy to children in the camp―most of whom would die tragically at Auschwitz. This story reveals how flashes of kindness can bring joy and relief―like fireflies in the dark. The story is enhanced with photographs and reproductions of the amazing artwork completed by Freidl Dicker-Brandeis, her students, and her colleagues during their time at Terezin."}, {"id": "1981142754", "genre": "Children's Books", "title": "Merry and Bright Christmas Coloring Book", "description": "A fun Christmas coloring book for all ages. Relax and enjoy holiday pages by yourself or with the children in your life. Merry & Bright Christmas coloring book has both simple and more complicated pages to color. Illustrated by Melinda Todd, you’ll love the festive and fun designs. Enjoy a few stops around the globe with a hippo, giraffe, polar bear, goat, dogs, cats, and people."}, {"id": "0998170003", "genre": "Children's Books", "title": "The Greatest Ten", "description": "We cannot start too early teaching the Ten Commandments to children in ways that are meaningful and memorable, according to age appropriate understanding.  The \"Greatest Ten,\" written in verse and beautifully illustrated, brings each Commandment to a level that youngsters can understand.                  Read or sing “The Greatest Ten,”             To learn and enjoy again and again.   (The verses may be sung to the tune of “This Old Man, He Played One”)"}, {"id": "1499803869", "genre": "Children's Books", "title": "Vikings (Blast Back!)", "description": "Get ready to blast back to the past and discover what life was like as a Viking!When people think about Vikings, things like big ships and helmets with horns may come to mind. But what was it really like to be a Viking? This engaging nonfiction book, complete with black and white interior illustrations, will make readers feel like they've traveled back in time. It covers everything from the ships they sailed to everyday life, and more. Find out interesting, little-known facts such as how the Vikings discovered North America long before Christopher Columbus, and how one Harry Potter character was named after a famous creature from Viking mythology! The unique details along with the clever and humorous interior illustrations make this series stand out from the competition. "}, {"id": "1565542851", "genre": "Children's Books", "title": "Gaston® the Green-Nosed Alligator (Gaston® Series)", "description": "Unprepared for his yearly trek because of a series of problems, a perplexed Santa sees Gaston in flight-suddenly the friendly alligator is employed to help save Christmas Eve. Gaston, the intrepid green-nosed alligator from the bayou, ventures far and wide to satisfy his wanderlust. Gaston's creator, James Rice, has written and illustrated eight books featuring the friendly swamp creature."}]