[{"id": "B075NJRY1T", "genre": "Children's Books", "title": "The Royal Park Murder", "description": "Annie Kelty recognises the dead man in the Edinburgh royal park murder. Alarmed that his killer's description fits her father, (whom she already suspects deals in more dangerous materials than rare books over their shop counter), she sets out confident in her ability as an amateur detective. An innocent in the city's criminal underworld, she is caught in a web of violent crime and deadly danger and soon discovers there is little chance of escape or survival for the unwary."}, {"id": "0689822197", "genre": "Children's Books", "title": "PAUL GOBLE GALLERY: Three Native American Stories", "description": "A breathtaking collection of three complete classics--Her Seven Brothers, The Gift of the Sacred Dog, and The Girl Who Loved Wild Horses--displays the author's brilliant artwork and his passion for the Native American Landscape and rich storytelling tradition."}, {"id": "0613252918", "genre": "Children's Books", "title": "Garfield's Big Book of Excellent Excuses", "description": "\"I forgot to remember.\" \"I ate too much sugar.\" \"I tripped on a hairball.\"  Need an excellent excuse for explaining why you: * Were late for school? * Didn't do your homework? * Had a bad game? * Can't eat certain foods? * Can't get off the phone?  Let Garfield, the Emperor of Excuses, help you explain why you couldn't, shouldn't, wouldn't do this, that, or the other!"}, {"id": "1589479718", "genre": "Children's Books", "title": "1-25 Dot-to-Dot Bilingual Spanish/English", "description": "Solve the dot-to-dot puzzles, and reveal pictures ready to color. Hace que el aprendizaje sea divertido! Picture titles, plus all instructions are in both Spanish and English. Great for early ESL or immersion classrooms. Dot-to-dots in this workbook from the Get Ready! series connect a frolicking collection of animal friends and playful scenes. Each puzzle labels the dots with numbers 1-25 and focuses on developing sequencing and eye-hand coordination--the skills that help prepare little ones for school. Once they connect the dots correctly, kids can reward themselves by coloring in the picture they helped create. With 64 playful puzzles to solve, developing a \"learning is fun\" habit comes easy. Get the School Zone Advantage today!"}, {"id": "0679830693", "genre": "Children's Books", "title": "The Teeny, Tiny Farm (Chunky Shape Books)", "description": "Illustrated in full color. Old MacDonald would feel right at home on this tour of a teeny tiny farm and its teeny tiny people and animals, die-cut in the shape of a barn.  "}]