[{"id": "B0774WS4K6", "genre": "Science Fiction & Fantasy", "title": "101 Ways To Spot a Western Spy (Tales From The Zone)", "description": "SSIT offers a humorous perspective on the economical and cultural conflicts between the United States and Ex Communist Countries from Eastern Europe. Using the medium of 101 tips from anonymous Easterners, the trusty manual intends to aid any reader towards drawing their own conclusions about the two factions and how their individual evolution shaped our modern world ever since the end of the WWII era."}, {"id": "B01F1K15CA", "genre": "Science Fiction & Fantasy", "title": "The Zero Patient: (A Dystopian Sci-Fi Thriller)", "description": "More is revealed in the second book of the Zero Patient Trilogy as Halo and Sterling disrupt the Northern Servers. New characters are introduced including Sterling's younger sister, Beige, who plays a pivotal role as the trilogy progresses. Tragedy strikes, sending Sterling into revenge-seeking frenzy, and something happens in the Off Limits which will forever change the Canyon.In the South, Hunter is still on the hunt, guided by Halo and his blind religious fervor. An unexpected meeting adds a touch of humanity to his character, but at the same time, his bloodlust and violent urges are on the brink of cracking what's left of his sanity.No questions asked, no answers questioned.From the writer of Fantasy Online and The Feedback Loop series comes a dystopian cyberpunk story about humanity's greatest dividing factors. Religion, politics, environmental degradation, class warfare -- all play their roles in the Canyon, the last surviving colony of people on Earth. "}, {"id": "1556346611", "genre": "Science Fiction & Fantasy", "title": "GURPS WW II Weird War II", "description": "Everyone's heard the stories of World War II - now take a look at the stories your teachers couldn't tell you in high school. Nazi mystic archmages, SS super\"human\" troops, secret antarctic bases, \"foo fighters\" - and that's just what the Axis was up to! Now your characters can fight the occult Nazi menace as well. Race for the Ark of the Covenant, steal Nazi tomes and fight the Werewolves in this unique supplement to the GURPS WWII system."}, {"id": "B073RR52CB", "genre": "Science Fiction & Fantasy", "title": "Jitter Crop: Stories", "description": "In the audacious opening story, “A Learner’s Permit,” fifteen-year-old Daniel assumes he’s in for a boring night of babysitting—until he arrives at the McGills’ ritzy, luxurious home. His teenage boldness leads him to uncover shocking revelations about this mysterious couple. In “IWASMIA,” an innocent psychologist accepts an invitation from a veteran for a Veteran’s Day lunch, unaware of the danger and chaos he is inviting into his life.In the wake of a school shooting and the disappearance of his young wife, a retired cop in “Kindred Spirits” thinks he’s seeing things. On the walking trail of a large, woodsy suburban park, he encounters an octogenarian who looks just like his grandfather—deceased for twenty years. He knows the man can’t be a ghost, so who is he—and what does he want?Stories of fantasy, dark wit, and unnerving discovery lead to deep reflection in Jitter Crop, the second short story collection by Carl F. Thompson Jr.  Five of these nine stories were previously published in literary magazines, and “Jellyne” was a finalist for the Glimmer Train Short Story Award for New Writers in early 2016.Here you’ll find ordinary people in everyday situations—safe until that moment when the ground beneath their feet gives way and the normal tumbles downhill.Jitter Crop bristles with the bewildering, the curious, and the quixotic in nine unusual works designed to mesmerize any imaginative mind."}, {"id": "0857440497", "genre": "Science Fiction & Fantasy", "title": "Necropolis 2350 Adventure Compendium (Savage Worlds)", "description": "Battle all the horrors of Hell in this fantastic series of seven adventures for Necropolis 2350!  The Necropolis 2350 Adventure Compendium contains a set of adventures for the sci-fi horror Roleplaying Game, Necropolis 2350 and is based in a fictional 24th century.  In these dark days, mankind, divided into two main camps and stands on the brink of extinction.  The Third Reformation Church are locked in desperate battle against undead invaders known as the Rephaim. While the heroes of humanity use advanced weapons and can call upon the power of faith, the twisted Rephaim are masters of necromancy and wield vile technology created from living tissue.  Adventures contained in this book: The Last Word The Long Sleep The Broken Seal The Opener of the Ways Echoes Tales from the Frontline One Tales from the Frontline Two  Each adventure contains all the information the GM needs including maps, handouts and full monster stats."}]