[{"id": "B0170JS6KY", "genre": "Science Fiction & Fantasy", "title": "Secret Magic (Shifty Magic Novella Series, Book 1)", "description": "Kidnapping. Treachery. Annoying Feds.New Private Investigator, Addison Kittner, is done taking jobs barely a step above hand-drawn notices nailed to telephone poles. So when she gets the opportunity to solve a kidnapping case, she jumps on it. Too bad the job comes with a liability, namely too-hot-for-her-own-good Were FBI Agent, Cooper Daine.Never one to trust people who follow the rules, Addison ditches him the first chance she gets. A decision she regrets when she discovers who’s behind the kidnapping and they almost kill her.She hates to admit it, but as risky as Cooper is to her peace of mind, not having the Were at her back is even worse. To have any chance at rescuing the kidnapped boy before it’s too late, they need each other. Maybe more than either of them wants to admit.Buy Secret Magic and experience the adventure today!"}, {"id": "B01AD4QAO2", "genre": "Science Fiction & Fantasy", "title": "The Marvellous History of King Arthur in Avalon and of the Lifting of Lyonnesse: A Chronicle of the Round Table", "description": "THE writer considereth the truth of the matters which are recorded in the Historie of King Arthur concerning the site of the Island of Avalon and the family of Queen Morgan la Faye. He telleth how Morgan la Faye carried away King Arthur and his Round Table into Avalon; and how she made them pass the time there for many hundreds of years; how she put King Arthur to sleep; of the lodestone wall that she built round the island; and of the vision of the world beyond, which she saw from the top of the wall. He speaketh, by the way, of Government in Avalon; of the Game of Loaves and Fishes; and of the Rule of Let Be; after which he telleth of the enchantments whereby Morgan la Faye beguiled those Knights of the Round Table whom she brought to look upon the world from the top of the lodestone wall; of the Parliament which she caused them to call; and of the speeches which those Knights made in the Parliament concerning the Defence of Britain."}, {"id": "0807083690", "genre": "Science Fiction & Fantasy", "title": "Kindred", "description": "Dana, a modern black woman, is celebrating her twenty-sixth birthday with her new husband when she is snatched abruptly from her home in California and transported to the antebellum South. Rufus, the white son of a plantation owner, is drowning, and Dana has been summoned to save him. Dana is drawn back repeatedly through time to the slave quarters, and each time the stay grows longer, more arduous, and more dangerous until it is uncertain whether or not Dana's life will end, long before it has a chance to begin."}, {"id": "B00FG6MNN0", "genre": "Science Fiction & Fantasy", "title": "Ministry Protocol: Thrilling Tales of the Ministry of Peculiar Occurrences", "description": "From the Creators of the award-winning steampunk Ministry of Peculiar Occurrences series ( Phoenix Rising, the Janus Affair, Dawn's Early Light, and the Diamond Conspiracy) comes a collection of new adventures from around the world.The Ministry of Peculiar Occurrences investigates the bizarre and unusual, and protects the citizens of the Empire from forces of darkness.  Every agent knows that thrusting themselves into danger is part of the job, and may demand of them the ultimate sacrifice. They call on their own inner strength, wits, intellect, and innovations of science and technology.But is it enough to face the unknown and the unexplainable? This is Ministry Protocol: Thrilling Tales of the Ministry of Peculiar Occurrences, a collection of short stories featuring the derring-do of secret agents cut from a different cloth.  These original short stories feature the imagination and voices of…Leanna Rennee HieberThe League of S.T.E.A.M.’s Glenn FreundDelilah S. DawsonJared AxelrodTiffany TrentKarina Cooper…and many more!Travel to the farthest corners of Queen Victoria’s mighty empire and back again to the shores of Old Blighty, unlocking the mysteries of legend, lore, and shadowy societies. Welcome to a world of steam, secrets, machinations and madness."}, {"id": "1591460026", "genre": "Science Fiction & Fantasy", "title": "Aftermath 1", "description": "In the aftermath of an asteroid that hits Earth in 1998, the story begins in the year 2006, following the adventures of members of the North American Air Defense Agency, Base One. Since all military resources must be turned to the task of providing aid and food to the survivors, the North American Air Defense Agency stands alone to guard against airborne terrorist attacks. While flying a reconnaissance mission, Skip Scott is forced down and captured by the terrorist group, Bushmaster. There, he meets the love of his life, Lieutenant Ahana Cohen, fighter pilot for his captors. But he also discovers something else, and it’s not what he expected at all…"}]