[{"id": "1537132938", "genre": "Science Fiction & Fantasy", "title": "The Paradox: How power powerfully powers power", "description": "Visit author website https://www.lameesauthor.com/ and get your free book today. All the good men and women, past and present, who shone a light for others to follow, had their own share of demons to conquer, and they emerged victorious. Malcolm is a young Harvard graduate visiting Italy. He befriends an enigmatic priest who offers to give him a tour of the Duomo Cathedral. The truth unfolds; this so-called priest is actually the devil, and he is after Malcolm's soul! In their travels to get to the cathedral, Malcolm and the devil encounter people with various sins. Their names are written in the devil's book; he will claim their souls. Malcolm argues with the devil over the alleged sins of these people while at the same time a little fearful; will the devil take his soul, too? \"You may as well call me the devil, for I might as well tell you, I am indeed the devil.\" \"That's impossible; the devil would not dress like a priest, carry the holy book, wear a cross, and work in a church.\" The devil smiled and said, \"Why not?\" Note to the reader: All the images and artworks in this book are fully colored."}, {"id": "1633674487", "genre": "Science Fiction & Fantasy", "title": "The Brotherhood of the Beast", "description": "The entire world came under the tyrannical rule of the Brotherhood of the Beast - the elites who ran everything. Freedom was becoming a distant memory. By the time Edward Snowden leaked the NSA spying secrets in 2013, it was already too late for humanity. Even worse, a diabolical plan to exterminate 7 billion people was on schedule."}, {"id": "031651795X", "genre": "Science Fiction & Fantasy", "title": "Arm of the Sphinx (The Books of Babel)", "description": "Senlin continues his ascent up the tower in the word-of-mouth phenomenon fantasy series about one man's dangerous journey through a labyrinthine world. \"One of my favorite books of all time\" - Mark Lawrence on Senlin AscendsThe Tower of Babel is proving to be as difficult to reenter as it was to break out of. Forced into a life of piracy, Senlin and his eclectic crew are struggling to survive aboard their stolen airship as the hunt to rescue Senlin's lost wife continues.Hopeless and desolate, they turn to a legend of the Tower, the mysterious Sphinx. But help from the Sphinx never comes cheaply, and as Senlin knows, debts aren't always what they seem in the Tower of Babel. Time is running out, and now Senlin must choose between his friends, his freedom, and his wife.Does anyone truly escape the Tower?The Books of BabelSenlin AscendsArm of the Sphinx"}, {"id": "B01LW2F7BB", "genre": "Science Fiction & Fantasy", "title": "The SeaLand Incident: The Story Behind One Zoo's Infamous Attempt to House a Great White Shark", "description": "In May of 2015, Tropical Storm Ana ravaged the southeastern United States and inadvertently trapped a large Great White shark in a small inlet near Myrtle Beach, South Carolina. Presented with this unique opportunity, executives from the struggling zoological park known as SeaLand opted to attempt what was previously thought impossible: the capture and permanent housing of the ocean's most notorious apex predator. Through expert interviews and eyewitness testimony, The SeaLand Incident: The Story Behind One Zoo's Infamous Attempt to House a Great White Shark documents the complex legal and technical hurdles of keeping a monster shark in captivity, as well as the tragic accident that forced the attraction to close for good."}, {"id": "0345304993", "genre": "Science Fiction & Fantasy", "title": "Merlin's Godson", "description": "a readers review.\nMerlin's Godson, the story of Merlin and a lost Roman contingent settling in among native Americans following Arthur's death, is equally as over-written but not nearly as entertaining or fantastical as the book it prequels, Merlin's Ring . Even so, fans of detail- and geography-obsessive alternate histories will probably find plenty to like. Munn's created an interesting universe in which savages cower at acts of \"magic\" that are obviously just proper application of scientific knowledge, but gods and mysticism rear their vengeful heads just often enough to make you realize those savages have reason to cower. \n\nThis is actually a combination of two previously published novels, King of the World's Edge and The Ship from Atlantis, which helps to explain why the last section of the book (featuring the early adventures of the titular hero, Gwalchmai) feels tacked on. Also important to note is that King of the World's Edge was originally published in 1939, and written as early as 1925, so taken in context it's a pretty impressive piece of work. Still, Godson is probably of interest mainly to people who've already read Ring and want a little flesh on the backstory."}]