[{"id": "0689853408", "genre": "Children's Books", "title": "Baby Loves", "description": "Celebrating the many precious first experiences in a baby's life, an enchanting picture book features lavish images by the legendary Impressionist Mary Cassatt that have been taken from the Metropolitan Museum of Art's vast collection."}, {"id": "0763663751", "genre": "Children's Books", "title": "Queenie: One Elephant's Story", "description": "The true story of one of the most famous elephants of all time: Queenie, the gentle Indian elephant.Evoking a time when elephants were giving rides in zoos all around the world, the true story of Queenie follows her from her birth in an Indian jungle to Australia's Melbourne Zoo, where she lived for more than forty years, giving rides to children. Thousands of kids loved Queenie, celebrated her birthday, and sent her letters. But in an event still not fully understood, Queenie crushed one of her keepers in late 1944. Was she mistreated or bored? Was it an accident? No one knows, but zoos have changed since Queenie's time. Plainspoken and honest, this gentle account shows the good, the bad, and the evolution of zoo philosophy. Queenie's story is a thought-provoking steppingstone for discussion of a complex, difficult topic.Back matter includes an author's note."}, {"id": "B00FELMPK8", "genre": "Children's Books", "title": "Drawing Books for Beginners: How to Draw Bible Stories - Noah's Ark (Hebrew Edition) (How to Draw (Hebrew Edition) Book 12)", "description": "Drawing is a universal language so even though this drawing book is in russian language there isnt any text so anyone can enjoy it all around the world!A \"how to draw\" book that will teach you how to draw step by step.How to draw comics characters step by step.This drawing book will teach you how to draw all you need to know about drawing simple and beautiful characters. The author and illustrator Amit Offir teaches you to draw and succeed in A short time even if you dont know how to draw at all!Everybody can draw and now you can too!A unique technique that will give you great drawing tools and lead you to success.Recommended for age 6 and all ages (for adults that want how to draw easily also)"}, {"id": "B073K1BL38", "genre": "Children's Books", "title": "Inventing with LittleBits (21st Century Skills Innovation Library: Makers as Innovators Junior)", "description": "With LittleBits, you can build your own electronic devices using modules that snap together easily with magnets. Through simple text written to foster creativity and problem solving, students will learn the art of innovation. Large, colorful images show students how to complete activities. Additional tools, including a glossary and an index, help students learn STEM concepts, new vocabulary, and locate information."}, {"id": "163517581X", "genre": "Children's Books", "title": "Velociraptor", "description": "Explores what scientists have uncovered about Velociraptor. Colorful photos and illustrations help bring each dinosaur to life as easy-to-read text guides readers through important discoveries about its appearance, diet, and habitat."}]