[{"id": "0864923023", "genre": "Science Fiction & Fantasy", "title": "The Colony of Unrequited Dreams", "description": "The Colony of Unrequited Dreams has garnered national and international praise for its distinctive blend of fact and fiction. Johnston weaves the story of Joey Smallwood, arguably Newfoundland&#146s most controversial political figure and undoubtedly its unlikelest romantic hero. It tells of Smallwood&#146s ambition and friendship with Sheilagh Fielding. Together, they escape Newfoundland and become socialists in New York. Returning home, he becomes a populist and is alternately plagued and inspired by Fielding, now a popular newspaper columnist."}, {"id": "1547296348", "genre": "Science Fiction & Fantasy", "title": "The Twins Of Arcon: On The Quest For Power Part 2 (1)", "description": "Part 2 of this epic adventure continues where we left off with our two-identical twin teenage sisters Jade and Teela, along with their Alsatian Rex. Who were all mysteriously transported to the alien world of Arcon. Now with the aid of Forgar their trustworthy and very forgetful shaman and his most annoying but wise talking staff Stugg. They must undergo on an adventure of a lifetime to reach the city were the Elder’s live, here they will discover the real reason while they were dragged to this terrifying world. On the way there, they will meet new friends and enemies and discover more about this strange new world that they find themselves stuck on. They will also have to learn how to use their new found magical abilities if they are going to have a chance in completing their mission. But they are not the only ones on a mission, the ruthless and cruel Ice Queen Yaramar has also sent her best agents on missions. Discover what happens when the forces of evil clash with those of the light. The battle for Arcon is only just beginning with many new and exciting characters and creatures to discover. Will the twins complete their mission and reach the city of the Elder’s or will the armies of darkness prevail?"}, {"id": "1944045244", "genre": "Science Fiction & Fantasy", "title": "The 13th Power Journey (The 13th Power Trilogy) (Volume 2)", "description": "In the second book of The 13th Power Trilogy, Ray Crawford, having failed to achieve fame, has formulated a new plan: reprogram the Supercomputers, build a bigger gravity chamber, and degenerate NASA’s prototype Inter Space Station Transporter into the 13th Power. He will discover that fame carries a terrible price. Since the undercover operation in Simi Valley failed, The Ark is under more pressure from the President to fulfill Directive 119, the Strategic Defense Initiative, and deploy at network of proton laser beams in orbit. He captures the fugitive murderer Dr. Curtis, aka Melvin Anderson, and offers him a deal he can’t refuse.    Just when Janis Mackey is settled into a peaceful life with Tracy in Boulder, the CIA calls on him to help them steal the 13th Power technology for Star Wars. Of course, he refuses, so acting on orders from The Ark, they take Tracy into custody and threaten to kill her if Janis doesn’t deliver the goods. Janis’s return to Simi Valley is not the joyous reunion Lisa expected. She’s heartbroken over his devotion to Tracy, but she’s determined to win him back. And Lisa has a new problem: her mother. Kate returns after her release from prison. She’s looking for forgiveness from a daughter she’d abandoned and a husband she’d betrayed. Good luck with that. In this stunning sequel to The 13th Power Quest, humanity is at the mercy of technology, and a family’s love for each other is put to a brutal test."}, {"id": "B072M3W9MP", "genre": "Science Fiction & Fantasy", "title": "Undyed Nightmare: A Zombie Bedtime Story", "description": "After a chemical spill turned a whole town into zombies and soaked up all the colors it was up to a boy named Caleb to save the day. The town remained zombies but they figured out how to get by with a high protein diet and returned to normal as their color slowly returned. He will be called back again when a new monster moves into town and starts taking the colors back. With the help of his friends and trusty dog, Caleb will be hit close to home and find out how hard it is to defeat a nightmare. But will he stop the monster before all the color is gone?"}, {"id": "B073CJL2RP", "genre": "Science Fiction & Fantasy", "title": "100 Military Science Fiction Writing Prompts (Science Fiction Writing Series Book 8)", "description": "This book contains 100 military science fiction writing prompts. It is book 8 of a 14-part writing series, based on the science fiction sub-genres, featured in From Alien Invasion to Time Travel: 350 Science Fiction Writing Prompts.Prevent writer's block and stay inspired with 100 Military Science Fiction Writing Prompts. This book is perfect for writing contests, short story inspiration, writing groups, NaNoWriMo, writing workshops or to fuel creativity."}]