[{"id": "1588463753", "genre": "Science Fiction & Fantasy", "title": "Werewolf Signs of the Moon (World of Darkness (White Wolf Hardcover))", "description": "Chapters devoted to each of the five auspices: in-character artifacts, Gifts, rites, lodges and new Auspice Aspects. A Storytelling chapter dedicated to discussing how best to use auspice in your game from both a practical and theoretical perspective, as well as discussion on creating new auspices and new Gifts. A series of Storytelling Adventure System scenes meant to serve as “auspice challenges” – these scenes are bound to different auspices and can be dropped into your games to highlight the importance of one’s moon."}, {"id": "1555601723", "genre": "Science Fiction & Fantasy", "title": "Jade Falcon Sourcebook (Battletech No. 1644)", "description": "An overview of the deadly Jade Falcons, one of the premier Clans. Falcon history, culture, and military capabilities are explored. The Jade Falcon Sourcebook also includes profiles of prominent Clan personalities, information on four deadly new BattleMechs, an overview of Jade Falcon-occupied worlds, and eight full-color pages featuring renderings of Jade Falcon uniforms and examples of Clan camouflage."}, {"id": "B00T44NHYY", "genre": "Science Fiction & Fantasy", "title": "The Osiris String (A Sam Buckner Adventure Book 1)", "description": "You won't want to put this book down!  It will keep you wanting more!A young physicist discovers a cure for HIV. But, he is manipulated by a powerful Islamic organisation, determined to convert his invention into a weapon: one which will allow them to control and dominate world politics.World leaders are targeted, including the President of the United-States, and it's up to Sam Buckner, a researcher at the University of Toronto, Melinda Gordon, a beautiful agent at Homeland Security, and Agent Cohen, a tough Israeli Secret Service agent, to find the scientist and stop him from using his weapon."}, {"id": "0062110845", "genre": "Science Fiction & Fantasy", "title": "The Golem and the Jinni: A Novel (P.S.)", "description": "﻿In The Golem and the Jinni, a chance meeting between mythical beings takes readers on a dazzling journey through cultures in turn-of-the-century New York.Chava is a golem, a creature made of clay, brought to life to by a disgraced rabbi who dabbles in dark Kabbalistic magic and dies at sea on the voyage from Poland. Chava is unmoored and adrift as the ship arrives in New York harbor in 1899.Ahmad is a jinni, a being of fire born in the ancient Syrian desert, trapped in an old copper flask, and released in New York City, though still not entirely freeAhmad and Chava become unlikely friends and soul mates with a mystical connection. Marvelous and compulsively readable, Helene Wecker's debut novel The Golem and the Jinni weaves strands of Yiddish and Middle Eastern literature, historical fiction and magical fable, into a wondrously inventive and unforgettable tale."}, {"id": "0891415378", "genre": "Science Fiction & Fantasy", "title": "1901: A Novel", "description": "The year is 1901. Germany’s navy is the second largest in the world; their army, the most powerful. But with the exception of a small piece of Africa and a few minor islands in the Pacific, Germany is without an empire. Kaiser Wilhelm II demands that the United States surrender its newly acquired territories: Guam, Puerto Rico, Cuba, and the Philippines. President McKinley indignantly refuses, so with the honor and economic future of the Reich at stake, the Kaiser launches an invasion of the United States, striking first on Long Island. Now the Americans, with their army largely disbanded, must defend the homeland. When McKinley suffers a fatal heart attack, the new commander in chief, Theodore Roosevelt, rallies to the cause, along with Confederate general James Longstreet. From the burning of Manhattan to the climactic Battle of Danbury, American forces face Europe’s most potent war machine in a blazing contest of will against strength.From the Paperback edition."}]