[{"id": "1783123389", "genre": "Children's Books", "title": "2018 FIFA World Cup Russia™ Kids' Handbook", "description": "With its winning mix of facts and features, this official guide to the 2018 World Cup is a must-have for soccer-crazy kids!   When it comes to sports, nothing equals the World Cup—and young soccer fans will find a wealth of information about the event in this colorful, compact handbook hosted by Zabivaka, the mascot for the upcoming Russian games. Meet the super strikers and midfield masters, find out how many different prizes players can scoop up in Russia, learn about the different stadiums where the games will be played, fill in the progress chart, and get the best stats, puzzles, quick quizzes, photos, and reusable stickers. Though it’s small enough to pop in a backpack, The Official 2018 FIFA World Cup Russia™ Kids' Handbook delivers pages packed with entertainment!"}, {"id": "B00ADUKHY6", "genre": "Children's Books", "title": "Silly Goose's Big Story", "description": "Friends and imagination save the day  Goose's friends love the stories he makes up when they're playing. Except one thing - Goose is always the hero. And when they ask to take turns leading the fun, Goose doesn't agree. While they argue about it, no one notices the hungry wolf sneaking up on them until he shouts, \"Hello, Lunch!\"  This real-life danger shows Goose how silly he's been and that his friends make terrific heroes!  Always a surefire hit on laps or at storytime, Keiko Kasza's latest shows how imagination can come in handy in an unexpected way."}, {"id": "0756979331", "genre": "Children's Books", "title": "Mouse of the Year (Angelina Ballerina (8x8))", "description": "Angelina nominates Miss Lilly for Teacher of the Yearaand she wins! But Angelina isnat happy when Miss Lilly suddenly doesnat have time for her mouselings anymore. Can Miss Lilly fulfill all her duties as Teacher of the Year and still find time for Angelina?"}, {"id": "1492333190", "genre": "Children's Books", "title": "Baxter's Backyard", "description": "Baxter is sitting inside his doghouse when a bird comes along and tells him how amazing the world is beyond his backyard. Will Baxter leave his home? Will he find a way over the fence? Will the grass be greener on the other side?"}, {"id": "B007K81D60", "genre": "Children's Books", "title": "Lily Lemon Blossom Welcome to Lily's Room: (Kids Book, Picture Books, Ages 3-5, Preschool Books, Baby Books, Children's Bedtime Story)", "description": "Meet Lily Lemon Blossom, a delightful little girl who loves adventures and playing with her friends. Lily invites you to see her lovely room and meet her many friends, including Bunny Rabbit and Josephine her kitten who is always by her side. A quick peek into Lily's room will tell you quite a lot about her. The room comes alive with its vibrant colors and huggable plush toys. It's a happy place for a happy little girl and her friends."}]