[{"id": "1486713971", "genre": "Children's Books", "title": "Famous Americans (Do You Know About?)", "description": "America wouldn't be the amazing country it is today without the help of great Americans who followed their dreams and paved the way for the future. Learn about the individuals who played a role in shaping our country in this exciting title filled with facts, descriptions, and photos that depict the famous Americans we know and love."}, {"id": "098908020X", "genre": "Children's Books", "title": "The Great Penny Brigade", "description": "The Great Penny Brigade is a fun, light-hearted kids adventure story about getting, giving and sharing with others.   Come along on the journey as Jacob and his friends take a little bit of change and turn it into bucket loads of fun.   See how they find that they have the power to make a difference and that the best blessings come from sharing."}, {"id": "0859538486", "genre": "Children's Books", "title": "Mrs Honey's Tree (Life Skills and Responsibility)", "description": "Big Book edition of Mrs Honey's Tree, in which Mrs Honey is faced with a real dilemma; which is more important - a tree or a bus shelter? Mrs Honey's Tree encourages children to look closely at the local environment, where the choices we have to make are never quite as clear cut as they may at first seem."}, {"id": "0763687642", "genre": "Children's Books", "title": "Flora & Ulysses: The Illuminated Adventures", "description": "Now available in a digest paperback edition! The beloved 2014 Newbery Medal winner by former National Ambassador for Young People's Literature Kate DiCamillo.Holy unanticipated occurrences! From #1 New York Times best-selling author Kate DiCamillo comes a laugh-out-loud story filled with eccentric, endearing characters — a novel interspersed with comic-style graphic sequences and full-page illustrations, all rendered in black and white by K. G. Campbell."}, {"id": "1520709633", "genre": "Children's Books", "title": "Diary of a Villager Armorer: An Unofficial Minecraft Book", "description": "Ever heard the story of a Villager Armorer?     Experience the daily life of a very special Villager Armorer.  What kind of mischief will he get into?  Will he be able to protect his reputation?  This diary book is a great read or gift for a Minecraft lover of any age!"}]