[{"id": "0811873447", "genre": "Children's Books", "title": "Little Fish: Finger Puppet Book (Little Finger Puppet Board Books)", "description": "Kids will go crazy for these quirky books featuring lovable characters, bright and simple art, charming rhymed text, and best of all, adorable finger puppets! Each darling book has a permanently attached plush finger puppet and peek-a-boo holes in every page, presenting a super-fun way for parents and children to play and read together."}, {"id": "1580892175", "genre": "Children's Books", "title": "Family Pack", "description": "A real-life story of adaptation and survival. Acclaimed science writer Sandra Markle and celebrated artist Alan Marks team up for the fifth time in this fascinating real-life story of a wolf and her pack. Years ago, an effort had been made to eliminate wolves from Yellowstone National Park. Recently, conservationists decided to reintroduce the animal to the area, relocating wolves from Canada. Family Pack introduces readers to Female 7 and Male 2, the founders of the Leopold wolf pack—the first naturally formed pack after the relocation effort. Readers follow Female 7 as she sets out on her own upon her release to the 2.2-million-acre area that is Yellowstone. Without the comfort of her mother or other wolves, the young female grows and learns to feed, hunt, and survive in her new home. Eventually, she crosses paths with Male 2, and the wolves form a family of their own. Back matter includes more information about wolves, a bibliography, and an author’s note about the Leopold pack and the importance of reintroducing wolves to Yellowstone, restoring the natural balance."}, {"id": "151248251X", "genre": "Children's Books", "title": "School Buses on the Go (Bumba Books: Machines That Go)", "description": "Carefully leveled text and fresh, vibrant photos engage young readers in learning about how school buses work. Age-appropriate critical thinking questions and a photo glossary help build nonfiction learning skills."}, {"id": "0061718238", "genre": "Children's Books", "title": "Don't Know Much About the Presidents", "description": "Forty-four presidentsOne White HouseAnd hundreds of grand facts about our country’s leadersWhich president was also a movie star? (see page 56)What happened five days after the Union won the Civil War? (see page 28)What food did Americans think was poisonous until Thomas Jefferson ate some? (see page 12)Hail to the chief! Here’s your chance to learn all about the presidents’ important political achievements, their nicknames, hobbies—even what kind of foods they ate. Bestselling author Kenneth C. Davis packs fun facts and cool quotes into his signature question-and-answer format. Who knows? After you learn so much about the presidents, maybe you will want to run for office someday, too!"}, {"id": "0756954770", "genre": "Children's Books", "title": "Who Was Ronald Reagan?", "description": "From his childhood in rural Illinois to moviemaking days in Hollywood and on to a career in politics that took him all the way to the Oval Office, Ronald Reagan kept an abiding faith in America and in what our country stood for. The oldest president ever, he survived a near-fatal assassination attempt and lived to be 93. Who Was Ronald Reagan? covers his life and times in a balanced, entertaining way for children. More than 100 black-and-white illustrations fill out the portrait of our fortieth president."}]