[{"id": "B0089MZ09M", "genre": "Science Fiction & Fantasy", "title": "Vitalis", "description": "Vitalis Omnibus contains seven novellas that launch the futuristic science fiction series, VitalisFollow the group of brave survivors as they fight to survive pirates and hostile alien life on an undiscovered planet beyond the fringes of human controlled space. They must not only learn to adapt and survive the deadly threats of Vitalis, but learn to work with each other and protect their interests against the off-planet humans that seek to plunder Vitalis for their own interests regardless of the costs.Look for these other Vitalis books:Book 1 - Vitalis Omnibus (a collection of 7 novellas)Book 2 - Vitalis: ResurrectionBook 3 - Vitalis: ProvenanceBook 4 - Vitalis: GenesisBook 5 - Vitalis: InvasionBook 6 - Vitalis: ChrysalisBook 7 - Vitalis: Communion"}, {"id": "0786965916", "genre": "Science Fiction & Fantasy", "title": "Maestro: Homecoming, Book II", "description": "Something terrible, unspeakable, immense, has come to Menzoberranzan and is leaving death and destruction in its wake. The primordial of Gauntlgrym stirs, sending Cattie-brie and Gromph to Luskan, and the ruins of the only power that can keep the beast in check. The damage of the Darkening, of war, and of a demon-ravaged Underdark has sent cracks out across the North. Some of this damage may never be repaired. And Drizzt is going home. But not to Mithral Hall. Not to Icewind Dale. He’s going to Menzoberranzan. Bruenor is ready to march with him bringing along an army of dwarves to end the scourge of Menzoberranzan, but Drizzt needs to see what’s happening there. The dwarf army may not be necessary. The City of Spiders might already have fallen to the demons and their wicked prince. But even if that’s true, what’s to say the demons will stop there? Maestro picks up where Archmage left off, plunging Drizzt into his most dangerous adventure yet, and with all the action, adventure, beloved characters, dark elves, monsters, and demon princes Drizzt fans adore. "}, {"id": "B01HU35OGO", "genre": "Science Fiction & Fantasy", "title": "The Afterlife of Alyx & Israel: A Dark Angel Novel", "description": "Her only hope is a man she doesn't remember...In their new mortal lives, Alyx & Israel don't remember anything about their supernatural past or each other.When Alyx becomes trapped in a coma deep within a DreamScape maze city, the only one who can help her escape is Israel. They need to find a mysterious Mapmaker and solve his riddle. But is this Mapmaker hiding something?Although this book is set in the Dark Angel world, it can be read as a standalone."}, {"id": "1849709661", "genre": "Science Fiction & Fantasy", "title": "Hereticus (Eisenhorn)", "description": "Part three of the epic Eisenhorn trilogy returnsHunted by his former allies as a radical and enemy of the Imperium, Inquisitor Gregor Eisenhorn must fight to prove that he remains loyal as he tracks down a dangerous heretic whom the Inquisition believes dead – the dread former Inquisitor Quixos. As he grows more desperate for victory, Eisenhorn uses ever darker means to achieve his goals – but how far can he go using the weapons of the enemy until he becomes that very enemy – and no different to the traitor he hunts?"}, {"id": "B00DDUBR60", "genre": "Science Fiction & Fantasy", "title": "101", "description": "Mark Quincy Jr., a man recently married to his dear wife, Carol, finds himself delving into an adventure unlike anything he could have ever imagined when his uncle visits him in his home in Princeton bearing news that his father is still alive, trapped in an alternate reality.Torn between his love for his wife and his care for his father, Mark delves into the peculiar new world hidden in the darkness of the universe.But he has no idea what he's getting into.  Something is going on in the alternate reality, a snare not visible to the eye, that traps and consumes men.  What Mark believes to be a quick rescue mission, quickly becomes much more than that, transforming him into something far more, a digit.101."}]