[{"id": "1582461104", "genre": "Children's Books", "title": "1: Rare Beasts (EDGAR AND ELLEN)", "description": "The sinister siblings, twins Edgar and Ellen, kidnap the pets of Nod's Limb's youngest citizens and turn them into \"rare beasts\" in hopes of making money to finance future pranks. 25,000 first printing."}, {"id": "B06Y5V6F74", "genre": "Children's Books", "title": "Children's Book: The Donut Thief [Bedtime Stories for Kids]", "description": "Children's Book: The Donut ThiefBedtime Stories for KidsSammy can't wait to eat the donut on the kitchen table. But there is one big problem...someone has already taken it. Will we find out who the donut thief is? Read along and help Sammy solve the case of the missing donut!This is a read aloud kids book and is easy to read. The target age range audience is for toddlers, preschool and young children. The Donut Thief is a book that any child will love, especially at bedtime. This book is suitable for parents to read to their children. Grandparents will definitely enjoy reading this book to their grandchildren. Read this children's book FREE as part of your PRIME or Kindle Unlimited membership!"}, {"id": "B074RBZ346", "genre": "Children's Books", "title": "Percy Jackson and the Singer of Apollo (Trials of Apollo)", "description": "The trouble starts when Apollo introduces Percy and his friend Grover the satyr to the Chryseae Celedones. Three golden women--living statues--appear in front of them, and sing one blissful chord. Apollo has a concert tonight at Mount Olympus, and he needs the Celedones as his backup singers. But there should be a quartet, not a trio--one of the singers has gone rogue. It's up to Percy and Grover to find the missing Celedon somewhere in New York City before she causes any problems. Capturing an attention-seeking automaton in a crowd of mortals is going to require some cagey thinking. Will Percy and Grover succeed, or hit a sour note?"}, {"id": "1400138892", "genre": "Children's Books", "title": "A Little Princess, with eBook (Tantor Unabridged Classics)", "description": "Sara Crewe is a gifted and well-mannered child, and Captain Crewe, her father, is an extraordinarily wealthy man. So Miss Minchin, headmistress of Sara's new boarding school in London, is pleased to treat Sara as her star pupil-a pampered little princess. But one dreadful day, Sara's father dies, and her world suddenly collapses around her. All of her lovely things are taken from her, and she is forbidden to associate with her friends. Miss Minchin can now show her greedy and mean-spirited nature to its fullest. The little princess is reduced to a shabby drudge. But Sara does not break, and with the help of a monkey, an Indian lascar, and the strange, ailing gentleman next door, she not only survives her sufferings but helps those around her."}, {"id": "0756941636", "genre": "Children's Books", "title": "Harry Potter and the Order of the Phoenix", "description": "The book that took the world by storm....In his fifth year at Hogwart's, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be- Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the keeper of the Gryffindor Quidditch Team. Along the way he learns about the strength of his friends, the fierceness of his enemies, and the meaning of sacrifice."}]