[{"id": "0843108533", "genre": "Children's Books", "title": "School Rules! Mad Libs Junior", "description": "From the moment the school bell rings in the morning to the end of the day, when it's time for homework and after-school snacks, School Rules! Mad Libs JuniorTM is perfect for every student!"}, {"id": "B00KK6BJB8", "genre": "Children's Books", "title": "Mary Tudor \"Bloody Mary\" (The Thinking Girl's Treasury of Dastardly Dames)", "description": "The first reigning Queen of England, Mary Tudor believed fervently that Catholicism should be the religion of the land, leading her to burn at the stake hundreds of Protestants. Was she just a ruler of her times, or did she deserve the name, Bloody Mary?Gorgeous illustrations and an intelligent, evocative story bring to life a real dastardly dame who, fueled by her faith, created a religious firestorm."}, {"id": "0746006969", "genre": "Children's Books", "title": "Science With Light and Mirrors (Science Activities)", "description": "A further title in the SCIENCE ACTIVITIES series which looks at basic scientific principles with safe experiments, games and full colour pictures. Also available in paperback priced at 1.75, ISBN 0 7460 0696 9."}, {"id": "1486704344", "genre": "Children's Books", "title": "The Story of Creation (5 Minute Bible Stories)", "description": "Children who are read to are inspired to read, so sit down with a 5 Minute Bible Story and enrich your child's mind as you build lifelong love for reading the bible. We cannot guarantee your 5 Minute Bible time will not turn into 10, 15, or 30 minutes while you explore the message of these stories together."}, {"id": "B00LVJTWQM", "genre": "Children's Books", "title": "Grasshopper Madness: 29 Amazing Facts About the Leaping Insects", "description": "Grasshoppers are found all over North America and around the world. The small insect might look easy to catch, but they are quick with strong legs that can jump long distances. In “Grasshopper Madness: 29 Amazing Facts About the Leaping Insects,” kids will get the change to learn about these amazing insects.** Amazon Prime Members can borrow this book for FREE! **Complete with FULL COLOR pictures, the grasshoppers can be seen in detail and the kids learn how the grasshoppers live. Details about the grasshoppers include:* How grasshoppers adapt* Where grasshoppers can be found* How grasshoppers eat* And MoreWhy do I love grasshoppers? These curious creatures eat half of their body weight every day and can move miles to find dinner. With five eyes and amazing jumping ability, the grasshoppers amazing insects. In this book, “Grasshopper Madness: 29 Amazing Facts About the Leaping Insects” I share my interest with kids of all ages.The kids will love the details they learn about grasshoppers."}]