[{"id": "1515742490", "genre": "Children's Books", "title": "Ancient Egypt: An Interactive History Adventure (You Choose: Historical Eras)", "description": "Delve into fascinating time periods! This series allows readers to explore different times and places in history from different perspectives. The narrative format, suspenseful action, and path navigation keep readers reading!"}, {"id": "0735821410", "genre": "Children's Books", "title": "Andersen's Fairy Tales", "description": "From well-known classics like The Little Match Girl and The Emperor's New Clothes, to fairytale treasures yet to be discovered, Silke Leffler's enchanting illustrations capture the time-less magic of Andersen's tales. The scope of this edition makes it a must-have for any collection of fairy tales. Silke Leffler's unique artwork brings a new perspective to the works of this storytelling genius. The gold foil on the jacket gives the book that extra appeal. Leffler's illustrations and the overall beauty of the book design make this especially appropriate for the gift market at the Holiday season."}, {"id": "B0037HOLRG", "genre": "Children's Books", "title": "Sniff! Sniff! (Miss Rhonda's Readers Set ONE)", "description": "Beginning Reader Featuring Phonetically Correct Words and Fun, Child-Friendly PlotsRhonda Lucadamo, a certified AMI Montessori teacher, discovered in the classroom that children had the most success when first given realistic stories to read. So Rhonda penned some for her youngest readers. Each book contained phonetic words so children could sound out complete sentences. The children's accomplishment was immediate! They laughed, asked questions and reacted to each story. But most importantly, they read. And then they picked up another book, and another, and another.Seven other books are available from Miss Rhonda's Readers Set ONE."}, {"id": "0316776238", "genre": "Children's Books", "title": "Hanukkah!", "description": "Now available in board book form, this classic follows the life of one family during a night of Hanukkah, from the eating of the latkes to the lighting of the menorah. Full color. 11 spreads."}, {"id": "0756556945", "genre": "Children's Books", "title": "The Split History of the D-Day Invasion: A Perspectives Flip Book (Perspectives Flip Books: Famous Battles)", "description": "Every battle has two sides, and the D-Day Invasion during World War II is no different. Experience the event from perspecitve of the Allies, and then read the perspective of the Germans. A deeper understanding of the battle from both sides will give readers a clearer view of this historic event."}]