[{"id": "1499805837", "genre": "Children's Books", "title": "#4: Trick or Cheat? (The Alien Next Door)", "description": "In the fourth book of the Alien Next Door series, Halloween is just around the corner, and Harris is excited to share the holiday with Zeke, who doesn't even need a costume!Harris is ready for Halloween and is very excited when he sees Zeke's \"costume,\" which is just his true alien form. Harris is sure Zeke will win the costume contest at school! Zeke also uses his powers to help Harris make the best costume he's ever had, but Roxy feels left out, as she and Harris usually make costumes together every year.  On Halloween, one of the other kids at school is jealous of Zeke's amazing costume and plots to sabotage it. Will Harris and Roxy be able to stop him and help Zeke win the costume contest?"}, {"id": "B01K2IBM7Y", "genre": "Children's Books", "title": "Shelter Friends Summer Camp 2016: Week 3 (Elementary School)", "description": "Imagine a book filled with stories and poems written by kids who love animals. Writing gives us the chance to use our imagination, to be creative, to explore our deepest thoughts and feelings, and to discover the gifts and talents we have inside.Pet Alliance of Greater Orlando is proud to present original works that showcase how young authors view the world around them. The writings and artwork are truly from the heart and strive to portray the hands-on experiences with shelter pets and knowledge gained during Shelter Friends Summer Camps. You will not find these imaginative and creative ideas anywhere else.Pet Alliance of Greater Orlando educates, shelters, places, and heals pets and their families with compassionate, responsible care maintained to the highest professional standards. We create more caring communities by promoting happier, healthier pets and their families."}, {"id": "B005MSOLTQ", "genre": "Children's Books", "title": "The Animal Seeker", "description": "Ten-year-old Tommy Williams and his dog, Nept, love to explore the lush woodlands they call home. The forest is their wonderland, filled with amazing animals and fantastic nooks and crannies and things to see. Usually, it is a peaceful place, but lately, something seems to be amiss. Odd lights and weird noises have been waking them up at night, and the animals have been behaving strangely, clearly upset about something.Together, Tommy and Nept decide to get to the bottom of the mysterious happenings in the woodlands, but they aren’t sure if they are prepared for what they might encounter. There is danger in the air, and the two of them are about to embark on an adventure that will lead them not only deep into the forest, but far into outer space as well! In their wildest canine and boyhood dreams, neither could have ever imagined what they are about to find out, the truth about their world and worlds beyond and how all of it, in a unique and wonderful way, links together!"}, {"id": "0590975854", "genre": "Children's Books", "title": "Fire (Scholastic Reference)", "description": "Presents the work done by fire fighters, including the equipment they use, the fires they fight, the rescues and investigations they perform, and the history and future of fire fighting"}, {"id": "B008M6L396", "genre": "Children's Books", "title": "Miss Courting – The Perfect Love Match (Singles Street Life)", "description": "Miss Courting epitomises the woman who has made a decision to get married God’s way. Her story demonstrates you can have the perfect love match.Learn more about what makes her tick in this book, her background her love languages and how she would relate in a relationship. About The Author ...Ade D'Almeida is passionate about encouraging those who are single to enjoy and maximise life. With a mix of humour and straight talk she provides insights, tips, advice on dating, courtship, relationships and marriage. Single for many years herself until she married in her 40s she feels qualified to talk about the highs and lows of single life.  Her life is a testimony of how to break free from the negative perceptions and views singles often have to face as they just get on with everyday life. Her articles and books truly inspire."}]