[{"id": "0786927089", "genre": "Science Fiction & Fantasy", "title": "Dragons of Summer Flame", "description": "The War of the Lance is long over. The seasons come and go as the pendulum of the world swings. Now it is summer, a hot parched summer such as no one on Krynn has ever known. And an uneasy balance light and dark begins to shift. Distraught by a grievous loss, the young mage Palin Majere seeks to enter the Abyss in search of his lost uncle, the infamous archmage Raistlin. Elsewhere, the Dark Queen has found new champions. Devoted followers, loyal to the death, the Knights of Takhisis follow the her vision to victory. And a dark paladin, Steel Brightblade, rides to attack the High Clerist’s Tower, the fortress his father died defending. And on a small Island, the mysterious Irda capture an ancient artifact and use it to ensure their own safety. Usha, the child of the Irda, arrives in Palanthas claiming that she is Raistlin’s daughter.  The summer will be deadly. But for whom, only the swing of the pendulum will tell."}, {"id": "0786948671", "genre": "Science Fiction & Fantasy", "title": "Dungeons & Dragons Player's Handbook: Arcane, Divine, and Martial Heroes (Roleplaying Game Core Rules)", "description": "The first of three core rulebooks for the 4th Edition Dungeons & Dragons® Roleplaying Game.The Dungeons & Dragons Roleplaying Game has defined the medieval fantasy genre and the tabletop RPG industry for more than 30 years. In the D&D game, players create characters that band together to explore dungeons, slay monsters, and find treasure. The 4th Edition D&D rules offer the best possible play experience by presenting exciting character options, an elegant and robust rules system, and handy storytelling tools for the Dungeon Master.The Player's Handbook presents the official Dungeons & Dragons Roleplaying Game rules as well as everything a player needs to create D&D characters worthy of song and legend: new character races, base classes, paragon paths, epic destinies, powers, more magic items, weapons, armor, and much more."}, {"id": "B077BWM3GJ", "genre": "Science Fiction & Fantasy", "title": "Syndicate Wars: Boxset 1-3 (A Space Opera Fantasy)", "description": "When an alien horde uses time loops to manipulate and enslave humanity, a Marine and her daughter are earth's best chance for survival.  Quinn was a Marine sergeant hell-bent on ensuring that her young daughter had a world to grow up in. Now that an alien armada known as the Syndicate has invaded, that seems like a distant dream that will never be realized. But rather than accepting that the world she wanted was over, Quinn organizes a ragtag group of Marines and resistance fighters who take the fight to the aliens, even as they discover that things are not as they appear to be.    The world is on fire and Quinn and her small band of freedom fighters are the extinguisher.  The alien invasion is over and an occupation has begun. Trying to reach her mother, Quinn’s daughter, Samantha, has been stranded in a no-man’s land of shattered cities, broken dreams, and refugees. Already wise beyond her years, Samantha is forced to grow up quickly in the face of numerous life-or-death encounters, and soon links up with another group of guerrilla fighters to kick some serious alien butt.It’s not a matter of if mother and daughter's worlds will collide, but when … and once they do, the revolt against the alien invaders will never be the same. The Syndicate leader, known as the Potentate, watches over everything, biding his time, working feverishly to manipulate the actions of Quinn and the others in the present and in past loops of time. Quinn and her daughter must stop the Syndicate by any means necessary, even if that includes magic and time travel.  Get ready for the thrill ride of a lifetime, because it's going to get bloody messy.Now available from Podium in Audiobook, narrated by Allyson Johnson! http://adbl.co/2AW3gTP "}, {"id": "0062275518", "genre": "Science Fiction & Fantasy", "title": "Feet of Clay", "description": "It's murder in Discworld!—which ordinarily is no big deal. But what bothers Watch Commander Sir Sam Vimes is that the unusual deaths of three elderly Ankh-Morporkians do not bear the clean, efficient marks of the Assassins' Guild. An apparent lack of any motive is also quite troubling. All Vimes has are some tracks of white clay and more of those bothersome \"clue\" things that only serve to muck up an investigation. The anger of a fearful populace is already being dangerously channeled toward the city's small community of golems—the mindless, absurdly industrious creatures of baked clay, who can occasionally be found toiling in the city's factories. And certain highly placed personages are using the unrest as an excuse to resurrect a monarchy—which would be bad enough even if the \"king\" they were grooming wasn't as empty-headed as your typical animated pottery."}, {"id": "B01D6SPARK", "genre": "Science Fiction & Fantasy", "title": "Blackmark (The Kingsmen Chronicles #1): An Epic Fantasy Adventure", "description": "“Like George RR Martin and Joe Abercrombie, Carlson writes in this genre for grown-ups, with flair and elegance. A complex world with characters that develop well, this story reveals as it builds!” - Daniel F., Amazon Review\"Smart epic fantasy! If you loved Wheel of Time or Game of Thrones you should give this a shot.\" – Anders C., Amazon Review“Blackmark is spellbinding! Strong development of characters, fully integrated storylines with intriguing plot twists, and deep world building. Takes you on a journey you never want to leave!” – Michelle G., Amazon Review Wrongfully accused of treason, veteran Kingsman Elohl seeks the truth of a betrayal that caused the Kingsmen to vanish a decade ago. Inked with the Blackmark and despised for it, Elohl uncovers the truth and exposes ancient enemies. Now, he must give everything to shatter the hidden sect that usurps power from the throne. A bloody war will be reaped in the shadows, that will burn nations and bring kings to their knees. This dark and gritty sword and sorcery series from award winning author Jean Lowe Carlson explores a complex world of treachery, passion, sex, and magic. Readers who enjoy George RR Martin's A Game of Thrones, Diana Gabaldon's Outlander, Patrick Rothfuss' Kingkiller Chronicles, or Robert Jordan's The Wheel of Time will love this fantastic adventure."}]