[{"id": "1521328986", "genre": "Children's Books", "title": "101 Facts...Steve Jobs: 101 Facts About Steve Jobs You Probably Never Knew (facts101)", "description": "After Reading this, your view on Steve Jobs will never be the Same Again!  101 Shocking and Amazing Facts about Steve Jobs that will leave you Saying Whaaaaaaaaaa?!   Spend a little time this year-end holiday to unravel this collection of 101 Facts about the late Steve Jobs and Discover some new & shocking facts about Steve. This could help you start an interesting conversation with Anyone!    CLICK to LOOK INSIDE! and see some of the facts for yourself....Download it Now!"}, {"id": "1589977718", "genre": "Children's Books", "title": "A Call to Something More (Adventures in Odyssey)", "description": "Life is full of surprises―some that are welcome, some that aren’t. A trip in the Imagination Station is usually fun, but three generations from the Parker family are surprised to find that it can be life-changing, too. And who doesn’t love the circus, especially when it involves solving a mystery behind sabotage and betrayal? And Connie’s life is turned upside-down by an unexpected phone call, triggering major changes for everyone around her. In laughter or tears, you can count on the gang at Whit’s End to make life’s surprises fun, exciting, touching, and rich with lessons from God.Episodes include: Life Expectancy (Parts 1-3), Your Servant Is Listening (Parts 1-2), The Friend Formula, No Chemistry Whatsoever, More Than a Feeling, Repent after Me."}, {"id": "1403442010", "genre": "Children's Books", "title": "Meriwether Lewis (American Lives)", "description": "Meriwether Lewis was secretary to a president, an expedition leader, a governor, and a frontiersman. Can you imagine what his life must have been like? Read this book in the American Lives series to get to know Meriwether Lewis."}, {"id": "0547243006", "genre": "Children's Books", "title": "Curious George at the Park (CGTV Touch-and-Feel Board Book)", "description": "There are so many fun things for Curious George to do at the park: see his animal friends, admire the trees and flowers, fly a kite, play soccer, and—his favorite one of all—have a picnic!The varied touch-and-feel materials—which include soft bunny fur, bumpy tree bark, shiny kite material, a rubbery soccer ball, and patterned blanket fabric—help young readers experience and enjoy all that the park has to offer through the curious eyes of everyone’s favorite little monkey."}, {"id": "B01JYX0N0A", "genre": "Children's Books", "title": "Marty Pants #1: Do Not Open!", "description": "“Funny and engaging. Marty Pants is a surefire hit!”—Lincoln Peirce, author of the Big Nate seriesMove over, Wimpy Kid. Here comes the imaginative, the inquisitive, the unstoppable Marty Pants!Marty Pants is different from your typical middle schooler. He has the soul of an artist, and as an artist, he notices things–except when he doesn’t.When Marty discovers a note suggesting an alien is watching him, this is something he can’t ignore. But no one, not his friends, his family, his arch-enemy, nor the chief of police, can see what he sees. So, it’s up to Marty to save the world—his way!This hilarious new series follows the endearing, frazzled, embarrassed, and ultimately fearless footsteps of literature’s most unlikely hero: Marty Pants. "}]