[{"id": "0375859624", "genre": "Children's Books", "title": "SquaredyPants! (SpongeBob SquarePants) (3-D Book)", "description": "Take a walk on Bikini Bottom's spooky side as Nickelodeon's SpongeBob SquarePants, Patrick, and Squidward jump off the oversized pages of this 3-D activity book. The eye-popping art brings fans face to face with monsters, vampires, and other things that go splash in the night—and two pairs of glasses are included so kids can share the scares with a friend!"}, {"id": "B008NWB5GA", "genre": "Children's Books", "title": "Our Island Story, A History of England for Boys and Girls(Illustrated)", "description": "Our Island Story(Color Illustrated and Free Audiobook Link) was first published in 1905 and became an instant classic. Beginning with the Romans and following the triumphs and foibles of the good, not so good and the downright despicable figures of history; we are treated to a dazzling montage of kings, queens, barons, knights, explorers, movers and shakers that have played a key role in the history of England. Marshall freely mixes folk tale with historical fact and in so doing paints a very vivid picture of the past in a style reminiscent of all that is finest in the children’s story telling tradition.This is the first section of that work and will carry you from the time when Tacitus first sang the praises of Britannica to his Roman readers up to the vicious and bloodthirsty confusion that is the War of the Roses (about 1500 years)."}, {"id": "0544320239", "genre": "Children's Books", "title": "The Story of Seeds: From Mendel's Garden to Your Plate, and How There's More of Less to Eat Around the World", "description": "Something as small as a seed can have a worldwide impact. Did you know there are top-secret seed vaults hidden throughout the world? And once a seed disappears, that’s it—it’s gone forever? With the growth of genetically modified foods, the use of many seeds is dwindling—of 80,000 edible plants, only about 150 are being cultivated. With a global cast of men and women, scientists and laypeople, and photographic documentation, Nancy Castaldo chronicles where our food comes from, and more importantly, where it is going as she digs deeper into the importance of seeds in our world. This empowering book also calls young adult readers to action with suggestions as to how they can preserve the variety of one of our most valuable food sources through simple everyday actions. Readers of Michael Pollen will enjoy the depth and fascinatingly intricate social economy of seeds."}, {"id": "073771204X", "genre": "Children's Books", "title": "China (Nations in Transition (Greenhaven))", "description": "A crumbling empire a hundred years ago, China entered the twenty-first century a major world power. This book traces China's efforts to implement pragmatic economic and political reforms while the nation remains true to its revolutionary ideals."}, {"id": "1847159184", "genre": "Children's Books", "title": "The Rescued Kitten (Holly Webb Animal Stories)", "description": "Edie and her friend Tayla are on their way home from school when they discover a tiny ginger kitten caught up in some barbed wire. She looks weak and has a cut on her leg from the wire, so they rush her home to Edie's mum, a vet. Edie's mum isn't sure that the little kitten is going to make it, as she's too small to have been separated from her mother and needs bottle-feeding round the clock. But Edie is determined to nurse Barbie back to health and find out what has happened to the rest of the kittens in the litter and their mum. What if they're in danger, too?"}]