[{"id": "0750221690", "genre": "Children's Books", "title": "Israel and the Arab Nations in Conflict (New Perspectives Series)", "description": "The conflict described in this book has involved most countries in the Middle East and has influenced international politics. But at its centre is Palestine. This book explains the story of Palestine from ancient times to the setting up of the state of Israel in 1948 to the formation of the PLO."}, {"id": "0375841970", "genre": "Children's Books", "title": "The Great and Only Barnum: The Tremendous, Stupendous Life of Showman P. T. Barnum", "description": "Step right up! Meet the astounding . . . the amazing . . . P. T. Barnum!  The award-winning author of The Lincolns: A Scrapbook Look at Abraham and Mary, Amelia Lost, and Our Eleanor brings us the larger-than-life biography of showman P. T. Barnum. Known far and wide for his jumbo elephants, midgets, and three-ring circuses, here’ s a complete and captivating look at the man behind the Greatest Show on Earth. Readers can visit Barnum’s American Museum; meet Tom Thumb, the miniature man (only 39 inches tall) and his tinier bride (32 inches); experience the thrill Barnum must have felt when, at age 60, he joined the circus; and discover Barnum’s legacy to the 19th century and beyond. Drawing on old circus posters, photographs, etchings, ticket stubs—and with incredible decorative art by Ray Fenwick—this book presents history as it’s never been experienced before—a show-stopping event!"}, {"id": "055353341X", "genre": "Children's Books", "title": "10 Busy Brooms", "description": "Celebrate Halloween with this bright and adventurous picture book!Fans of Room on the Broom will want to fly the night sky with these ten little witches in this fun and festive Halloween counting book! Whether zooming past rattling skeletons, buzzing by pie-stealing mummies, or soaring over a werewolf with bad breath, readers will be cheering for this exciting group of witches and their high-flying Halloween adventures! Plus, play a game of I Spy and find the cat and owl on every page!\"An enjoyable celebration of witchy sisterhood.\" - Publisher's Weekly \"Bright and cheerful.\" - School Library Journal"}, {"id": "B01J6Z072A", "genre": "Children's Books", "title": "Buds and Blossoms of Childish Life (Illustrated, Annotated) (Treasured Illustrated Classics Book 9)", "description": "Thirty-two illustrations in color.Detailed Illustrator’s biography with photo, with more published works listed.Punctuation added for easy reading.A Reading level of 9.6 due to German and Dutch words, also the antiquated language within.Nursery Rhymes with family life values. See several children, both boys and girls, deal with everyday life in a rhyming relaxed atmosphere."}, {"id": "1684010144", "genre": "Children's Books", "title": "Glory Days Press Sports Biographies: David Ortiz", "description": "David Ortiz is one of the best hitters in MLB history. Signed by the Seattle Mariners in 1992, he continued his career with the Minnesota Twins and then became an unstoppable designated hitter for the Boston Red Sox. Read more about his baseball story and how he became one of Boston's most beloved players."}]