[{"id": "1613830742", "genre": "Children's Books", "title": "Adventures in Cartooning", "description": "The magic cartooning elf is back--along with the Knight, Edward the hungry horse, and a whole new cast of charming characters! And this time, readers can join in the fun--right IN the book! ALA Notable Children's Book Adventures in Cartooning was called \"the best book of the year,\" in a starred review in Booklist, and was named a School Library Journal Best Book of the Year. Building on the basic lessons presented in Adventures in Cartooning, this activity book leads kids through a story that they help tell by doodling and completing comics activities. And at the end, readers are invited to make their own comic book story!"}, {"id": "1430064552", "genre": "Children's Books", "title": "Zip for Kids: Jesus Is ... Preschool", "description": "Zip for Kids: Jesus Is … Preschool includes all resources needed to create a customized Preschool event for summer Wednesday nights, day camp, or VBS. "}, {"id": "1591870275", "genre": "Children's Books", "title": "Dale Earnhardt, Jr: Tragedy and Triumph (The World of Nascar)", "description": "A biography of the NASCAR driver who is the son of another winning racecar driver, Dale Earnhardt, Sr."}, {"id": "0735841985", "genre": "Children's Books", "title": "ABC of Fantastic Princes", "description": "An alphabet of pioneering princes—from A to Z—by the acclaimed Austrian designer Willy Puchner Meet the princes from A to Z. Some are ambitious, some bold, some daring and dashing . . . but each of the twenty-six frogs are striking in character and charm and come bearing extraordinary gifts and talents. Puchner’s opulent and incomparable illustrations make this abecedary a marvel for all ages."}, {"id": "1404812970", "genre": "Children's Books", "title": "The Actor, the Rebel, and the Wrinkled Queen (Read-It! Chapter Books: Historical Tales)", "description": "A young actor at the Globe Theatre must defend his master when Queen Elizabeth suspects that Shakespeare tried to help the Earl of Essex overthrow her."}]