[{"id": "B06ZZHSD1N", "genre": "Children's Books", "title": "A Home for Bessie", "description": "The story of a girl going through the foster system looking for a home but also building ones for her companion doll.  50% of the profits of this book will go towards foster agencies, though a decision has not been reached on local, national, or global agencies.  Your support is very much appreciated!"}, {"id": "1515738736", "genre": "Children's Books", "title": "The Iroquois: The Six Nations Confederacy (American Indian Nations)", "description": "Provides an overview of the past and present lives of the Iroquois Native Americans of New York and Ontario, tracing their customs, family life, history, culture, and government."}, {"id": "B0725XJPRM", "genre": "Children's Books", "title": "Box Set of Fun Books for Kids: Riddles, Tongue Twisters and Jokes for the Whole Family", "description": "Collection of Seven Fun Books for ChildrenThis fun packed Box Set is a collection of seven children’s books by the author in one easy set. The purpose of these books is to encourage children to read and engage with the family and their friends.The books are jokes and puzzles for an age range of 6 upwards and are full of jokes and riddles that generations of children have enjoyed. It is fun for all the family and will keep children amused on long journeys or on holidays. The book is a fun way to get children reading and is a book children will love..The books contained in this set are available individually through the links below and make ideal gifts for children.The final book, The Best Jokes Book For Kids, is an amalgam of the other books with some additional material."}, {"id": "0435688421", "genre": "Children's Books", "title": "Supported Learning in Physics Project: Physics Of Flow", "description": "Built around the common core of physics A Level syllabuses this book, which is one of a series of eight titles, covers all the compulsory content with the aim of promoting independent learning for post-16 students."}, {"id": "1760360481", "genre": "Children's Books", "title": "Brown Bear Can't Sleep", "description": "It is the coldest day of winter, and most of the animals have gone to bed. But Brown Bear can't fall asleep. He wants to go outside, but he needs a disguise so the cold-loving animals won't recognize and ridicule him. But to look like a polar bear, he needs lots and lots of white wool. And for lots of wool, Brown Bear needs lots and lots of sheep. So, Brown Bear starts calculating how many sheep he will need... Will his sweater plan succeed?"}]