[{"id": "1477810544", "genre": "Children's Books", "title": "Sneezy the Snowman", "description": "B-R-R-R-R! AH-CHOO! Sneezy the Snowman is cold, cold, cold. To warm up, he drinks cocoa, sits in a hot tub, stands near a warm fire–and melts! But the children know just what to do to build him up again–and make him feel \"just right\". Hilarity chills the air with playful mixed-media illustrations by Stephen Gilpin as Sneezy attempts to warm himself with some silly results."}, {"id": "1878668234", "genre": "Children's Books", "title": "Coming to America A new life in a new land  (Perspectives on History series)", "description": "Compelling firsthand accounts and primary source U.S. history documents underpin History Compass'  popular Perspectives on History series. Excerpts from the diaries and letters of young people and adults, along with historic photographs and poems, depict immigrants from Russia, Lithuania, Italy, Greece, Sweden, and Ireland who passed through Ellis Island at the turn of the turn of the century."}, {"id": "0195218507", "genre": "Children's Books", "title": "The Mystery of the Hieroglyphs: The Story of the Rosetta Stone and the Race to Decipher Egyptian Hieroglyphs", "description": "For more than 15 centuries, no one could read the strange-looking Egyptian hieroglyphs. And then in 1799 a French soldier in Napoleon's army in Egypt stumbled across the Rosetta Stone, an ancient inscription recorded in Greek, hieroglyphs, and demotic script. Many of the brightest scholars of the time--Egyptologists, historians, and linguists--as well as detectives, professional code breakers, and plain amateurs, all set out to decipher the forgotten words. Carol Donoughue tells us the fascinating story of the hieroglyphs and the race to decipher them, explaining how this curious writing system began with simple drawings of everyday objects. She compares the hieroglyphic system to modern alphabets in an entertaining narrative complemented with numerous photographs and drawings, maps, historical timelines stretching from ancient Egypt to Napoleon, a glossary, and numerous sidebars. The book culminates in an edge-of-your-seat description of how the brilliant French archaeologist Champollion finally succeeded in deciphering the hieroglyphs. A final section displays an alphabet of \"hieroglyphs\" and offers some fun activities for children based on hieroglyphic writing."}, {"id": "1783446730", "genre": "Children's Books", "title": "Things a Bright Girl Can Do", "description": "Through rallies and marches, in polite drawing rooms and freezing prison cells and the poverty-stricken slums of the East End, three courageous young women join the fight for the vote. Evelyn is seventeen, and though she is rich and clever, she may never be allowed to follow her older brother to university. Enraged that she is expected to marry her childhood sweetheart rather than be educated, she joins the Suffragettes, and vows to pay the ultimate price for women's freedom. May is fifteen, and already sworn to the cause, though she and her fellow Suffragists refuse violence. When she meets Nell, a girl who's grown up in hardship, she sees a kindred spirit. Together and in love, the two girls start to dream of a world where all kinds of women have their place. But the fight for freedom will challenge Evelyn, May and Nell more than they ever could believe. As war looms, just how much are they willing to sacrifice?"}, {"id": "0241340985", "genre": "Children's Books", "title": "Ladybird Readers BBC Earth multi-copy Pack", "description": "Ladybird Readers is a graded reading series of traditional tales, popular characters, modern stories, and non-fiction, written for young learners of English as a foreign or second language. Recommended for children aged 5+, the four levels of Readers and Activity Books follow the CEFR framework (Pre-A1 to A2) and include language activities that help develop key skills and provide preparation for the Cambridge English: Young Learners (YLE) Starters, Movers and Flyers exams.The Ladybird Readers BBC Earth multi-copy Pack contains six copies of each of two different Graded Readers (BBC Earth: Baby Animals - Ladybird Readers Level 1 & BBC Earth: Hungry Animals - Ladybird Readers Level 2), as well as six copies of the accompanying Activity Books, and is available to order from the warehouse.Levels 1 and 2 are ideal for students at pre-A1 and A1 proficiency on the CEFR scale."}]