[{"id": "0739301845", "genre": "Science Fiction & Fantasy", "title": "A Gift of Dragons", "description": "For more than thirty years, Pern has conjured visions of brave men and women mounted upon the backs of dragons. As anyone knows who has been touched by the storytelling magic of Anne McCaffrey, to read of the exotic world of Pern is to inhabit it—and to experience its extraordinary dragons is to soar aloft with them and share their dazzling adventures.Now, A Gift of Dragons brings together three beloved stories and a thrilling new tale of Pern in a single volume illustrated with beautiful artwork by Tom Kidd. In “The Smallest Dragonboy,” Keevan is the youngest dragonrider candidate, determined to impress a dragon when the next clutch of eggs hatches. But what transpires will surprise everyone—Keevan most of all. In “The Girl Who Heard Dragons,” a young girl’s rare ability to communicate with dragons puts her family in danger and will bring her face to face with her greatest fears—and with her most secret desire. The “Runner of Pern” is a girl named Tenna, who follows family tradition by delivering messages—and who will find her destiny on the mossy traces that runners have used for centuries under the dragon-filled sky. And finally, a very special gift: an exciting new Pern adventure, published here for the first time, fresh from the imagination of Anne McCaffrey.From the Hardcover edition."}, {"id": "B072KX9BC4", "genre": "Science Fiction & Fantasy", "title": "Tomorrow Factory: Collected Fiction", "description": "Twenty-three stories from one of science fiction’s up-and-coming stars, Pushcart and Journey Prize-nominated author Rich Larson.Welcome to the Tomorrow Factory.On your left, post-human hedonists on a distant space station bring diseases back in fashion, two scavengers find a super-powered parasite under the waves of Sunk Seattle, and a terminally-ill chemist orchestrates an asteroid prison break.On your right, an alien optometrist spins illusions for irradiated survivors of the apocalypse, a high-tech grifter meets his match in near-future Thailand, and two teens use a blackmarket personality mod to get into the year’s wickedest, wildest party.This collection of published and original fiction by award-winning writer Rich Larson will bring you from a Bujumbura cyberpunk junkyard to the icy depths of Europa, from the slick streets of future-noir Chicago to a tropical island of sapient robots. You'll explore a mysterious ghost ship in deep space, meet an android learning to dream, and fend off predatory alien fungi on a combat mission gone wrong.Twenty-three futures, ranging from grimy cyberpunk to far-flung space opera, are waiting to blow you away.So step inside the Tomorrow Factory, and mind your head."}, {"id": "1937013510", "genre": "Science Fiction & Fantasy", "title": "East Texas University: GM Screen with Class Ring Adventure (Savage Worlds, S2P10312)", "description": "Three panel hardback landscaped screen with adventure. They say the Language Arts building at East Texas University is haunted. They re right. In Class Ring, a late night study session takes a supernatural direction when the ghost of a beautiful young woman reaches out for help. Who was she, and why is she haunting the building? How many other spirits share her fate? It ll take strong nerves and sharp minds to unlock the mystery of the spirit s demise and free the building from its haunting."}, {"id": "B01MZE3L4D", "genre": "Science Fiction & Fantasy", "title": "First Command: A TIDES novella", "description": "Master and Commander meets Sarah J Maas in a seafaring adventure of duty, love, magic, and a princess’s quest to protect her kingdom on her own terms. Born to privilege, called to service, trained for command, seventeen-year-old Lieutenant Nile Greysik finally gets the chance to prove herself a leader. As she takes charge of a captured enemy ship, her orders will take her through hostile waters and stormy seas with a hold full of prisoners, a skeptical crew, and a handsome first mate whose every move undermines her confidence.To navigate to safe harbor, Nile must earn the crew’s trust . . . but first she must dare to trust herself.FIRST COMMAND is a prequel novella in Alex Lidell’s TIDES series. Recommended for fans of Sarah J. Maas, Tamora Pierce, and Naomi Novik. "}, {"id": "1934857572", "genre": "Science Fiction & Fantasy", "title": "Battletech Masters & Minions Starcorps", "description": "Rulers of the Universe  Who is the Director of the Internal Security Force? Planetary ruler of Regulus? Current Marshal of the Armies? Merchant Factor of Clan Diamond Shark?  As one of the most powerful interstellar corporations in the Inner Sphere-with satellite plants in every House-such questions are imperative for StarCorps Industries. In the tumultuous time of the Jihad, as power brokers fall and new personalities rise to prominence, the answers to such questions can mean the difference between a fat in-the-black account and operations in the red. And no corporation, much less one as powerful and far reaching as StarCorps Industries, treats failure well.  Masters and Minions: The StarCorps Dossiers is a sourcebook from the perspective of StarCorps Industries, compiled from dozens of sources by an army of administrators, all with an eye towards furthering StarCorps markets and interest. Masters and Minions is a complete who's-who of the BattleTech universe, with well over a hundred personalities detailed. Short overviews of all the major and most minor factions of the Inner Sphere are also included, briefly covering such details as their most notable factories, planets and military forces."}]