[{"id": "1548870641", "genre": "Science Fiction & Fantasy", "title": "Realms of Understreet: Role-Playing Game Campaign Setting", "description": "Fantasy Kingdoms of Rats, Living and Warring beneath Manhattan. An original campaign setting. Tooth and Claw – Sword and Scabbard – Magic and Myth – These are not your average rats. A new campaign setting from dicegeeks.com. What people said about the introductory PDF: \"Just genius. I don't think I could ever express just how amazing this is. I would give this a 20 out of 5 [stars] if I could...\" - James B. - Five Star Review \"The guy knows how to world-build.\" - Andrew N. - Five Star Review \"Highly creative and evocative of much of the fiction I remember reading as a child. The author has done a wonderful job...\" - Thomas A. - Five Star Review \"Loved the concept. Can't wait to see what comes next...\" - Jesse R. - Five Star Review The book contains: Capsule histories for each kingdom Details for races and cultures Two maps of the \"Understreet\" Original character backgrounds Numerous scavenge tables Adventure ideas and story hooks Important NPCs Creature stats Original artwork And more! Kings and nobles vie for power in a swirling labyrinth of political intrigue. Warriors and wizards battle for treasure, knowledge, and adventure. Scavenge through items discarded by fearsome giants to fashion clothes, weapons, armor, and homes. Your players take on roles of rats, mice, and other creatures living in the sewers of Manhattan Island."}, {"id": "B004W0CG56", "genre": "Science Fiction & Fantasy", "title": "100 Days From Home: Book-1 Hard Rain", "description": "Jacob Frye is haunted. Haunted by his past, and haunted by the present. A dedicated journalist and the most unlikely of heroes, Frye goes on the most dangerous assignment of his career. The year is 2406 and humanity is engaged in a desperate struggle for possession of a metropolis called Volengrad City on a planet designated Q-781.  The final battle in a besieged star system is to be fought over the industrial epicenter and Frye is there to cover the historical invasion. His assignment takes him on a dark journey into the trenches where he befriends the soldiers of 1st Platoon/Bravo Company...the warriors that are hurled into the most vicious battles of the conflict. Frye is reeducated by the humble frontline troops of the Alliance as the meanings of courage, honor, and sacrifice are redefined by the onslaught of destruction and friendships are forged in the fires of combat. Frye's life unravels as he is forced to watch his new  friends make the ultimate sacrifice to liberate a society light years from home."}, {"id": "038542017X", "genre": "Science Fiction & Fantasy", "title": "Like Water for Chocolate: A Novel in Monthly Installments with Recipes, Romances, and Home Remedies", "description": "The bestselling phenomenon and inspiration for the award-winning film.Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico blends poignant romance and bittersweet wit. This classic love story takes place on the De la Garza ranch, as the tyrannical owner, Mama Elena, chops onions at the kitchen table in her final days of pregnancy. While still in her mother's womb, her daughter to be weeps so violently she causes an early labor, and little Tita slips out amid the spices and fixings for noodle soup. This early encounter with food soon becomes a way of life, and Tita grows up to be a master chef, using cooking to express herself and sharing recipes with readers along the way."}, {"id": "1540702472", "genre": "Science Fiction & Fantasy", "title": "Echoes Through Time: A Harvester Adventure Series (Volume 1)", "description": "Jerome David Anderson has believed in his special destiny for several years. Ever since he joined the project at the age of fifteen, he has been preparing for a dangerous mission.  Jerome may be humankind’s last hope. The sun is growing more and more unstable with each passing day. Humanity has fled to bunkers deep underground to escape the radiation.  While everyone else is adjusting to life in subterranean caverns, Jerome still looks up at the stars. It’s where he will be traveling on a desperate voyage. Somewhere out there, there may be intergalactic civilizations that can help Earth. Jerome just has to find them.  Jerome knows his mission is critical, but he’s heartbroken at leaving his lovely friend and caretaker, Katie Dawson, behind. Then, Jerome’s mentor, Professor Massey, reveals a shocking secret about Jerome’s upcoming journey. This secret will lead to a race through time itself. In this young adult adventure, author Richard W. Chamberlain uses the experiences of Jerome and his friends to explore time, relativity, cosmology, and other scientific concepts. Jerome will soon learn that the universe is a dangerous place and only the brave will survive. "}, {"id": "B00DGC8C72", "genre": "Science Fiction & Fantasy", "title": "This Plague of Days Season One (The Zombie Apocalypse Serial Book 1)", "description": "If you loved The Stand, Swan Song or The Passage, this trilogy is your next binge read.\"This is like reading World War Z...hooks you from the beginning and you can't stop reading!\" ~ Armand Rosamilia, Author of the Dying Days zombie seriesOne autistic boy + elements of The Stand + 28 Days Later = A haunting protagonist versus the Running DeadWhen the Sutr-X virus spreads globally, civilization falls. Jaimie Spencer, an autistic boy, is caught in the fight for survival. When the virus mutates the infected transform into rabid bio-weapons. Jaimie tries to save his family first. Destiny calls him to fight for all of us.Readers of all things apocalyptic will love This Plague of Days. The Omnibus Edition won Honorable Mention from Writer's Digest Self-published Ebook Awards. You may purchase each book of the trilogy separately or read the omnibus for one low price, available in ebook and paperback.Unique Zombie Fiction!Enter the mind of a selective mute whose world rarely touches our own. He becomes a hero like you've never experienced. We are all trapped in the nightmares: survivors, looters, the wicked and the damned. Jaimie is our one hope. Look for him in your dreams.Scroll up and grab a copy today.Reader Guide:Expect violence, metaphysical adventures, Latin proverbs and some gory scenes throughout this series."}]