[{"id": "1541905288", "genre": "Children's Books", "title": "The Mythical Medieval Beasts Ancient History of Europe | Children's Medieval Books", "description": "The mythical medieval beasts are part of Europe’s ancient history. They have been deeply embedded in their cultures and traditions that you can still hear stories about them. Scientifically, these beasts never existed but for the ancient Europeans, they do. Read about the most popular of these medieval beasts today!"}, {"id": "1609732146", "genre": "Children's Books", "title": "How Telescopes, Binoculars, and Microscopes Work (How Things Work)", "description": "This book explains the principles of light, lenses, and other key science ideas behind the technology of telescopes, binoculars, and microscopes. The book discusses the history of the inventions, their uses, and how to select one for purchase."}, {"id": "1540399427", "genre": "Children's Books", "title": "'Twas the Night before Hanukkah", "description": "...not a creature was stirring, except for a mouse. Can you follow him as he explores the excitement of Hanukkah?  This beautifully illustrated children's book, written in delightful verse, highlights traditional Hanukkah celebrations, including lighting the menorah, making latkes and playing the dreidel game. Perfect for families and children of all ages to discover the joy of Hanukkah."}, {"id": "0753458640", "genre": "Children's Books", "title": "Pirates & Smugglers (Kingfisher Knowledge)", "description": "Pirates and Smugglers is a swashbuckling introduction to the highwaymen and women of the seas—from the cruel Cilician pirates who terrorized the Mediterranean more than 2,000 years ago to the well-organized and ruthless modern-day buccaneers who target supertankers on the South China Sea—and the loot they plunder and smuggle."}, {"id": "1941434592", "genre": "Children's Books", "title": "It's Just Me Brooklyn", "description": "With brilliant illustrations, clever observations and sweet humor, It's Just Me Brooklyn encourages and opens the conversation about positive self-esteem in children. Follow Brooklyn as her 2 cats try to prove that 2 is better than 1. Brooklyn and her kitty counterparts discover that whether you are a single or a pair, that just being yourself is amazing! A sparkling celebration of being an individual and loving yourself...just the way you are!"}]