[{"id": "0792269977", "genre": "Children's Books", "title": "National Geographic Prehistoric Mammals", "description": "Written by one of the world's foremost paleontologists, Prehistoric Mammals gives children a rare glimpse at a world gone by in a stunningly illustrated, incredibly comprehensive reference book."}, {"id": "0439669375", "genre": "Children's Books", "title": "'Twas the Night Before Thanksgiving (Bookshelf)", "description": "Let the Scholastic Bookshelf be your guide through the whole range of your child's experience--laugh with them, learn with them, read with them! Twelve classic, best-selling titles are available now.Category: HolidayThe incomparable Dav Pilkey adapts Clement Moore's classic Christmas poem to tell his wacky Thanksgiving tale. The day before Thanksgiving, eight boys and girls take a field trip to a turkey farm. They have fun playing with eight exuberant turkeys but are shocked to learn that Farmer Mack Nuggett plans to kill all the turkeys for Thanksgiving dinners. So the children decide to smuggle all the turkeys home, and all their Thanksgiving dinners become vegetarian this year. The turkeys' lives are saved!"}, {"id": "1570820341", "genre": "Children's Books", "title": "Beauty and the Beast (Classics Series)", "description": "Introducing a stunning diorama format that has five 3D windows that offer a glimpse of the character's environment by peeking through a door or a window. Belle is looking everywhere for her book. But it is not to be found in her bedroom, the kitchen, the library, or the Beast's lair. Maybe Belle's enchanted friends can help her find it in these six full-color spreads."}, {"id": "1595154345", "genre": "Children's Books", "title": "Robert Fulton (Discover the Life of an Inventor II)", "description": "- Keyed to State Social Studies Standards- Each book teaches reading through nonfiction biography- Will cross over to science studies as well"}, {"id": "158261427X", "genre": "Children's Books", "title": "Dale Earnhardt: The Intimidator (Racing Superstars)", "description": "If there was any doubt that the competitive fire still burned in the belly of Dale Earnhardt despite his advancing years, he certainly dispelled all such notions by winning the 40th annual Daytona 500 in 1998, on his 20th try. The aggressive style of the seven-time Winston Cup champion mesmerized a generation of fans and earned him a reputation as one of the sport's greatest drivers. He's a NASCAR legend and a child of the South who rewrote the record books with his daring style on the track and his folksy style off it. A third-generation race car driver, his love of family and the outdoors, and his Carolina roots stirred the imagination of millions of fans and made him a role model for many. The updated version covers Earnhardt's career through his tragic death in 2001."}]