[{"id": "0735814759", "genre": "Children's Books", "title": "Three Little Rabbits, The", "description": "A Balkan variation on the tale of \"The Three Little Pigs\" introduces three young rabbits who set out on their own but only one of which follows her father's advice on how to be safe from a hungry fox."}, {"id": "0140564780", "genre": "Children's Books", "title": "Young Mozart (Picture Puffins)", "description": "A biography of the famous Austrian composer introduces youngsters to his life, from his childhood as an engaging prodigy through the composing of his major works and his early death. Reprint."}, {"id": "1524717193", "genre": "Children's Books", "title": "1, 2, 3, Tea! (Shimmer and Shine)", "description": "Boys and girls ages 0 to 3 will love learning to count with Leah and her genies from Nickelodeon’s Shimmer and Shine as they count up to a magical tea party!   Boom, Zahramay! Join the madcap magical adventures of genie-in-training twin  sisters, Shimmer and Shine, as they grant wishes for their best human friend, Leah, and show preschoolers that things are always better when you work together."}, {"id": "0989359700", "genre": "Children's Books", "title": "Meet Mac - Our Pet Raven - A True Story", "description": "Meet Mac! He is a black bird.  Mac is our pet raven.  Mac, as a baby, fell out of his nest and on to the ground.  Papa Brian put Mac on a towel to keep him warm.  He put the baby bird in a box and took him home.  All Mac could do was cry...AWK! AWK! AWK!  Day after day, Mac got bigger and BIGGER, and louder and LOUDER!  Mac meets the big red dog Ruby, and Clinger the cat.  Clinger is a curious one!  Ruby just wants to kiss Mac's face.  She wants to lick him all over the place!  Mac the raven has many lessons to learn in this series of true stories.  This is book number 1 in the Mac The Raven Series."}, {"id": "0613501896", "genre": "Children's Books", "title": "Celebrate!: Stories of the Jewish Holidays", "description": "This sparkling collection of stories, recipes, crafts, and commentary introduces readers to the eight major Jewish holidays. Each story is accompanied by three sections: What We Celebrate; How We Celebrate; and Crafts and Food. Full color."}]