[{"id": "B01MUIT0UK", "genre": "Science Fiction & Fantasy", "title": "Trust Me (Mind Sweeper Series Book 0)", "description": "Mind Sweeper Flashback Story (A companion story to the Mind Sweeper Series)NOTE: This story is a prequel. Reading Mind Sweeper, the first book in the series, will greatly enhance your reading experience of this book.It’s been a year since Kyle McKinley realized that paranormals do, indeed, exist. A year of working with an overprotective vampire and demon. A year of actually using her ability to manipulate memories to help the good guys.The team’s newest case revolves around supernatural extortionists. When local businesses are forced to pay protection money, Kyle convinces her teammates to let her go undercover for the first time to stop the culprits.Will Jean Luc and Misha trust her to get the job done? And does she trust her own abilities enough to stop the threats of violence before they become a reality?  Mind Sweeper Series:Book 1 – Mind SweeperBook 2 – The Fledgling (A Novella)Book 3 – Shifter Wars Book 4 – The Pursuit (A Novella) Mind Sweeper – The NovellasBook 5 – Sentinel Lost Mind Sweeper Flashback StoriesForget MeTrust MeProtect Me"}, {"id": "B077L98V5K", "genre": "Science Fiction & Fantasy", "title": "Tarzan of the Apes", "description": "Experience the legend of Tarzan in this thrilling adventure from Edgar Rice Burroughs.Set amid the vibrant colors and sounds of the African jungle, this classic work, rich in suspense and action, has beckoned generations of readers on a glorious journey to romance and pure adventure. This is the story of the ape-man Tarzan, raised in the wild by the great ape Kala, and how he learns the secrets of the jungle to survive—how to talk with the animals, swing through the trees, and fight the great predators. As Tarzan grows up, he makes many friends, including Tantor the elephant and Numa the lion. When this paradise is invaded by white men, Tarzan’s life changes, for in this group is Jane, the most beautiful woman he has ever seen. Speaking directly to our childhood fantasies, this exhilarating work takes us to that faraway place in our minds where dreams prevail, and where we too can be masters of our own domain."}, {"id": "1937004007", "genre": "Science Fiction & Fantasy", "title": "1: Lore", "description": "What means more to a man - love or destiny? The world hangs on the edge of existence and the keys to salvation rest in the hands of Mark Hope, a man with a sordid past and an uncertain future. The problem? He doesn't know he possesses the power to save the world. To complicate matters, his focus is set entirely on saving his girlfriend from the limbo hell she has been sent to - he doesn't even care about the world. Mark is pushed toward his fated path by a group of wayward, mismatched soldiers who stand by his side through every battle. Together they seek the truth and fight to save a world plagued by criminals and war. The catch that could be Mark's downfall is that the villain he has to fight is his own brother. How far will Mark go to save the girl he loves? Who can he trust? And how will this band of unlikely heroes save existence as we know it from being destroyed by evil incarnate?"}, {"id": "B00X90MOKC", "genre": "Science Fiction & Fantasy", "title": "Book Of Fire (Dragon Quartet)", "description": "Follow the adventures of the four elemental dragons and their human guides in the third book of the history-spanning Dragon Quartet fantasy series.A desperate call had united the dragons Earth and Water with their dragon guides: the girl named Erde, who had discovered Earth in the war-ravaged principalities of 913 AD Germany, and the boy N'Doch, who found Water on the African coast in the year 2013. Together they braved the dangers of both their times, only to find themselves drawn to a future beyond even N'Doch's own—to a devastated America where the dragon Fire reigned in all his terrifying magnificience, with his dragon guide Paia transformed into his high priestess, her true destiny concealed from her.Yet it was not Fire who had summoned his brother and sister dragons. The Call had come from another, and the reason for the summons was all too clear. Fire had chosen to become a god instead of a guardian. And the dragon Air was nowhere to be found.Could Earth and Water with Erde and N'Doch force Fire and Paia back on the path they were fated to follow? Could they find and rescue Air? Or would Fire's rebellion doom both the dragons and the world they guarded?"}, {"id": "194475105X", "genre": "Science Fiction & Fantasy", "title": "Poison or Protect: A Delightfully Deadly Novella", "description": "London's most scandalous lady assassin versus one very hot Highlander.Lady Preshea Villentia, the Mourning Star, has four dead husbands and anasty reputation. Fortunately, she looks fabulous in black.What society doesn't know is that all her husbands were marked for death byPreshea's employer. And Preshea has one final assignment.It was supposed to be easy, a house party with minimal bloodshed. Presheahadn't anticipated Captain Gavin Ruthven - massive, Scottish, quietlyirresistible, and... working for the enemy.In a battle of wits, Preshea may risk her own heart - a terrifying prospect, as she never knew she had one.New York Times bestselling author Gail Carriger presents a charming lovestory set in her popular steampunk Parasolverse. May contain plaid,appearances from favorite characters, and the strategic application ofleather gloves.The Delightfully Deadly novellas stand alone and may be read in any order.Delicate Sensibilities?Contains men pleasing women, and ladies who know what they want and ask for it, sometimes in detail."}]