[{"id": "B005LLE0GS", "genre": "Children's Books", "title": "Maximilian Kolbe: Saint of Auschwitz", "description": "A biography of the Polish friar, canonized in 1982, who founded the Militia o the Immaculate, wrote numerous periodicals and newspapers, and while impriso in Auschwitz, sacrificed his life for another man."}, {"id": "1584690623", "genre": "Children's Books", "title": "Over in the Ocean: In a Coral Reef", "description": "Teachers and parents, take note: this book is already a classic. Two geniuses--author and illustrator--came into perfect alignment to create this book. The author has kids thinking it is entertainment while adults think it is a great lesson about the ocean. The genius of the illustrator is obvious. With painstaking detail each illustration is created entirely of polymer clay, then photographed, creating a 3-D impression of tremendous vitality. Kids will sing, clap, and count their way among pufferfishthat puff, gruntfishthat grunt and seahorses that flutter, and begin to appreciate life in the ocean.And the art will inspire many a project. Plus there are several pages of extension ideas for curriculum and art projects as well as resources on the web and elsewhere.Please note: The board book edition is 28 pages. It includes suggestions for children to do body movements as the text is read. It does not include additional information about the animals, rainforests, and the score of the song as is in the hardback and paperback editions."}, {"id": "1499420951", "genre": "Children's Books", "title": "Girls Play Basketball (Girls Join the Team)", "description": "How can a girl go from playing basketball in gym class to becoming a WNBA superstar? The journey starts by learning as much as possible about the sport of basketball. Through manageable text, a detailed graphic organizer, and fun fact boxes, readers explore basketball basics. They also discover stories of some of the most famous women to ever play the game. Full-color photographs show girls and women hard at work and having fun on the basketball court. With each turn of the page, readers will feel inspired to pick up a basketball and put all they’ve learned into action."}, {"id": "B00VATG180", "genre": "Children's Books", "title": "Children's books: \" The Dusty Puppy \",( Illustrated Picture Book for ages 3-8. Teaches your kid the value of friendship and family),Beginner readers,Bedtime story,friends and animals collection", "description": "Elliot is just like any other 5 year boy with an active imagination.  So when he notices the ball of dust in the closet corner breathing, he jumps into action to discover what could be an alien invader or strange new species.  What he really discovers is the puppy who will become his best friend for life.  The Dusty Puppy is the story of a little lost dog and how he finds his forever home.  Children will love this book, filled with colorful illustrations and the heartwarming story of the loveable puppy and the boy who rescues him.  The first book in The Dusty Puppy series introduces Elliot and Dusty, who instantly  form the bond that will take them through their upcoming adventures.  Be sure to watch for The Dusty Puppy’s New Life, coming soon to Amazon and Kindle."}, {"id": "1602528187", "genre": "Children's Books", "title": "Bloody Jack: Library Edition (Bloody Jack Adventures)", "description": "Life as a ship's boy aboard HMS Dolphin is a dream come true for Jacky Faber. Gone are the days of scavenging for food and fighting for survival on the streets of eighteenth-century London. Instead, Jacky is becoming a skilled and respected sailor as the crew pursues pirates on the high seas.There's only one problem: Jacky is a girl. And she will have to use every bit of her spirit, wit, and courage to keep the crew from discovering her secret. This could be the adventure of her life--if only she doesn't get caught. . . ."}]