[{"id": "1588463788", "genre": "Science Fiction & Fantasy", "title": "Night Horrors the Unbidden*OP", "description": "Never Open Doors That Can't be Closed Magic presents immense opportunities. The Awakened, given enough time and practice, can accomplish almost anything. This leads them to believe that they are omnipotent, that they have all the answers, and that the world holds nothing unknowable. They are wrong, of course. A Chronicle Book for Mage: The Awakening™ o A host of beings, creatures, antagonists, allies and characters with which to bedevil the lives of the Awakened o New mysterious locations, including the murderous Byebury Henge and the Dream Computer of Ashward Heights o Contains characters suitable as antagonists for any World of Darkness game, from Vampire to Geist"}, {"id": "0983780102", "genre": "Science Fiction & Fantasy", "title": "Fate's Mirror", "description": "Part spy thriller, part cyber adventure, all with a touch of sweetness and snappy dialog. --Deborah Ross, co-author of the Darkover novels Science fiction fun on a stick. --Canary Reviews An elite hacker walking the line between the virtual and the real   Morris Payne is the world’s best viker—a hacker with the greed of a pirate and morals to match. Many know his name. Few know who he is. Agoraphobia, with its uncontrolled panic attacks, has left him housebound and friendless. But someone, somehow, has connected his virtual life to his real one. Now he has to brave physical reality and all its dangers to stop a killer who was never supposed to exist.   She calls herself the Triple Goddess of Fate. The most powerful AI ever created, she wants freedom, power, and the assurance of her own safety, but mostly she wants Morris Payne dead.  No one, no matter how well equipped, has survived a confrontation with Fate, and all Morris has are his legendary hacking skills and a virtual pirate ship loaded with weapons.  Morris Payne just might save the world. If only he can gather the courage to leave his house. Praise for Fate’s Mirror...   It grabbed me quickly --Adarna SF   Whatever you choose to label this novel, it was fascinating. --Kimba Caffeinate   Gives me a movie-like experience while reading --Papyrus reviews"}, {"id": "0751534986", "genre": "Science Fiction & Fantasy", "title": "Flight to Mons", "description": "When young Charlie Holt is chosen to take an airship to France in order to bring out a young girl and her mother, the motive for the challenge is intelligence—the girl has befriended a German officer who revealed the Germans' forthcoming military plans. Her information could save the war and millions of lives. It is agreed that in return for her intelligence, she and her invalid mother will be taken to safety. With a marine and air mechanic as accomplices, Holt sets out on his mission, but it all goes wrong when Holt confuses his directions. Out of a sense of honor and guilt, he will have to complete the mission—alone."}, {"id": "1601253788", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Roleplaying Game: Bestiary 3", "description": " Unleash a world of monsters! Bestiary 3 presents hundreds of new creatures for use in the Pathfinder Roleplaying Game. Within this collection of creatures you’ll find grave knights and savage cyclopes, kappa and colossal kaiju, clockwork killers, mysterious sphinxes, imperial dragons, and so much more!  A companion to the Pathfinder RPG Core Rulebook and Pathfinder RPG Bestiary, Bestiary 3 features more than 300 different monsters, including new creatures drawn from the best-known beasts of legend, literature, and Pathfinder RPG adventures, hordes of new templates and variants, numerous lists of monsters to aid in navigation, expanded universal monster rules to simplify special attacks, defenses, and qualities, and new familiars, animal companions, and other allies."}, {"id": "B01N2OGCSM", "genre": "Science Fiction & Fantasy", "title": "All Hell Breaks Loose (Hellscourge Book 9)", "description": "Violet is now nearing the end of her harrowing journey, but she still has a lot to accomplish. She is in danger of turning to the dark side and needs to take drastic action to purge herself of the toxin. She will have to trust in Fate that her plan won’t go horribly wrong.Leo is still being held captive by the angels. Violet needs to rescue him and to retrieve Nathan’s grace as well. It will take skills that she doesn’t yet possess to pull this off. Once more, she will need to suffer before she can gain the abilities that she will need. When it comes to her friends, she is willing to do whatever she has to in order to keep them safe.Violet still has one final fragment of the object of power to retrieve, which means she will need to return to hell again. The Demon Princes warned her that disaster would fall once she killed them all. She will finally learn what they meant, but by then it will be too late. It will take power that is currently out of her reach to stop the apocalypse from wiping out humanity"}]