[{"id": "1617832189", "genre": "Children's Books", "title": "Elephants (African Animals)", "description": "Introduces the two kinds of African elephant--savannah elephants and forest elephants--describing their physical features, habitat, life cycle, and behavior."}, {"id": "B075NLX7VT", "genre": "Children's Books", "title": "The Wheels タイヤ The Friendship Race  (japanese children's stories, japanese bilingual books, english japanese children's books, japanese baby book) (English Japanese Bilingual Collection)", "description": "English Japanese Bilingual Children's Book. Perfect for kids learning English or Japanese as their second language.What is friendship? Join three good friends as they discover what real friendship means. They start a race, but decide to finish it together, helping a friend who got in trouble. This book will teach children positive friendship skills like sharing, supporting, and helping each other."}, {"id": "1426317093", "genre": "Children's Books", "title": "National Geographic Kids Quiz Whiz 4: 1,000 Super Fun Mind-bending Totally Awesome Trivia Questions", "description": "Discover 1,000 more fun, fascinating, and funny quiz questions in the latest book in this popular series, with all-new content and photos. Packed with fantastic photos and a dynamic design, kids will have a blast quizzing themselves, friends, and family members on tons of fun trivia! They'll love fun new chapters, such as \"On Safari,\" \"Heroes and Villians,\" and \"Earthly Extremes,\" and more."}, {"id": "1481490354", "genre": "Children's Books", "title": "Keith the Cat with the Magic Hat", "description": "From the author of Norman the Slug with the Silly Shell comes a sweet, silly, and sassy picture book about a cat who has a hat that seems magical—but the powers of the hat aren’t quite what they seem.Meet Keith—a very cute cat with a magical hat! When Keith wears the hat, it makes bunnies appear out of nowhere! It even makes a stick move all on its own! But when Keith’s hat falls off, will the magic still work and save the day?"}, {"id": "B00TBGJUGY", "genre": "Children's Books", "title": "Max and Bertie Bring Back Bees", "description": "When Max meets a tired and hungry bumblebee called Bertie, the pair become instant friends and team up to save the bees and paint dreary London all the colours of the rainbow along the way."}]