[{"id": "1508157316", "genre": "Children's Books", "title": "Good Manners at a Friend's House (Manners Matter)", "description": "When a boy spends the day at his friend Marco's house he demonstrates good manners by greeting Marco's parents, sharing and playing fairly with his friend, and behaving politely at lunch."}, {"id": "B01BFX0LEU", "genre": "Children's Books", "title": "Can This Fox Be Trusted (Mrs. Wordlover Trickster Tales Book 5)", "description": "As her name suggests, Mrs. Ima Wordlover loves words.  For her, word games are fun.  But the words making stories are the best.  And she loves the trickster stories.  She shares them with her class.  And Felix the Fox is her favorite trickster.All cultures have myths and legends. And seemingly in the myths and legends of all cultures, there are trickster stories.  In Africa, the trickster may be the tortoise or the hyena.  In Native American lore, the trickster is the coyote or the raven.  North America has B’rer Rabbit.  It shares with Europe the Aesop Fables’ trickster fox.  It’s estimated that Japan has over 1500 tales featuring the trickster as fox. . All the world loves a trickster. He is entertaining.  He has no rules.  His society’s rules mean nothing to him. For the trickster there is no right or wrong.  Sometimes he is greedy or childish, or just plain nasty. Yet some tales show him as helpful, even friendly; but almost always, he is clever.  He seeks his own way and usually gets it.  Though he is not always successful, he is always entertaining and almost always a male."}, {"id": "0395779383", "genre": "Children's Books", "title": "How the Stars Fell into the Sky: A Navajo Legend (Sandpiper Houghton Mifflin Books)", "description": "This retelling of a Navajo folktale explains how First Woman tried to write the laws of the land using stars in the sky, only to be thwarted by the trickster Coyote."}, {"id": "1595669256", "genre": "Children's Books", "title": "Bulldozers (Mighty Machines QEB)", "description": "Get the lowdown on some of the most exciting machines on the planet with this fantastic bumper guide. Aimed at young readers, the easy-to-read text and strong, clear images will encourage even the most reluctant reader to get involved."}, {"id": "1599253445", "genre": "Children's Books", "title": "I Can Play Too! Life-Changing Lessons from a Three-Legged Dog", "description": "Follow the adventures of Bo, a real-life, three-legged dog who lost his right leg in a terrible accident, but who persevered and won the heart of his new owner and the author of the book. Although this is written for young children, parents and teachers will find this story tugging at their hearts, as they see the value and integrity of all creatures of our God and King. You will learn how Bo persisted with his owner's other two dogs to finally convince them that \"I Can Play Too.\" The primary purpose of this full color book is to teach children to treat all other children with respect no matter how different they may be. This is a powerful story!"}]