[{"id": "193754852X", "genre": "Children's Books", "title": "I, Humanity", "description": "Winner: 2017 NSTA, Outstanding Science Trade Books Nautilus Book Awards, Gold, Children's Illustrated Nonfiction Story Time From Space Official Selection Part of a set of books launched to the International Space Station through NASA’s Story Time from Space program, read aloud by astronauts for children around the world   Written in the first person with the viewpoint of a narrator who represents the human race throughout history, I, Humanity tells the story of what we now know about the universe and how we learned it. It begins with the ancient view of a small, flat Earth, and page-by-page shows how we’ve gradually learned about our planet, its orbit, and its place in the vast universe. The book is designed to work on three different levels: education, perspective, and inspiration. The educational aspect comes in the factual content of the story, the perspective element involves enabling children learn to see themselves and our planet in a new light, and the inspirational component comes in helping children dream of how they can help make the world a better place."}, {"id": "0545857813", "genre": "Children's Books", "title": "Attack of the Kraken (The Yeti Files)", "description": "Something smells fishy in the underwater kingdom of Atlantis. The merfolk claim the mighty kraken is attacking their city and threatening their safety. They have called yeti Blizz Richards and his team of cryptozoologists to track and capture the beast. But something about their story isn't holding water...To find the kraken and get some answers, Blizz and the gang will have to face man-eating sharks, powerful magic crystals, giant crabs, and find a long lost hero in the furthest reaches of the deep."}, {"id": "B06ZZ9QKYC", "genre": "Children's Books", "title": "Not My Mittens (Sam You Can Read Book 1)", "description": "What do you do when you lose your mittens? You have to look for them of course, and if you have to look for them then you should have fun doing so! And that's exactly what Ann does in this delightful little story. This book is great for beginning readers.Other titles in the Sam You Can Read Book Series:Written and illustrated by Dr. Zeuzz:> The Little Mouse Miss And Her Little House of SwissWritten by Samantha Sams:> Not My Mittens > The Teacher's Pet> The Rainbow Day> Bella Is A Ballerina > Stella Is A Mariachi Dancer > Sports I Like To Play > The Book Of Look> Sam You Can Colors> Sam You Can Numbers> Green Day > If We Went To The Beach Written by Samantha Sams with Red Fish Blue Fish:> Just For You> A Bear Just Right For MeWritten and illustrated by Louis Eckbert:> Mama Smiles > All The Pretty Horses Of The Painted Hills > Growing Jack O' Lanterns> Growing Christmas"}, {"id": "B073BVWLXZ", "genre": "Children's Books", "title": "I Love to Eat Fruits and Vegetables Uwielbiam Jeść Owoce i Warzywa: polish baby books, polish books for children, polish kids books, polish childrens books (English Polish Bilingual Collection)", "description": "English Polish bilingual children's book. Perfect for kids studying English or Polish as their second language. Jimmy, the little bunny, likes to eat candy. He sneaks into the kitchen to find a bag with candies that was hidden inside the cupboard. What happens right after Jimmy climbs up to reach the bag of candy? You will find out when you read this illustrated children's book. Since that day, he starts to develop healthy eating habits and even likes to eat his fruits and vegetables."}, {"id": "0778793435", "genre": "Children's Books", "title": "Australia the Land (Lands, Peoples & Cultures)", "description": "Text and photographs portray Australia's unique geography, wildlife, and climate, as well as its city and rural life, industry, and transportation."}]