[{"id": "0689804512", "genre": "Children's Books", "title": "When Zaydeh Danced on Eldridge Street", "description": "While staying with her grandparents in New York City in the mid-1930s, eight-year-old Zeesie joins in the celebration of Simchat Torah and sees a different side of her stern grandfather"}, {"id": "0692232516", "genre": "Children's Books", "title": "Turkey and Mr. Bear", "description": "When Turkey shares his enthusiasm for Thanksgiving with Mr. Bear, he learns that he has no idea what that holiday really means. With wild ideas about birthday cake, fireworks and stockings hung by Santa, he soon finds out what Thanksgiving is all about.  What does that mean for Turkey?"}, {"id": "1465417141", "genre": "Children's Books", "title": "10 Minutes a Day: Spelling, Second Grade", "description": "Help develop spelling skills at home with worksheets appropriate for second graders, featuring exercises on plurals, silent letters, contractions, doubling letters, and more in 10 Minutes a Day: Spelling Grade 2. Accompanied with a digital timer, the 10 Minutes a Day series provides quick exercises testing a range of skills and knowledge. Each spread takes a maximum of ten minutes to complete, with a mix of problems that can be quick to answer, or take a little longer. Complete with parents' notes including tips, guidance, and answers, these workbooks are the perfect reinforcement aids for help at home. Supports the Common Core State Standards."}, {"id": "1442115327", "genre": "Children's Books", "title": "The Speed Trail: A Feathers, Fur And Frog's Hair Adventure", "description": "The inspiration for this book was the enjoyment I get from reading to my two little girls every night. My life around the authentically passionate people in motorsports collided with cute fluffy animals, princesses and fairies after my girls were born. So, the idea of Feathers, Fur and Frog's Hair Adventures was born. This is a children's adventure story about little woodland and wetland animals that work on race cars. Robin is a bird who happens to know a lot about fixing race cars and enlists his woodland and wetland buddies to help him. They emanate the qualities of the people who appreciate motorsports in real life: competitive spirit, teamwork, tradition and conservation. This is an essential reading for anyone who wants to know the real reason race cars go fast!!! Also available at Amazon.com."}, {"id": "1563978687", "genre": "Children's Books", "title": "1 2 3 Valentine's Day", "description": "It's Valentine's Day and Mister Mouse goes from house to house delivering Valentine gifts. From one little frog to ten little mice, Mister Mouse brightens everyone's day with two knocks on the door and a greeting of \"Happy Valentine's!\" Jeanne Modesitt's adorable counting book in rhyme is lovingly illustrated by Robin Spowart. The book also features simple, step-by-step instructions for making a Valentine's Day heart."}]