[{"id": "0439217873", "genre": "Children's Books", "title": "Sounder", "description": "Set in the Deep South, this Newbery Medal-winning novel tells the story of the great coon dog, Sounder, and the poor sharecroppers who own him. Celebrating 30 years! During the difficult years of the nineteenth century South, an African American boy and his poor family rarely have enough to eat. Each night, the boy's father takes their dog, Sounder, out to look for food and the man grows more desperate by the day. When food suddenly appears on the table one morning, it seems like a blessing. But the sheriff and his deputies are not far behind. The ever-loyal Sounder remains determined to help the family he loves as hard times bear down on them.This classic novel shows the courage, love, and faith that bind an African American family together despite the racism and inhumanity they face. Readers who enjoy timeless dog stories such as Old Yeller and Where the Red Fern Grows will find much to love in Sounder."}, {"id": "1947118455", "genre": "Children's Books", "title": "If You Were Me and Lived In... Brazil: A Child's Introduction to Cultures Around the World", "description": "Join Carole P. Roman when she visits the stunning and diverse land of Brazil in the newest book of her informative series. Learn about the varied customs and cultures. Travel to South America to discover what you would eat and do for fun. See the land through the eyes of a youngster like you and understand what life is like in this exciting place. Don't forget to look at the other books in the series so that you can be an armchair world traveler."}, {"id": "B00GJD7474", "genre": "Children's Books", "title": "'Tween Girls and God", "description": "'Tween Girls and God is a magazine for girls ages 8-12ish who want to follow Jesus (or find out what that means!)Believers are supposed to be thankful, but are we? Do we take each opportunity God gives us to give thanks and glory to Him? To others?It's not always easy! It's certainly not easy when things aren't going our way!But a thankful heart glorifies God ...and He says we must be thankful people ...But how?Inside this issue, your daughter will find:5 new devotionals on being thanksfulnew articles and activitiesa thanksgiving turkey made of paint sticks that will be perfect for a centerpiececookie recipesan answer to a tough question - why God made demons!and a place to share, pray and learn in a community of girls her own age.'Tween Girls and God is a ministry magazine. Saturday - Wednesday, downloads are free and after that, they cost just .99.   Join us on a fantastic journey - a discovery of thankfulness for all God has done for us!"}, {"id": "1631405144", "genre": "Children's Books", "title": "Mickey Mouse: Gift of the Sun Lord", "description": "Enjoy these tales of classic and modern stories featuring everyone's favorite mouse, Mickey, plus Goofy and Minnie! Includes the stories \"Gift of the Sun Lord,\" \"The Ghost of Man-Eater Mountain!,\" \"Plan Dine From Outer Space!,\" and more!"}, {"id": "B076HMMN3D", "genre": "Children's Books", "title": "Mail Order Bride: The Lumberjack and the Woodworker's Daughter: Sweet, Clean, Inspirational Western Historical Romance", "description": "Margaret Jones sees all her childhood friends discovering love and marrying their suitor's. Why is she always the one left sitting in the church, watching from a distance?Margaret longs to find her soulmate and enjoy the companionship of true love, but is her independence and desire to continue working stopping admirers from showing an interest? Determined to resolve the problem and find the man of her dreams, Margaret discovers something that may be the answer to her prayers, whilst allowing her to keep her aspirations and ambitions alive.Replying to an advertisement, placed by Irishman Matthew Murphy, for a bride, can she combine her yearning for love whilst still maintaining her independence, or is this destined to be simply a business arrangement?Will Margaret ever find her happy ever after true love or will her determined spirit and foolhardiness have disastrous consequences and prevent her from ever fulfilling her dreams?"}]