[{"id": "1527003043", "genre": "Children's Books", "title": "Peppa Pig Super Sticker Book: Over 1,000 Stickers & 8 Posters", "description": "The Peppa Pig Super Sticker Book is a pig-a-licious fun time for fans of Peppa Pig! The 64-page book is filled with full-color activities to complete and things to draw. There are also eight full-color posters for parents to cut out and for kids to display, and more than 1,000 stickers!"}, {"id": "B077YFHWDS", "genre": "Children's Books", "title": "Epic Chritsmas Jokes for Kids: Jokes for kids (joke books for kids 7 to 9) laugh out loud hilarious jokes for kids (riddles for kids and family) (silly memes jokes Book 4)", "description": "This Epic christmas jokes for kids is a laugh out loud jokes for kids with many of practical jokes contains  joke books for kids 7 to 9 laugh out loud hilarious jokes for kids riddles for kids and family  it is a funny book to read with riddles for kids and family  And much more…  SCROLL to the top and select the Add to Cart button to have the Epic christmas jokes for kids  Enjoy!!!"}, {"id": "068814683X", "genre": "Children's Books", "title": "Moishe's Miracle: A Hanukkah Story", "description": "\"...set it upon the fire empty, and it will produce as many delicious Hanukkah latkes as you wish. Latkes by the dozen, latkes by the hundreds will appear until you remove the pan from the stove. Just remember the stranger's warning: \"To Moishe this gift was given, and only Moishe must see it.\"With such a gift, Moishe, his wife Baila, and the entire village of Wishniak can have a Hanukkah like no other. They will dance and sing and feast on latkes all because of a mysterious frying pan provided by a stranger and some talking cows grateful for Moishe's generosity. But what of the warning? Will the magic pan still fry up latkes as plump as little pillows if Baila uses it? Or will it fry up something totally unexpected...?Laura Krauss Melmed, author of the bestselling  I Love You As Much..., and artist David Slonim have cooked up a wondrous and wholly original Hanukkah story, made from all the classic ingredients of Jewish folktales: mystery, humor, and good food."}, {"id": "1514326477", "genre": "Children's Books", "title": "The TENNIS Alphabet Book (The Sports Alphabet Books) (Volume 3)", "description": "The TENNIS Alphabet book is a picture book for children from six to twelve years of age using the 26 letters of the alphabet and pictures to describe over 100 tennis terms and definitions. The pictures tell a story and help the children to understand tennis terms. It is a fun and educational book for all parents and children who love the game of tennis."}, {"id": "B01N1OQTJ2", "genre": "Children's Books", "title": "The Adventures of Jaxon Maxwell: Jaxon Saves Christmas", "description": "I am so excited to announce that my second children’s book, The Adventures of Jaxon Maxwell: Jaxon Saves Christmas, is here!The Adventures of Jaxon Maxwell: Jaxon Saves Christmas is an inspiring story that will most certainly be a family favorite for years to come. Jaxon, an energic and playful young man, goes on an adventure to save Christmas. “As an educator, I know just how important it is for children to see characters that look like them in today’s literature to give them hope and inspiration,” Colvin says."}]