[{"id": "1626721599", "genre": "Children's Books", "title": "The Nameless City: The Stone Heart", "description": "The Stone Heart is the second book in the Nameless City trilogy from Faith Erin Hicks.Kaidu and Rat have only just recovered from the assassination attempt on the General of All Blades when more chaos breaks loose in the Nameless City: deep conflicts within the Dao nation are making it impossible to find a political solution for the disputed territory of the City itself. To complicate things further, Kaidu is fairly certain he's stumbled on a formula for the lost weapon of the mysterious founders of the City. . . . But sharing it with the Dao military would be a complete betrayal of his friendship with Rat. Can Kai find the right solution before the Dao find themselves at war?"}, {"id": "1454914181", "genre": "Children's Books", "title": "Our Solar System (Science for Toddlers)", "description": "The youngest astronomers can go forth and journey into outer space in this fun, basic introduction to the solar system. The unique format presents our sun and each planet in order with graduated flaps—turn each flap to reveal fascinating facts on each celestial body, and even the Milky Way!"}, {"id": "0808593056", "genre": "Children's Books", "title": "The Fourth Of July Story (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The 13 colonies desire independence, select Thomas Jefferson to write the Declaration of Independence, and carry the news of independence to the colonies."}, {"id": "184443429X", "genre": "Children's Books", "title": "R & L: Material Detectives Paper: Let's Look at a Comic Hardback (Read and Learn: Material Detectives)", "description": "\"Read and Learn\" is our extensive collection that helps young readers discover and understand the world around them. These books are packed full of fascinating facts and intriguing, labelled photographs that will really grab their attention. Using questions to focus learning, each title will prompt discussion, encourage information gathering and truly involve children in the topics they are studying. \"Material Detectives\": Encourages children to investigate an object using all of their senses. Each book takes a familiar item made from a single material and explores the different properties and uses of that material. A quiz at the end of each title tests comprehension and encourages research skills."}, {"id": "075345937X", "genre": "Children's Books", "title": "The Best Book of Snakes", "description": "Realistic illustrations capture each individual species, while evocative text anddramatic artwork recreate the life, habitats, and behavior of these fascinatingreptiles—from harmless grass snakes to the deadly taipan of Australia. Thishandy paperback is just the thing for young herpetologists on the go."}]