[{"id": "B0711FKDJJ", "genre": "Children's Books", "title": "Te Amo (Xist Kids Spanish Books)", "description": "\"Te amo como a una piedra saltarina... Te amo como al hueso de un perrito\" Celebrating the love between a parent and a child, this Spanish language picture book features a host of animals and the things they love about each other. Perfect for babies, toddlers, preschoolers and as a reminder to the big kids in your life."}, {"id": "0756545889", "genre": "Children's Books", "title": "Mesopotamia (Exploring the Ancient World)", "description": "The peoples of ancient Mesopotamia oversaw one of the major cradles of human civilization. The world’s first cities and empires grew on the plains of what is now Iraq. Some of the world’s first farmers worked land in what historians call the Fertile Crescent."}, {"id": "B01B9LTBIA", "genre": "Children's Books", "title": "World's Cutest Baby Animals (Explorer Series Book 1)", "description": "Come along as Explorer introduces your child to the cutest baby animals in the world!Gorgeous full-color pictures and lots of fun and engaging facts await young readers on every page. Did you know that a lion's roar can be heard five miles away? Or that a koala isn't really a bear at all? Your reader will learn all of this plus what each baby animal is actually called, what it eats, where it lives and much more!If you and your kids love beautiful pictures of adorable baby animals, World's Cutest Baby Animals is the perfect book for you!"}, {"id": "1607102870", "genre": "Children's Books", "title": "3-D Explorer: Safari Animals: A Journey Through the African Wilderness", "description": "With 3-D Explorer: Safari Animals, take a spectacular 3-D journey into the African wilderness with five incredible pop-up scenes that provide an in-depth look at the landscapes and animals of this fascinating continent. From the cool misty mountains of Uganda to the dry dusty plains of Namibia, explore a diverse range of habitats and learn how these amazing animals survive their harsh environments.Includes 5 pop-up scenes:Mountains: Virunga volcanoes in UgandaGrasslands: Serengeti plains in TanzaniaWetlands: Okavango wetlands of BotswanaWater Hole: Etosha National Park in NamibiaOn the Ground: Kruger National Park in South Africa"}, {"id": "1511600799", "genre": "Children's Books", "title": "Little Astronomer: Journey Into The Solar System: From The Sun To Eris (Kid Lit Science) (Volume 1)", "description": "Kids can discover the vast wonders of space by exploring the eight primary planets, comets, asteroids, moons, and dwarf planets. Each page illustrates a fun character that children will sure to enjoy as they learn the names and fun facts about each planet within the solar system."}]