[{"id": "1499482817", "genre": "Children's Books", "title": "Cool Crafts With Cloth (Don't Throw It Away...Craft It!)", "description": "What happens to cloth once a big project, such as making blankets or curtains for the home, is done? This book offers several possibilities for readers who love to craft! Clear instructions guide readers step-by-step through each project, showing how to complete it as well as where readers can add some personality to their cloth craft. An overall theme of recycling, reducing, and reusing waste offers readers practical ways to help the environment but still have fun and be creative."}, {"id": "B00SG65EOC", "genre": "Children's Books", "title": "#1 A Dog's Breakfast (The Nightmare Club)", "description": "The Nightmare Club is not for just ANYBODY. Only the spookiest, scariest stories get told at Annie's Halloween sleepovers―and if you can't take it, well, tough! Getting lost in the woods is no big deal for Glen. It's just one more thing he can whine and complain about. But then he encounters a strange creature―and gets on its bad side. Not long afterward, Glen disappears. What happened to him? Did his mysterious adventure in the woods have something to do with it? Only the members of the Nightmare Club will find out..."}, {"id": "0440402409", "genre": "Children's Books", "title": "The Story of Walt Disney: Maker of Magical Worlds (Yearling Biography)", "description": "When Walt Disney was a child, he loved to draw. It's no wonder he grew up to create such memorable and loveable characters as Mickey Mouse and Donald Duck.Walt Disney spent a lifetime entertaining and delighting millions of children and adults alike--on film, on television, and in his magical kingdoms of Disneyland and Disney world. This is his story."}, {"id": "0982680562", "genre": "Children's Books", "title": "Miracle", "description": "MIRACLE What is it like to go toe-to-toe with evil? To fight the very Prince of Darkness? This is the challenge that faces twelve-year-old Willie MacGregor and his best friend, Johanna, in Miracle, the exciting new book for mid-graders from best-selling author J. Helen Elza. After a prolonged separation, best friends Willie and Johanna are reunited in a hospital room, but their joy is short-lived. Their dream vacation becomes a nightmare, as Johanna, who now uses a wheelchair, goes missing. Willie's search for his friend leads him into a forest both fantastic and fearsome, and forces him into escalating confrontations with the evil shape-shifting prince who hates intruders, but welcomes a good fight. In her fiction debut for young people (ages 8 and up) Author Elza (Rosemillion) deftly blends equal portions of suspense, action, and drama in this epic fantasy-adventure. Miracle is a reader's delight that applauds the power of faith, the spirit of the physically challenged, and the bonds of friendship."}, {"id": "0689840721", "genre": "Children's Books", "title": "Whose Toes Are Those? (Flip-Top Board Books)", "description": "\"Bunny has some very ticklish animal friends. Whose toes are those is he tickling now? Flip open the top of each page to find out\"--Cover back."}]