[{"id": "0763659193", "genre": "Children's Books", "title": "10 Things I Can Do to Help My World", "description": "Even young children are eager to help the environment -- and here is a bright, inviting novelty book that offers simple ways to make a difference.Do you remember to turn off the tap while you brush your teeth? How about using both sides of the paper when writing and drawing? Or planting seeds and nurturing the new plants as they grow? Bold, child-friendly illustrations and die-cut pages will draw even the youngest listeners to this gentle reminder of the easy, everyday ways we can be kinder to the earth."}, {"id": "B00LU6Y73E", "genre": "Children's Books", "title": "Twenty-Four Salvador Dali's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Salvador Dali's Paintings. Twenty-Four Salvador Dali's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "1909991554", "genre": "Children's Books", "title": "Rita and the Romans (Rita the Rescuer)", "description": "It’s Roman day at the Sports Field. There’s plenty of work for Rita—a toddler’s being launched in the air from the catapult, a trumpeter’s in trouble, and she is even called upon to build Adrian’s Wall!"}, {"id": "0375939636", "genre": "Children's Books", "title": "The Police Cloud", "description": "In this funny and tender picture book for the youngest child, a fluffy cloud gets a job (with the help of his friend the police helicopter) as a police officer. But no matter how hard he tries, the qualities that make him a cloud seem to get in the way of his duties. He blocks the sun at the park instead of helping people and obscures traffic at an intersection instead of directing it. Upset, the cloud starts to cry. And it's his streaming tears—which inadvertently put out a fire in a burning building—that lead him to his true calling in life: as a firefighter!From the Hardcover edition."}, {"id": "1547137789", "genre": "Children's Books", "title": "Happy 61st Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 61 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]