[{"id": "0836858697", "genre": "Children's Books", "title": "Judaism: Religions of the World", "description": "Describes the origins, principal teachings, scriptures, important figures, historical events, holidays, places of worship, and community life of Judaism."}, {"id": "0823437833", "genre": "Children's Books", "title": "The 12 Days of Christmas", "description": "Jane Cabrera's signature animals celebrate Christmas with joy and love in this adaptation of the beloved holiday song. Her cheerful illustrations show magic mice, drumming dogs, skiing squirrels, and a whole crowd of festive creatures. Accompanying the colorful art and jolly text is sheet music set to Cabrera's lyrics."}, {"id": "1524766607", "genre": "Children's Books", "title": "The 12 Days of Preschool", "description": "Count the first twelve days of preschool with this fun-filled picture book inspired by “The 12 Days of Christmas”—perfect for fans of Natasha Wing’s “The Night Before . . .” series! Includes stickers for a great school-time reward.Celebrate the first 12 days of preschool! On the first day of preschool, all the kids learn how to share ONE fuzzy teddy bear. On the second day, the kids share TWO toy trains. The third day? THREE tricycles! Each of the first 12 fun-filled days of preschool are illuminated in this cumulative rhyming storybook based on \"The 12 Days of Christmas.\"Preschoolers and their parents and teachers will love spotting all the fun things to find in the classroom. It's a great way to calm first-day-of-school jitters and to reinforce the idea of sharing by talking about what to expect once preschool is underway. And the book includes stickers - perfect treats for the first 12 days of preschool.Also available: The 12 Days of Kindergarten, The 12 Days of Halloween, and The 12 Days of Valentine's."}, {"id": "1328791831", "genre": "Children's Books", "title": "There's a Tiger in the Garden", "description": "A gorgeous and imaginative debut picture book by author/illustrator Lizzy Stewart, perfect for fans of Emily Hughes, Peter Brown, and Julie Morstad. There’s nothing to do at Grandma’s house and Nora refuses to believe any outlandish tales of dragonflies as big as birds, grumpy polar bears who like to fish, or a magnificent tiger all allegedly residing in Grandma’s garden. Nora's too old for silly games. But this charming picture book proves you are never too young or too old to dream--and adventure can find you when you least expect it.When Grandma says she's seen a tiger in the garden, Nora doesn't believe her. She's too old to play Grandma's silly games! Everyone knows that tigers live in jungles, not gardens.   So even when Nora sees dragonflies as big as birds, and plants that try to eat her toy giraffe, and a polar bear that likes fishing, she knows there's absolutely, DEFINITELY no way there could be a tiger in the garden . . .   Could there?"}, {"id": "1515775143", "genre": "Children's Books", "title": "Scooby-Doo! and the Ruins of Machu Picchu: The Hidden City Howler (Unearthing Ancient Civilizations with Scooby-Doo!)", "description": "Ruh-roh! A haunted howling is coming from the ruins of Machu Picchu. It's up to Scooby-Doo and Mystery Inc. to solve the case. Readers join the gang as they explore the ancient ruins, learn about the Incas who called this city home, and use the clues to silence this mystery once and for all!"}]