[{"id": "1589978544", "genre": "Children's Books", "title": "Imagination Station Special Pack: Books 1-6 (AIO Imagination Station Books)", "description": "When they step into the Imagination Station, kids experience an unforgettable journey filled with action-packed adventure to inspire their imaginations. With each book, they’re whisked away with cousins Patrick and Beth to embark on a new journey around the world and back in time.Perfect for beginning readers, these easy-to-read chapter books will keep kids entertained as they journey through history with Patrick and Beth. This introductory six-book box set includes books 1–6 in the series: Voyage with the Vikings, Attack at the Arena, Peril in the Palace, Revenge of the Red Knight, Showdown with the Shepherd, and Problems in Plymouth."}, {"id": "1624312985", "genre": "Children's Books", "title": "Ichthyosaur (21st Century Junior Library: Dinosaurs and prehistoric animals)", "description": "This book details the life of the dinosaur known as Ichthyosaur. Readers will develop word recognition and reading skills while learning when Ichthyosaur lived and what it likely looked like. They will also find out how it lived, from what it ate to how it dealt with enemies. Additional text features and search tools, including a glossary and an index, help students locate information and learn new words."}, {"id": "0763632066", "genre": "Children's Books", "title": "Beowulf", "description": "The acclaimed author and illustrator of SIR GAWAIN AND THE GREEN KNIGHT return with an exhilarating edition of Britain's oldest epic.Long ago there was a Scandinavian warrior who fought three evils so powerful they could destroy whole kingdoms. Standing head and shoulders above his comrades, Beowulf single-handedly saves the land of the Danes from a merciless ogre named Grendel and then from his sea-hag mother. But it is his third terrible battle, with the death-dragon of the deep, in which he truly meets his match. Lovers of heroes, monsters, and the drama of battle will find this retelling as enthralling as it is tragic."}, {"id": "0439296390", "genre": "Children's Books", "title": "Girl.net: For Girls Who Click!", "description": "A hip and fun guide to the digital world reveals where girls can go to find information about their favorite stars, play games, shop, and chat, and provides advice on safely navigating the Internet, talking in a chat room, handling sticky cyber situations, creating websites, and much more! Original."}, {"id": "0310708257", "genre": "Children's Books", "title": "The Jesus Storybook Bible: Every Story Whispers His Name", "description": "The Moonbeam Award Gold Medal Winner in the religion category, The Jesus Storybook Bible tells the Story beneath all the stories in the Bible. At the center of the Story is a baby, the child upon whom everything will depend. Every story whispers his name. From Noah to Moses to the great King David---every story points to him. He is like the missing piece in a puzzle---the piece that makes all the other pieces fit together. From the Old Testament through the New Testament, as the Story unfolds, children will pick up the clues and piece together the puzzle. A Bible like no other, The Jesus Storybook Bible invites children to join in the greatest of all adventures, to discover for themselves that Jesus is at the center of God's great story of salvation---and at the center of their Story too."}]