[{"id": "0142300187", "genre": "Children's Books", "title": "Tallchief: America's Prima Ballerina", "description": "Growing up on the Osage Indian reservation, Maria Tallchief was a gifted pianist and dancer. According to Osage tradition, women are not permitted to dance, but Maria's parents recognized her gifts and allowed her to break the rule. Then when Maria reached the age of twelve, her father told her it was time to choose between her two loves. Maria chose ballet. It was a decision that would change not only the course of her life, but the face of classical ballet in America. The fascinating story of Maria Tallchief's rise to become America's prima ballerina will captivate young readers."}, {"id": "B071L75S8G", "genre": "Children's Books", "title": "Caterflies and Ice (Zoey and Sassafras)", "description": "With magical animals, science, mystery, and adventure -- the brand new series Zoey and Sassafras has something for everyone!  Easy-to-read language and illustrations on nearly every page make this series perfect for a wide range of ages.In the fourth book, an unexpected snow storm causes trouble for the magical creatures of the forest.  When Zoey and Sassafras attempt to rescue trapped caterfly eggs, they make a mistake.  Can they figure out a way to fix things before the baby caterflies hatch?"}, {"id": "1460232879", "genre": "Children's Books", "title": "The Brothers Three", "description": "We all know that bumble bees die after they sting once, but this story is fiction (make believe). In fiction, anything can happen with the stroke of a pen or pencil. Find out what happens when two bumble bee brothers like to sting people for fun.  Read how one bee helps his bee brother to see that hurting others is not funny or fun."}, {"id": "1681521393", "genre": "Children's Books", "title": "Do You Really Want to Meet Stegosaurus? (Do You Really Want to Meet a Dinosaur?)", "description": "New titles in our popular animal series introduce young readers to five dinosaur species plus a family of flying prehistoric reptiles (the Pterosaurs). In each book, a child explorer travels back in time to meet these incredible animals and shares his or her experiences, which are based on fossil finds. Delightful illustrations and carefully crafted text help the stories come alive, making these books both educational and entertaining. A young child adventures back in time to 153 million years ago to meet a Stegosaurus, learning about what this dinosaur ate, its size, and what its armored plates might be for. This illustrated narrative nonfiction title includes a map of fossil findings, glossary, and further resources."}, {"id": "0525467742", "genre": "Children's Books", "title": "101 Outdoor Adventures", "description": "Perfect for summer vacation, a wonderful guide, filled with an abundance of games, activities, and ideas such as making giant bubbles, becoming a sidewalk poet, and holding a backyard carnival, shows children how to make the most of the great outdoors."}]