[{"id": "0694014222", "genre": "Children's Books", "title": "Happy Easter, Mouse! (If You Give...)", "description": "Join Mouse from If You Give a Mouse a Cookie as he goes on an Easter egg hunt! Who is hiding eggs in Mouse’s house? This adorable board book combines an engaging Easter theme with a story about colors! This board book with sturdy pages is perfect for toddlers, who will enjoy the simple introduction to colors and counting. Each page has one or two sentences and points out a different color and number of eggs.Starring the ever-popular Mouse, this is a colorful and fun addition to a little one's Easter basket."}, {"id": "1615664815", "genre": "Children's Books", "title": "The ABC's of the B-I-B-L-E", "description": "Designed for preschool- and kindergarten-aged children, young readers will be captivated as they go letter by letter, exploring stories from the Old and New Testament. Parents will love the educational opportunity The ABC's of the B-I-B-L-E provides, helping their kids learn to read while also learning about the Father's love."}, {"id": "B06Y4PF4BD", "genre": "Children's Books", "title": "Earth Day for Beginner Readers (Seasonal Easy Readers for Beginner Readers Book 8)", "description": "Earth Day is celebrated on April 22nd every year, but the message at the end of this reader is \"Let's make every day Love our Earth Day!\" How can we help protect our beautiful planet? This rhyming reader suggests small changes that can make a big difference.Empower your Beginner Reader to help the environment while increasing their reading fluency."}, {"id": "0544715578", "genre": "Children's Books", "title": "Big Machines: The Story of Virginia Lee Burton", "description": "In this loving tribute to Virginia Lee Burton, the New York Times best-selling creators Sherri Duskey Rinker and John Rocco pay homage to the storied life of one of the most beloved creators in children’s literature.  Everyone in Folly Cove knows Virginia Lee as “Jinnee.” With her magical wands she can draw whatever she imagines, but for her sons Aris and Michael, she draws the most wonderful characters of all: BIG MACHINES with friendly names like Mary Anne, Maybelle, and Katy. Her marvelous magical wands can make anything move—even a cheerful Little House.      "}, {"id": "1600604390", "genre": "Children's Books", "title": "Irena's Jars of Secrets", "description": "The story of Irena Sendler, a Polish Catholic social worker who helped rescue nearly 2500 Jewish children from the Warsaw Ghetto in Nazi-occupied Poland during World War II. Includes afterword, author's note, sources and glossary."}]