[{"id": "B00XO5LZ7A", "genre": "Children's Books", "title": "Rutabaga the Adventure Chef", "description": "In a world where there are dragons, wyverns, and haunted squash, you'd figure someone would have recipes for them, right? Rutabaga and his magic cooking pot, Pot, join young adventurers Winnifred, Manny, and Beef on a quest to defeat a dragon, discover new ingredients, find monsters to have for and/or to dinner, and to save the day through cooking. Rutabaga will dare any danger to uncover new tastes, and there's a whole world full of food to try--from roasted mud leech to spider soup to peanut butter on crackers. His heroic recipes combine real ingredients, fantasy ingredients, and real ingredients that sound fantastical. Rutabaga the Adventure Chef is the perfect adventure for any kid grossed out when something weird shows up on the dinner table."}, {"id": "B075CMQ2YG", "genre": "Children's Books", "title": "Disney Manga: Tangled", "description": "Inspired by the hit Disney movie, Tangled.Rapunzel has lived inside an isolated tower all of her life, able to see the world outside her window but forbidden to leave. When the notorious thief Flynn Rider shows up, she makes a deal with him to finally break free and experience the world outside her prison. is the world as scary as Mother Gothel promised it wold be? Or will she find the answers behind her magical, flowing hair and the truth about her childhood? This magical adaptation retells the hit Disney movie using beautiful manga artwork."}, {"id": "1502632586", "genre": "Children's Books", "title": "Drug Wars (I Witness War)", "description": "The violence that surrounds drug dealing and drug trafficking has decimated whole communities, and, in some cases, reshaped daily life in entire countries. This volume takes a closer look at the people affected by the drug trade and the efforts being made to combat it. The book includes firsthand stories, critical thinking questions, and a summative activity, all with the aim of showing the human toll of the drug economy."}, {"id": "1632351315", "genre": "Children's Books", "title": "12 Incredible Facts About the Louisiana Purchase (Turning Points in US History)", "description": "Describes the Louisiana Purchase, providing information on events leading up to the exploration of the West, such as disputes between France and Spain for control of the territory, and the Lewis and Clark expedition."}, {"id": "0793508320", "genre": "Children's Books", "title": "The Disney Collection (Piano - Vocal - Guitar Series)", "description": "(Piano/Vocal/Guitar Songbook). The third edition of this collection perfect for those who love singing and/or playing the music of Disney features 60 favorites, including new additions from Tangled, Frozen and more. Songs includes: Beauty and the Beast * Can You Feel the Love Tonight * I See the Light * Let It Go * Mickey Mouse March * Supercalifragilisticexpialidocious * That's How You Know * Under the Sea * When You Wish Upon a Star * Zip-A-Dee-Doo-Dah * and more."}]