[{"id": "1597142980", "genre": "Children's Books", "title": "The Wolf Who Ate the Sky", "description": "A homemade modern folk tale  Once upon a time there was a wolf who was so hungry that when he went to bed he said, ''When I wake up, I am going to eat the first thing I see.'' The next morning when he opened his eyes the first thing he saw was the sky, and guess what happened next…  After the world goes dark, a brave boy, along with a menagerie of other animals, decides to confront the wolf who ate the sky. This utterly charming and mythic tale was created by Mary Daniel Hobson and her young daughter Anna. Accompanying the text are dreamy, evocative illustrations created by Anna's grandfather Charles Hobson."}, {"id": "1633340910", "genre": "Children's Books", "title": "The Young Citizen's Reader (Yesterday's Classics)", "description": "Describes the essential methods of political action at the town, state, and national level to lead boys and girls to notice and understand what is going on about them. Attention is then directed to the structure of the state in all its parts with a view to informing intelligent action in matters of politics."}, {"id": "0843198613", "genre": "Children's Books", "title": "Kaboom of Doom (Kung Fu Panda 2)", "description": "Join Po and the Furious Five as they protect China from the vengeful Shen and his secret weapon. But before Po can truly vanquish this threat, he must unlock the mysteries of his past. This reader is perfect for fans who are just learning how to read on their own."}, {"id": "0060724714", "genre": "Children's Books", "title": "Corbenic", "description": " It starts when Cal gets off the train at the wrong stop in the middle of the night, in the middle of nowhere. He's stranded.   Following a muddy path leads him to a castle that appears to be deserted. But inside is Corbenic, a magnificent hotel filled with rich people preparing for a banquet&#8212and Cal is their guest of honor. During the meal, he experiences a disturbing vision, but when he is asked to talk about what he has seen, he denies it. What if he's becoming crazy, like his mother?   When Cal wakes the next morning, the elegant castle turns out to be nothing more than an abandoned ruin. But something inside him has changed&#8212he now knows he needs to right the wrongs in his life. It will be a difficult journey, and if Cal achieves his goal, it will not be without cost. The first step&#8212he must return to Corbenic. "}, {"id": "1563971976", "genre": "Children's Books", "title": "Horizons: Poems as Far as the Eye Can See", "description": "When the sun rises, it lifts the curtain on the horizon, ushering in a brand-new day. And like a new day, each horizon is original. Sun, clouds, sky, water, even skyscrapers shape the distance and offer us new views and the chance to think about what lies beyond. Renowned poet and author Jane Yolen gives us her insights on horizons great and small in fourteen new poems. Inspired by Jason Stemple's stunning photographs of vistas found in deserts, swamps, mountains, and other scenic places, Ms. Yolen, in thoughtful, playful verse, allows us to imagine what happens when earth meets sky."}]