[{"id": "1554987105", "genre": "Children's Books", "title": "The Amazing Discoveries of Ibn Sina", "description": "Born in Persia more than a thousand years ago, Ibn Sina was one of the greatest thinkers of his time — a philosopher, scientist and physician who made significant discoveries, especially in the field of medicine, and wrote more than one hundred books. As a child, Ibn Sina was extremely bright, a voracious reader who loved to learn and was fortunate to have the best teachers. He memorized the Qur’an by the age of ten and completed his medical studies at sixteen. He spent his life traveling, treating the sick, seeking knowledge through research, and writing about his discoveries. He came up with new theories in the fields of physics, chemistry, astronomy and education. His most famous work is The Canon of Medicine, a collection of books that were used for teaching in universities across the Islamic world and Europe for centuries. Ibn Sina’s story, told in the first person and beautifully illustrated, provides a fascinating glimpse into the life of one of the great intellects of the past."}, {"id": "B00E78RWLG", "genre": "Children's Books", "title": "Adventures of a Mouse at Sea - The Navigator", "description": "...Cameron and Momma are swept out to sea and find themselves rescued by two human sailors and a cat. Can they escape, or maybe make friends with someone on board?  · The Captain? He's the master of his ship, and he does not like mice.  · The Lady of the boat does seem to have some mystical way of    communicating with Momma; maybe she can help.  · The Cat?  Well, he just wants to eat them or have them thrown overboard.  And every day, the boat gets farther away from home!  Can they escape, can they get home, what adventure lies ahead, and what does Cameron eventually come to desire most?A real sailor wrote this book shortly after setting out on a round-the-world cruise on a 41-foot sailboat in March 2013. The setting for this story is upon this real sailboat, sailing in real-time to actual places in the Caribbean.  The real Captain and his Lady really do have a teapot and all the boat “stuff” mentioned in the story, and it really does work (and break) as described.  The real adventure continues at http://svsoulmatie.blogspot.com Book 2 of Adventures of a Mouse at Sea ~ Castaway Cameron ~ has recently been released and Book 3 ~ Pirate Waters ~ is on the way."}, {"id": "B00J0LXQGK", "genre": "Children's Books", "title": "Surreal Peter (Peter: A Darkened Fairytale, Vol 4): Short Poems & Tiny Thoughts", "description": "Welcome to the surreal world of Peter: A Darkened Fairytale. Some of the strangest ideas have been taken and twisted into a new selection of 27 Short Poems and Tiny Thoughts - Surreal Peter.As always, the poetry books give hints to the forthcoming novels in the Peter stories. Look out for more escapades throughout the year from Peter, Slip and their bizarre friends.For this moment, enjoy the confusing, sometimes illogical places in the realm of Peter. Go plunging with Seebright the lift attendant, enter portals to Snakedom and Boaland through Boyle the barber's opening head. Get ready to be hunted by the witch Heriot White, live in a magic box and soar with dragons. Take the 4.02 key and slide it into your mind for a trippy disturbed adventure."}, {"id": "1599534703", "genre": "Children's Books", "title": "1, 2, 3 y los colores de querido dragon / Dear Dragon's Colors 1, 2, 3 (Dear Dragon Bilingual) (Spanish and English Edition)", "description": "\"A boy and his pet dragon have fun learning about counting and colors\"--Provided by publisher."}, {"id": "B00L4EDESG", "genre": "Children's Books", "title": "Archie Comics Spectacular: It's a Date (Archie Comics Spectaculars)", "description": "It's hilarious high school dating hi-jinx in a great pocket-sized edition from Archie Comics! This graphic novel collection features hand-picked, favorite stories about the comedically dysfunctional dating scene of friends Archie, Betty and Veronica at Riverdale High."}]