[{"id": "1934947830", "genre": "Children's Books", "title": "Jesus Never Missed a Jump Shot", "description": "To live a life of service, non-judgment, and compassion, is to express the glory of God whom is within you. When we find Christ in our hearts, there is no longer competition or comparison. There is only the spirit of love and togetherness. Through dedication, hard work, and reverence, we become one with the spirit of the game."}, {"id": "1944762086", "genre": "Children's Books", "title": "ABC Gulls", "description": "ABC Gulls, a picture book for early readers, offers a playful look at the alphabet with a coastal twist. A cast of seagulls, from Admiral to Zeke, chronicle scenes from everyday island life. Little ones can start by learning letters and move up to sounding out individual words. Early readers will enjoy reading full sentences, and parents and grandparents will have fun reading them out loud. Join our gulls as they get the grill going, jump off the jetty, and steal a sandwich!"}, {"id": "0142421995", "genre": "Children's Books", "title": "Encyclopedia Brown and the Case of the Carnival Crime", "description": "Ten exciting new adventures for the famous boy detective!Everyone's favorite fifth-grade gumshoe is back on the case! Following the classic Encyclopedia Brown formula, this installment presents ten mysteries, complete with answers at the end of the book that allow the reader to solve the cases along with the boy detective. Join Encyclopedia Brown as he takes on cases of giant diamonds, lazy lions, a country singer, and of course a trip to the carnival.“I loved Encyclopedia Brown as a kid.”—Junot Diaz, Pulitzer Prize-winning author of The Brief Wondrous Life of Oscar Wao"}, {"id": "1575842858", "genre": "Children's Books", "title": "Egyptian Mummies : Zoomers Series", "description": "Discover a brand-new kind of book when you flip open a Zoomer and enter an amazing new world of learning! Each flip of these multilayered books reveals another spread packed with facts until -- presto! -- you're back where you started. Kids (and adults, too!) won't be able to put their Zoomers down! Inexpensive and collectible, Zoomers make learning fun! How did the Egyptians mummify their dead? What is the curse of the mummy? Why did the Egyptians bury jewelry with their mummies? In Egyptian Mummies kids will be fascinated by the rituals of mummifying a body as they flip through the layers of a mummy. Dimensions (inches): 8 x 9 3/4"}, {"id": "1481766953", "genre": "Children's Books", "title": "Clark The Shark", "description": "Clark The Shark deals with bullying, which is a worldwide problem and can lead to negative consequences. In hopes that young children will learn, before they enter an advanced school environment, to accept other children as individuals and learn from \"Clark The Shark\" to treat others the way they would like to be treated. The effort to \"prevent\" rather than \"treat\" should be the focus by developing cultural competency strategies, skills and programs that inclusively enhance healthy communication and relationship building. Also, creating and sustaining a healthier social climate in schools and youth-centered environments, implementing prevention and intervention strategies, which have been shown to yield tangible, lasting benefits for individuals, families, schools and communities. Enjoy with each turn of the page."}]