[{"id": "0613433661", "genre": "Children's Books", "title": "Photography (Make It Work! Science (Paperback Twocan))", "description": "Provides instructions for photography projects involving a pinhole camera, tripod, zoom lens, and other pieces of equipment."}, {"id": "0807274259", "genre": "Children's Books", "title": "Sideways Stories from Wayside School", "description": "Read by Lionel WilsonTwo cassettes / two hours 48 mins.You can imagine the confusion at Wayside School when the builder made a terrible mistake.  You see, instead of building 30 classrooms side-by-side, he built them one on top of another.Maybe that accounts for the wacky goings-on in Mrs. Jewls' class.  Where else will you find children being turned into apples, dead rats wearing raincoats, and little girls who try to sell their toes?  If you're confused too, maybe Todd can explain it to you, but just remember, he leaves at noon."}, {"id": "B01FV979T4", "genre": "Children's Books", "title": "Looking Up: An incredible journey to find one's true identity", "description": "This endearing story revolves around the new life of an eaglet named Alfred, who as he learns new skills as an eagle, constantly compares himself to the other animals and birds around him. Alfred eventually realizes that he was born to be a mighty and proud eagle, but not without learning some valuable lessons first. This heartfelt tale delivers a sound message for children of all ages to celebrate and use the specific gifts and talents they were given to live out who they were created and destined to be."}, {"id": "1368002145", "genre": "Children's Books", "title": "Sam, the Most Scaredy-cat Kid in the Whole World: A Leonardo, the Terrible Monster Companion", "description": "A TERRIFICALLY TERRIFYING TALE!Sam is afraid of anything and everything-except for his friend Leonardo, the terrible monster.Kerry is afraid of everything and anything-except for her friend Frankenthaler, the other monster.One day, the two scaredy-cat kids make a particularly scary discovery: each other!AAH! EEK!Something has to be done. Something BIG. But what? "}, {"id": "0971122849", "genre": "Children's Books", "title": "Sun Kisses, Moon Hugs", "description": "No matter how far apart we are, I will always find ways to tell you I love you. Sun Kisses, Moon Hugs is a beautiful picture book with a simple but powerful message: love lasts forever. Lyrical writing and delightful multicultural illustrations provide perfect bedtime reading for any child. The book is also ideal for supporting children through grief, separation anxiety, divorce, illness or other traumatic situations, by wrapping them in a warm and comforting emotional security blanket and opening a dialogue on the nature of love. Even when loved ones cannot be with us, we can feel their presence through our deep connections to the natural world. Sun Kisses, Moon Hugs has received glowing testimonials from parents, librarians, social workers, teachers, hospice caregivers...and most importantly, kids."}]