[{"id": "1940947340", "genre": "Children's Books", "title": "Cubs in a Tub: Short Vowel Adventures (BraveMouse Readers)", "description": "From an award-winning author and illustrator comes a phonics book that focuses on short “u”–sound words   Gus and his little brother Russ are glum: their friends have sleds and they don’t. What to do? Make one, of course! Gus and Russ set out on a snowy adventure featuring a faster than expected sled, jumps, bumps, lumps, and when they need her most––Mum (and her delicious hot buttered muffins)! Cubs in the Tub incorporates many short “u” sound words in this heartwarming winter story."}, {"id": "099741300X", "genre": "Children's Books", "title": "Where Did My Sweet Grandma Go?: A Preschooler's Guide to Losing a Loved One", "description": "This beautiful picture book is filled with watercolor paintings by author Lauren Flake, as well as original artwork by the author's late mother, Dixie Benton Stucky, whom she lost to early onset Alzheimer's disease in 2013, while Lauren was pregnant with her youngest daughter. Where Did My Sweet Grandma Go? is a Mom's Choice Awards® Gold Recipient and a 2017 Next Generation Indie Book Awards Finalist."}, {"id": "1467785857", "genre": "Children's Books", "title": "#02 on the Sapphire's Trail (Hotel Strange)", "description": "The adorable residents of Hotel Strange are busy planning a music festival, until thieves kidnap Marietta and Mr. Léclair. A cast of quirky characters sets out to rescue them. As usual in Hotel Strange, distractions abound. They must first solve the mystery of a missing sapphire to save their friends, and the festival!"}, {"id": "0525420312", "genre": "Children's Books", "title": "Mouse, Look Out!", "description": "Young children can join in a thrilling game of chase as a little mouse forages for food and a warm place to sleep while a wily black cat quietly stalks the mouse and a mysterious beast waits in the shadows."}, {"id": "0062367161", "genre": "Children's Books", "title": "Warriors: Power of Three Box Set: Volumes 1 to 6", "description": "Erin Hunter’s #1 nationally bestselling Warriors series continues in Warriors: Power of Three!This box set includes all six books in the third Warriors series, and is perfect for the collections of longtime Erin Hunter fans and readers new to the Warriors world. The wild cat Clans have lived in peace and harmony for many moons, but now strange messages from their warrior ancestors speak of a terrifying new prophecy and a mysterious danger.The time has come for three young cats of ThunderClan—Hollypaw, Jawpaw, and Lionpaw—to become apprentices. Grandchildren of the great leader Firestar, they possess unusual power and talent. But secrets and uncertainty surround them, and a mysterious prophecy promises trouble to come. The fate of the warrior code rests in the paws of these three apprentices—and all of their strength will be needed for the Clans to survive. "}]