[{"id": "0765379457", "genre": "Science Fiction & Fantasy", "title": "Dancer's Lament: Path to Ascendancy Book 1", "description": "Esslemont's all-new prequel trilogy takes readers deeper into the politics and intrigue of the New York Times bestselling Malazan Empire. Dancer's Lament focuses on the genesis of the empire, and features Dancer, the skilled assassin, who, alongside the mage Kellanved, would found the Malazan empire."}, {"id": "1973357127", "genre": "Science Fiction & Fantasy", "title": "Blood World (Undying Mercenaries Series)", "description": "A dirty deal was struck. Humanity was allowed to keep three hundred rebellious worlds. In return, we declared war on a powerful enemy from beyond the frontier. A frantic build-up of forces has begun, but the task is hopeless. Seeking allies, Earth’s legions are sent to BLOOD WORLD. A planet on the fringe of known space, where the people only respect masters of combat. Earth’s Legions must impress them, but other alien powers have been invited to join the contest. The prize consists of billions of loyal troops—Earth must win. Fighting and dying and fighting again, the struggle is half-mad—but so is James McGill. BLOOD WORLD is the eighth book in the Undying Mercenaries Series."}, {"id": "B016XP4SBW", "genre": "Science Fiction & Fantasy", "title": "Windy City Sinners: A Magic Realism Crime Novel", "description": "\"...unlike most modern-day novels, Villines is interested in — wants to — grapple with the idea of sin and with the other great questions of human existence...Windy City Sinners is a freewheeling, wry and whimsical novel about the deepest human feelings and questions.\" PATRICK T. REARDON (patricktreardon.com)Part crime caper à la Donald Westlake, part magic realism tale in the spirit of Gabriel García Márquez, part John Kennedy Toolesque hijinks and high comedy, Windy City Sinners offers mystery and mayhem with fun and froth mixed in for good measure. The story takes place on the Far Northwest Side of Chicago, right on the edge of town where the cops and members of the Outfit live side-by-side in perfect disharmony. The unlikely partners in crime include a notorious hitman, a detective in league with a drug kingpin, a vengeful mailman, an embezzling bank clerk, a petty holdup man, a conniving cleaning lady, an embittered priest, and the ghost of composer Antonio Vivaldi.At sugarskullpress.com, watch a book trailer for Windy City Sinners and check out our classic and gothic mystery titles."}, {"id": "0062433229", "genre": "Science Fiction & Fantasy", "title": "Departure", "description": "From the author of the #1 bestselling The Atlantis Gene comes a new novel in which the world’s past and future rests in the hands of five unwitting strangers in this definitive edition of A. G. Riddle's time-traveling, mind-bending speculative thriller.En route to London from New York, Flight 305 suddenly loses power and crash-lands in the English countryside, plunging a group of strangers into a mysterious adventure that will have repercussions for all of humankind.Struggling to stay alive, the survivors soon realize that the world they’ve crashed in is very different from the one they left. But where are they? Why are they here? And how will they get back home?Five passengers seem to hold clues about what’s really going on: writer Harper Lane, venture capitalist Nick Stone, German genetic researcher Sabrina Schröder, computer scientist Yul Tan, and Grayson Shaw, the son of a billionaire philanthropist.As more facts about the crash emerge, it becomes clear that some in this group know more than they’re letting on—answers that will lead Harper and Nick to uncover a far-reaching conspiracy involving their own lives. As they begin to piece together the truth, they discover they have the power to change the future and the past—to save our world . . . or end it.A wildly inventive and propulsive adventure full of hairpin twists, Departure is a thrilling tale that weaves together power, ambition, fate, memory, and love, from a bold and visionary talent.  "}, {"id": "B075FZPCZG", "genre": "Science Fiction & Fantasy", "title": "GENTLEMEN PREFER ROBOTS: A COMEDY ABOUT LOVE AND AI", "description": "This short story follows the comic misadventures of a robot designer when his girlfriend dumps him. He comes up with a fiendish scheme to torment her with a lovesick robot. You'll never guess what happens when everyone gathers for a climactic meeting one fateful night."}]