[{"id": "B008NVLJ8K", "genre": "Science Fiction & Fantasy", "title": "The Saptarishi Prophecy", "description": "At the dawn of the Treta Yuga, the demon Kalkamba, is ravaging Bharatvarsha. Answering the anguished prayers of his victims, a prophecy is made. It announces his death at the hands of those forbidden to kill.The Saptarishi Prophecy shall take you by the hand to the fabled land of Bharatvarsha, where an epic battle brews. Where, for once, Evil might triumph......"}, {"id": "0978907817", "genre": "Science Fiction & Fantasy", "title": "Water Rites", "description": "We failed to check global warming. In this dry future water is the most valuable resource. It is power. And in the US, the Army Corps of Engineers has become the guardian and keeper of water. Life is metered by water - by it's lack and its location. And who controls it. Major Carter Voltaire, newly in charge of The Pipeline, the enormous water project that keeps much of the western US alive, finds himself standing between thirsty locals and the need to provide water to the many. He has seen devastating water riots and must find a way to prevent that from happening here, while protecting precious water. There are no good answers."}, {"id": "0062237365", "genre": "Science Fiction & Fantasy", "title": "Witches Abroad (Discworld)", "description": "Once upon a time there was a fairy godmother named Desiderata who had a good heart, a wise head, and poor planning skills—which, unfortunately, left the Princess Emberella in the care of her other (not quite so good and wise) godmother when death came for Desiderata. So now it's up to Magrat Garlick, Granny Weatherwax, and Nanny Ogg to hop on broomsticks and make for far-distant Genua to ensure the servant girl doesn't marry the Prince.But the road to Genua is bumpy, and along the way the trio of witches encounters the occasional vampire, werewolf, and falling house (well this is a fairy tale, after all). The trouble really begins once these reluctant foster-godmothers arrive in Genua and must outwit their power-hungry counterpart who'll stop at nothing to achieve a proper \"happy ending\"—even if it means destroying a kingdom."}, {"id": "1410920119", "genre": "Science Fiction & Fantasy", "title": "0: Sci-Fi & Fantasy (Cinematic History)", "description": "Science fiction and fantasy films are perhaps the most imaginative films, both in terms of story and technology. They have been filmed from the early days of naive low-key film-making through to the multi-million dollar serial blockbusters. As cinematic te"}, {"id": "1849701148", "genre": "Science Fiction & Fantasy", "title": "Warhammer 40,000: The Emperor's Will", "description": "Art book designed, written and drawn by GW legend John Blanche. Focusing on the servants of the Imperium.Games Workshop's legendary art director John Blanche shares the first of a series of conceptual sketches and art for the world of Warhammer 40,000.  Most of them never seen before"}]