[{"id": "B01995Z3SK", "genre": "Children's Books", "title": "10 things Santa does not want you to do (Moral building and safety): Santa Claus teaches you how to be a good kid", "description": "Santa teaches kids what not to do if they want to get their presents this Christmas. This book teaches kids about safety and morals though pleasing illustrations that children can relate to and with short, easy to understand text. A perfect gift for the holidays and for for anytime you want to teach your kids about safety and for developing good habits and morals."}, {"id": "1596160004", "genre": "Children's Books", "title": "Miss Mary's Missing Book Bag", "description": "Raccoon's curiosity gets the better of him, when he snatches Miss Mary's book bag.  Of course, inside the bag Raccoon finds several delicious and questionable things.  With the help of his friends, Raccoon discovers the only way to answer his questions is to return to the scene of his crime.  Check out what Raccoon finds when Miss Mary helps him answer his questions.    This is a book about libraries and librarians."}, {"id": "1426314515", "genre": "Children's Books", "title": "World History Biographies: Mozart: The Boy Who Changed the World With His Music (National Geographic World History Biographies)", "description": "At 5 years old, he composed a minuet. By six, he was performing for royalty. The compelling story of Wolfgang Amadeus Mozart is a timeless tale of musical genius, its rewards, and its pitfalls. Author and musician Marcus Weeks takes us around Mozart's world—from the Royal courts of 18th century Europe to the opera houses and balls where Mozart enjoyed triumph and fame. We meet the kings and queens of the age, learn of the young Mozart's favorite games, see the clothes he wore, and the new musical instruments of the time. The lively text also gives readers an appreciation of Mozart's vast legacy of immortal music.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information. From the Hardcover edition."}, {"id": "1474740995", "genre": "Children's Books", "title": "Cleansing the World: Flood Myths Around the World (Graphic Library: Universal Myths)", "description": "Gather round to hear of a devastating flood that washed across the lands told from ancient myths around the world! Cleansing the World gathers seven diverse flood stories in one book so readers can discover the unique differences and surprising similarities between these world myths all recreated in gripping graphic novel format. Dive into legends from various mythologies and traditions, including Indian, Incan, African, Aboriginal and more. Extra info provides insight into the culture and primary sources from which these myths originated. With the Universal Myth series, readers can experience exciting multicultural tales brought to life!"}, {"id": "0152002197", "genre": "Children's Books", "title": "Trouble", "description": "Tekleh is curious. Tekleh likes adventure. And trouble always seems to find him, no matter how hard he tries to avoid it. One day Tekleh’s father decides that a gebeta (also known as mancala) board will help keep Tekleh occupied--and out of trouble. “Time and place will prove no barrier to kids’ identification with an inadvertent mischiefmaker.”--The Bulletin"}]