[{"id": "1429679697", "genre": "Children's Books", "title": "Tractors in Action (Transportation Zone)", "description": "Pulling, plowing, hauling. Tractors do it all. Tractors help farmers plant crops, haul heavy loads, and much more. Learn more about these helpful vehicles in Tractors in Action."}, {"id": "0545273226", "genre": "Children's Books", "title": "Ocean Sunlight: How Tiny Plants Feed the Seas", "description": "In this timely book, acclaimed Caldecott artist Molly Bang and award-winning M.I.T. professor Penny Chisholm use poetic language and dazzling illustrations to introduce the oceanic world. From tiny aquatic plants to the biggest whale or fish, Bang and Chisholm present a moving, living picture of the miraculous balance sustaining each life cycle and food chain deep within our wondrous oceans. On land or in the deep blue sea, we are all connected--and we are all a part of a grand living landscape. Award-winning scientist Penny Chisholm, a leading expert on oceans, packs Ocean Sunlight with clear, simple science, illuminated by Molly Bang's wondrous illustrations. This informative, joyous book will help children understand and celebrate the astonishing role our oceans play in human life."}, {"id": "1628571004", "genre": "Children's Books", "title": "Everything's Better with Cheddar", "description": "Cheddar is a food-loving mouse who loves to cook gourmet meals while the lady of the house is sleeping. He enjoys trying new things and making new friends.  But he soon finds himself with a big problem! A house cat has been brought home from the shelter and everyone knows that cats eat mice. So Cheddar must find a way to get the \"fuzz ball of a creature\" to become his friend before it's too late.  How will Cheddar be able to become the cat's best buddy before he finds himself becoming a tasty treat?  Everything's Better with Cheddar is the first book of a series. The possibilities of his upcoming adventures are endless!   Natalka Prytula was finishing her degree in early childhood education when she took a children's literature class. She had to write and illustrate a children's book, and Cheddar was born. She teaches toddlers full-time at Westminster Early Childhood Programs in Buffalo, New York.   Publisher's website:  http://sbpra.com/NatalkaPrytula"}, {"id": "1979139369", "genre": "Children's Books", "title": "Ebay For Teens: Gain the Mental Edge To Make Real Money Online", "description": "In Ebay For Teens Crystal Tummala covers an easy to follow approach for you to harness inspiration and ideas for your eBay business. You can apply this technique to selecting merchandise, writing appealing ads, and how to draw traffic to your listing. Start or take your business to the next level today."}, {"id": "1624910769", "genre": "Children's Books", "title": "Boo-Tickle Tales: Not-So-Scary Stories for Ages 4-9", "description": "  The attraction of scary stories begins very early in childhood, but the fortitude to be truly scared comes later. So where are the scary stories for young children? Educators and storytellers, Ford and Norfolk deliver a silly and gently spooky collection of jumps, laughs, interactive moments, and mostly happy endings to satisfy the curious-for-creepy Pre-K through Grade 4 set. Their weirdly funny and gently scary collection of adapted folktales, original stories, and verses will delight those who enjoy being surprised more than being scared. This book is for: Parents, grandparents, and other mentors who work with children developmentally aged 4 to 9 Educators, librarians and others serving young listeners, who like silly and creepy stories, but may not like very scary material Audiences ages 4-9, who like creepy but not-too-scary stories.  Twelve pen-and-ink drawings based on folktale motifs complement the fanciful tone of the book."}]