[{"id": "1402292449", "genre": "Children's Books", "title": "Monster Machines! On the Construction Site", "description": "Kids who love to watch machines at work will be fascinated with this fun and informative book featuring fearsome machines used in construction. Learn all about the various vehicles and their functions from backhoes to bulldozers, including: • excavators • wrecking balls • pavers ...and more!"}, {"id": "1543504930", "genre": "Children's Books", "title": "Pro Hockey's Championship (Major Sports Champions) (Major Sports Championships)", "description": "The skater speeds to the net as the excited fans cheer. He positions himself for a slapshot. The puck glides past the goalkeeper. Score! The stakes are high in this Stanley Cup Finals game, as two of NHL's best teams fight for the win. Young readers will delight in learning fascinating facts about Stanley Cup records, the event's history, and some of its most heart-stopping games."}, {"id": "1426329938", "genre": "Children's Books", "title": "1,000 Facts About Insects (100 Facts About...)", "description": "Kids love bugs! Jam-packed with 1,000 fascinating facts, this colorful reference book is buzzing with all kinds of information about insect creepers, crawlers, fliers, stingers, biters, and more.From butterflies and honey bees to cockroaches and katydids, discover all you have ever wanted to know about these amazing animals. Discover which insects are the most common; which have the most painful sting; and which have awesome talents, like \"escape artist\" camouflage abilities. Learn about insect senses, insect predators, quirky facts about insect fossils, and which bugs are most closely related to our other animal friends. After this deep dive into the science of entomology, you'll \"bee\" an expert on bugs and will dazzle your family and friends with your newfound knowledge."}, {"id": "0635026414", "genre": "Children's Books", "title": "Elizabeth Cady Stanton: Women's Rights Activist (183) (1000 Readers)", "description": "These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses.Get the Answer Key for the Quizzes! Click HERE."}, {"id": "B00LFXZIRG", "genre": "Children's Books", "title": "Twenty-Four Edgar Degas's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Edgar Degas's Paintings. Twenty-Four Edgar Degas’s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}]