[{"id": "0765328771", "genre": "Science Fiction & Fantasy", "title": "2: Elsewhens: Book Two of Glass Thorns", "description": "Theater, magic, art, and politics all blend in Elsewhens, the second installment of the amazing high-fantasy series, Glass Thorns, from the imagination of Melanie Rawn.Touchstone, the magical theater troupe, continues to build audiences. But Cayden is increasingly troubled by his \"elsewhens,\" the uncontrolled moments when he is plunged into visions of the possible futures. He fears that his Fae gift will forever taint his friendships; his friends fear that his increasing distance will destroy him. But worldly success follows them-an apparent loss in the Trials leads to Touchstone being selected to travel to the Continent with a Royal Embassy to collect Prince Ashgar's new bride. They are the first theater artists to appear outside Albeyn for at least seventy years-for magic is suspect and forbidden elsewhere, and the Kingdom's easy race mixing and magic use horrifies the people they are to travel among.The Glass Thorns Series#1 Touchstone#2 Elsewhens#3 Thornlost#4 Window Wall#5 Playing to the Gods (forthcoming)"}, {"id": "1937013227", "genre": "Science Fiction & Fantasy", "title": "Deadlands: Trail Guides (Savage Worlds, S2P10210)", "description": "Take a tour of the less-traveled Weird West with your Epitaph correspondent Phineas P. Gage for the first three Deadlands Trail Guides, now compiled into one volume for ease of reference. In Trail Guide: South o' the Border, visit beautiful Mexico. Bask in the sun as centuries-old hatred festers in the midst of a three-sided civil war. In Trail Guide: Great Northwest, you'll see the snow has its own beauty. But in this land gripped by Famine, you might give your left arm for some jerky, and that might be what it's used for! When a war between the unnatural beasts in the woods threatens to wipe humanity from the region, will your posse be up to the challenge? Finally, the Trail Guide: Weird White North takes you to the tundra of Alaska and British Columbia, a land locked in ice north of the amazing Winterline, a fence made by Hellstromme Industries to hold back the cold itself! But something more sinister, more malevolent than mere winter is being held in check...for now! EachTrail Guide offers you a closer look at the people, places, and perhaps most important things you'll see in each region. And don't forget the mini-Plot Point Campaigns and Savage Tales in each, as well. You're bound to have fun or die tryin'! Deadlands Trail Guides, Volume 1 is not a complete game. It s a supplement for the Deadlands Reloaded setting for the Savage Worlds game system. This is a full-color Explorer's Edition sized book (6.5\" x 9\"). Softcover. Full-color. 320 pages."}, {"id": "B00GXK3OFY", "genre": "Science Fiction & Fantasy", "title": "A Gang of Fellows (A Melody of Hope Trilogy Book 1)", "description": "Kill the princess. Start a war. Melody, a poor serving girl with no money, no power, and no prospects for either, is thrown into the thick of things when a gang of criminals kidnaps her. Tossed into a world of intrigue and murder, she soon learns that only she can stop a coming war. She wants to do what is right, but doubt plagues her at every turn. Who can she really trust? Why is she alone so important? Can she truly stand against the face of evil, or will she succumb to its tempting ways? Embark on an epic fantasy set in a Victorian-esque world. The Five Kingdoms stand poised on the brink of a new era: airships fill the skies, steam-powered machines roll through the streets, and war is waged with cannon and musket rather than sword and pike. All of mankind is set to benefit from this new age, but there are those who desire more than peace and prosperity. A clandestine group seeking power and wealth has formed a terrifying plot to bring the world to its knees. One thing is certain: if Melody fails and the plot succeeds... hundreds of thousands will die."}, {"id": "1556343531", "genre": "Science Fiction & Fantasy", "title": "Gurps Traveller Behind the Claw: The Spinward Marches Sourcebook", "description": "Behind The Claw details the Spinward Marches, a complete sector of space. Over four hundred star systems are described in detail, along with essays on the Imperial Nobility and system of government, a detailed history of the region, referee's information, current events and a wealth of adventure material."}, {"id": "1544111479", "genre": "Science Fiction & Fantasy", "title": "Cold Stone & Ivy Book 2: The Crown Prince (The Empire of Steam) (Volume 2)", "description": "“The Crown Prince is dead, shot in the head. War is coming on iron feet.” A murdered Prince. A Gilded Empire. A clockwork locket that tick-tocks dark matter. The year is 1889 and Austria's Crown Prince Rudolf has been found with a bullet in his brain. Immediately, all eyes are turned to the Empire of Steam’s Mad Lord of Lasingstoke, a notorious ghost hunter and the last man to see the Crown Prince alive. As the first whispers of war cast a preternatural shadow over Europe, an international manhunt is launched to see the Mad Lord and his clockwork brother swiftly brought to justice. Unfortunately, young criminologist Ivy Savage has written herself into the plot and it takes all of her resourcefulness to keep them one step ahead of the firing squad. From airships over the Black Forest to a stolen ride on the Orient Express, it’s clear that the Gilded Empire is not the only thing hunting the Mad Lord. Ghost horses and iron giants, long-dead saints and an archduchess more cable than flesh; all want something from the de Lacey brothers, not the least of which being the resurrection of the crown prince himself. But Ivy knows that at the heart of it, two lockets alone control the destiny of Empires and the clockwork is ticking as they race back to Vienna and the dangerous labyrinth that lies beneath..."}]