[{"id": "0062404431", "genre": "Children's Books", "title": "Pete the Cat: Out of This World", "description": "Blast off into space with New York Times bestselling author and artists James Dean and everyone’s favorite cat-stronaut, Pete the Cat, in Pete the Cat: Out of This World. Includes over 30 fun stickers!When Pete heads off to space camp, he gets to float in zero gravity, build rockets, and even goes on an extraordinary interstellar mission that is out of this world—literally. Houston, ready to rock out with Pete the Cat!"}, {"id": "0008266980", "genre": "Children's Books", "title": "Year 4 Hands-on Maths: Using Manipulatives 10 Minutes a Day", "description": "Use manipulatives 10 minutes a day with these simple at-a-glance activities! Just 6 weeks of these activities will give children a richer and deeper mastery of maths by demonstrating abstract ideas and core mathematical concepts in a variety of representations and problem-solving contexts. Use manipulatives 10 minutes a day with these simple at-a-glance activities! • Easy to implement activities for all curriculum areas• Filled with photos for easy reference• Uses a variety of everyday objects and common maths resources Part of the Making Mathematics Count research project from the North Star Teaching Alliance, the approach has been fully trialled to success in primary schools across the country!"}, {"id": "B072ZBV9LF", "genre": "Children's Books", "title": "LarryBoy and the Merciless Mango (VeggieTales)", "description": "Laugh while you learn with all your VeggieTales™ friends!  Get ready for all the zaniness and fun you've come to expect from VeggieTales—in a new comic-style format that's perfect for early readers! In LarryBoy and the Merciless Mango you'll laugh while you learn a lesson about showing mercy with Bob and Larry and all your VeggieTales friends. Don't miss an adventure—be sure to collect each volume in this series:   Dave and The Giant PickleJosh and the Big Wall King George and the Ducky  LarryBoy and the Foolish Fig from Faraway  LarryBoy and the Merciless Mango LarryBoy and the Prideosaurus LarryBoy and the Quitter Critter Quad Squad LarryBoy and the Reckless Ruckus LarryBoy and the Rude Beet Lyle the Kindly Viking MacLarry and the Stinky Cheese Battle Minnesota Cuke and the Search for Samson's Hairbrush Rack, Shack, and Benny The Ballad of Little Joe The League of Incredible Vegetables Tomato Sawyer and Huckleberry Larry's Big River Rescue Veggies in Space: The Fennel Frontier Where's God When I'm Scared  "}, {"id": "9814779768", "genre": "Children's Books", "title": "Animal Fact File: Head-to-Tail Profiles of More Than 90 Mammals", "description": "Animal Fact File is a visual guide to the most important - and most interesting - unique anatomical features of the world's most irresistible and fascinating mammals. This work covers more than 90 popular warm-blooded creatures from every corner of the globe. Each animal is featured on a two-page, full-colour illustrated spread that shows the entire mammal and highlights interesting parts of its anatomy. Each entry includes notes on natural history, range, and habitat, along with measurements and characteristic features. Budding zoologists will enjoy leafing through these pages, which make for a nice artists' reference and an inviting coffee-table book as well."}, {"id": "B06XPY581D", "genre": "Children's Books", "title": "Dinosaur Empire! (Earth Before Us #1): Journey through the Mesozoic Era", "description": "Ronnie is just a normal fifth-grader trying to pass her science class’s impossible quiz on the history of dinosaurs . . . until she happens upon her neighbor—Ms. Lernin—a retired paleontologist. With the assistance of Science Magic, Ronnie and Ms. Lernin travel back through time and space to experience the Mesozoic Era firsthand. They visit three important time periods in the development of the Mesozoic Era: the Triassic, the Jurassic, and the Cretaceous. Along the way, Ronnie finds herself face-to-face with real-life dinosaurs and reptiles, like stegosauruses, velociraptors, and thalattosaurs. With the help of her neighbor’s trusty knowledge of prehistoric times, she learns the differences between herbivores, carnivores, and omnivores, as well as between dinosaurs, insects, and reptiles. This insightful and informative graphic novel uses engaging art to bring facts to life, giving kids the tools to understand the evolution of these prehistoric creatures and the important effects this era had on our world today.  "}]