[{"id": "1429619333", "genre": "Children's Books", "title": "The Star Spangled Banner in Translation: What It Really Means (Kids' Translations)", "description": "How long is four score and seven years? Just what are unalienable rights? These translations make important historical documents meaningful. Each book translates the work of a primary source into a language you can understand."}, {"id": "1631772562", "genre": "Children's Books", "title": "Twas the Night Before Duckmas", "description": "'Twas the Night Before Duckmas puts an Oregon Ducks spin on a classic tale. Find out what the Oregon Duck is up to the night before each football game in this charming kid's book.How do you celebrate the first game of the Duck football season? Do you lay out your game day clothes the night before? Do you get butterflies when the whistle blows? If you consider the first Duck game (or any Duck game) the best day of the year, 'Twas the Night Before Duckmas is for you!"}, {"id": "1405205385", "genre": "Children's Books", "title": "Pig's Prize", "description": "One morning, Pig gets a leaflet through the letter box, saying \"Gardening Competition. Grow Big things and win Big prizes!\" \"Hooray!\" thinks Pig. \"I'll win easily!\" And he sets to work, making a special growing mixture which he puts on everything. Then he waits to see what will grow the most. Eventually he grows a beautiful and absolutely enormous plant. But when the judges see it, they aren't impressed. Fortunately, almost nothing can dampen Pig's Spirits, and his friends come up with a wonderful way of making him a winner after all!"}, {"id": "0811877175", "genre": "Children's Books", "title": "In My Ocean", "description": "Turn the colorful die-cut pages of this irresistible board book to discover just what makes little dolphin's ocean so cozy. Is it the splashing waves? No, it's his loving family! Bright pictures, sweet reassuring messages, unique layered pages, and an adorable finger puppet combine to create interactive reading and playtime fun!"}, {"id": "B0756L2TM8", "genre": "Children's Books", "title": "The Spirit of Cattail County", "description": "Sparrow doesn't have many friends. Some kids believe her house near the swamp is haunted. Others think there's something \"unusual\" about her. But Sparrow's not lonely--she has a best friend who's always with her. He sits with Sparrow on her porch swing. He makes her smile by playing pranks in church. Yet Sparrow is the only one who can see him . . . because the Boy is a ghost. So when her mama passes away, Sparrow doesn't give up hope. After all, if the Boy can linger after death, then surely Mama can return as well.  But the Boy has a secret of his own, one that Sparrow will need to uncover before the ghost will lead her to Mama. To solve the mystery, Sparrows join forces with some unlikely allies--Maeve and Johnny, siblings from a family of town outcasts--and Elena, a visiting child fortune teller.With its loving depiction of small town life, and characters who feel like old friends, this magial debut  will enchant you, dazzle you . . . and make you feel at home."}]