[{"id": "379137060X", "genre": "Children's Books", "title": "13 Art Inventions Children Should Know", "description": "From the use of perspective to the invention of the paint tube, 13 examples of some of the most important breakthroughs in artistic technology offers kids an exciting new perspective on the world of art. This new volume in the highly successful \"13\" series uses colorful reproductions, glossaries, and a timeline to explore milestones in the history of art. Kids will learn about important innovations in art while they discover answers to questions such as: Why was oil painting invented? What were the subjects of the first photographs? How do you depict the world on a flat canvas? Filled with accessible, fascinating facts as well as creative suggestions for independent art projects, this unique introduction to art history shows young readers how art is made as well as how to enjoy it."}, {"id": "B00BRAK2QO", "genre": "Children's Books", "title": "The Book of Ghosts", "description": "Never before have Michael Hague′s paintings been so captivating, lending a further dimension of mystery and the macabre to the classic chilling tales in this collection which includes The Legend of Sleepy Hallow, The Tell-Tale Heart, The Mummy′s Curse, The Canterville Ghost, The Monkey′s Paw, The Story of the Inexperienced Ghost, A Diagnosis of Death, Laura, and The Statement of Randolph Carter. Adapted from legendary masters Edgar Allan Poe, Washington Irving, Oscar Wilde, and a host of others, this book, sixth in a series that includes Wizards, Dragons, Pirates, Fairies and Fairy Poetry, will be sure to frighten even the boldest of readers.  Ages 6-11"}, {"id": "B00TEE1L24", "genre": "Children's Books", "title": "Shoop Doo-Bee Doop: Pat and Her Cat Mat", "description": "Pat is a spunky, precocious little girl who enjoys playing and spending time with her cat, Mat. Pat’s mother is always singing phrases, which Pat then interprets as scatting—one of her favorite things to do. “Shoop doo-bee doop, doo-bee doop, doo-bee doo-bee doo-bee doop!” \"Shoop Doo-Bee Doop\" is a playful beginners’ book that helps children grasp the concept of rhyming. The story consists of repetition, building comprehensive skills, and feeding your child’s desire to learn by providing a sense of comfort through predictability. “My name is Pat, and this is my cat, Mat!”"}, {"id": "1893038394", "genre": "Children's Books", "title": "Jackson & Franklin", "description": "Danny Abbot’s fifth grade year is crawling by, but things change quickly when he loses his favorite teacher and makes the Majors of Little League all in the same week. Unfortunately, his new teacher turns out to be anything but friendly, and that’s not the only bad news. A questionable maneuver has landed the league’s two hardest-throwing pitchers on the same team. As the season unfolds, Danny must face not only his teacher but also a powerhouse team that’s devouring the competition. (Ages 12+) Jackson & Franklin is suitable for younger readers but can also be enjoyed by anyone who played sports as a kid and doesn’t mind taking a look back."}, {"id": "1499807058", "genre": "Children's Books", "title": "Jane Foster's Halloween (Jane Foster Books)", "description": "Introduce little ones to Halloween in this bold and graphic board book by illustrator and textile designer Jane Foster.In this beautiful and sophisticated board book, children will be introduced to bold images of Easter and Fall, such as pumpkins, black cats, bats, witches, haunted houses, and more!  Praise for Jane Foster's ABC and Jane Foster's 123:  \"Both titles are stunningly simple, but Foster is able to create some truly arresting images here, making both books pleasurable repeat reads. A fetching and effective introduction to the world of numbers.\" -starred review, Kirkus Reviews  \"It's a book that style-minded parents and kids can appreciate equally.\" -starred review, Publishers Weekly  \"This unusually attractive counting board book from the British illustrator and textile designer Jane Foster shows off her style in a way that will catch–and hold–the eye of grown-ups and younger children alike.\" -New York Times Children's Board Book roundup review"}]