[{"id": "1534520252", "genre": "Children's Books", "title": "Ancient Egypt (Unlocking Ancient Civilizations)", "description": "Discusses the history of Ancient Egypt, including the construction of the pyramids, what everyday life was like, and their religion and burial customs."}, {"id": "B00IDFJNZC", "genre": "Children's Books", "title": "THE 3 MONKEYS SWING LOW, SWING HIGH (Monkey Tales Book 4)", "description": "Do you and your kids want a gorilla-sized barrel of laughs? These are stories with adventure, humor and interactive character lessons built in so gently!In these stories the 3 Monkeys are real swingers. But it's not all fun, games and bananas. Their special gorilla friend Kabooley hasn't been around for a while and the 3 Monkeys search for him in \"Where's Kabooley?\"Then in \"Storm Warning\" their beautiful treehouse faces up to a fierce jungle storm. There seems to be no hope to escape the flood. Next, a \"Really Big Visitor to the Jungle\" surprises everyone, especially the hippopotamuses. Your taste buds will join in the hippo-potluck in honor of this visitor. \"Can You?\" is a story of extreme adventure, courage and cooperation. It will have you gasping with fear and cheering the surprising bravery that comes about.But there is also time for relaxation and memories in \"Mother Monkey Rhymes.\" The 3 Monkeys give funny twists to that Old Mother Hubbard lady! You'll be quoting these rhymes for your friends for a long time. So get ready to interact as readers and listeners to these stories. Or just read them by yourself and let your imagination become a playmate with these Jungle Land friends. ."}, {"id": "0750295902", "genre": "Children's Books", "title": "The Vietnam War? (Did Anything Good Come Out of)", "description": "This book considers the Vietnam (or Second Indochina) War, 1955-1975, which may have killed as many as 3 million troops and civilians. It divided America, it aroused huge opposition around the world and it divided generations. Why was it fought and what were the outcomes? Did it have any unexpected consequences? Did any good at all come out of it?"}, {"id": "1606060856", "genre": "Children's Books", "title": "The Fate of Achilles", "description": "When Achilles was born, the Fates—the three female deities who shaped people’s lives—announced that his destiny would be tied to that of Troy. Son of the nymph Thetis and Peleus, king of the Myrmidons, the fiercest warriors in all of Greece, Achilles was raised by the centaur Chiron, who taught the boy fighting skills and imbued him with a strong sense of honor.  When asked to help avenge the Greeks against the Trojans, who had kidnapped the Greek princess Helen, Achilles answers the call, even though his mother warns him that battling the Trojans will bring him eternal glory but will cost him his life. Fighting alongside the troops of King Agamemnon, Achilles’s sense of honor and capacity for empathy are both tested. Achilles goes on to meet his fate against the Trojans but, in the end, who really decided his fate? Was it the gods, or was it Achilles himself? This epic tale is enlivened by bold and beautiful illustrations reminiscent of ancient Greek art. Ages nine to twelve. "}, {"id": "1438050119", "genre": "Children's Books", "title": "Furry Bunny (Mini Friends Touch & Feel)", "description": "Delight all of Baby's senses with this adorable little book that has a \"spot\" of fur that Baby can touch and feel right on the front cover!Furry Bunny is out and about, meeting friends in the garden. Bright illustrations and gentle text stimulates babies' sense of sight and hearing, and introduce fun facts that can help your little one learn new words and ideas. Perfectly sized for little hands to explore and enjoy."}]