[{"id": "1590216415", "genre": "Science Fiction & Fantasy", "title": "So You Want to Be a Robot and Other Stories", "description": "Step one: forget the convention and disregard the binary. Gender? Sexuality? Old words unsuited for new consciousness. The twenty-one stories in this book challenge the imagination as only acclaimed author A. Merc Rustad can. Pages of robots and AIs constructing lives and exploring \"humanity\"; wasted worlds with monstrous cityhearts; assassins and the perils of enchanted labyrinths; and always the raw truths of love, loss, and devotion. Step two: read these science-fiction and fantasy tales as if they are the only stories you will discover on your bookshelf this day. Step three: dare to feel.  "}, {"id": "1477825827", "genre": "Science Fiction & Fantasy", "title": "Time's Edge (The Chronos Files)", "description": "To stop her sadistic grandfather, Saul, and his band of time travelers from rewriting history, Kate must race to retrieve the CHRONOS keys before they fall into the Cyrists’ hands. If she jumps back in time and pulls the wrong key—one that might tip off the Cyrists to her strategy—her whole plan could come crashing down, jeopardizing the future of millions of innocent people. Kate’s only ally is Kiernan, who also carries the time-traveling gene. But their growing bond threatens everything Kate is trying to rebuild with Trey, her boyfriend who can’t remember the relationship she can’t forget.As evidence of Saul’s twisted mind builds, Kate’s missions become more complex, blurring the line between good and evil. Which of the people Saul plans to sacrifice in the past can she and Kiernan save without risking their ultimate goal—or their own lives?"}, {"id": "B00KK6A03Q", "genre": "Science Fiction & Fantasy", "title": "Elegy on Kinderklavier (Linda Bruckheimer Series in Kentucky Literature)", "description": "\"The stories in Elegy on Kinderklavier travel around the world and to the moon, and along the way they tell you everything they know. Arna Hemenway writes a fiction whose satisfactions are not merely narrative but musical, and it is a pleasure to listen to his stories as they rise into song.\"—Kevin BrockmeierThe stories in Elegy on Kinderklavier explore the profound loss and intricate effects of war on lives that have been suddenly misaligned. A diplomat navigates a hostile political climate and an arranged marriage in an Israeli settlement on a newly discovered planet; a small town in Kansas shuns the army recruiter who signed up its boys as troops are deployed to Iraq, falling in helicopters and on grenades; a family dissolves around mental illness and a child's body overtaken by cancer. The moment a soldier steps on an explosive device is painfully reproduced, nanosecond by nanosecond. Arna Bontemps Hemenway's stories feel pulled out of time and place, and the suffering of his characters seem at once otherworldly and stunningly familiar. Elegy on Kinderklavier is a disquieting exploration of what it is to lose and be lost.Arna Bontemps Hemenway's fiction has appeared in The Missouri Review, A Public Space, the Seattle Review, and Ecotone. Originally from Kentucky, he holds an MFA from the Iowa Writers' Workshop, and has received scholarships from the Sewanee Writers' Conference and Truman Capote Literary Trust."}, {"id": "B0756HL8LR", "genre": "Science Fiction & Fantasy", "title": "Witchmark", "description": "C. L. Polk arrives on the scene with Witchmark, a stunning, addictive fantasy that combines intrigue, magic, betrayal, and romance.In an original world reminiscent of Edwardian England in the shadow of a World War, cabals of noble families use their unique magical gifts to control the fates of nations, while one young man seeks only to live a life of his own.Magic marked Miles Singer for suffering the day he was born, doomed either to be enslaved to his family's interest or to be committed to a witches' asylum. He went to war to escape his destiny and came home a different man, but he couldn’t leave his past behind. The war between Aeland and Laneer leaves men changed, strangers to their friends and family, but even after faking his own death and reinventing himself as a doctor at a cash-strapped veterans' hospital, Miles can’t hide what he truly is. When a fatally poisoned patient exposes Miles’ healing gift and his witchmark, he must put his anonymity and freedom at risk to investigate his patient’s murder. To find the truth he’ll need to rely on the family he despises, and on the kindness of the most gorgeous man he’s ever seen.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}, {"id": "1101972122", "genre": "Science Fiction & Fantasy", "title": "Stories of Your Life and Others", "description": "Includes “Story of Your Life” the basis for the major motion picture Arrival, starring Amy Adams, Forest Whitaker, Jeremy Renner, and directed by Denis Villeneuve.“Shining, haunting, mind-blowing tales . . . Ted Chiang is so exhilarating, so original, so stylish he just leaves you speechless.” —Junot DíazStories of Your Life and Others delivers dual delights of the very, very strange and the heartbreakingly familiar, often presenting characters who must confront sudden change—the inevitable rise of automatons or the appearance of aliens—with some sense of normalcy. With sharp intelligence and humor, Chiang examines what it means to be alive in a world marked by uncertainty, but also by beauty and wonder. An award-winning collection from one of today's most lauded writers, Stories of Your Life and Others is a contemporary classic."}]