[{"id": "0756500125", "genre": "Children's Books", "title": "Abraham Lincoln (Compass Point Early Biographies)", "description": "A biography of Abraham Lincoln, the sixteenth president of the United States, known as a wise and compassionate man and an eloquent speaker, whose determination helped preserve the Union during the Civil War."}, {"id": "0689822022", "genre": "Children's Books", "title": "Stars That Shine", "description": "Compiles stories from some of today's most famous country music stars--including LeAnn Rimes, Loretta Lynn, and Vince Gill--about their childhood and memories of growing up."}, {"id": "1512486426", "genre": "Children's Books", "title": "World War II Spies and Secret Agents (Heroes of World War II)", "description": "Under cover and in secret during World War II, Allied spies and secret agents worked behind the scenes to send messages, take pictures, and find out about the enemy's plans. These spies broke codes and stopped weapons programs. Eventually, their work helped the Allies win the war. These brave men and women risked their lives to fight back against the Axis powers who invaded their homes and interrupted their lives. Learn more about these hidden heroes of World War II: a famous singer, a major-league baseball player, a well-known writer, and many others who helped change the course of history."}, {"id": "1635175747", "genre": "Children's Books", "title": "Archaeopteryx", "description": "Explores what scientists have uncovered about Archaeopteryx. Colorful photos and illustrations help bring each dinosaur to life as easy-to-read text guides readers through important discoveries about its appearance, diet, and habitat."}, {"id": "143291216X", "genre": "Children's Books", "title": "Ancient China (China Focus)", "description": "What are oracle bones? How long is the Great Wall of China? What was the Silk Road? China Focus offers fascinating and detailed coverage of a major world power. The four titles examine different aspects of China and its interaction with the world."}]