[{"id": "B01LXQPP3O", "genre": "Science Fiction & Fantasy", "title": "Soul of the World (The Ascension Cycle)", "description": "Three heroes must rise to take their place in battle for the fate of the world, but a fourth contender lurks on the horizon in the first book of this epic fantasy trilogy for fans of Mistborn and The Black Prism.It is a time of revolution. In the cities, food shortages stir citizens to riots against the crown. In the wilds, new magic threatens the dominance of the tribes. and on the battlefields, even the most brilliant commanders struggle in the shadow of total war. Three lines of magic must be mastered in order to usher in a new age, and three heroes must emerge. Sarine is an artist on the streets of New Sarresant whose secret familiar helps her uncover bloodlust and madness where she expected only revolutionary fervor.Arak'Jur wields the power of beasts to keep his people safe, but his strength cannot protect them from war amongst themselves.Erris is a brilliant cavalry officer trying to defend New Sarresant from an enemy general armed with magic she barely understands. Each must learn the secrets of their power in time to guide their people through ruin. But a greater evil may be trying to stop them.Start reading this gripping, vibrant, and imaginative addition to the epic fantasy canon for readers of Brandon Sanderson, Brian McClellan, and Miles Cameron. "}, {"id": "1588463524", "genre": "Science Fiction & Fantasy", "title": "Vampire Daeva Kiss of the Succubus*OP (Vampire: The Requiem (White Wolf))", "description": "The Daeva Clan Book for Vampire: The Requiem™  Love them or hate them, the Daeva are the ones you die for. Tempters and priests, madonnas and horrors, these vampires feed on the blood and vices of the World of Darkness ― and feed well. From the best parties to the worst parts of town, be seduced by the beautiful among the Damned. For the Succubi, a good-looking corpse is only the first step in the Danse Macabre.  A Clan book for Vampire: The Requiem™  • Trace the history of the Daeva ― from their first chilling nights in Sumeria to the sticky heat of modern cities.  • Tune into the Cacophony, the underground journalism of the Kindred. Find out what it takes to stay on the cutting edge of the Masquerade... and why that edge is cutting deeper than ever.  • Experience the Daeva through the “writing” of the living and the dead from around the world. Players and readers are drawn into a World of Darkness that’s more frighten-ing every night.  • New Merits, bloodlines, Discipline powers, and clan secrets that every Vampire: The Requiem player will want to have."}, {"id": "1601257961", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Player Companion: Weapon Master’s Handbook", "description": "Being proficient with a weapon is a good start, but you can become a true artist of combat with the secrets of the Pathfinder Player Companion: Weapon Master's Handbook! Within the volume’s pages are the benefits of studying at the great schools of war, details on fighting techniques honed over centuries of gladiatorial combat, and rules for learning several divine fighting techniques. Also featuring new feats, magic items, archetypes, and expanded options for the stamina and combat trick rules first presented in Pathfinder RPG: Pathfinder Unchained, this player-friendly volume contains everything you need to become a master with any conceivable weapon!"}, {"id": "0821406515", "genre": "Science Fiction & Fantasy", "title": "The Romance of William Morris", "description": "The Romance of William Morris traces the intellectual, emotional, and literary development of Morris, a representative Victorian, as he explores the classic themes of love, fate, and death-chiefly through the genre of romance. Professor Silver points out the ways in which Morris’s personal and social vision, interwoven in his literary work, contributes to his art, design, and social theory, as well as to some of the major intellectual and artistic movements of his time.Exploding the myth of Morris’s escapism and demonstrating his importance as a scholar, historian, and mythmaker, the book studies Morris’s uses of the past and shows how he transformed classical and medieval materials and institutions to viable positive and negative models for his own culture. For the intellectual and social historian, the book clarifies the fact that Morris was a paradigm for the Victorian imagination. For the literary historian, it reveals hw Morris records in literature his movement from an idealized view of romantic love to an obsession with it, his disillusionment with eros and his final attainment of a balanced view of passion."}, {"id": "B000HP8KCI", "genre": "Science Fiction & Fantasy", "title": "Science Fiction Digest, October-November 1981", "description": "Vol. 1, No. 1. FEATURES: Editorial by Shawna McCarthy; \"Speculations\" (essay) by John Silbersack; \"Asimov on Science Fiction\" by Isaac Asimov; \"How Easy to See the Future\" (1975) by Isaac Asimov; \"The Dreams of Science Fiction\" (1981) by Isaac Asimov. FICTION: \"Swarmer, Skimmer\" by Gregory Benford; \"The Pride of Chanur\" (excerpt) by C. J. Cherryh; \"Sunwaifs\" (excerpt) by Sydney J. Van Scyoc."}]