[{"id": "1423166310", "genre": "Children's Books", "title": "The Kane Chronicles", "description": "A collection fit for the (Egyptian) gods! All three hardcover books in the blockbuster Kane Chronicles trilogy are together at last, encased in a deluxe box along with two bonus posters. This boxed set will be treasured by readers of all ages, whether they’re experiencing Sadie and Carter's amazing adventures for the first time or are faithful fans eager to devour the saga all over again."}, {"id": "B01FOQ1N4Q", "genre": "Children's Books", "title": "My Crazy Pet Frog: I Gave My Pizza A Spanking", "description": "Great heavens! This frog really is crazy!This time he claims he’s a secret agent and that there’s a spy in his pizza.Will the world ever be the same again?Approximately 3,000 words, 10 images, and 1 big spanking.Descriptions of my other popular children's books are included after the main feature (an additional 5 pages).NOTE: A sneak peek of My Crazy Pet Frog: The Nightmare Pizza Before Christmas is included in this volume!"}, {"id": "0431076618", "genre": "Children's Books", "title": "Science Topics: Chemicals In Action (Paperback)", "description": "Designed to provide full curriculum support for science, this volume covers chemicals in action and includes: informative text; clear illustrations; and a wide range of examples drawn from topical areas of science demonstrating the relevance of chemicals."}, {"id": "B076DW5P78", "genre": "Children's Books", "title": "Weather and Climate through Infographics (Super Science Infographics)", "description": "Trying to breeze through weather and climate facts just might cause a brain freeze! You're showered with details about extreme temperatures (Earth's record high is 134°F and record low is -129°F), crazy heights (our atmosphere extends 6,200 miles above Earth), and even huger mysteries (how predictions in weather and climate work). How can all these big numbers and concepts make more sense? Infographics! The charts, maps, and illustrations in this book tell a visual story to help you better understand key concepts about weather and climate. Crack open this book to explore mind-boggling questions such as: • How do cold and warm fronts change weather? • How can cities at similar latitudes have significantly different climates? • How do ocean currents help create winds, temperature changes, and storms? The answers are sure to blow you away!"}, {"id": "0763664278", "genre": "Children's Books", "title": "A Voice of Her Own: Candlewick Biographies: The Story of Phillis Wheatley, Slave Poet", "description": "The moving story of how the first published African-American female poet regained what had been taken away from her and from slaves everywhere: a voice of her own.\"We'll call her Phillis.\"In 1761, a young African girl was sold to the Wheatley family in Boston, who named her Phillis after the slave schooner that had carried her. Kidnapped from her home in Africa and shipped to America, she'd had everything taken from her - her family, her name, and her language.But Phillis Wheatley was no ordinary young girl. She had a passion to learn, and the Wheatleys encouraged her, breaking with unwritten rule in New England to keep slaves illiterate. Amid the tumult of the Revolutionary War, Phillis Wheatley became a poet and ultimately had a book of verse published, establishing herself as the first African American woman poet this country had ever known. She also found what had been taken away from her and from slaves everywhere: a voice of her own."}]