[{"id": "1467713120", "genre": "Children's Books", "title": "Gabby Douglas (Amazing Athletes)", "description": "Although she's just 4 feet, 11 inches tall, Gabby Douglas made a larger-than-life impact on the 2012 Olympic Games in London. Gabby dominated the gymnastics all-around competition with her flawless execution and amazingly high flips, winning gold by a landslide. In early 2012, this pint-sized powerhouse was ready to quit gymnastics for good, but she kept going. Competing at the Olympics at just sixteen years old, she became the best female gymnast in the world. Read about this incredible athlete's journey from Virginia Beach to London gold."}, {"id": "0486283380", "genre": "Children's Books", "title": "Victorian Easter Stickers and Seals: 68 Full-Color Pressure-Sensitive Designs", "description": "Vintage illustrations of rabbits, chicks, children, and Easter eggs, Easter bunny with big bow tie, many others."}, {"id": "B009V7I04Q", "genre": "Children's Books", "title": "10 Witch Hats (A Counting Picture Book Book 9)", "description": "Teach your child how to count to ten with this fun '10 Witch Hats: A Counting Picture Book'  featuring little witch hats. Watch the delight in your child's face as he or she counts the witch hats on each page up to the number ten.Check out the other fun count to ten books in Ashley's 'Counting Picture Book' series while the introductory prices are still low. 10 Little Pumpkins10 Little Ghosts10 Little Cows10 Little Elephants10 Little Hippos10 Little Pigs10 Little Penguins10 Little Zebras             "}, {"id": "B019K2JGXU", "genre": "Children's Books", "title": "The Christmas Crocodile (Nancy Pearl's Book Crush Rediscoveries)", "description": "From Caldecott-winning illustrator David Small and bestselling author Bonny Becker, an unforgettable Christmas story that will leave the whole family giggling.When Alice Jayne finds a crocodile under the tree on Christmas Eve, her family goes into an uproar! The Christmas Crocodile doesn’t mean to be bad, not really, but soon he is eating up Christmas—from the dinner roast to the left stove-top burner…even the Christmas tree! Everyone has an opinion about what to do with him. Uncle Theodore suggests they send him to Africa, Father recommends the zoo, and Aunt Figgy mentions an orphanage. But Alice Jayne thinks the Christmas Crocodile deserves a real family. Can she find him a new home? And will she and the family survive till Christmas morning, with that naughty crocodile gobbling up everything in sight?"}, {"id": "1442457023", "genre": "Children's Books", "title": "The Fantastic Flying Books of Mr. Morris Lessmore", "description": "The book that inspired the Academy Award–winning short film, from New York Times bestselling author and beloved visionary William Joyce.Morris Lessmore loved words.He loved stories.He loved books.But every story has its upsets.     Everything in Morris Lessmore’s life, including his own story, is scattered to the winds.     But the power of story will save the day.     Stunningly brought to life by William Joyce, one of the preeminent creators in children’s literature, The Fantastic Flying Books of Mr. Morris Lessmore is a modern masterpiece, showing that in today’s world of traditional books, eBooks, and apps, it’s story that we truly celebrate—and this story, no matter how you tell it, begs to be read again and again."}]