[{"id": "1622957377", "genre": "Children's Books", "title": "A Cup of Tea for Tiger and Me", "description": "'s playtime as usual when Lauren dresses up for tea, but she's in for a surprise when a guest joins her party! Come along with Lauren and Tiger for a magical tea time adventure full of imagination and fun. When Tiger makes a mess, does it ruin the party? Or does Lauren realize the importance of love and forgiveness? This story is a fun tale for the animal lover in all of us!"}, {"id": "1943541361", "genre": "Children's Books", "title": "Gideon", "description": "Superbook takes Joy, Chris, and Gizmo back in time to meet Gideon - an unlikely hero hiding from enemies who have taken over Israel. The Angel of the Lord appears to Gideon, and he is transformed from a coward into a bold leader. Gideon faithfully follows God's instructions, even when others doubt his wisdom. The children discover how to find courage to face any challenge. CBN's Superbook team is made up of Emmy-winning artists and storytellers, whose credits include Mulan, The Lion King, and Beauty and the Beast. Together they are collaborating to completely reimagine the classic Superbook series using the latest 3D CGI technology. The new Superbook honors the life-changing legacy of the classic series and introduces the stories of the Bible to a new generation."}, {"id": "145981181X", "genre": "Children's Books", "title": "Ramadan: The Holy Month of Fasting (Orca Origins)", "description": "The month of Ramadan offers the opportunity to improve one's personal and spiritual behavior. By focusing on positive thoughts and actions, Muslims build a closer connection with God and come away from the month feeling spiritually renewed. Ramadan: The Holy Month of Fasting explores the richness and diversity of the Islamic tradition by focusing on an event of great spiritual significance and beauty in the lives of Muslims. Rich with personal stories and stunning photographs, Ramadan demystifies the traditions and emphasizes the importance of diversity in a world where Islamophobia is on the rise."}, {"id": "1608867900", "genre": "Children's Books", "title": "Peanuts Vol. 7", "description": "It was a dark and stormy night...But no longer! PEANUTS happiness and adventure awaits you in this collection, filled to the brim with original Schulz wonders and over a dozen all-new stories starring all of your best pals, from Good Ol' Charlie Brown to the one and only Lucy van Pelt. There's no end to the neighborhood fun as legendary cartoonist Charles M. Schulz's classic continues in PEANUTS Volume Seven.   Featuring classic from Charles M. Schulz and brand new stories from Jason Cooper, Vicki Scott (The Beagle Has Landed), Jeff Dyer, Scott Jeralds (Batman: Brave and the Bold), Robert Pope (Scooby Doo), and Donna Almendrala."}, {"id": "0575020210", "genre": "Children's Books", "title": "The Long Secret", "description": "Harriet the Spy refuses to become ruffled when an unidentified person starts leaving disturbing notes all over the quiet little beach town of Water Mill. She’s determined to discover the author of the notes. And she drags her best friend, mousy Beth Ellen, into all kinds of odd and embarrassing situations in her efforts to reveal the culprit. Observing in her own special, caustic way with her ever-present notebook, Harriet the Spy is on the case. But will she be ready to face the truth when she finds it?From the Trade Paperback edition."}]