[{"id": "1599616173", "genre": "Children's Books", "title": "1: Star Wars Episode III: Revenge of the Sith", "description": "Based on the screenplay by George Lucas-the official comics adaptation of the most anticipated of the Star Wars films! The action of the Clone Wars comes to a dramatic conclusion, and events are put in place for A New Hope. Battles rage in space, armies clash on alien worlds, heroes become martyrs, and friends become enemies-and the galaxy is forever changed! Spotlight editions are printed on high-quality paper and with reinforced library bindings specifically printed for the library market. Grades 6-12."}, {"id": "0689825773", "genre": "Children's Books", "title": "My Bridges of Hope", "description": "In 1945, after surviving a harrowing year in Auschwitz, fourteen-year-old Elli returns, along with her mother and brother, to the family home, now part of Slovakia, where they try to find a way to rebuild their shattered lives."}, {"id": "B01MRVAZM5", "genre": "Children's Books", "title": "Tisha B'Av: A Jerusalem Journey", "description": "Israeli kids and their aunt observe the holiday of Tisha B'Av, which commemorates the destruction of the Temple in Jerusalem, by visiting an archaeological dig at the Temple Mount and participating in their own hands-on dig, in this beautifully photographed book."}, {"id": "B013V6OHIU", "genre": "Children's Books", "title": "Be an Explorer (Go Wild)", "description": "Do you want to experience what it's like to chart new territory and survive the unexpected? Discover the unknown as you...● find your way in fog ● follow the stars ● find fossils and bones ● predict rain ...and lots more. Devised and tested by an expert in outdoor activities, these exciting projects help you navigate the wild, using nature's resources—and your own!"}, {"id": "1928556310", "genre": "Children's Books", "title": "Camellia the Bald", "description": "While visiting the beachside mansion of her mysterious Aunt Camellia, Susan finds herself transported to another world where she is continually addressed as \"Your Majesty\" and learns the value of self-reliance as she tries to find her way home."}]