[{"id": "031615914X", "genre": "Children's Books", "title": "Postcards From Buster: Buster Hunts for Dinosaurs (L1): First Reader Series (Passport to Reading Level 1: Postcards from Buster)", "description": "When his father takes him to visit a national park about dinosaurs, Buster sends postcards to his friends back home telling them what he is learning."}, {"id": "B01LXSTG5U", "genre": "Children's Books", "title": "The Good Wolf (Annotated & Illustrated)", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors.THERE was once a fat little, nice little, round little boy and his name was Tim. As soon as people looked at him they began to laugh and he began to laugh too. He had dimples on his knees and dimples on his hands and dimples all round his mouth. That was because Fairies liked him and used to kiss him whenever they flew past him, and they kissed him so much that they made dimples."}, {"id": "0448467100", "genre": "Children's Books", "title": "What Was the Alamo?", "description": "\"Remember the Alamo!\" is still a rallying cry more than 175 years after the siege in Texas, where a small band of men held off about two thousand soldiers of the Mexican Army for twelve days. The Alamo was a crucial turning point in the Texas Revolution, and led to the creation of the Republic of Texas. With 80 black-and-white illustrations throughout and a sixteen-page black-and-white photo insert, young readers will relive this famous moment in Texas history."}, {"id": "0008251347", "genre": "Children's Books", "title": "Sip It: Band 1A/Pink A (Collins Big Cat Phonics)", "description": "Collins Big Cat Phonics for Letters and Sounds features exciting fiction and non-fiction decodable readers to enthuse and inspire children. They are fully aligned to Letters and Sounds Phases 1\u00966 and contain notes in the back. The Handbooks provide support in demonstration and modelling, monitoring comprehension and expanding vocabulary. Chant and Chatter books are written especially for the Big Cat Phonics for Letters and Sounds series at Book Band Pink. The narratives and non-fiction texts are formed through three short, rhythmic chants, allowing the demonstration and modelling of fluent reading and supporting children in learning Phase 1 of Letters and Sounds. The sounds in this book are: s a t p i n m d Pages 14 and 15 contain a fun \u0093I Spy” Letters and Sounds activity, which uses visual support to help children embed phonic knowledge. Reading notes within the book provide practical support for reading Big Cat Phonics for Letters and Sounds with children, including a list of all the sounds and words that the book will cover."}, {"id": "1429694440", "genre": "Children's Books", "title": "The World Series: All about Pro Baseball's Biggest Event (Winner Takes All)", "description": "Every October baseball fans flock to stadiums to cheer for the teams trying to reach the World Series. Yearly since 1903 the National League and American League champions have played for the Major League Baseball championship. Discover the World Series greatest teams, players, and historic moments."}]