[{"id": "0310751020", "genre": "Children's Books", "title": "The Berenstain Bears, The Very First Christmas (Berenstain Bears/Living Lights)", "description": "Join the Bear cubs as they learn all about Jesus’ holy birth. From the angel Gabriel’s announcement to Mary to the visit from the three wise men, join Mama, Papa, Brother, Sister, and Honey as they discover the story of the very first Christmas."}, {"id": "1465470123", "genre": "Children's Books", "title": "Thomas & Friends Character Encyclopedia (Library Edition)", "description": "The definitive guide to Thomas the Tank Engine and all your favorite friends from the Island of Sodor. Includes images of the the real-life trains the characters are based on.Learn all about Thomas the Tank Engine, Percy, James, Rosie, Gordon, and all the other Steamies, Diesels, vehicles, and characters from Sodor. The guide is packed with fun facts and trivia about each popular character from the toys, TV shows, and movies. New characters from the TV movies Thomas & Friends: The Great Race, and the upcoming Thomas & Friends: Journey Beyond Sodor are featured alongside much-loved popular characters. Find pictures, too, of the real-life trains that are the inspiration for the characters, plus close-ups of train lamps, wheels, whistles, and more.© 2017 Gullane (Thomas) Limited."}, {"id": "0778775127", "genre": "Children's Books", "title": "Top 10 Smallest (Crabtree Contact)", "description": "Discover fascinating facts and figures about the tiniest things in the world! From the smallest country to the teeniest mobile phone, find out what makes it into the smallest top ten ever."}, {"id": "0385755341", "genre": "Children's Books", "title": "Superhero Instruction Manual", "description": "Anyone can be a superhero and this guidebook will show you how! Just follow six easy steps and you’ll be saving the world in no time. Join an aspiring hero as he selects a secret identity, chooses a power, and much, much more. But be warned: it isn’t easy being super. And sometimes the greatest acts of heroism need a helping hand to get off the ground. Kristy Dempsey’s rollicking text, coupled with Mark Fearing’s expressive, cartoon-style illustrations will have readers laughing all the way to infinity and beyond!"}, {"id": "1616419245", "genre": "Children's Books", "title": "Novel Nightmare: The Purloined Story (Adventures in Extreme Reading, Book 6)", "description": "In this action-packed series, Carter Lewis and Isabelle Hunter help their computer crazy uncle who has created a totally new kind of book experience. You don't read Uncle Dan's version of classic books; you live them in a virtual reality simulation. When Uncle Dan realizes someone has hacked his system and is corrupting his books, Carter and Isabelle must work together to help him uncover and beat the hacker.In Book 6, a wealthy but unpublished author hires Uncle Dan to turn his book into a virtual world so that he can get the attention of a publisher. But soon Carter and Isabelle begin to suspect this author is a little too desperate for success. In fact, he's lifted characters and dialog directly from classic books for his masterpiece. Can Carter and Isabelle reveal the plagiarism of Edgar Allan Poe's The Purloined Letter and convince Uncle Dan to put a stop to this novel nightmare? Calico Chapter Books is an imprint of Magic Wagon, a division of ABDO Group. Grades 3-6."}]