[{"id": "B00L0LYC84", "genre": "Children's Books", "title": "Head of the River", "description": "Nine rowers, 2,000 grueling yards, and one chance for glory  Tall, naturally talented, and the offspring of Olympians, superstar siblings Leni and Cristian Popescu are set to row Harley Grammar to victory in the annual Head of the River race. With six months until the big race, the twins can't lose. Or can they? When Cristian is seduced by the easy route of performance-enhancing drugs, and Leni is suffocated with self-doubt, their bright futures start to fade. Juggling family, high expectations, study, break-ups, new relationships, and wild parties, the pressure starts to build. As the final moments tick down to the big race, will they make it to the start line or will they plummet from grace?"}, {"id": "1600442951", "genre": "Children's Books", "title": "Puedes Ayudar / You Can Help (Mi Vecindario / My Neighborhood) (Spanish and English Edition)", "description": "Shows some of the ways that people can show they care about their community by taking care of their surroundings and treating the people around them well."}, {"id": "0892393750", "genre": "Children's Books", "title": "Martí's Song for Freedom / Martí y sus versos por la libertad (English and Spanish Edition)", "description": "A bilingual biography of José Martí, who dedicated his life to the promotion of liberty, the abolishment of slavery, political independence for Cuba, and intellectual freedom. Written in verse with excerpts from Martí's seminal work, Versos sencillos. "}, {"id": "1783445742", "genre": "Children's Books", "title": "The Time-Travelling Cat and the Tudor Treasure", "description": "Ka, the time-traveling cat, has disappeared, leaving just one clue. Realizing that she has gone back to Elizabethan England, Topher fears that Ka is in terrible danger. Cats were tortured in Tudor England, so Topher must find her before it is too late. In doing so, he meets Queen Elizabeth and Doctor Dee, the court magician and astronomer, who thinks Ka can help him find the Philosopher's Stone."}, {"id": "162135556X", "genre": "Children's Books", "title": "Princess Plume", "description": "Eleven-year-old Sara Massey feels neglected and depressed. After a haunting near-crippling crash from the uneven bars years earlier, Sara can't return to her favorite sport of gymnastics without risking death or complete paralysis. Or can she? In a flicker of her desperate heart and soul, she adopts the kitten of a wild barn cat, and the feisty kitty gives Sara all she can handle, plus a jolt of confidence. But as Sara begins her risky comeback in gymnastics and life, an imposturous Turkish sultan calling himself Orkhan Hamid arrives to claim the kitten for his own. Desperate for the kitten's rejuvenating power, Hamid will even steal to turn his fortune around. Can broken-hearted Sara stop him and keep the cat of her dreams? A fun and meaningful read for all novel readers."}]