[{"id": "B003KVKW8Q", "genre": "Children's Books", "title": "Emily Windsnap and the Castle in the Mist", "description": "\"An easy sell to girls looking for a friendship story with more than a touch of make-believe.\" — Kirkus reviewsWhen Emily Windsnap discovers an old diamond ring during a class hunt for trinkets, how is she supposed to know that the ring is half the key to unlocking an ancient curse by Neptune himself? Now, with the ring stuck firmly on her hand, Emily finds herself under a new curse: in just a few days, she’ll cease to be half-human and half-mermaid and must say good-bye to one parent forever. Can she possibly find the other missing ring that will break all the curses? Is there anyone who can help her -- before it’s too late?"}, {"id": "1932687920", "genre": "Children's Books", "title": "Genesis-The Book With Seventy Faces: A Guide for the Family", "description": "Children will love the full color illustrations and simple narrative that helps explain each story of the Book of Genesis. Teens and adults will gain a more profound understanding of the greatness of our forefathers and their wives as they read both the Rabbinic sources and modern commentators that give wider meaning to the Book of Genesis."}, {"id": "076420081X", "genre": "Children's Books", "title": "4: Hero Tales", "description": "Dave and Neta Jackson present the fourth volume of the Hero Tales books. These stories educate and excite readers--fostering Christian character in children and families."}, {"id": "1512456799", "genre": "Children's Books", "title": "Momcilo Gavric's World War I Story (Kids in War)", "description": "In August 1914, Austro-Hungarian troops attacked eight-year-old Momcilo Gavric's village in Serbia. With his home destroyed and his family missing, Momcilo set off on his own to seek help from the Serbian army. The Serbian army took him in, and soon Momcilo was fighting against the Austro-Hungarian army that had taken everything from him. Follow Momcilo as he enters battle and becomes the youngest soldier to fight in World War I."}, {"id": "B005DICL3S", "genre": "Children's Books", "title": "Sabertooth", "description": "Long ago there lived big cats whose giant teeth make today’s cats look tame: sabertooth! Those teeth helped it compete with other predators for a meal of mammoth—or even a tasty human.  Then, ten thousand years ago, every last sabertooth disappeared. With only ancient bones—and massive teeth—to guide them, scientists are learning amazing facts about these enormous prehistoric cats.  Patrick O’Brien’s captivating illustrations, exciting facts, and kidfriendly, comics-inspired design will thrill young adventurers."}]