[{"id": "1467711977", "genre": "Children's Books", "title": "Where's My Tushy? (Kar-Ben Favorites)", "description": "\"\"\"In one little town (it is sad but it's true),The tushies left town without leaving a clue.\"\"What happens when all the tushies in an unusual town decide to take a vacation?\""}, {"id": "0938467859", "genre": "Children's Books", "title": "Dori's Gift (Mom's Choice Award Recipient) )", "description": "Mom's Choice Award for Best General Fiction (ages 9-12)  It's Dori's birthday and she doesn't have to do her normal chores today. Her father makes a special dulcimer for Dori and it is the perfect gift!  Angie Wilson comes from a long line of Appalachian descent. As she often listened to stories about her grandparents, she realized that yes, they faced many hardships, but each had a happy childhood with fond memories of strong family bonds. The series, \"Appalachian Heritage\" is a collection of stories that brings the region to life as the reader travels back to a different time- where everyone did their part, and life offered many simple joys."}, {"id": "0531260259", "genre": "Children's Books", "title": "Caves (Blastoff! Readers: Learning About the Earth-level 3: Early Fluent)", "description": "\"Simple text and supportive images introduce beginning readers to the physical characteristics and geographic locations of caves\"--Provided by publisher."}, {"id": "006443656X", "genre": "Children's Books", "title": "Little Louie the Baby Bloomer", "description": "Frustrated that his baby brother Louie is too small to understand his games, Leo can't wait for him to get older so that he can start being an active companion, in this amusing tale about patience and sibling love. Reprint."}, {"id": "B077GDTY1W", "genre": "Children's Books", "title": "He Lived Among Us: Discipleship Poems for Christian Children (Poems from the Pew Book 3)", "description": "The third in Liz Wilkey's \"Poems from the Pew\" series, Christ Lived Among Us is a collection of  poems which effortlessly engage children’s imaginations to allow them to feel as if they were present for the important events in the life of Jesus. Each poem portrays a particular Gospel story as a first-hand narrative. Readers are invited into the biblical scene as told by an observer, apostle, pharisee, recipient of Jesus’ healing, or even the Blessed Mother herself - making it easy for children to apply their active imaginations to contemplate Gospel passages.  A perfect teaching and devotional tool for teachers, catechists, and parents."}]