[{"id": "1628324732", "genre": "Children's Books", "title": "Odysseys in Crime Scene Science : Mind of a Criminal", "description": "An in-depth look at how psychological profilers analyze behaviors and patterns to identify suspects and help solve crimes, employing real-life examples such as the Jeffrey Dahmer case."}, {"id": "1403403864", "genre": "Children's Books", "title": "The Maya (Understanding People in the Past)", "description": "Shows how the ancient Mayan people lived by describing their social, economic, political, religious, and cultural life, and looks at how archaeologists learn about ancient civilizations."}, {"id": "0780781112", "genre": "Children's Books", "title": "Margaret and Margarita/Margarita y Margaret (English and Spanish Edition)", "description": "Margaret and MargaritaMargarita Y MargaretMargaret speaks English but not Spanish. Margarita speaks Spanish but not English. Can they still play? Of course they can! Join two robust girls who aren't about to let \"anything\" spoil their fun."}, {"id": "B00OZQP3HU", "genre": "Children's Books", "title": "99 Tortuous, Tricky, Tough Tongue Twisters", "description": "99 Tortuous, tricky, tough tongue twisters to keep you amused for hours. Challenge yourself and your friends to see who really is the tongue twister champion.Includes the ‘World’s Hardest Tongue Twister’, as researched by psychologists at MIT.Not only are you guaranteed fun and laughter, but tongue twisters have been proven to improve English pronunciation skills too, for both native speakers and foreign language students.To get you warmed up........Three sweet switched Swiss witches watch three washed Swiss witch Swatch watch switches.Which sweet switched Swiss witch watches which washed Swiss witch Swatch watch switch?"}, {"id": "0756613841", "genre": "Children's Books", "title": "DK Eyewitness Books: Car", "description": "A photo essay about the history, development, and impact of automobiles from horseless carriages and Model T Fords to today's high-performance racing cars."}]