[{"id": "B00ENQEMBA", "genre": "Science Fiction & Fantasy", "title": "Legend of the Highland Dragon (Highland Dragons Book 1)", "description": "\"Mesmerizing, ingenious, slyly humorous, and wonderfully romantic, this unusual charmer is a winner for fans of paranormals. A Highland dragon? How can it miss?\"-Library Journal, STARRED ReviewA stunningly imaginative series from highly acclaimed author Isabel Cooper blends two of romances hottest genres: Scottish Highlanders and paranormal, with sexy Victorian dragon shapeshifter heroes...In Victorian England, gossip is often as precious as gold. But the Highlanders are a more mysterious bunch. And if anyone found out that Stephen MacAlasdair really was, he'd be hunted down, murdered, his clan wiped out. As he's called to London on business, he'll have to be extra vigilant—especially between sunset and the appearance of the first evening star. Mina just wanted to find out more about the arrogant man who showed up in her employer's office. Some might say it was part of her job. She never thought the stranger would turn into a dragon right in front of her. Or that he'd then offer her an outrageous sum of money to serve as his personal secretary. Working together night and day to track a dangerous enemy, Mina comes to see a man in love is more powerful and determined than any dragon. The Highland Dragons Series: Legend of the Highland Dragon (Book 1) The Highland Dragon's Lady (Book 2)Night of the Highland Dragon (Book 3)Praise for Legend of the Highland Dragon: \"The mix of hard-headed realism and fantasy in this novel is enchanting...\"-Barnes and Noble Reviews\"An outstanding read! ...fast-paced, smartly written...impossible to put down.\"- RT Book Reviews, 4 ½ Stars, Top Pick!"}, {"id": "0958014116", "genre": "Science Fiction & Fantasy", "title": "Dark Awakenings: Shadowland (d20 System)", "description": "In the hour of darkest despair, hope oft fortifies the heart. Having survived the terrors of Guardian Island, you now face the daunting task that has been set before you. Strengthened with ancient weapons and arcane devices you must enter the world of your enemy and try to win through to its place of power. Only then can you hope to return to Guardian for the final showdown. Bonus CD Including: 3D scenes depicting key locations in the adventure The complete adventure module in searchable PDF format Ambient sound effects Printable color maps Printable color game handouts Background to the author and the development team"}, {"id": "0857440055", "genre": "Science Fiction & Fantasy", "title": "Daring Tales of Chivalry Compendium (Savage Worlds)", "description": "Daring Tales of Chivalry Compendium is a set of five Savage WorldsTM adventures set in a medieval England full of mystery and where legends come to life! Daring Tales of Chivalry Compendium by Triple Ace Games uses the award winning Savage WorldsTM roleplaying system."}, {"id": "1629290408", "genre": "Science Fiction & Fantasy", "title": "The Night and the Land", "description": "Blood writes the book.  Book 1 in the Deschembine trilogy.  Among the local hippies and squatters of Brattleboro, Vermont, Sally Wildfire is on the run, hiding from her cruel, relentless family. She finds unexpected love with Rob, a bristly young man freshly awoken to alien sensations and ancestral memories of a long-forgotten realm...setting them both on a collision course with a brutal rite of passage, as the Wildfire family leaves a trail of mangled corpses on the road to Brattleboro."}, {"id": "0963427318", "genre": "Science Fiction & Fantasy", "title": "GURPS: 1st Kingston", "description": "Welcome to the newest of the United Nations' International Super Team embassies, IST Kingston. Set on the sunny shores of tropical Jamaica, IST Kingston is a super-fortress disguised as a resort complex. Home to a team of dedicated metahuman heroes, IST Kingston is the U.N.'s watchdog on the volatile Caribbean.IST Kingston is a supplement for Steve Jackson Games' Generics Universal RolePlaying System, for use with the GURPS Supers and GURPS International Super Teams sourcebooks. It contains an entire IST embassy compound, completely staffed and equipped and ready to go. Fight drug smuggling in the international waters around Jamaica, combat metahuman criminals in and around Kingston, confront social issues in the slums of Trenchtown and the Jungle, go head-to-head with an apocalyptic Castro, or face down the super agents of non-U.N. Guatemala. IST Kingston includes: Complete maps of the newest IST embassy. Fully fleshed out members of the embassy support staff. Guides to Jamaica and the Caribbean in the IST world. Six pregenerated supers, usable as PCs or as extra team members to quick-start a GURPS Supers campaign. Three all-new metavillains, with their agendas and plans -- and patrons. An extended adventure seed, in which the PC's must save the new embassy from destruction by a mysterious attacking force! And the requisite much, much more!"}]