[{"id": "1681570971", "genre": "Children's Books", "title": "All About Steve Wozniak (All About...People)", "description": "Steve Wozniak grew up with an insatiable curiosity that his father, a programmer, helped fuel. After being accepted to the University of Colorado Boulder, Steve was quickly expelled for hacking into the college’s computer system. He then got a job at Hewlett-Packard where he met Steve Jobs. Together, the two Steves created the Apple Computer company.  Steve Wozniak’s job at Apple was to program the computers to be programmable, compact, and fast, which was no easy feat when most computers at the time filled a room. Steve Jobs’s role was to market and sell the new computers. Woz, as his friends called him, single-handedly designed and programmed the hardware, circuit boards, and operating system for the Apple I. Slowly, the tech world caught up to him and the personal computer was born.  "}, {"id": "1508603863", "genre": "Children's Books", "title": "1: Saving Honor (Volume 1)", "description": "Saving Honor is the first book in its series, followed by \"Death and I\". Honor was just a regular teenager until everything changed in a few swift moments of truth. Honor discovers that she has abilities beyond what she could have imagined; abilities that she never thought could have existed outside of her little brother's comic books. What is also discovered are tales of her dark origins; origins deep and unlike most others. Although she tries to deny her strange new life, she soon realizes that she must face what she has become. Will she be able to keep her unique identity a secret from those around her, including those she loves the most? Is Honor a hero in the making or will she turn her back on the responsibility she never asked to carry? An eccentrically funny book that is equally dramatic. (This book may be listed as for children but its for Teens and Young Adults)"}, {"id": "B0716H7ZCH", "genre": "Children's Books", "title": "Joe Some-More: The Boy Who Lost a Lot and Won Big", "description": "Joe Some-More and his trusty—and fit—canine friend, BuffHound, have a story to tell! Joe used to be unhealthy, overweight, and unhappy, and he sure did want to fit in with his friends and make the soccer team. With the help of his parents, his doctor, and his best buddy BuffHound, Joe successfully battled his addiction to sugar and became super motivated to live a healthy lifestyle. He learned how to choose healthy foods and the benefits of exercise. By reading Joe Some-More, you too can learn about what happens when you eat too much fat and sugar, and how nutritious food and staying active can change your life. If Joe can do it, so can you! Joe Some-More is the second in a series of books from Gleeson Rebello, M.D. and Jamie Harisiades, which will combine entertaining rhyme and accurate medical information aimed at educating readers and parents on common childhood conditions like allergies, autism, asthma, and bone breaks. "}, {"id": "1635650585", "genre": "Children's Books", "title": "This Makes Me Sad (Dealing with Feelings)", "description": "If feeling blue isn’t bad enough, it’s even worse without your best furry friend. This Makes Me Sad follows a young boy after he accidentally lets his dog, Kit, loose from the yard. Despite his parents’ attempt to find her, nothing can cheer up the boy. His favorite things, like a pretty sunset, going to the park, and his beloved teddy bear, just make him more sad. Even happy memories of Kit no longer feel good. With help from his family, the boy must learn to accept and express how he’s feeling inside. And by dealing with his feelings, he might just be able to do some good until Kit comes home. Easy-to-read text and evocative illustrations make this relatable second story in the Dealing with Feelings series a perfect practice in emotional maturity for kids."}, {"id": "0736439005", "genre": "Children's Books", "title": "Don't Rain on My Pug-rade (Disney Junior Puppy Dog Pals) (Little Golden Book)", "description": "A super-cute Little Golden Book based on the Disney Junior show Puppy Dog Pals!Bingo and Rolly are the cutest pug puppies around! Children ages 2 to 5 will love this Little Golden Book--retelling an episode of the new Disney Junior show Puppy Dog Pals--in which the pugs get an awesome parade to march right by their house.Puppy Dog Pals is a preschool show that follows the adventures of Bingo and Rolly as they travel the world doing whatever it takes to make their owner, Bob, happy."}]