[{"id": "0985799676", "genre": "Children's Books", "title": "All the World Praises You: an Illuminated Aleph-Bet Book", "description": "This sparkling illuminated book is inspired by the charming medieval Jewish work, Perek Shira (Chapter of Song). In All the World Praises You, wonders of the natural world exclaim biblical praises of God, offering hours of warm delight for young children and parents, and inspiration for older students, Bar/Bat Mitzvahs, and adults seeking fresh spirituality—a book to which adults and children will return throughout their lives. New translations and transliterations make the book delightfully accessible to all English readers, regardless of Hebrew skills."}, {"id": "1616336552", "genre": "Children's Books", "title": "The Adventures of Andy & Spirit: Book 1", "description": "Andy, a young handicapped boy, meets Spirit, a wild mustang turned therapy horse. Their relationship helps both horse and rider learn and grow. That leads to new experiences for a boy with new-found freedom from his wheelchair. Suggested age range for readers: 8 thru 12"}, {"id": "2895791112", "genre": "Children's Books", "title": "Laugh with Chirp", "description": "Pre-schoolers love to laugh - and so does Chirp! Hosted by the lovable character from Chirp Magazine, Laugh with Chirp will delight parents and children alike. With knock knock jokes, old groaners, and humorous illustrations, kids will want to read this book again and again."}, {"id": "0735841632", "genre": "Children's Books", "title": "The Crocodile Who Didn't like Water", "description": "Meet a most unusual crocodile!   Everybody knows that crocodiles love water, but this little crocodile is different—he doesn't like it at all! He tries to his best to change, but when attempt at swimming causes a shiver then a sneeze—could it be that this little crocodile isn't a crocodile at all? A hilarious and uplifting story about being yourself from a talented debut author-illustrator!"}, {"id": "1602705674", "genre": "Children's Books", "title": "Loki (Short Tales: Norse Myths)", "description": "Loki goes by many names, including Maker of Lies, Sly God, Shapeshifter, Trickster, and Wizard of Lies. At times, he just seemed like a harmless prankster. Often, he used his quick wit to undo the very trouble that he had caused. How Loki caused the destruction of Asgard, the land of the gods is retold in this brilliantly illustrated Norse myth."}]