[{"id": "0340881712", "genre": "Children's Books", "title": "The Story of Everything", "description": "This pop-up book is literally larger than life! Neal's unique perspective on Evolution, the beginnings of the world and the Big Bang theory presents life in a format accessible to even the very young - a perfect gift book for all. With pops, flaps and tabs."}, {"id": "1481440799", "genre": "Children's Books", "title": "Twist and Shout (Mermaid Tales)", "description": "In this sparkling Mermaid Tales adventure, Echo hurts her tail when she falls off of a sea horse—right before the big Tail Flippers competition! Will she still be able to flip her way to a trophy?Echo loves dancing in the Trident Academy Tail Flippers. When she’s not dancing, she also loves riding sea horses, so when a classmate offers to let her ride their newest horse, Pinky, she doesn’t think twice! But when a slithery eel darts in front of Pinky, Echo gets knocked off and hits a rock. Her entire body aches—from scales to tail—so she heads to the doctor. Dr. Weedy tells Echo that moving her tail is absolutely out of the question. Not only can Echo not swim, but even worse, she can’t compete in the Poseidon Tail Flippers team competition! And Echo’s their star flipper. Without Echo’s tricks and flips, Trident City’s team doesn’t stand a chance. Echo’s friends find a pair of human crutches, which help her get around without the use of her tail. But that doesn’t solve the Tail Flipping problem! Will Echo find a way to help her team win from the sidelines?"}, {"id": "B0085SISBM", "genre": "Children's Books", "title": "Little Bitty Mousie", "description": "What new surprise will Little Bitty Mousie find around the next corner?While a family sleeps, Mousie scampers through the house one night. She sniffs around, wiggling her nose at all she sees from A through Z. After a bite of an apple, a taste of some butter, and a nibble on a carrot, Mousie's just begun to explore. The night is young, and there's still much more to discover! Jim Aylesworth's rhythmic language and Michael Hague's intricate illustrations will lead readers on a delightful midnight adventure with a charmingly curious little mouse. "}, {"id": "B00ANVTFAC", "genre": "Children's Books", "title": "Around the World with Santa Claus (The Children Chapter Book)", "description": "Around the World with Santa ClausBy Richard AndreThe 1891 illustrated book in color with Santa Claus's adventure around the world.  **This kindle edition is scanned from the original hardcover book."}, {"id": "0486436330", "genre": "Children's Books", "title": "Ancient Mexican Designs (Dover Design Coloring Books)", "description": "The highly stylized designs of pre-Columbian art are perennial favorites among graphic artists. This intriguing collection of ancient Mexican designs, masterfully adapted by Marty Noble from centuries-old Mayan, Aztec, and other Mesoamerican works, includes 30 ready-to-color illustrations.Among the many images depicted are powerful gods, kings, warriors, mythical creatures, as well as supernatural scenes with calendrical associations, a relief design from a temple at Chichen Itza, figures from a temple panel in Palenque, and other subjects.A delight for coloring book enthusiasts of all ages, this collection of exotic figures can be used to add a rustic, Mesoamerican touch to a host of art and craft projects."}]