[{"id": "0756630053", "genre": "Children's Books", "title": "Pirate (DK Eyewitness Books)", "description": "Take a close-up look at the colorful--and cruel--robbers of the sea. Learn who devised the terrifying Jolly Roger, how a surprisingly disciplined life was maintained aboard pirate ships, and what cunning ruses pirates used to lure merchants to their doom.  "}, {"id": "0448464950", "genre": "Children's Books", "title": "HARDY BOYS STARTER SET, TH The Hardy Boys Starter Set", "description": "A special treat for Hardy Boys fans! The first five books in the classic mystery series are packaged together in a collectible box set featuring a newly redesigned slipcover. Titles included are #1 The Tower Treasure, #2 The House on the Cliff, #3 The Secret of the Old Mill, #4 The Missing Chums, and #5 Hunting for Hidden Gold."}, {"id": "1603425314", "genre": "Children's Books", "title": "The Nature Connection: An Outdoor Workbook for Kids, Families, and Classrooms", "description": "Clare Walker Leslie shows kids how to experience nature with all five senses, whether they live in the countryside, a major city, or somewhere in between. Guiding children through inspiring activities like sketching wildlife, observing constellations, collecting leaves, keeping a weather journal, and watching bird migrations, The Nature Connection encourages kids to engage with the world outside and promotes a lifelong love of nature."}, {"id": "0803733631", "genre": "Children's Books", "title": "Dragonbreath", "description": "It's not easy for Danny Dragonbreath to be the sole mythical creature in a school for reptiles and amphibians?especially because he can't breathe fire like other dragons (as the school bully loves to remind him). But having a unique family comes in handy sometimes, like when his sea-serpent cousin takes Danny and his best iguana friend on a mindboggling underwater tour, complete with vomiting sea cucumbers and giant squid. It sure beats reading the encyclopedia to research his ocean report . . .Using a hybrid of comic-book panels and text, Ursula Vernon introduces an irresistible set of characters with a penchant for getting themselves into sticky situations. It's perfect for both the classroom and fans of Wimpy Kid and Bad Kitty. "}, {"id": "1974191834", "genre": "Children's Books", "title": "If You're Not Outraged You're Not Paying Attention: Back To School Composition Notebook, 8.5 x 11 Large, 120 Pages College Ruled (Fun School Journals)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}]