[{"id": "0812571398", "genre": "Science Fiction & Fantasy", "title": "Shadow of the Giant (Shadow Saga)", "description": "Bean's past was a battle just to survive. He first appeared on the streets of Rotterdam, a tiny child with a mind leagues beyond anyone else. He knew he could not survive through strength; he used his tactical genius to gain acceptance into a children's gang, and then to help make that gang a template for success for all the others. He civilized them, and lived to grow older. Then he was discovered by the recruiters for the Battle School.For Earth was at war - a terrible war with an inscrutable alien enemy. A war that humanity was near to losing. But the long distances of interstellar space has given hope to the defenders of Earth - they had time to train military geniuses up from childhood, forging them into an irresistible force in the high-orbital facility called the Battle School. That story is told in two books, Orson Scott Card's beloved classic Ender's Game, and its parallel, Ender's Shadow. Now, in Shadow of the Giant, Bean's story continues.Bean was the smallest student at the Battle School, but he became Ender Wiggins' right hand, Since then he has grown to be a power on Earth. He served the Hegemon as strategist and general in the terrible wars that followed Ender's defeat of the alien empire attacking Earth. Now he and his wife Petra yearn for a safe place to build a family - something he has never known - but there is nowhere on Earth that does not harbor his enemies - old enemies from the days in Ender's Jeesh, new enemies from the wars on Earth. To find security, Bean and Petra must once again follow in Ender's footsteps. They must leave Earth behind, in the control of the Hegemon, and look to the stars."}, {"id": "1548976962", "genre": "Science Fiction & Fantasy", "title": "Republic and Empire (Adrift on a Sea of Stars) (Volume 4)", "description": "The age of exploration had been replaced by the age of war. The Tarden Republic lay fractured. The rebellion on Brakk had been brutally beaten down for a second time leaving the race near extinction. Ducis Iratus's assassination of most of the members of the Senex failed to cower the core worlds. As he fortifies the solar system against an attack from the Republic, a shadowy presence at the star closest to Earth grows in strength. With humanity refashioned as his personal slave army, Iratus above all dreams of conquest. On the colony world in orbit around Sigma Draconis, Captain Brad Rutherford and the crew of the Beagle are about to become pawns between the Republic and the Empire."}, {"id": "1937013871", "genre": "Science Fiction & Fantasy", "title": "The Sixth Gun Role-Playing Game Limited Edition Hardcover (Savage Worlds, S2P11100LE)", "description": "The Sixth Gun comic series a pop interpretation of the supernatural Western by writer Cullen Bunn and artist Brian Hurtt follows the journey of six ancient and mystical weapons with the power to remake all of Creation. Now Pinnacle Entertainment Group, creators of Deadlands, brings the world of The Sixth Gun to your Savage Worlds tabletop roleplaying game!"}, {"id": "1515961052", "genre": "Science Fiction & Fantasy", "title": "The Twilight Obelisk (Mirror World)", "description": "Olgerd and his tribal NPC gang have finally discovered the Forbidden City. Problem is, they haven't found what they were looking for. The ancient maps are hopelessly out of date, and the Ennan capital city is lying in ruins. In the meantime, their enemies are closing in. Noctean hordes are arriving from the Silver Mountain Valley; the Dark army has already crossed the Back Stream, and the forces of Light have already entered the Icy Woods. The magic protection sphere which Olgerd received from the city's invisible guardians is about to expire . . . The only way he can save the lives of his trusty NPC friends is by activating the Twilight Obelisk."}, {"id": "0982300174", "genre": "Science Fiction & Fantasy", "title": "Heros Handbook Tiefling", "description": "Rich with culture, new magic items, monsters and character options, Hero’s Handbook: Tiefl ing is the essential tiefl ing player’s resource. Second in a complete line of PC aids, each brings character, history and new depth to your player character. • Compatible with D&D 4th edition. • Builds on popularity of Hero’s Handbook: Dragonborn and Hero’s Handbook: Eladrin. • Appeals to players, the largest segment of the D&D audience. • First exploration of new 4E character option."}]