[{"id": "B00WFNRHEC", "genre": "Science Fiction & Fantasy", "title": "Agent of Byzantium", "description": "A dashing master spy takes on the enemies of the Byzantine Empire and discovers impossible inventions like gunpowder and telescopes in a magnificent romp from the maestro of alternate-history science fiction In another, very different timeline—one in which Mohammed embraced Christianity and Islam never came to be—the Byzantine Empire still flourishes in the fourteenth century, and wondrous technologies are emerging earlier than they did in our own. Having lost his family to the ravages of smallpox, Basil Argyros has decided to dedicate his life to Byzantium. A stalwart soldier and able secret agent, Basil serves his emperor courageously, going undercover to unearth Persia’s dastardly plots and disrupting the dark machinations of his beautiful archenemy, the Persian spy Mirrane, while defusing dire threats emerging from the Western realm of the Franco-Saxons. But the world Basil so staunchly defends is changing rapidly, and he must remain ever vigilant, for in this great game of empires, the player who controls the most advanced tools and weaponry—tools like gunpowder, printing, vaccines, and telescopes—must certainly emerge victorious.   A collection of interlocking stories that showcase the courage, ingenuity, and breathtaking derring-do of superspy Basil Argyros, Agent of Byzantium presents the great Harry Turtledove at his alternate-world-building best. At once intricate, exciting, witty, and wildly inventive, this is a many-faceted gem from a master of the genre."}, {"id": "1556347219", "genre": "Science Fiction & Fantasy", "title": "Gurps Swat", "description": "From small-town crisis units to the FBI's Hostage Rescue Team, from the urban sprawl of Berlin to the mountainous wilds of Idaho, GURPS SWAT covers the dangerous world of tactical police operations. Serve a warrant on a dangerous meth lab, protect a judge whose life is threatened, rescue hostages from international terrorists, or take down a barricaded suspect before he kills again! Establish perimeters and begin hostage negotiations. Perform a stealth entry if you can, or blow down the door in a swift dynamic assault!  GURPS SWAT includes realistic information on skills, tactics, weapons and equipment, as well as several real-world police tactical teams, from the original LAPD SWAT to federal and international agency units."}, {"id": "1781165637", "genre": "Science Fiction & Fantasy", "title": "Anno Dracula - One Thousand Monsters", "description": "“There are no vampires in Japan. That is the position of the Emperor. The Emperor is wrong...”In 1899 Geneviève Dieudonné travels to Japan with a group of vampires exiled from Great Britain by Prince Dracula. They are allowed to settle in Yōkai Town, the district of Tokyo set aside for Japan’s own vampires, an altogether strange and less human breed than the nosferatu of Europe. Yet it is not the sanctuary they had hoped for, as a vicious murderer sets vampire against vampire, and Yōkai Town is revealed to be more a prison than a refuge. Geneviève and her undead comrades will be forced to face new enemies and the horrors hidden within the Temple of One Thousand Monsters…"}, {"id": "B00EDA97C0", "genre": "Science Fiction & Fantasy", "title": "Children of Hel", "description": "After brutally avenging his brother's death, viking warrior Einar is exiled from his homeland for his crimes. Intent on rebuilding his fortune and his good name, he returns to what he knows best. Raiding. The veteran warrior Egil leads a band of raiders setting sail for the West. A crew of hard men determined to cross the seas in search of glory and plunder. And they just might have room for one more. But when they set their sights on the easy prey of a lone monastery, they get far more than they bargained for. Something sinister has awoken in the tombs beneath the monastery and within Einar himself. Powers beyond the knowledge of men stir from ages old slumber, intent on vengeance, and with a hunger for human flesh. The living and the dead will clash in the darkness of the catacombs and the desperate battle for survival will begin. When all is said and done, there will be Hel to pay."}, {"id": "0553562738", "genre": "Science Fiction & Fantasy", "title": "Doomsday Book", "description": "For Kivrin, preparing an on-site study of one of the deadliest eras in humanity's history was as simple as receiving inoculations against the diseases of the fourteenth century and inventing an alibi for a woman traveling alone. For her instructors in the twenty-first century, it meant painstaking calculations and careful monitoring of the rendezvous location where Kivrin would be received.But a crisis strangely linking past and future strands Kivrin in a bygone age as her fellows try desperately to rescue her. In a time of superstition and fear, Kivrin -- barely of age herself -- finds she has become an unlikely angel of hope during one of history's darkest hours.Five years in the writing by one of science fiction's most honored authors, Doomsday Book is a storytelling triumph. Connie Willis draws upon her understanding of the universalities of human nature to explore the ageless issues of evil, suffering and the indomitable will of the human spirit."}]