[{"id": "B00GP4FKGO", "genre": "Children's Books", "title": "Baby Tiger and Friends Celebrate Chanukah (Baby Tiger and Friends Celebrate the Jewish Holidays Book 1)", "description": "Baby Tiger's friends Baby Elephant and Baby Bear have never celebrated Chanukah before and want to know what it is all about. Baby Tiger invites his friends to his house for a Chanukah dinner. Perfect story to explain Chanukah to your preschool aged child."}, {"id": "1481446959", "genre": "Children's Books", "title": "And Tango Makes Three (Classic Board Books)", "description": "The heartwarming true story of two penguins who create a nontraditional family is now available in a sturdy board book edition.At the penguin house at the Central Park Zoo, two penguins named Roy and Silo were a little bit different from the others. But their desire for a family was the same. And with the help of a kindly zookeeper, Roy and Silo got the chance to welcome a baby penguin of their very own. In time for the tenth anniversary of And Tango Makes Three, this Classic Board Book edition is the perfect size for small hands."}, {"id": "0749647973", "genre": "Children's Books", "title": "Hinduism (Religion in Focus)", "description": "Religion in Focus is a series of fact-packed reference books about the main world religions. The books will provide as much factual information as possible, and will use tables, diagrams, maps and photographs, as well as text, to make that information easily accessible. Each title will cover such topics as where the religion is practised, its key tenets and beliefs and how these are interpreted in everyday life, main religions figures, the main festivals and what they celebrate, the various different forms and sects within the religion, holy places and holy scripture. Important terms will be highlighted in the text and explained in a glossary. Each book will also feature a timeline of significant dates in the religion's history for easy reference."}, {"id": "0763605808", "genre": "Children's Books", "title": "What Newt Could Do for Turtle", "description": "After Turtle has saved him several times during the spring, summer, and fall, Newt finds a way to repay his friend before winter comes to the swamp"}, {"id": "1909881627", "genre": "Children's Books", "title": "Castle Explorer: Knight Sticker & Activity Book", "description": "Interactive pages keep young minds engaged with a range of great activities for children to get into the nitty gritty of the subject and absorb information from every page. Whether it is sticking details onto the castle walls, identifying knight's armor or coloring in the missing details in the castle scenes, little ones will be entertained for hours. With fascinating facts teaching children about the Middle Ages, banquets and life, this is the perfect book for any castle or knight addict!"}]