[{"id": "1107622700", "genre": "Children's Books", "title": "Chemistry for the IB Diploma Coursebook", "description": "Chemistry for the IB Diploma, Second edition, covers in full the requirements of the IB syllabus for Chemistry for first examination in 2016. The Second edition of this well-received Coursebook is fully updated for the IB Chemistry syllabus for first examination in 2016, comprehensively covering all requirements. Get the best coverage of the syllabus with clear assessment statements, and links to Theory of Knowledge, International-mindedness and Nature of Science themes. Exam preparation is supported with plenty of sample exam questions, online test questions and exam tips. Chapters covering the Options and Nature of Science, assessment guidance and answers to questions are included in the additional online material available with the book."}, {"id": "1548937312", "genre": "Children's Books", "title": "Hunter Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "0044481217", "genre": "Children's Books", "title": "Listening to Hindus", "description": "The \"Listening To\" series introduces students to the challenging and varied nature of religion. By \"listening to \" members of different faiths talking about what it means to be a Buddhist, Christian, Hindu, Jew, Muslim or Sikh, young people are encouraged to explore the human face of religion, and make informed personal responses to the beliefs and values of others. Pupils are encouraged to see the six major religions in Britain as living faiths which affect people's everyday lives and their attitudes to the world around them. The books aim to foster a willingness and ability to listen to others and to respect different ways of life, and to discourage stereotyping and generalizations."}, {"id": "0060292164", "genre": "Children's Books", "title": "Jennifer's Rabbit", "description": "Provides a fantastical tale in which a young girl dreams about a great adventure on the high seas with her friends where castles are built with moonbeams as stars shine brightly from the heavens."}, {"id": "0531175715", "genre": "Children's Books", "title": "What Do You Mean?: Communication Isn't Easy (Shockwave: Social Studies)", "description": "A history of the English language shows how it has changed through the years, discussing how new words are constantly being added, new slang introduced, and meanings altered, along with changes in spelling and pronunciation."}]