[{"id": "0635014858", "genre": "Children's Books", "title": "Laura Ingalls Wilder: Pioneer Girl (16) (1000 Readers)", "description": "Laura Ingalls was a pioneer girl who traveled in a covered wagon with her family all over the Midwest. She was playful and adventurous. She was smart and curious. When she grew older, she became a famous author. For years, children and adults alike have loved to read her stories of pioneer life.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "0448463326", "genre": "Children's Books", "title": "Who Is Bill Gates? (Who Was?)", "description": "Bill Gates, born in Seattle, Washington, in 1955, is an American business magnate, investor, philanthropist, and author. In this Who Was...? biography, children will learn of Gates' childhood passion for computer technology, which led him to revolutionize personal computers. Through the success of his now-world-famous software company, Microsoft, Bill Gates became one of the wealthiest philanthropists in history.This fascinating story of a child technology genius is sure to captivate any audience!"}, {"id": "1523501200", "genre": "Children's Books", "title": "Crinkle, Crinkle, Little Star (A Read-and-touch Bedtime Book)", "description": "Take an interactive journey through the night sky in an innovative, tactile board book, a special book that engages three senses—seeing, touching, and hearing. With its gorgeous, full-spread illustrations of constellations and beloved bedtime lullaby reimagined, Crinkle, Crinkle, Little Star is the perfect book to rock babies to sleep. Here’s Taurus the bull, strong and fast. Cetus the whale, waving a mighty tail. Orion, with bow and arrow in hand. Babies can trace the imaginary lines that turn random stars into ancient constellations—and, in a special treat, create a crinkling sound by tracing the channel of shimmery material underneath the last illustration in the book. That same mysterious, compelling crinkling sound persists when baby and parents hold the book and rub the crinkly material on the back cover.  "}, {"id": "1496427823", "genre": "Children's Books", "title": "I Can (My First Bible Memory Books)", "description": "With a repetitive, rhythmic introduction of Philippians 4:13 (“I can do everything through Christ, who gives me strength”), I Can turns Bible memorization from a duty to a delight for children, using the author’s unique teaching strategy. This purposeful presentation of Scripture will help children memorize, understand, and absorb passages as the author presents this powerful verse one word at a time, teaching the meaning of each individual word before presenting the entire passage. I Can builds a meaningful connection between God’s Word and a child’s life experiences, laying a foundation for a love and comprehension of Scripture. Parents and children will enjoy interacting together over the passage."}, {"id": "0694010588", "genre": "Children's Books", "title": "Cat's Pajamas", "description": "Rhythm, sounds, and words are captured by vibrant illustrations that follow a group of jazzy cats on a city night, as they prowl the darkened streets in search of adventure."}]