[{"id": "B00AKEWIBA", "genre": "Children's Books", "title": "12 Days Of Christmas: A Counting Christmas Book For Kids", "description": "The 12 Days of Christmas is a fun and colorful Christmas Book for kids who love to count. A lovable version of the all-time favorite children's Christmas song filled with colorful illustrations and simple text, perfect for little readers. This cheerful Christmas book for kids has simple lower case text and clear, legible, numbers so little learners will be able to identify and follow along with the story. Each of the 12 Days of Christmas has its own page, complete with the number of the day and a matching number of items to count. Children will have fun reading along with the main character, Ella, as she invites readers to join her and her Daddy in reading and counting each of the 12 Days of Christmas. It is sure to become one of your little one's favorite Christmas books for Kindle.             "}, {"id": "B00J0I2DDU", "genre": "Children's Books", "title": "Earth Kid Hero Book 1: Lift Off: A Science Fiction Action Adventure Series Book for Kids Age 9-12", "description": "Can a Six Year Old Earth Boy Become an Interstellar Hero?Earth Kid Hero book series chronicles the adventures of a young earth boy named Tyler Parker.Tyler Parker is a very bright boy. Like most kids, Tyler is often told he is special but Tyler is truly exceptional.  His gifts have been overlooked by all but his parents. However a group is watching Tyler closely.  These people are on the other side of the galaxy and desperately need Tyler's help. Ganrea is under a blockade from the aggressive planet Unu.  The Ganrean President sent his only son across the galaxy to cajole Tyler Parker into an incredible journey. Tyler and an alien boy go on an exciting adventure to get back to Ganrea before the Unu attack.  During the long trek, the boys are faced with several challenges that require courage and focus. Tyler has no idea why the Ganrea need him but he is determined to help˃˃˃ Grab your copy today!"}, {"id": "0516239627", "genre": "Children's Books", "title": "What Is a Wheel and Axle? (Welcome Books: Simple Machines)", "description": "Introduces the wheel and axle as a simple machine that can make it easier to move heavy objects, as well as to flatten dough."}, {"id": "0824914201", "genre": "Children's Books", "title": "All Aboard! Charlie the Can-Do Choo Choo (A Light & Sound Book)", "description": "Children will love to climb aboard Charlie, for he demonstrates the power of positive thinking through his perseverance and encouraging song--with genuine train sounds.  The caboose arrives, the trip is done. The Can-Do Choo Choo had such fun. 'Just wait till morning,' says our friend, 'And I can do it all again!'  Children will gravitate to this infectious story of perseverance, for there are no obstacles Charlie cannot overcome with his 'can-do' attitude and optimistic approach to life. When Charlie's nose is pressed, children hear the conductor shout, 'All aboard!' The catchy rhyme and repetitive refrain mimics the sound of a train's momentum which makes this an ideal read-aloud book. The PVC push-button nose, train sounds, and cheerful illustrations will make this book a beloved favorite with young children. Ages 3 to 5."}, {"id": "067989036X", "genre": "Children's Books", "title": "Bones (Step-Into-Reading, Step 2)", "description": "How many bones are there in the human body? Which bone is the longest? Or the smallest? Without bones, you would be a blob, like a jellyfish or a worm. Our bones support us and protect our insides. They work together with our muscles to allow us to do all the things we do! So when you think of your bones, say \"Thank you!\"This simple Step 2 introduction teaches young readers these facts and many more about the skeleton inside each of us!"}]