[{"id": "0385382979", "genre": "Children's Books", "title": "Richard Scarry's Funniest Storybook Ever!", "description": "Get ready to laugh, laugh, laugh, in Richard Scarry's Funniest Storybook Ever!Richard Scarry’s classic collection of his funniest stories is back in print! All your favorite Busytown characters are back and getting up to countless silly situations. Whether it’s an out-of-control mix-up with Ma Pig’s new car, babysitters making accidental exploding fudge, sneaky mice pirates taking over Uncle Willie’s ship, or even a talking loaf of bread that baffles Humperdink the Baker and Lowly Worm, young readers will be rolling on the floor with laughter thanks to the hysterical hijinks found in this Funniest Storybook Ever! Note: Includes some stories that also appear in Richard Scarry's Favorite Storybook Ever.Contents:Absentminded Mr. Rabbit Sergeant Murphy and the Banana Thief Speedboat Spike Ma Pig’s New Car Mr. Fixit The Three Sitters Tanglefoot The Talking Bread The Three Fishermen The Accident Please Move to the Back of the Bus Uncle Willie and the Pirates The Unlucky Day Rudolf’s Airplane Lowly Worm’s Birthday"}, {"id": "0842380698", "genre": "Children's Books", "title": "Wee Sing Bible Songs (book)", "description": "Wee Sing Bible Songs--a celebration of the Bible in music and song! This delightful song book contains a collection of songs about Bible heroes, teachings, parables, praises, and prayers. Children will love celebrating the Bible by singing these songs for years to come. Over 60 songs in all!"}, {"id": "1534562818", "genre": "Children's Books", "title": "U.S. Borders (Crossing the Border)", "description": "The borders between the United States and foreign countries are important locations. Goods and people cross them constantly as they move from one nation to another. Readers discover what happens at these borders and how they are protected through enlightening main text and sidebars that provide additional information. Full-color photographs are also included, helping readers visualize the borders between the United States and its neighbors. Border protection is often in the news, and readers will develop a stronger sense of why this issue is so important as they explore this timely topic."}, {"id": "1568229046", "genre": "Children's Books", "title": "The 100+ Series Time & Money, Grades 1-2: Building Math Skills for Daily Life", "description": "     Your students will love Time and Money, and so will you! With 100 reproducible pages, you will never be at a loss for a way to introduce practice sessions for these important skills. Time and money concepts are vital knowledge for everyday life.These engaging pages will allow your class to explore basic time and money units, along with concepts such as elapsed time, making change, estimating, and more! Includes answer key.   "}, {"id": "B01IA68KFW", "genre": "Children's Books", "title": "Plants vs. Zombies Volume 5: Petal to the Metal", "description": "The best-selling game adaptation roars forward!Sun-powered, plant-driven speedsters versus imp-powered, zombie-driven hot rods! Let the races begin! Crazy Dave takes on the incredibly tough Don’t Blink video game—and he also challenges Dr. Zomboss to a series of races to determine the future of Neighborville! The car-filled competition is underway! Paul Tobin and Ron Chan return to deliver another hilarious zombie battle to your burg! Collects issues #7–#9 of the series.* Eisner Award winner Paul Tobin continues his hilarious PVZ run!* The official comic of the addictive video games!"}]