[{"id": "0979204739", "genre": "Science Fiction & Fantasy", "title": "Battletech Introductory Box Set *OP (Classic Battletech)", "description": "Strap yourself into the ultimate suit of armor: the BattleMech. Thirty feet tall and weighing up to a hundred tons, this humanoid engine of destruction is a walking arsenal with enough firepower to level a city block. The Classic BattleTech game system takes you into the world of the 31st Century, where war has become a way of life. You are a MechWarrior. You are in command of the most powerful machine on the battlefield, and hold the fate of empires in your hand!"}, {"id": "153316682X", "genre": "Science Fiction & Fantasy", "title": "The Watchmaker's Daughter (Glass and Steele) (Volume 1)", "description": "India Steele is desperate. Her father is dead, her fiancé took her inheritance, and no one will employ her, despite years working for her watchmaker father. Indeed, the other London watchmakers seem frightened of her. Alone, poor, and at the end of her tether, India takes employment with the only person who'll accept her - an enigmatic and mysterious man from America. A man who possesses a strange watch that rejuvenates him when he's ill. Matthew Glass must find a particular watchmaker, but he won't tell India why any old one won't do. Nor will he tell her what he does back home, and how he can afford to stay in a house in one of London's best streets. So when she reads about an American outlaw known as the Dark Rider arriving in England, she suspects Mr. Glass is the fugitive. When danger comes to their door, she's certain of it. But if she notifies the authorities, she'll find herself unemployed and homeless again - and she will have betrayed the man who saved her life. With a cast of quirky characters, an intriguing mystery, and a dash of romance, THE WATCHMAKER'S DAUGHTER is the start of a thrilling new historical fantasy series from the author of the bestselling Ministry of Curiosities, Freak House, and Emily Chambers Spirit Medium books."}, {"id": "1464400989", "genre": "Science Fiction & Fantasy", "title": "Write Fantasy Fiction in 5 Simple Steps (Creative Writing in 5 Simple Steps)", "description": "Fantasy is a fun genre to read and write because you can create new worlds, people who have magical powers, and animals with remarkable qualities. If you enjoy stories about wizards and witches, traveling through time, talking animals, fairies, and trolls, then fantasy is the perfect way to express yourself. In WRITE FANTASY FICTION IN 5 SIMPLE STEPS, author Laura Lee McKay shows aspiring writers how to craft an exciting fantasy."}, {"id": "0192817450", "genre": "Science Fiction & Fantasy", "title": "Sir Charles Grandison (The World's Classics)", "description": "First published in 1753, Richardson's third novel was immensely popular. Richardson draws on every kind of narrative technique in this intricate and logically patterned novel. He creates a work that is at once a novel of manners, a novel of sensibility, a Gothic novel--a variety of genres that highlight his gift for witty character sketch and brisk dialogue."}, {"id": "1433224062", "genre": "Science Fiction & Fantasy", "title": "The Many-Colored Land (The Saga of Pliocene Exile, Volume 1) (Library Edition)", "description": "This is a spellbinding tale woven of equal parts epic and myth--with a liberal dash of hard science fiction. When a one-way time tunnel to Earth's distant past, specifically six million B.C., was discovered by folks on the Galactic Milieu, every misfit for light-years around hurried to pass through it. Each sought his own brand of happiness. But none could have guessed what awaited them. Not even in a million years. In the early twenty-second century, many humans are being born with psychic powers and are linked in a single galactic mind. Those without these psychic powers--the misfits, undesirables, criminals, and radicals--have a choice: mental reprogramming or exile. Exile, voluntary or otherwise, takes them back six million years, to a time between the extinction of dinosaurs and the rise of Homo sapiens, and to a time of exotic surprises and unknown dangers. THE SAGA OF PLIOCENE EXILE series includes:Volume I:THE MANY-COLORED LANDVolume II:THE GOLDEN TORCVolume III:THE NONBORN KINGVolume IV:THE ADVERSARY. . . and don't miss A PLIOCENE COMPANION"}]