[{"id": "1741260132", "genre": "Children's Books", "title": "Miki's First Errand", "description": "Five-year-old Miki is entrusted by Mom to run her first errand alone — to go to the shop to buy milk. Miki succeeds despite what are, to her, enormous challenges."}, {"id": "B00DSRIQGC", "genre": "Children's Books", "title": "The Golden Knight #2:  The Battle for Rone", "description": "A legend reborn…Princess Rainna has escaped Devon Castle with the ancient Book of Wisdom.  Marsonee the archangel and Justin the farm boy journey to the fallen city of Rone.  As their paths collide on a dark road, an even greater challenge awaits them in the catacombs of the old cathedral of Rone.  Can Justin remove the sword and become the Golden Knight?  Is the Keeper among us?  Who is the mysterious figure known only as the Prince?Flar, the evil fire lord, and his sorcerer, Murlox, have learned the identity of the Keeper and are determined to prevent the prophecy from being fulfilled.  Summoning a powerful Demon from the pits of the underworld, Flar and Murlox lead an army of fire soldiers to attack Rone.   New allies and new dangers await our heroes as the Keeper is revealed, the Golden Knight is reborn and the battle for the ancient city of Rone begins.The Golden Knight #2 is beautifully decorated with over 25 illustrations.  Join the adventure today!"}, {"id": "0060782188", "genre": "Children's Books", "title": "Time For Kids: Plants! (Time For Kids Science Scoops)", "description": "Get the inside scoop on the world's most amazing vegetation!Watch a seed growFind out how plants get waterDiscover how a Venus flytrap catches its foodLearn more than thirty fun facts about plants"}, {"id": "1622851102", "genre": "Children's Books", "title": "Soccer Star Lionel Messi (Goal! Latin Stars of Soccer)", "description": "Considered by some to be the greatest soccer star of all time, Lionel Messi’s story is nothing short of spectacular. As this sports biography highlights the biggest moments of his career, it becomes quite clear why he is the most important player to Argentina’s national squad and his club team, FC Barcelona."}, {"id": "0399247475", "genre": "Children's Books", "title": "My Very First Book of Food", "description": "Feast your eyes on the latest split-page board books from Eric Carle. In the sumptuous My Very First Book of Food, children can match each animal with the food it eats. Do you know what a squirrel eats? How about a seal? In My Very First Book of Motion, children can match each animal with the way it moves. Which animal hops? Which one waddles? Only you can match them. These fun books are full of bright animals, and are lots of fun for young children."}]