[{"id": "0884483215", "genre": "Children's Books", "title": "Moon Watchers: Shirin's Ramadan Miracle", "description": "Looking through the tall trees in their backyard in Maine, Shirin and her dad search for a glimpse of the new moon, the sign that the month of Ramadan has begun. Ramadan is a time when Muslims around the world pray, fast, and pay special attention to doing good deeds. Shirin is nine and thinks she should be able to fast like her older brother Ali, but her parents feel she is still too young to go without food and water all day. When Shirin catches Ali sneaking food after school, she wonders: Should she tattle or is this an opportunity for a good deed? Shirin feels left out when the others break their fasts to have their own meals after dark and in the early morning, before it is light again. But then her grandmother tells a story that shows her a way she can feel more a part of Ramadan and the traditions and closeness her family enjoys during this special month of the year. Her good deeds result in a surprise for everyone!"}, {"id": "1681853264", "genre": "Children's Books", "title": "Turtle Coloring Book", "description": "Coloring turtles raises your child's awareness on their existence and a bit about how they survive. Coloring is a highly effective way of instilling societal norms because children tend to absorb information better when they get to experience learning. In addition, your child's hand muscles are strengthened when he/she colors. With the many advantages coloring brings, why haven't you picked up a copy of this book yet?"}, {"id": "B01GT7BLM8", "genre": "Children's Books", "title": "Diary of a Surfer Villager: Book 2: (an unofficial Minecraft book)", "description": "Book 2: Dream Realized!Jimmy Slade and Emma have created an awesome surf park and are earning huge piles of emeralds. What could go wrong?Biff the bully is jealous and acting like a meany, but when his cousins Claire, the fashionista, and Clayton, the athletic nerd, arrive, will he be on his best behavior or ...?Don't miss Book 2 in the ongoing Surfer Villager series.****Dr. Block says, \"I know the title of this series sounds weird, but it is really pretty cool.\""}, {"id": "0786805218", "genre": "Children's Books", "title": "Christmas Soul: African American Holiday Stories", "description": "With original stories by Debbie Allen, Halle Berry, Jamie Foxx, Whitney Houston, D.L. Hughley, Monica, and more. In this collection of poignant and witty original stories, African American celebrities recount their favorite childhood Christmas memories. Accompanied by evocative oil pintings, these stories will illuminate the holidays for years to come. A portion of the proceeds for Christmas Soul will be donated to The United Negro College Fund."}, {"id": "B076DQZV84", "genre": "Children's Books", "title": "Google Cybersecurity Expert Parisa Tabriz (STEM Trailblazer Bios)", "description": "Do you like to compete against other people? So did cybersecurity engineer Parisa Tabriz. She turned her toughness and her competitive spirit into a job as Google's top security expert.As a child, Tabriz loved to play games with her brothers—and she played to win. When she couldn't outmuscle them, she tried to outsmart them. In high school, she excelled at math and science. She also liked drawing and painting. She considered a career as an artist and even as a police officer. Years later, Tabriz became an information security engineer at Google. How did she go from battling her brothers to fighting cybercriminals at one of the world's most important tech companies? Read on to learn all about the life of Google's top security brain."}]