[{"id": "B01NBAMKIH", "genre": "Science Fiction & Fantasy", "title": "ARTIFEX (The Cyberratum Series Book 0)", "description": "A genius inventor clashes with a power-mad corporate General over priceless mineral that will give the victor control of a powerful new technology in this, exciting, fast-paced, short story prequel.ARTIFEX kicks the doors wide open to the birth of The Cyberratum Series! From innovative tech to pulse-pounding plot, this short prequel will leave you wanting more!"}, {"id": "B012P8OPKK", "genre": "Science Fiction & Fantasy", "title": "The Windkeeper: Book 1 in the Eld Creatures Series", "description": "The air mages of Norbane have been concealing a great secret for fifteen years. But now the earth mages of the neighboring kingdom are threatening war, and Norbane has no choice but to bring that secret weapon out of hiding. The only problem is she's just fifteen years old. With time running short, young Morgan must embark on a journey to find the mythical creatures that can save her kingdom.  She is the only one who can, and the fate of Norbane depends on her finding them. The road ahead is perilous, and will test whether she truly has what it takes to fulfill her destiny and become who she was born to be: the Windkeeper."}, {"id": "1617682845", "genre": "Science Fiction & Fantasy", "title": "The Lord of the Rings: The Two Towers Deck-Building Game", "description": "In The Lord of the Rings: The Two Towers Deck-building Game, you take on the role of Frodo, Legolas, Aragorn, or one of their brave and heroic allies in the struggle against the forces of the Dark Lord Sauron! While you begin armed only with basic combat maneuvers, you will add new, more powerful cards to your deck as you go, with the goal of defeating the deadly forces that serve Sauron as you make way towards Mount Doom. In the end, the player who has accumulated the most Victory Points from the cards in his or her deck wins the game."}, {"id": "0913165433", "genre": "Science Fiction & Fantasy", "title": "The Asimov Chronicles: Fifty Years of Isaac Asimov", "description": "A collection of 50 Asimov stories, covering half a century of his work, including tales of distant worlds, parallel universes, unknowable aliens and immeasurable space. Among this collection are \"Nightfall\", \"The Martian Way\" and \"The Ugly Boy\"."}, {"id": "1944985301", "genre": "Science Fiction & Fantasy", "title": "Rosinanti: Wrath of the Faithful (Rosinanti Series) (Volume 2)", "description": "Valentean Burai and Seraphina Kackritta barely escaped the grip of chaos. Only by working together were these two life long soul mates able to combat the greatest threat the world of Terra has ever known. But when they find themselves separated, with the entire world turned against them, both princess and animus warrior must battle not only the forces of chaos and darkness that seek to end their world, but their own crippling doubts and fears. Valentean must also face the horrifying truth of himself. He is one of the last surviving members of the Rosinanti race, and holds within him world-destroying power, and the unwanted uncontrollable ability to transform into a fearsome dragon. The struggle of man vs beast is not limited to the battlefield. Valentean will wage that war internally, within the confines of his own conflicted heart. But, in the end, who is stronger? The man, or the dragon?"}]