[{"id": "1847804853", "genre": "Children's Books", "title": "The Story of Life: A First Book about Evolution", "description": "At first, nothing lived on Earth. It was a noisy, hot, scary place. Choking gas exploded from volcanoes and oceans of lava bubbled around the globe... Then in the deep, dark ocean, something amazing happened. This is an exciting and dramatic story about how life began and developed on Planet Earth, written especially for younger children.The authors explain how the first living cell was created, and how the cells multiply and create jellyfish and worms, and then fish with bendy necks, which drag themselves out of the water into swampy forests. They tell the story of the biggest creatures that have ever walked on land - the dinosaurs. Long after that, hairy creatures who have babies, not eggs, take over, stand on two legs and spread around the world, some of them living through cataclysmic events such as ice ages and volcanic eruptions. Everyone living today is related to these survivors. With delightful illustrations including lots of detail and humour, all carefully researched and checked, this book shows the development of life on Earth in a truly accessible and simple way."}, {"id": "142630286X", "genre": "Children's Books", "title": "National Geographic Readers: Sharks! (Science Reader Level 2)", "description": "He’s quick. He’s silent. He has five rows of deadly teeth. Chomp! Meet the shark—the fish who ruled the deep before dinosaurs roamed the Earth! This fish has soft cartilage so he can glide, twist, and turn before his prey can say \"gulp!\" He can smell a single drop of blood in 25 million drops of ocean. He can feel electricity given off by his prey. He will lose and replace more than 10,000 teeth in his lifetime. Cool photos bring kids into the shark’s world. Fun facts go deep into the shark’s scary science."}, {"id": "B00HL6PRBI", "genre": "Children's Books", "title": "20 Incredible Dinosaurs: A book for kids to learn names , location and facts about the top 20 dinosaurs.", "description": "This is a book on the 20 Dinosaurs. This book has been written for all lovers of dinosaurs. Whether the reader is a beginner, so that words are all explained in a glossary, or a budding expert. This book gives the reader all of the information on the top Dinosaurs.  The top 20 Dinosaurs are introduced with a picture, their popular name and then their scientific name.  Then their height, length, weight, continent of discovery and time of existence. These factual pieces of information are displayed on a card. Following this is then approximately a page on each to describe and talk about each dinosaur. There are 55 pages in total with great easy to read information.This book is also great for a quick reference, whether for projects for school or when wanting to confirm information on a particular dinosaur. All the information on needs to be a budding paleontologist."}, {"id": "0816035032", "genre": "Children's Books", "title": "160 Ways to Help the World: Community Service Projects for Young People", "description": "This guide for young adults gives ideas and instructions for a wide variety of activities including handling money, conducting drives, obtaining sponsorship, creating publicity, and more."}, {"id": "161479166X", "genre": "Children's Books", "title": "Iron Man and the Armor Wars Part 3: How I Learned to Love the Bomb", "description": "Tony Stark FINALLY has his IRON MAN armor back…good thing, too, 'cuz there's about three dozen assassins with orders to take him dead or alive… \n \n Aligned to Common Core Standards and correlated to state standards.\n \n Marvel Age is an imprint of Spotlight, a division of ABDO."}]