[{"id": "0064421295", "genre": "Children's Books", "title": "Don't Know Much About Martin Luther King Jr.", "description": "When did King first encounter an integrated world? (see page 20)How did he learn about nonviolent movements? (see page 53)Why did King need so much paper in the Birmingham jail? (see page 88)Best-selling author Kenneth C. Davis sheds light on the most prominent leader of the Civil Rights movement. Martin Luther King Jr. had big dreams about ending segregation and fervently advocated nonviolent protests. Tragically, his life was cut short. Davis weaves a smooth, flowing narrative through his trademark question-and-answer format, peppering the text with informational sidebars and compelling quotes. Dramatic photographs and stirring black-and-white illustrations by Machiyo Kodaira reveal King's public courage and private fear, as well as the tumultuous times in which he lived."}, {"id": "151514125X", "genre": "Children's Books", "title": "Kamitic Stories for Children: The Living Legacy", "description": "Ancient Kamit, renamed Egypt in later times by the Greeks, is a very popular but not very well understood culture. The oldest formalized religion on Earth comes from here, and all other religions are descended from it. This book has been written so that this incredible ancient culture can be brought to life again for adults and children alike, using original Kamitic artwork and colorful photographs to help children identify with the historical significance of these rich and vibrant tales. Each of the seven stories here is a blend of various tales from the different nomes, or states, of ancient Kamit. Each state and region had their own versions of the creation story, of the interaction between the various divine principles, and of the effect of these interactions on the human story. This blend serves as an introduction to the culture of ancient Africa so that readers can begin their journey of historical and spiritual discovery as they open the doors to the hidden meanings for themselves and discover deeper personal truths."}, {"id": "0745949258", "genre": "Children's Books", "title": "When Zaccheus Met Jesus (The Lion Story Bible)", "description": "A \"big book\" presentation of an important biblical story. This retelling uses simple language and short sentences which make it ideal for new readers. Color illustrations complement the text—both setting the scene for Jesus' storytelling and illustrating the parable itself."}, {"id": "1416975284", "genre": "Children's Books", "title": "My Dad, John McCain", "description": "Born the son and grandson of military men, Senator John McCain from Arizona was destined for a life serving his country in the armed forces. Like many great men, he occasionally struggled with authority, but once he found his true calling -- flying naval aircraft -- his ideals and commitment to his country took him far.   From the low point of five years as a prisoner of war to the high points of raising a large, happy family and being chosen as the Republican nominee in the 2008 presidential election, Senator McCain has lived an incredible life driven by a love of his country and a desire to serve it to the best of his ability.   This picture book biography, written with great love and insight by his oldest daughter, writer Meghan McCain, shows us the public John McCain and the personal John McCain in a way we've never seen before -- making this American hero come to life before young eyes."}, {"id": "0760355347", "genre": "Children's Books", "title": "Inside Out Egyptian Mummy: Unwrap an Egyptian mummy layer by layer!", "description": "Calling all explorers and archaeologists! Inside Out: Egyptian Mummy comes with everything you need to start an Egyptian adventure from the outset to discovering a tomb, to unwrapping a mummy. Though the ancient civilization of Egypt may be long gone, its dead still have secrets to tell. From the myth of Isis and Osiris, to King Tut’s tomb, to the intricacies of preparing the body for its underworld journey, Inside Out: Egyptian Mummy takes you step by step into a tomb. Get a fascinating glimpse into how an ancient culture saw death and the afterlife beyond. That isn't all though! Alongside beautiful illustrations and photographs, an interactive die-cut model reveals the many rites of the Egyptian tomb. You will be amazed by everything from the iconic golden burial mask, to the lucky amulets the dead were buried with, protective linen wrappings, and even the mummified body and preserved sacred organs. And when it comes to hieroglyphics, hidden burial grounds, and missing treasure, there’s always more to uncover, so get your start now, who knows where your journeys will take you!"}]