[{"id": "0689849249", "genre": "Children's Books", "title": "Tithe : A Modern Faerie Tale", "description": "Welcome to  the realm of  very scary  faeries!  Sixteen-year-old Kaye is a modern nomad. Fierce and independent, she travels from city to city with her mother's rock band until an ominous attack forces the sixteen-year-old back to her childhood home. There, amid the industrial, blue-collar New Jersey backdrop, Kaye soon finds herself an unwilling pawn in an ancient power struggle between two rival faerie kingdoms -- a struggle that could very well mean her death.  Newcomer Holly Black's enormously powerful voice weaves teen angst, riveting romance, and capriciously diabolical faerie folk into an enthralling, engaging, altogether original reading experience."}, {"id": "0689815360", "genre": "Children's Books", "title": "Good-Bye, Charles Lindbergh: Based on a True Story", "description": "Complemented by lovely, technically accurate paintings, a historical novel is based on the true story of a farm boy who meets his hero, Charles Lindbergh, when the famous pilot sets down his biplane in a field in Mississippi."}, {"id": "0698400720", "genre": "Children's Books", "title": "Amar the Earth Fairy (Minedition Bucher)", "description": "Amar, the earth fairy, does a good job of protecting the animals in the forest and the Fairy Queen gives her a special assignment as a reward."}, {"id": "0195216733", "genre": "Children's Books", "title": "Korean Folk-tales (Oxford Myths and Legends)", "description": "Here are Dan-Gun, the first emperor, whose mother was a bear; Shim Chung, who sacrificed herself to the sea to restore her father's sight, and the magistrate who tried to steal the Dragon King's daughter. The traditional Korean tales in this collection are full of amazing events and characters typical of the Far Eastern folklore. Sad, happy, romantic, and funny, together these tales bring vividly to life the magic of Korea.(reissue of ISBN 0-19-274160-8)"}, {"id": "0525428194", "genre": "Children's Books", "title": "Keith Haring: The Boy Who Just Kept Drawing", "description": "Iconic pop artist Keith Haring comes to life for young readers in this picture book biography lovingly written by his sister This one-of-a-kind book explores the life and art of Keith Haring from his childhood through his meteoric rise to fame. It sheds light on this important artist’s great humanity, his concern for children, and his disregard for the establishment art world. Reproductions of Keith's signature artwork appear in scenes boldly rendered by Robert Neubecker. This is a story to inspire, and a book for Keith Haring fans of all ages to treasure."}]