[{"id": "1427281297", "genre": "Science Fiction & Fantasy", "title": "Voyage of the Basilisk: A Memoir by Lady Trent (The Lady Trent Memoirs)", "description": "The thrilling adventure of Lady Trent continues in Marie Brennan's Voyage of the Basilisk . . . Devoted readers of Lady Trent's earlier memoirs, A Natural History of Dragons and The Tropic of Serpents,may believe themselves already acquainted with the particulars of her historic voyage aboard the Royal Survey Ship Basilisk, but the true story of that illuminating, harrowing, and scandalous journey has never been revealed―until now. Six years after her perilous exploits in Eriga, Isabella embarks on her most ambitious expedition yet: a two-year trip around the world to study all manner of dragons in every place they might be found. From feathered serpents sunning themselves in the ruins of a fallen civilization to the mighty sea serpents of the tropics, these creatures are a source of both endless fascination and frequent peril. Accompanying her is not only her young son, Jake, but a chivalrous foreign archaeologist whose interests converge with Isabella's in ways both professional and personal.Science is, of course, the primary objective of the voyage, but Isabella's life is rarely so simple. She must cope with storms, shipwrecks, intrigue, and warfare, even as she makes a discovery that offers a revolutionary new insight into the ancient history of dragons."}, {"id": "1543690637", "genre": "Science Fiction & Fantasy", "title": "Children of the Divide (Children of a Dead Earth)", "description": "No matter how far humanity comes, it can't escape its own worst impulses in this far-future science fiction thriller from the author of The Ark. A new generation comes of age 18 years after humanity arrived on the colony planet Gaia. Now threats from both within and outside their Trident threaten everything they've built. The discovery of an alien installation inside Gaia's moon, terrorist attacks and the kidnap of a man's daughter stretch the community to breaking point, but only two men stand a chance of solving all three mysteries before the makeshift planetary government shuts everything down. "}, {"id": "B077V5TFLS", "genre": "Science Fiction & Fantasy", "title": "Nemo Rising", "description": "An exciting sequel to the Captain Nemo adventures enjoyed by millions in Jules Verne's 20,000 Leagues Under the Sea. Sea monsters are sinking ships up and down the Atlantic Coast. Enraged that his navy is helpless against this onslaught and facing a possible World War as a result, President Ulysses S. Grant is forced to ask for assistance from the notorious Captain Nemo, in Federal prison for war crimes and scheduled for execution. Grant returns Nemo's submarine, the infamous Victorian Steampunk marvel Nautilus, and promises a full Presidential pardon if Nemo hunts down and destroys the source of the attacks. Accompanied by the beautiful niece of Grant's chief advisor, Nemo sets off under the sea in search of answers. Unfortunately, the enemy may be closer than they realize.... "}, {"id": "1588464016", "genre": "Science Fiction & Fantasy", "title": "Tradition Book: Euthanatos (Mage: The Ascension)", "description": "From necrotic practices in ancient India to modern wheels of chance, the Euthanatos move among all places where fate hangs in the balance. Self-appointed judges and executioners, they seek to keep harmony in the cosmic cycle. But who judges them, and where do their responsibilities truly lie? Only the most careful equilibrium can stave off a descent into the pits of madness and death."}, {"id": "B00K4PWS2Y", "genre": "Science Fiction & Fantasy", "title": "Science Fiction: An Oral History", "description": "\"Science Fiction: An Oral History\" features in-depth dialogs with prominent authors of the genre's Golden Age (1930-1960) and New Wave (1960-1980) eras, including Philip K. Dick, Theodore Sturgeon, Fritz Leiber, Roger Zelazny, C.L. Moore, Leigh Brackett, Norman Spinrad and Robert Anton Wilson. Through these interviews with some of the most highly-regarded figures in the field, we get first-hand insight into the changes in style, subject and society that shaped the evolution of the genre over its first half-century. Topics covered include their influences and working habits, analysis of their major works, discussions of science fiction as the modern mythology and its differences from mainstream fiction, as well as numerous anecdotes from their professional and personal lives. Far from a dry history of a dynamic subject, the interview format captures the spontaneity, enthusiasm and humor of spending a couple hours in good conversation with an old friend. Now includes a bonus interview with \"Star Trek\" creator Gene Roddenberry."}]