[{"id": "1538211475", "genre": "Children's Books", "title": "Soccer Stats, Facts, and Figures (Do Math With Sports Stats!)", "description": "Soccer may be considered a low-scoring sport by some, but learning its intricacies allows readers to see the world of math that is hidden inside what is known as The Beautiful Game. Readers will learn basics like goals and assists as well as higher numbers like caps. They'll even learn how league standings work, and how more complex equations like goal differential can sometimes determine league champions."}, {"id": "B00AC07RIQ", "genre": "Children's Books", "title": "Computer & Tech (Peekaboo: Toddler 2 Infant) (Kids Flashcard Peekaboo Books: Childrens Everyday Learning)", "description": "Picture book with: full screen & text-to-speech. Introduction to computers & technology, includes 24 technologies. Suitable for toddlers, infants & beyond. Length: 24 pages.Items included:PC, monitor, mouse, keyboard, speakers, microphone, printer, ink, laptop, tablet, camera, memory card, USB flash drive, CD, MP3 player, headphones, telephone, mobile, TV, DVD player, game consoles, controllers, SAT Nav & light switch.Full Screen - Optimised to fill 100% of the screen (Includes: Kindle, Paperwhite, Fire & Fire HD).Text-to-Speech - Automatically reads the book and turns the pages (for capable devices).For other ebooks like this, search Amazon for: Peekaboo Toddler 2 Infant"}, {"id": "0989541118", "genre": "Children's Books", "title": "My Salah Flip Book: Teach the basic salah positions with this fun flip book from Allah to Z", "description": "Teach you child the basic salah positions with this spring to life, black and white, fun salah flip book. Slightly larger in size, this book will fit into the smallest of hands. Set the scene in motion with a flick of your thumb from front to back!"}, {"id": "8495761793", "genre": "Children's Books", "title": "Kiko juega con sus amigos (Kiko series)", "description": "Designed in a format perfect for small hands, this collection of stories about a boy named Kiko presents problems that children often view as impossible to solve and teaches them that with the help of family, friends, and loved ones they can confront problems and overcome their fears and difficulties with ease. En esta coleccíon de cuentos infantiles en formato pequeño ideal para las manos de los más chicos se expone un pequeño problema que a los niños puede parecerles grande e imposible de resolver. Luego de manifestar el problema, junto al apoyo y el cariño de la familia y amigos, el niño resuelve sus miedos y dificultades con fluidez y naturalidad."}, {"id": "B00A0NLLDM", "genre": "Children's Books", "title": "Swirly", "description": "Lila is born in the Blue Country, but moves with her parents to the Yellow Country when she is a little girl. As she gets older she discovers that she isn’t all blue—she has swirls of yellow from growing up in the Yellow Country!Lila isn’t just like her yellow friends or her blue cousins, so she feels as though she doesn’t fit in anywhere. But when she meets another swirly kid and his swirly mom, she finds out that she does belong somewhere . . . with a very special swirly Someone."}]