[{"id": "B077WQ4JGR", "genre": "Science Fiction & Fantasy", "title": "A Curse of Fire (Fae Academy Book 1)", "description": "A magical calling card, a murderous secret, and an ancient, dangerous realm.The Fae have been hunting Imogen’s mother for nearly eighteen years. She has something they want: her daughter. Now they’ve caught up with her, and Imogen’s faced with a choice: attend their fae college by choice…or by force.That should’ve been enough warning that Callador, school for the fae, is a manipulative and dangerous place. But it’s not until the school is under attack and the students are facing death by curse that Imogen realizes Callador’s darkest secret isn’t how they get their students to attend.You won’t want to fall behind on the series readers are calling a “brilliant, magical new world.” One click your copy TODAY to see what’s Beyond the Shadow Veil!"}, {"id": "0441003702", "genre": "Science Fiction & Fantasy", "title": "Schismatrix Plus (Complete Shapers-Mechanists Universe)", "description": "Schismatrix Plus, is Bruce Sterling's new trade paperback. For the first time in one volume: every word Bruce Sterling has ever written on the Shapers-Mechanists Universe.In the last decade, Sterling has emerged a pioneer of crucial, cutting-edge science fiction. Now Ace Books is proud to offer Sterling's stunning world of the Schismatrix--where Shaper revolutionaries struggle against aristocratic Mechanists for ultimate control of man's destiny. This volume includes the classic full-length novel, Schismatrix, plus thousands of words of mind-bending short fiction."}, {"id": "B015QFTAXG", "genre": "Science Fiction & Fantasy", "title": "Darkness Divided: Part Two in The Unfading Lands Series", "description": "Katharine E. Hamilton continues the incredible adventure of allied kingdoms fighting a common enemy in her sensational The Unfading Lands trilogy.A darkness is now divided.A new threat is on the horizon,and a queen is on the throne.Princess Alayna rises to position as queen of the entire Realm. A role she was never meant to possess. She is faced with the daunting task of protecting her Realm of four kingdoms from the Land of Unfading Beauty’s increasing strength as well as a new threat emerging from a once friendly neighbor, the Realm of King Abner.As they face Lancer, their shared enemy, and consider the threat of Abner, the beloved allies come together in unprecedented unity.  From the ashes of hard-fought battles, romance blooms and friendships deepen within the roster of cherished princes and princesses. New leaders will appear, bold and true, and deeply committed to the virtue of the Realm.An ally has infiltrated the Land of Unfading Beauty at great cost — absorbing the very darkness that runs through Lancer. Can this useful collaborator help save them all from Lancer’s mysterious power? Can he withstand the temptations of evil coursing through his veins?With multiple enemies threatening the very foundation of the Realm, Alayna must decide whom she can trust. She must decide who the real enemy is. And all the leaders must fight. Can Alayna, the newly crowned queen, lead the Realm to victory?While treacherous secrets frustrate strategies and an imposing army appears on the horizon, the most important question remains:Where does your allegiance lie?"}, {"id": "1943958491", "genre": "Science Fiction & Fantasy", "title": "Beneath Catseye", "description": "In the not too distant future, the Earth's corporate giants and surviving governments decide the cleansing of the overpopulated planet is a necessity. In collusion advertising campaigns draw in the desperate, the fanatic and the soldier for the first colonization of an extraterrestrial body. The ships were quickly filled with volunteers, willing . . . or not.   At the end of a long journey, the few military leaders observed the disaster that spun below them. Cold, bombarded and fading, their new home was clearly less than advertised. So the scientist went to work to speed up the process toward occupying the planet.Years later as the ships' occupants disembarked, hungry eyes looked on."}, {"id": "B00MOQI6B8", "genre": "Science Fiction & Fantasy", "title": "The Abode, Part 9: Timeless", "description": "Jack Williams, a young college student with a crippled leg, undergoes a near spontaneous healing after trying a new medication for pain. He soon discovers that the therapy awakened genes that have triggered a transformation of his body. Upon learning of his true nature, an extraterrestrial-human hybrid, he is rushed to a unique community where aging and disease are unheard of and many secrets will be revealed to him. When the citizens of his new abode go to war with an ancient enemy, his new abilities are put to the test. The woman he loves, the family member he didn't know existed, and the ruthless king he must defeat: the challenge of dealing with them, and others, push him to the breaking point. Will he survive the transition from human to something much greater and take his rightful place in the community? Download this tale of love and fantasy to find out."}]