[{"id": "0310757363", "genre": "Children's Books", "title": "Bright Night", "description": "Share the joy of Christmas with your child through the colorful pages of Bright Night, a board book by Lorie Ann Grover that celebrates the season. Sweet rhymes and engaging illustrations show little ones the way Mary and Joseph traveled to Bethlehem on the bright night that Jesus was born. Filled with love and gentle storytelling, this padded cover board is perfect for the young child in your life."}, {"id": "B0052FF882", "genre": "Children's Books", "title": "A Dazzling Display of Dogs", "description": "From the award-winning team behind A Curious Collection of Cats comes a new collection of visual poems celebrating all things canine—from obedience school, to backyard break outs, to flatulent Fidos. Whether your best friend is a plucky Jack Russell, an indecisive basset hound, or a poodle with an indiscriminate appetite, you're sure to find this dazzling display doggone delightful."}, {"id": "B01D7UQE90", "genre": "Children's Books", "title": "Hopper and the Rollercoaster (Hopper & Friends Book 0)", "description": "Hopper Bunny is excited when he learns about the new amusement park being built in the forest where he lives. But his excitement quickly fades when he finds out about the enormous rollercoaster it will have.How can Hopper keep his friends from finding out how terrified he is about the new rollercoaster... especially now that Shannon Squirrel is having her birthday party at the amusement park?"}, {"id": "B0091N4U2Q", "genre": "Children's Books", "title": "Click: The Ultimate Photography Guide for Generation Now", "description": "Teens love to take pictures of their friends, their families, their dogs, their noses . . . now they can get serious with Click,the first how-to photography book written by teens for teens. The author is eighteen-year-old Charlie Styr, assisted by writer and photography editor Maria Wakem, and the book is illustrated with more than 150 photos taken by teen photographers around the world. After discovering basic equipment, composition, and lighting, readers explore 27 high-interest techniques, from portraits to action, macro, shooting at night, special effects, and more, with Styr’s clear how-to advice plus sample photos by teens. Tips from new and established pros, including industry veteran Art Wolfe, Pulitzer Prize winner Vincent Laforet, National Geographic photographer David McLain, and celebrity photographer Chris Buck, bring great photographs totally within reach. Ready? Set? Click!"}, {"id": "B00CY2HQTK", "genre": "Children's Books", "title": "From the Good Mountain: How Gutenberg Changed the World", "description": "What was made of rags and bones, soot and seeds? What took a mountain to make? For the answer, travel back to the fifteenth century—to a time when books were made by hand and a man named Johannes Gutenberg invented a way to print books with movable type. Written as a series of riddles and illustrated in the style of medieval manuscripts by an award-winning author and artist, From the Good Mountain will intrigue readers of all ages. On every page there is something surprising to learn about how the very thing you are holding in your hands came to be."}]