[{"id": "B0754LXYXW", "genre": "Children's Books", "title": "I Can Be Anything! Don't Tell Me I Can't", "description": "Like most girls and boys, Zoe enthusiastically embraces the wonders of our world and its infinite possibilities. \"I can be anything I want to be!\" she tells us, presenting herself in a range of careers. \"But what if you fail?\" asks a voice of doubt that attempts to undermine her confidence.Bold and sassy, Zoe swats the voice away at every turn, declaring her certainty with a charisma that will encourage us all to silence the fears projected onto us by our world. Why can't a girl grow up to be President? Zoe can! When the voice of doubt continues, Zoe knows exactly what to say: \"Go away, voice... I can be anything... but first, I have to learn to read. And don't tell me I can't!\" Award-winner Diane Dillon has created a winning character who defies anything to hold her back from achieving her goals. And the key to Zoe's future success begins when Zoe defiantly opens her book, making it clear that both confidence and reading are tools we all need to make our dreams come true."}, {"id": "B074HDL8SD", "genre": "Children's Books", "title": "5 Tips to Ride a Tuk-Tuk in Bangkok Tuk-Tuk TAXI Bangkok Thailand (Photo): 5 Tips to Ride a Tuk Tuk", "description": "Tuk-tuk or ‘sam lor’ (three-wheeled) used to be everyone’s favourite way of getting around Bangkok before the BTS, MRT and colourful taxis took over. Originating from an old-fashioned rickshaw during the second World War, a tuk-tuk is essentially a rickshaw with a small engine fitted in."}, {"id": "1933339055", "genre": "Children's Books", "title": "The Story of the World, Activity Book 1: Ancient Times - From the Earliest Nomad to the Last Roman Emperor", "description": "Color a picture of a Minoan bull-jumper, make a model of the Nile River, create Roman armor and Celtic jewelry and more...don't just read about history―experience it! This comprehensive, 8.5\" x 11\" curriculum guide and activity book contains map activities, coloring pages, games, projects, review questions, cross-references to illustrated encyclopedias, and extensive book lists. Children and parents love the activities, ranging from cooking projects to crafts, board games to science experiments, and puzzles to projects. Each Story of the World Activity Book provides a full year of history study when combined with the Textbook, Audiobook, and Tests―each available separately to accompany each volume of The Story of the World Activity Book. Activity Book 1 Grade Recommendation: Grades 1-5. Illustrated throughout with black-and-white drawings and maps"}, {"id": "0316126446", "genre": "Children's Books", "title": "The Jolly Postman", "description": " p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 14.0px Calibri} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Times}  This nostalgic classic is a must-have for every child!  Now republished in a larger format, this gorgeously illustrated, full-color classic celebrates a time before email by depicting amusing correspondences from one fairy tale or Mother Goose character to another, giving readers a chance to reimagine their favorite bedtime stories and keeping young readers busy for hours!"}, {"id": "B003L77V10", "genre": "Children's Books", "title": "Laura Bush: America's First Lady", "description": "Laura Bush has loved education and reading since she was a young child, and today she brings her experienced viewpoints, her love of children, and her interest in education to a much broader audience as the wife of the forty-third president of the United States, George W. Bush. In her speeches and public appearances, she expresses what many Americans believe: that every human being should be treated whith dignity, and that no child should be left behind in shcool, or in life.  This biography of one of our most fascinating public figures touches on all aspects of Mrs. Bush's life, from her years as a teacher and librarian, to her first meeting with her husband, to the birth of their twins, to her important work as an advocate for women and children."}]