[{"id": "B0152BWHHU", "genre": "Children's Books", "title": "Fantastic Facts About Pandas: Illustrated Fun Learning For Kids", "description": "Welcome to the Fantastic Facts Book Series!Bestselling children’s author Miles Merchant presents “Fantastic Facts About Pandas”. This book uses captivating images and expertly written words to teach children about “Pandas”Perfect reading for any occasion and especially ideal for bed times, long journeys or for bonding with your child. Fun Filled Learning for Your Child (and you!)Every one of our books is lovingly researched, illustrated and put together to outstand, awe and inspire the reader. Our beautiful images help explain and enlighten each well-written fact.We loved compiling this book and even learned a few things along the way and hopefully you will too.Get this book at this SPECIAL PRICE exclusive to the Amazon Store. *** Your child will love it - this is guaranteed.***PLEASE Leave an honest review after reading this booK! It REALLY helps us to understand what you would like to see and read about! Thank you."}, {"id": "1582462569", "genre": "Children's Books", "title": "The Yankee at the Seder", "description": "The war is over, and everyone is saying the South lost. Ten-year-old Jacob would give anything to show those Yankees that not all Confederates are ready to surrender.He gets his chance when he sees a real, live Yankee soldier walking down his street, on leave for Passover. But before Jacob can think of a way to be brave, the Yankee asks him for a piece of his matzoh. This true story about a Jewish Yankee soldier joining a Southern family’s Passover meal shows how common values can overcome even the most divisive differences. Gathered around the seder table, the group discusses what it means to be free--a subject as relevant today as it was during the War between the States and during the Exodus."}, {"id": "0756615011", "genre": "Children's Books", "title": "Mi Primer Libro del Cuerpo/My First Body Board Book (My First Books)", "description": "Labelled photographs help babies identify parts of the body and their uses, emotions, clothing, and other terms."}, {"id": "1426310986", "genre": "Children's Books", "title": "National Geographic Kids Just Joking 3: 300 Hilarious Jokes About Everything, Including Tongue Twisters, Riddles, and More!", "description": "Q: What sound to porcupines make when they kiss?A: Ouch!Q: What do you get from a cow after an earthquake?A: A milkshake!Q: Why did the golfer wear two pairs of pants?A: In case he got a hole in one.Packed with even more of the silly jokes that kids love, including knock-knocks, tongue twisters, riddles, traditional question and answer jokes, and more, Just Joking 3 will be presented in National Geographic Kids' colorful, photo-driven style. Laughing animals, funny people, and other colorful photos are paired with each joke, adding an extra laugh on each page. National Geographic Kids' signature square trim size and candy-colored palette make this fun-filled book perfect for tossing into a backpack to share with friends at school or camp."}, {"id": "0237538776", "genre": "Children's Books", "title": "Garden (Sparklers - Out and About)", "description": "Garden encourages children to investigate a garden whatever the weather—from planting seeds in spring to feeding birds in winter. Children are introduced to gardening tools and techniques, and to the creatures found near ponds, grass, flowers, and soil. They are also encouraged to use the garden as a place to play and to enjoy time with family and friends."}]