[{"id": "B01GPL2FW8", "genre": "Science Fiction & Fantasy", "title": "The Golden D6 #4: The Online Hobby Magazine", "description": "As part of nostalgic longings, I remember a time when hobby magazines were chock full of modelling tips, painting guides, battle and tactics articles. Not just for one system, but for heaps of them. It was awesome!Ultimately, The Golden D6 has been created to capture and inspire tabletop wargamers’ imaginations.There are some amazingly talented individuals out there playing, painting and building scenery and The Golden D6 plans to showcase them all!We hope you will be as inspired and excited as we are!With an editorial by our residnet creature of the night, Matt Weaver, The Golden D6 issue four features:Jonno's Infinty reportA Warhammer 40000 battle report from Creative TwilightStephen Spiteri's Heroclix Team Building adviceNafNaf's Nightmare VisionsMetalHead Minis review the upcoming KickStarter for Phoenix MiniaturesScarHand PaintingPlus more ..."}, {"id": "B074RYRRC6", "genre": "Science Fiction & Fantasy", "title": "Fog Lifted: An Epik Fantasy Short (The Great Ranger Book 1)", "description": "A ranger's duty is to protect the people of the realm... Only, who protects the rangers?A legendary monster lurks in the depths of the ocean.Collus, a ranger, and his companions quest across the continent in search of the beast. What they find is a village that has all but given into its murder. But like an iceberg, there’s more hidden under the metaphorical surface of the town than meets the eye.Fantasy meets myth in this short but epic tale.Sign up for the mailing list to read FREE origin stories: http://freebook.williamtylerdavis.com Fog Lifted is the first novella in a spin-off of the Epik Fantasy Series.\"Wait... A spin-off? But I haven't read the others?\"\"Right, that's fine. And actually intentional. These events take place several months before Hero in a Halfling kicks off.\"\"Oh, neat!\" The Great Ranger TrilogyFog LiftedThe Vanishing Castle (November 2017)Chivalry's Lament (January 2018)"}, {"id": "B003XT5SMK", "genre": "Science Fiction & Fantasy", "title": "2012 The Awakening", "description": "A woman, Ravi Shyamalan, is about to give her most auspicious career speech after receiving the Nobel Prize in Economics. A vibration rattles her and she finds herself unable to deliver her prepared address, but is driven to speak from the heart about a need for humanity to change directions and see itself in a new role on planet earth.Her sister/manager, Rachel, is terrified as her sister goes so far off script from the talk they'd prepared together. Ravi is embarrassed, petrified, and filled with self doubt as she becomes a voice for a shift in humanity's consciousness. What she does not yet know is that all of humanity is being challenged to redefine themselves at this critical time in history.Join Ravi on her heart gripping exhilarating journey into a world of grave danger and limitless possibility, navigating the waters of a global human awakening.Deepak Chopra called '2012 The Awakening' \"a Gift,\" actor, Holmes Osborne said it has 'the suspense of a Da Vinci Code, the spiritual awareness of The Secret, and the fearsome aspect of Orwell’s 1984.' A global human awakening shakes the foundations of powers that have ruled the world for eons. The heroes’ struggle to envision a new way of being will determine their survival. Can they? Can we?"}, {"id": "158846783X", "genre": "Science Fiction & Fantasy", "title": "Arcana Evolved Ruins of Intrigue (SWORD AND SORCERY)", "description": "The ruins of Serathis loom high in the mountains. Only recently uncovered, this ancient city draws hundreds to its shattered streets in search of treasure and adventure. Giants and dragons square off from opposite sides of the ruins. The winds of war howl in the distance. Vast wealth and terrible monsters await!Ruins of Intrigue provides the foundation for an entire campaign using the Monte Cook's Arcana Evolved variant player's handbook. It presents Serathis, a ruined city located between territories claimed by the giants and dragons. Both factions seek to hold the city and its treasure, setting the stage for conflict. The book's adventure source material will take your characters to 10th level and beyond.Ruins of Intrigue also contains new monsters, secret societies, organizations, and other material that reflects the city's ancient secrets. And its modular design allows all player levels and character affiliations to use this campaign-in-one-book.This comprehensive look at an exciting new realm of adventure gives DMs the chance to start and run a campaign with ease and offers an characters the opportunity to play an important role in the Lands of the Diamond Throne."}, {"id": "B078843MS8", "genre": "Science Fiction & Fantasy", "title": "A Blurt in Time: The Tale of a Time-Traveling Toilet", "description": "Burt was certain that if he hadn't hit King Kong with Darth Vader's head, he would not have fallen into that Citadel Hill time-traveling toilet. He wouldn't have met and been shot by the one-armed ghost, and he would not have found himself in the wrong place at the wrong freaking time. A Blurt in Time is a YA time-travel horror story that grown-ups will want to hear when the kids aren't looking.\n\"If Harlan Ellison, Richard Matheson, and Robert Bloch had a three-way sex romp in a hot tub, and then a team of scientists came in and filtered out the water and mixed the leftover DNA into a test tube, the resulting genetic experiment would most likely grow up into Steve Vernon.\" - Bookgasm\n"}]