[{"id": "0761143866", "genre": "Children's Books", "title": "The Brainiest Insaniest Ultimate Puzzle Book!", "description": " It’s win-win for the whole family: Kids love puzzles—and parents love their kids to love puzzles. Now from Puzzability—the premier puzzle-writing company whose mind-benders have appeared regularly in The New York Times and Disney Adventures, and repeatedly in The New Yorker and Martha Stewart Kids—comes a rich, original, and entertaining category-killer of a book with over 250 puzzles on every imaginable theme and subject. Fully illustrated in color, here is a bonanza of mazes, word games, visual and logic puzzles, and more. With a full range of difficulty, but all totally solvable, the puzzles are not meant to be tests. In fact they’re engaging and humorous, as fun to work on as they are satisfying to solve. In Gray Matter, readers first solve a short crossword, then use the letters in the puzzle to crack a riddle. Hot Lines involves matching kids to their clothing—based on tan lines. Flea Circuit is an unusual maze that you find your way out of by jumping around the page like a flea. A scavenger hunt runs through the book—solve every puzzle to amass the clues and earn the bound-in certificate of achievement. (Yes, the honor system applies.)"}, {"id": "0544809076", "genre": "Children's Books", "title": "Mr. Putter & Tabby Smell the Roses", "description": "Mr. Putter wants Mrs. Teaberry’s birthday to be extra special this year. So how about a trip to the Conservatory to see the beautiful trees and plants and flowers? It will be heavenly. And it is! Mr. Putter and Tabby and Mrs. Teaberry and Zeke sniff the air. They smell the roses. They learn the plant facts. It’s the perfect celebration . . . until Zeke finds the banana tree. The Mr. Putter & Tabby early reader series has been long beloved by children, parents, and teachers. This new volume is as funny and endearing as ever."}, {"id": "0881063266", "genre": "Children's Books", "title": "The Coin Counting Book", "description": "Twenty-five pennies, four dimes, two nickels, and one quarter… hmm…A pocketful of coins! Who can make heads or tails of it? YOU can with THE COIN COUNTING BOOK. Change just adds up with this bankable book illustrated with real money. Counting, adding, and identifying American currency from one penny to one dollar is exciting and easy. When you have counted all your money, you can decide to save it or spend it."}, {"id": "B00P0OBYGK", "genre": "Children's Books", "title": "The Adventures of Bird Dog and Friends", "description": "The story of “The Adventures of Bird Dog and Friends” began with a fluffy blue and white toy dog that had large floppy ears. The toy dog was given to our daughter Samantha, by a friend when she was around two years of age. Thereafter, and every night until she grew out of the fairy tale fantasy, I would tell her a story based on a dog that could fly. The characters in the story are of course Bird Dog (Blondie), along with her friends, Bumble Bee, Swallow, Opossum and Monkey. Other key characters are Rocky the horse and Claw the eagle.The book will capture the imagination of children and instill the values of friendship, teamwork, caring for one another, achievement, kindness and manners within a framework of adventure.             The book has been superbly illustrated by Australian artist Leigh Brown and brilliantly designed by Top Dog Advertising in Brisbane, Australia.\"\"THE BOOK WAS HONORED IN AMERICA BY USA BOOK NEWS AS A CATEGORY FINALIST IN THE NATIONAL BEST BOOKS 2010 AWARDS\"\".Enjoy...Stephen PenberthyAuthor"}, {"id": "0547959079", "genre": "Children's Books", "title": "Eye to Eye: How Animals See The World", "description": "In his eye-popping work of picture book nonfiction, the Caldecott Honor–winning author-illustrator Steve Jenkins explains how for most animals, eyes are the most important source of information about the world in a biological sense. The simplest eyes—clusters of light-sensitive cells—appeared more than one billion years ago, and provided a big survival advantage to the first creatures that had them. Since then, animals have evolved an amazing variety of eyes, along with often surprising ways to use them."}]