[{"id": "B00127SID6", "genre": "Children's Books", "title": "Dinosnores", "description": "Such are the trembling sounds of the gigantic dinosnores. Not everyone knows that the earth used to be made up of one huge supercontinent –– until the loud snores of the dinosaurs caused the land to quake and split!  Kelly DiPucchio's fun and boisterous take on a page out of history is brought to life in Ponder Goembel's colorful, fantastic world of flying pterodactyls and rumbling brontosauruses. "}, {"id": "B01AGIOSQ2", "genre": "Children's Books", "title": "The Ultimate Book of Space", "description": "With all the features that made The Ultimate Construction Site Book a bestseller, this oversized volume offers a fact-filled and action-packed look at the amazing universe of outer space. Bursting with 40 flaps, pop-ups, pull tabs, and movable parts, The Ultimate Book of Space provides a richly illustrated, hands-on exploration of space travel, the Earth's place in our galaxy, the solar system, and so much more! Sure to encourage curious young readers to venture deeper into space, this is a must-have book for any budding scientist's library."}, {"id": "1599538768", "genre": "Children's Books", "title": "Reduce, Reuse, Recycle (Beginning-to-Read: Life Science)", "description": "\"Taking care of the planet now will allow for a better future. By reducing trash, reusing products, and recycling materials, we can make small changes that will help make a big difference in the future. This title includes science and reading activities and a word list\"--"}, {"id": "1530545765", "genre": "Children's Books", "title": "Jossie's New Home", "description": "Jossie's New Home is a gentle tale about Josie the Jersey cow who is tired of living in a paddock - so she goes off in search of a new home. She tries the orchard, the dog kennel, the hen house and even the garage, only to discover she can't sleep a wink. Just when Jossie is wondering what else to try, and if she will ever sleep again, she spies the perfect place!The story is suitable for little ones up to about age six years, although older children might enjoy the story, too. "}, {"id": "B00F077ZH4", "genre": "Children's Books", "title": "Funny and Decent Jokes for Kids (Joke Books for Kids Book 1)", "description": "Awesome collection of over 500 funny and decent jokes for kids!This first book in the series of Joke Books for Kids features jokes such as:Aviation JokesApple JokesAccountant JokesBanana Jokesand many more to tickle your funny bones.."}]