[{"id": "1514269392", "genre": "Science Fiction & Fantasy", "title": "The Rules of Supervillainy (The Supervillainy Saga) (Volume 1)", "description": "Gary Karkofsky is an ordinary guy with an ordinary life living in an extraordinary world. Supervillains, heroes, and monsters are a common part of the world he inhabits. Yet, after the death of his hometown's resident superhero, he gains the amazing gift of the late champion's magical cloak. Deciding he prefers to be rich rather than good, Gary embarks on a career as Merciless: The Supervillain Without Mercy. But is he evil enough to be a villain in America's most crime-ridden city? Gary soon finds himself surrounded by a host of the worst of Falconcrest City's toughest criminals. Supported by his long-suffering wife, his ex-girlfriend turned professional henchwoman, and a has-been evil mastermind, Gary may end up being not the hero they want but the villain they need."}, {"id": "0521466652", "genre": "Science Fiction & Fantasy", "title": "Fantasy, the Bomb, and the Greening of Britain: Romantic Protest, 1945-1980", "description": "This work explores the essential ideas and assumptions of three very different cultural developments in post-World War II Britain: the fantasy literature of C. S. Lewis and J. R. R. Tolkien and the response it provoked; the protests that emerged in the late 1950s against Britain's possession of nuclear weapons; and the early Green movement of the 1960s and 1970s. It shows that these three products of middle-class culture should be placed within the British intellectual and cultural tradition of romantic protest against industrialised society."}, {"id": "1512060399", "genre": "Science Fiction & Fantasy", "title": "Abilites", "description": "When a freak accident at summer camp threatens his friend's life, it's up to fifteen-year-old Alex Bern to use his previously hidden superhuman ability to save her. But revealing his hidden power has repercussions, exposing his deepest secrets to all. Camp Pacific is suddenly the most dangerous place for Alex to be ... because his enemies have been lying in wait."}, {"id": "1588464393", "genre": "Science Fiction & Fantasy", "title": "Mage Keys to the Supernal Tarot Major*OP", "description": "The Major Arcana   Each key, each trump, is a step along the path of the mage. From the dangerous ignorance of the Fool to the completion of the World, each card holds a secret. Seek Justice, pursue Strength, trick the Devil, and defy Death ― the cards will show you the way.   A Chronicle Book for Mage: The Awakening™  • Storytelling the journey through the Tarot as a Mage chronicle  • 22 different cabals, legacies, Artifacts, and other ready-made story materials, each one tied to one of the Major Arcana  • Advice on cartomancy, story seeds for every Tarot card, and more"}, {"id": "0765375095", "genre": "Science Fiction & Fantasy", "title": "Voyage of the Basilisk: A Memoir by Lady Trent (The Lady Trent Memoirs)", "description": "The thrilling adventure of Lady Trent continues in Marie Brennan's Voyage of the Basilisk . . . Devoted readers of Lady Trent's earlier memoirs, A Natural History of Dragons and The Tropic of Serpents, may believe themselves already acquainted with the particulars of her historic voyage aboard the Royal Survey Ship Basilisk, but the true story of that illuminating, harrowing, and scandalous journey has never been revealed―until now. Six years after her perilous exploits in Eriga, Isabella embarks on her most ambitious expedition yet: a two-year trip around the world to study all manner of dragons in every place they might be found. From feathered serpents sunning themselves in the ruins of a fallen civilization to the mighty sea serpents of the tropics, these creatures are a source of both endless fascination and frequent peril. Accompanying her is not only her young son, Jake, but a chivalrous foreign archaeologist whose interests converge with Isabella's in ways both professional and personal.Science is, of course, the primary objective of the voyage, but Isabella's life is rarely so simple. She must cope with storms, shipwrecks, intrigue, and warfare, even as she makes a discovery that offers a revolutionary new insight into the ancient history of dragons.The Lady Trent Memoirs1. A Natural History of Dragons2. The Tropic of Serpents3. Voyage of the Basilisk4. In the Labyrinth of Drakes5. Within the Sanctuary of Wings"}]