[{"id": "B001IBJ330", "genre": "Children's Books", "title": "A Place to Belong", "description": "Almost everyone longs for a place where they fit in, a place where they feel safe and loved. For most people, their families provide this security, but Paul Miller had to find it out in the world and in his own heart. In his new novel, A Place to Belong, set in the years following World War II, he tells a story of a childhood of abuse and as adolescence on the road in constant search."}, {"id": "0449816664", "genre": "Children's Books", "title": "I Can Be...Story Collection (Barbie) (Step into Reading)", "description": "The Barbie™ I Can Be . . . Story Collection includes five Step into Reading early readers: I Can Be . . . A Baby Doctor,  I Can Be . . . A Horse Rider, I Can Be . . . A Teacher,  I Can Be . . . A Pet Vet, and I Can Be . . . A Ballerina. Girls ages 4–6 won't be able to resist!"}, {"id": "1783122978", "genre": "Children's Books", "title": "Gaming Record Breakers", "description": "This is the record book every gamer and games fan needs—now revised and updated!  The longest Minecraft marathon, the most expensive computer game ever made, the richest gaming prizes, the biggest games console, the most popular game on Facebook: here are all the records you want about the incredible world of computer games! Kids—both boys and girls—can’t get enough gaming action, and this book gives them all the facts, stats, and full-page, all-action images they crave.Features games rated as Teen or younger by the US Entertainment Software Rating Board (ESRB)."}, {"id": "B00FBAP0ZE", "genre": "Children's Books", "title": "Romaine Holiday (The Bunnyrific Adventures of Juni the Wonderbunny Book 4)", "description": "\"Romaine Holiday\" is the fourth volume in the delightful series of children's eBooks, entitled, \"The Bunnyrific Adventures of Juni the Wonderbunny.\" Written entirely in playful rhymes, children will be fascinated and enchanted with the start-to-finish story of Juni the Wonderbunny's dream of going to Thailand's \"Rabbit Resort,\" a real place in Asia. They will learn about packing a suitcase for an overseas vacation, and about the fun of meeting new people and exploring new places far away from home. Children will enjoy reading new vocabulary words and seeing ornate architecture and wood carvings from another part of the world! Whether you have a bunny, are considering adopting a bunny or just love bunnies, you will find this eBook utterly bunnyrific!"}, {"id": "B00WOPKRHK", "genre": "Children's Books", "title": "Mama Duck's Really Big Scare", "description": "A delightful book for children that tells you about a near tragic calamity that almost changed the perfect lives of the characters. Visit Mama Duck and her ten ducklings in Desert Valley Lake and discover about their lives. Know what the calamity is and witness how their bravery saved them. Enjoy Mama Duck's Really Big Scare and be inspired!"}]