[{"id": "0841232482", "genre": "Science Fiction & Fantasy", "title": "Chemistry and Science Fiction (American Chemical Society Publication)", "description": "This lively collection looks at science as filtered through literature, film, and television. It discusses classic works in science fiction and provides an in-depth look at the chemistry depicted in popular culture, particularly in Star Trek, Star Wars, and Doctor Who. It includes an examination by Nebula Award winner Connie Willis of how science fiction authors use science, and reprints two tongue-in-cheek short stories by Isaac Asimov. The book also includes suggestions for using science fiction as an educational resource."}, {"id": "0316513318", "genre": "Science Fiction & Fantasy", "title": "The Imperial Radch Boxed Trilogy: Ancillary Justice, Ancillary Sword, and Ancillary Mercy (The Imperial Radch Trilogy)", "description": "This special boxed set includes the New York Timesbestselling author Ann Leckie's complete Hugo, Nebula, Arthur C. Clarke, and Locus award-winning Ancillary space opera trilogy.On a remote, icy planet, the soldier known as Breq is drawing closer to completing her quest.Breq is both more than she seems and less than she was. Years ago, she was the Justice of Toren-- a colossal starship with an artificial intelligence linking thousands of corpse soldiers in the service of the Radch, the empire that conquered the galaxy.An act of treachery has ripped it all away, leaving her with only one fragile human body. And only one purpose-- to revenge herself on Anaander Mianaai, many-bodied, near-immortal Lord of the Radch.The Ancillary TrilogyAncillary Justice Ancillary Sword Ancillary Mercy"}, {"id": "B01MS45D6Y", "genre": "Science Fiction & Fantasy", "title": "Mating Wars", "description": "The Marauders are coming. And they're coming hard.Aura never thought she'd be the first human in history to mate with a big, purple alien with a big, teal d*ck. She also never thought her hybrid children would go on to form a lasting dynasty within the solar system. But Cygnus's arrival changes everything. He's as tall as Olympus Mons, and his shoulders are as wide as Valles Marineris--and his ego may be too big for the solar system.Cygnus and Aura's story kicks off a six-book epic. Follow the first generation of Marauder and human romances, and then see what happens when their Seraphim children--human and Marauder hybrids--grow up and fall in love themselves. These fierce and protective aliens will stop at nothing to be with their human mates, even if they have to betray their own kind. Each full-length story is full of love, action, laughter, and steamy sex. Each book has a happy ending with no cliffhanger--and absolutely no cheating."}, {"id": "0803280300", "genre": "Science Fiction & Fantasy", "title": "Master of Adventure: The Worlds of Edgar Rice Burroughs (Bison Frontiers of Imagination)", "description": "So, just how was Tarzan created? Eager to know the inside story about the legendary John Carter and the amazing cities and peoples of Barsoom? Perhaps your taste is more suited to David Innes and the fantastic lost world at the Earth’s core? Or maybe wrong-way Napier and the bizarre civilizations of cloud-enshrouded Venus are more to your liking? These pages contain all that you will ever want to know about the wondrous worlds and unforgettable characters penned by the master storyteller Edgar Rice Burroughs. Richard A. Lupoff, the respected critic and writer who helped spark a Burroughs revival in the 1960s, reveals fascinating details about the stories written by the creator of Tarzan. Featured here are outlines of all of Burroughs’s major novels, with descriptions of how they were each written and their respective sources of inspiration. This Bison Books edition includes a new foreword by fantasy writer Michael Moorcock, a new introduction by the author, a final chapter by Phillip R. Burger, as well as corrected text and an updated bibliography."}, {"id": "1784296171", "genre": "Science Fiction & Fantasy", "title": "Florence Grace: The Richard & Judy bestselling author", "description": "'Possibly the most wonderful book I've ever read. A complete joy' Amazon reviewer. The stunning new novel from the author of the Richard and Judy bestseller Amy Snow. Perfect for fans of The Keeper of Lost Things and Island of Secrets. Florrie Buckley is an orphan, living on the wind-blasted moors of Cornwall. It's a hard existence but Florrie is content; she runs wild in the mysterious landscape. She thinks her destiny is set in stone. But when Florrie is fourteen, she inherits a never-imagined secret. She is related to a wealthy and notorious London family, the Graces. Overnight, Florrie's life changes and she moves from country to city, from poverty to wealth. Cut off from everyone she has ever known, Florrie struggles to learn the rules of this strange new world. And then she must try to fathom her destructive pull towards the enigmatic and troubled Turlington Grace, a man with many dark secrets of his own."}]