[{"id": "1903654416", "genre": "Science Fiction & Fantasy", "title": "Professor Bernice Summerfield and the Glass Prison", "description": "Don't ever annoy the Fifth Axis. They might throw you into the Glass Prison on Deirbhile­ and then throw away the key. Once you're inside, there's nowhere to hide. They can see your every movement. They control you. You're going to be watched for the rest of your life, wherever you go, whoever you are. Even if you're a professor of archaeology. Even if you're a friend of the famous Irving Braxiatel, and you've written several popular coffee-table books. Even if you're pregnant, and your baby's due any day now. But, of course, they know all about your baby. And they're planning to take it away. That is, unless the loony cultists you're locked up with don't get it first."}, {"id": "0765377241", "genre": "Science Fiction & Fantasy", "title": "Denied: A Novel of the Sazi (Luna Lake)", "description": "USA TODAY BESTSELLING AUTHORThe thrilling stand-alone conclusion to the paranormal fantasy Luna Lake series, packed with action and romanceCathy Clamp's landmark, USA Today bestselling Sazi series concludes with Denied, a thrilling paranormal love story.Anica Petrovic was once human. Now she's Sazi, a bear-shifter and a hero for destroying a European kidnapping ring that was turning human children into shifters. Anica has embraced her Sazi self; and is settling into Luna Lake with her father and brother, happy to live in a shifter community where all are welcome. Love is in the air between Anica and a mysterious newcomer, Tristin, and between Anica's brother and Scott, an owl-shifter who worries about his family's reaction when they scent his attraction to another man. A series of violent murders rocks the town. The killings appear to have been done by a bear. Anica's super-sensitive nose tells her Tristin, also a bear-shifter, is innocent of the murders...but that he's hiding something dangerous.More titles by Cathy Clamp:Luna Lake seriesForbiddenIllicitDenied"}, {"id": "B076483B2J", "genre": "Science Fiction & Fantasy", "title": "The Burning Sea (The Furyck Saga: Book Two)", "description": "IN A WORLD RULED BY MEN, ONE WOMAN WILL RISEAs the kingdoms prepare for war, unexpected visitors and a horrifying murder, throw everyone’s plans into disarray.Amidst the chaos, Jael must find a way to lead her men to victory against King Haaron and his sons, watching as Eadmund drifts away from her, powerless to save him. Left behind on Oss, Edela is locked in a deadly struggle to keep Jael and Eadmund safe. She is going to need help to battle against the dark magic being woven by Evaine and Morana.   In Hest, Jaeger Dragos has found the Book of Darkness. He needs his father’s dreamer to reveal its secrets, but can he trust her?And in Edela’s dreams, she is taunted with the terrifying visions of what is coming to claim them all...Contains mature content, not suitable for younger readers.Also in this series:Winter's Fury (The Furyck Saga: Book One)"}, {"id": "1784967548", "genre": "Science Fiction & Fantasy", "title": "Knightsblade (Imperial Knights)", "description": "A Freeblade Imperial Knight must decide whether to abandon his quest to restore his honour in order to warn the planet that exiled him of an impending doom.Since the fall of House Chimaeros to heresy, Luk Kar Chimaeros has renounced his heritage and his name to become the Knight of Ashes. For five arduous years, in this role as a Freeblade Imperial Knight, he has pursued his treacherous step-mother across the stars alongside a band of fellow exiles. Just as their hunt appears to be nearing its conclusion, word comes of a terrible destruction descending upon Luk's home planet of Adrastapol. The Knight of Ashes must decide whether to continue his quest to exact justice and restore his honour, or to aid the Noble Houses of Adrastapol and risk being branded a heretic evermore."}, {"id": "1508781850", "genre": "Science Fiction & Fantasy", "title": "Fog (1/2986) (Volume 2)", "description": "The thunder of battle rolls over Taiwan. Two stand against fifty, and the price for survival is unbearably high.\"You don't hear death leaping at you. But I can hear you dying. And I can see your body growing as grey and black as the soil that drinks your blood.\"Book 2 of the acclaimed climate fiction saga 1/2986."}]