[{"id": "1547138548", "genre": "Children's Books", "title": "Happy 98th Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 98 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1974249476", "genre": "Children's Books", "title": "Composition Notebook: Back To School Notebooks (School Supplies For Students)(Notebooks for School)(Composition College Ruled 8.5 x 11)(Volume 6)", "description": "Composition Notebooks For The Back To School is Cool KidsWhether it is the start of the school year or half way through it these school journals are great gifts for boys and girls, students of any age and teachers.Filled with ruled paper this school workbook is a must have for every student whether they are Grade 1, 2, 3, or even 6. It is 8.5 x 11, with 120 pages offering ample room for school homework and notes.These back to school journals work great for:Back to School Memory BookBack to School Supplies & EssentialsSchool Year Keepsake BookSchool Record & PlannerHomeschooling School SuppliesComposition Books & HomeworkTeachers Gifts & Stocking StuffersBirthday Gifts for KidsAnd much more…..Scroll up and grab a cool and unique school notebook for kids today!"}, {"id": "1500773204", "genre": "Children's Books", "title": "Mr. McDoo Visits the Zoo", "description": "Mr. McDoo Visits the Zoo is an exciting children's book with 34 pages of beautiful full-color illustrations and adventure! Do you know where to go to answer questions about animals? Mr. McDoo does! Visit the zoo with Mr. McDoo, explore the world of amphibians, reptiles, birds, insects, mammals and rhyme!"}, {"id": "B00V404FNI", "genre": "Children's Books", "title": "A Kid's Guide to Keeping Chickens: Best Breeds, Creating a Home, Care and Handling, Outdoor Fun, Crafts and Treats", "description": "Chickens make wonderful pets, and Melissa Caughey provides all the information kids need to raise healthy chickens and have lots of fun doing it. Covering everything from feeding, housing, and collecting eggs to quirky behaviors and humane treatment, Caughey’s engaging advice helps children understand the best ways to care for their chickens. Spark enthusiasm with creative activities like chicken forts and a veggie piñata for the flock, and feed more than the imagination with egg-centric dishes like Mexican egg pizza. "}, {"id": "0836878116", "genre": "Children's Books", "title": "Let's Read about Snow (Let's Read about Weather)", "description": "Rhyming text is ideal for building phonemic awareness and phonics skills. This series uses delightful rhyming text and engaging photographs to introduce beginning readers to four common weather conditions. These books build the foundation for reading success and make learning about weather fun!"}]