[{"id": "B07147MPHD", "genre": "Children's Books", "title": "Harry Potter Jokes for Kids!", "description": "A Harry Potter joke book for kids!Tags:Harry PotterHarry Potter JokesJokesJokes and RiddlesJokes for KidsSeverus SnapeJK RowlingJ.K. Rowling"}, {"id": "1426309112", "genre": "Children's Books", "title": "National Geographic Readers: Tigers", "description": "With their bold black stripes, powerful presence, and fierce faces, tigers are just about the coolest animal on the planet. These giant jungle cats can climb trees, swim, and run in sprints up to 32 mph—making them a predatory nightmare. Ranging from the warm climates of Southeast Asia to the frozen tundra of western Russia, these solitary hunters will devour whatever animal they catch. In this level 2 reader you'll learn all you ever wanted to know about tigers and so much more. Complete with fascinating facts, beautiful images, National Geographic Readers Tigers can't miss.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "1879794853", "genre": "Children's Books", "title": "Mega Man 1: Let the Games Begin", "description": "Mega Man is the hit new action-adventure series from Archie Comics!Dr. Light wanted to build a better tomorrow with his new Robot Masters, but the evil Dr. Wily reprogrammed them to take over the world! Now it's up to one little robot to save us all -- Mega Man!Don't miss the first heroic adventures of Rock, a simple helper robot who takes up the fight for the greater good! This volume contains Rock's transformation into Mega Man, his first battles with the Robot Masters, and his titanic clash with Dr. Wily!Mega Man Vol. 1 collects issues 1-4 of the Mega Man comic book."}, {"id": "0749643013", "genre": "Children's Books", "title": "The Seed I Planted (Wonderwise Readers)", "description": "Mick Manning and Brita Granstrom, award-winning author/illustrators of many of the Wonderwise titles, have created an exciting new collection of young non-fiction books that are perfect for children just beginning to read. Each book explores a particular area of learning with a simple narrative text and beautiful illustrations which, where appropriate, are labelled or given very simple captions. This differentiated text gently introduces readers to some of the methods of extracting information from a non-fiction book, but still enables them read the book as a story - or simply look at the pictures. Each book has a list of contents, further information and a glossary/index. I Feel Sick! follows the progress of a germ, what it does to people and ways of staying health The Seed I Planted looks at seeds and growing new plants, in particular a conker a young child planted 35 years ago."}, {"id": "0972213538", "genre": "Children's Books", "title": "Stay Safe in Cyberspace: Kids' Guide", "description": "A reference manual that provides the fundamentals of online and computer safety for ages 6-13. Major topics include fraud, infectors, strangers, home computer security, passwords and instant messaging."}]