[{"id": "0515157805", "genre": "Children's Books", "title": "A Pig, a Fox, and Stinky Socks (Penguin Young Readers, Level 2)", "description": "The stars of Jonathan Fenske's 2016 Theodor Seuss Geisel Honor book, A Pig, a Fox, and a Box, are back!Pig and Fox are back—and so are their shenanigans! Told in a silly three-part story, A Pig, a Fox, and Stinky Socks begins with a prank, with Fox \"gifting\" Pig with a pair of stinky socks. But what happens when his plan goes awry and the shoe (or sock!) is on the other foot? With comical art and simple language, Pig and Fox's antics in this Level 2 reader will continue to crack kids up."}, {"id": "1454929413", "genre": "Children's Books", "title": "Brilliant Bugs (First Explorers)", "description": "FIRST EXPLORERS:With cool things to push, pull, and slide on the cover and each sturdy spread, plus fun facts on every page, this chunky board book gives children their first enticing taste of nonfiction! Meet bees, butterflies, and wiggly worms! Peek through the leaves for a magical introduction to the wild world of insects. Turn a wheel to watch a caterpillar turn into a butterfly; pull a tab to see a spider spin its web; count zigzagging beetles; and find out which creepy crawlies are hiding underneath the leaves on the forest floor. It’s interactive fun!"}, {"id": "1464401187", "genre": "Children's Books", "title": "I Like Poodles! (Discover Dogs With The American Canine Association)", "description": "Poodles make great pets. They are smart. You can train them to do tricks! They also love to play and swim. Learn how to care for your poodle. Read about grooming, feeding, vet checkups, and more."}, {"id": "0994573502", "genre": "Children's Books", "title": "Turtle Time: A Children's Photo Story about Flatback Sea Turtles", "description": "Welcome on a journey to one of the most isolated corners of the world, to learn about the beautiful and mysterious Flatback Turtle! The Flatback is unique among the seven species of sea turtles; it is the only sea turtle to nest solely in a single country, doing so in the rugged far north of Australia.  The Flatback Turtle nesting is one of nature’s spectacular events. The pilgrimage to witness it is a privilege few can claim given the tremendous isolation of the beaches the turtles call home.   This journey, shown in photographs and told in simple rhymes, follows the sea turtle from nesting mothers to newborn hatchlings. It takes place in the remote mining town of Port Hedland, Western Australia. Many locals have the good fortune to witness mothers nesting and babies hatching just a hop, skip, and a flip from their doorsteps… a fortune about to be shared with you!"}, {"id": "0844212938", "genre": "Children's Books", "title": "L'Express: Perspectives françaises (1-2-3 Series)", "description": "Intermediate through Advanced French studentsL’Express: Perspectives françaises (Steele) is a collection of 36 articles selected from issues of France's leading weekly news magazine, L'Express. Each selection is accompanied by carefully written pedagogical activities designed to help your students hone their linguistic skills as they read about cultural developments in the French-speaking world."}]