[{"id": "0312526504", "genre": "Children's Books", "title": "Wipe Clean Workbook: Number Skills (enclosed spiral binding) (Wipe Clean Learning Books)", "description": "Help your child master their early numeracy skills with Number Skills―the latest addition to Priddy's successful wipe-clean workbook range. This colorful workbook comes with a dry-wipe pen, perforated number cards, and 44 pages of activities to help children write their numbers, recognize number models to 10, and do simple addition and subtraction.Each page includes colorful photographs and illustrations to make the activities engaging and enjoyable, and there is plenty of opportunity to put their growing numeracy skills into practice. Afterward, children can wipe the pages clean for when they are ready to try again. The spiral binding means that pages lie completely flat for ease of use, and there are even tips for good writing habits. Children can reinforce their learning with the number flash cards that can be used to play the fun maths games included in the book. This workbook is a fantastic way to help your child gain confidence in math at an early age."}, {"id": "1856973484", "genre": "Children's Books", "title": "In Inca Times (Little Library)", "description": "Aimed at 6-9 year olds, this book explores w hat everyday life was like in Inca times. '"}, {"id": "B073BHC189", "genre": "Children's Books", "title": "About Animals for Kids - Russian Edition: Funny Poems To Make Your Child Smile (Russian Funny Poems About Animals Book 3)", "description": "These sweet nursery rhymes will introduce your child to animals: a chameleon, a snail, a little pony, an octopus, a panther and others. Each animal has its own personality and reasons for acting like it does. Written by Russian children's author Irina Stukova, and adorned with colourful pictures by artist Vladimir Nesterenko, these little poems entertain young children and stimulate their imagination.  Which nursery rhyme will be your child's favourite?The book is suitable for children age 3-8. To get a taste, click 'Download Free Sample' or 'Look Inside'."}, {"id": "B075X2SF8S", "genre": "Children's Books", "title": "Escape: Intense, Book 1", "description": "Who is the man with a hole in his face?Tyler Higgins finds more trouble than a 12-year-old should. He’d just wanted to hang with the cool kids. And so he’d listened to Dustin, and now where was he? Spying on parked cars in Lover’s Lane is way too dangerous. Especially when you see some creeps pulling a dead body out of the trunk—right before they spot you behind the shrubs.If only he’d been smart enough to stick up for his friend Nathan instead of going with Dustin . . ."}, {"id": "1417783346", "genre": "Children's Books", "title": "Andrew Johnson (Turtleback School & Library Binding Edition) (Getting to Know the U.S. Presidents)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Highlights the life of the seventeenth president of the United States, who oversaw the reconstruction of the United States after the Civil War, often disagreed with Congress, and agreed to buy Alaska from Russia."}]