[{"id": "1591430372", "genre": "Science Fiction & Fantasy", "title": "The Lost Book of Enki: Memoirs and Prophecies of an Extraterrestrial God", "description": "The companion volume to The Earth Chronicles series that reveals the identity of mankind’s ancient gods• Explains why these “gods” from Nibiru, the Anunnaki, genetically engineered Homo sapiens, gave Earthlings civilization, and promised to return• 30,000 sold in hardcoverZecharia Sitchin’s bestselling series The Earth Chronicles provided humanity’s side of the story concerning our origins at the hands of the Anunnaki, “those who from heaven to earth came.” In The Lost Book of Enki we now view this saga from the perspective of Lord Enki, an Anunnaki leader revered in antiquity as a god, who tells the story of these extraterrestrials’ arrival on Earth from the planet Nibiru.In his previous works Sitchin compiled the complete story of the Anunnaki’s impact on human civilization from fragments scattered throughout Sumerian, Akkadian, Babylonian, Assyrian, Hittite, Egyptian, Canaanite, and Hebrew sources. Missing from these accounts, however, was the perspective of the Anunnaki themselves. What was life like on their own planet? What motives propelled them to settle on Earth--and what drove them from their new home? Convinced of the existence of a lost book that held the answers to these questions, the author began his search for evidence. Through exhaustive research of primary sources, he has here re-created tales as the memoirs of Enki, the leader of these first “astronauts.” What takes shape is the story of a world of mounting tensions, deep rivalries, and sophisticated scientific knowledge that is only today being confirmed. An epic tale of gods and men unfolds, challenging every assumption we hold about our past and our future."}, {"id": "1250186110", "genre": "Science Fiction & Fantasy", "title": "The Stars Now Unclaimed (The Universe After)", "description": "Perfect for fans of Firefly and James S. A. Corey's Expanse series, The Stars Now Unclaimed is a fun, adventure-filled ride around a far-future galaxy.Jane Kamali is an agent for the Justified. Her mission: to recruit children with miraculous gifts in the hope that they might prevent the Pulse from once again sending countless worlds back to the dark ages.Hot on her trail is the Pax--a collection of fascist zealots who believe they are the rightful rulers of the galaxy and who remain untouched by the Pulse.Now Jane, a handful of comrades from her past, and a telekinetic girl called Esa must fight their way through a galaxy full of dangerous conflicts, remnants of ancient technology, and other hidden dangers.And that's just the beginning . . ."}, {"id": "0765321319", "genre": "Science Fiction & Fantasy", "title": "Hymn: The Final Volume of the Psalms of Isaak", "description": "Ken Scholes completes his five-book epic that began with his acclaimed first novel Lamentation. The battle for control of The Named Lands has captivated readers as they have learned, alongside the characters, the true nature of world called Lasthome. Now the struggle between the Andro-Francine Order of the Named Lands and the Y’Zirite Empire has reached a terrible turning point. Believing that his son is dead, Rudolfo has pretended to join with the triumphant Y’zirite forces―but his plan is to destroy them all with a poison that is targeted only to the enemy.In Y’Zir, Rudolfo’s wife Jin Li Tam is fighting a war with her own father which will bring that Empire to ruin.And on the Moon, Neb, revealed as one of the Younger Gods, takes the power of the Last Home Temple for his own.The Psalms of Isaak#1 Lamentation#2 Canticle#3 Antiphon#4 Requiem#5 Hymn"}, {"id": "0786927828", "genre": "Science Fiction & Fantasy", "title": "Arms and Equipment Guide (Star Wars Roleplaying Game)", "description": "Hokey religions and ancient weapons are no match for having a good blaster at your side.The galaxy is a dangerous place, and even the most capable heroes need the right equipment to get the job done. Outfitting for a rescue mission on a frigid ice planet differs from gearing up for an assault on a crime lord's jungle world headquarters. But with the right connections, and enough credits, heroes can acquire all the weapons and tools needed to survive any situation.This sourcebook features:• An arsenal of weapons and armor, along with rules for customizing and personalizing them.• A wide variety of droids from across the galaxy, including the legendary R-Series astromech droids, binary load lifters, and the RA-7 \"Death Star\" droid.• An array of vehicles from landspeeders to military walkers.• Essential survival equipment, including breathers, comlinks, scanners, medpacs, and tools.To use this sourcebook, you also need the Star Wars Roleplaying Game Revised Core Rulebook."}, {"id": "1588462005", "genre": "Science Fiction & Fantasy", "title": "Dharma Book: Thousand Whispers", "description": "We live among the breathing masses, learning from our many lives like the centipede learns from its steps. Each brings us closer to the Hundred Clouds, and each is forgotten when it is over. We are an enigma, but also an answer. We are all things and nothing. Can you be one of us?Dharma Book: Thousand Whispers is the latest Dharma Book for Kindred of the East. It is a complete guide to playing the enigmatic chameleons of the Middle Kingdom. The secrets of the Broken Mask Technique, in which a vampire lives mortal lives, await within, along with many new rites and powers, prominent characters and new facts about the Asian World of Darkness."}]