[{"id": "0836822994", "genre": "Children's Books", "title": "The Prince and the Pooch (Adventures of Wishbone)", "description": "When Joe gets a chance to prove himself as coach and discovers that it is not as easy as it seems, Wishbone is reminded of the tale in which a poor boy trades places with the crown prince of England, each one believing that the other has the easier life."}, {"id": "1426304714", "genre": "Children's Books", "title": "National Geographic Countries of the World: Guatemala", "description": "\"Learn about Guatemala’s brutal history of dictatorship and guerilla warfare. Discover the proud Mayan heritage of this beautiful land. Dare to peer into some of the highest and most active volcanoes in Latin America. Explore a land of impenetrable jungles, colorful coral reefs, and spectacular flora and fauna.\"National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "B0718XC93K", "genre": "Children's Books", "title": "Ann Riley: The Irish Girl (First Children of Farmington)", "description": "How can Ann find a grandfather who’s just right?With so many aunts and uncles, why doesn’t Ann Riley have a grandfather? Her friend, Katie Murphy, has a special grandfather who tells stories and remembers all the things he did at home in Ireland. When Katie’s little sister tells Ann that everyone has to have a grandfather, Ann decides to find one of her own. She asks all her neighbors to be her grandfather. But Green Leaf’s grandfather doesn’t speak the same language, the miller is too busy, the store owner too important, the cooper too fussy, the bagpipe player too loud, and Father Rehrl away too much. Who can be Ann’s grandfather?"}, {"id": "0618154264", "genre": "Children's Books", "title": "Greek Myths", "description": "From the terror of Medusa and the Minotaur to the Labors of Heracles and journeys of Theseus, the stories in this collection have thrilled and enthralled people for centuries with their high drama, hazardous quests, and unforgettable characters (both mortal and immortal). Under Olivia Coolidge&#8217;s skillful pen, the landscape of early Greece and its famous legends bloom with vigor and are perfectly suited to the adventure-seeking reader. "}, {"id": "1614794952", "genre": "Children's Books", "title": "Ghostbusters 3: Haunted America", "description": "While watching Egon squabble with an extra-terrestrial obsessed FBI agent, the Ghostbusters come face-to-face with some aliens! Or… ghosts? Or are they both? In Roswell, New Mexico, it could be either option and the Ghostbusters are determined to figure that out."}]