[{"id": "150814902X", "genre": "Children's Books", "title": "Ancient Maya Daily Life (Spotlight on the Maya, Aztec, and Inca Civilizations)", "description": "What was life like in the days of the ancient Maya civilization? Where did people live and what did they do each day? These questions and more are answered in this fact-filled book about the daily life of the ancient Maya. Engaging text and primary sources shed light on the many mysteries of the Maya people. Color photographs of existing architecture and artifacts, as well as artwork, will transport readers back to the days when the Maya civilization was thriving. This exciting book is rich with information about Maya culture, and it’s sure to stoke readers’ imaginations while giving them a deep understanding of the history of this ancient civilization."}, {"id": "1894384946", "genre": "Children's Books", "title": "Grizzly's Home: and Other Northwest Coast Children's Stories", "description": "In this latest collection of easy-to-read fables, Robert James Challenger continues to teach children practical moral lessons about life in today's complicated world. Owl shows Grandson that a problem will only go away when each person involved becomes part of the solution. Little Mallard Duck finds out the hard way that things change over time, and even when we think we are not ready, it may be time to move on. Steelhead Trout learns that instead of swimming away from those who are different, it is much better to respect their points of view and help them to understand our own."}, {"id": "B009F72J9Y", "genre": "Children's Books", "title": "Common Ground: The Water, Earth, and Air We Share", "description": "A simple story of our planet's natural resources with jewel-like paintings by Caldecott Honor author Molly Bang. Through the example of a shared village green and the growing needs of the townspeople who share it, Molly Bang presents the challenge of handling our planet's natural resources. Full color picture book."}, {"id": "0316406872", "genre": "Children's Books", "title": "The Land of Stories: Beyond the Kingdoms", "description": "Fairy tales are just the beginning.The Masked Man is on the loose in the Land of Stories, and it's up to Alex and Conner Bailey to stop him... except Alex has been thrown off the Fairy Council, and no one will believe they're in danger.With only the help of the ragtag group of Goldilocks, Jack, Red Riding Hood, and Mother Goose and her gander, Lester, the Bailey twins discover the Masked Man's secret scheme: He possesses a powerful magic potion that turns every book it touches into a portal, and he is recruiting an army of literature's greatest villains!So begins a race through the magical Land of Oz, the fantastical world of Neverland, the madness of Wonderland, and beyond. Can Alex and Conner catch up to the Masked Man, or will they be one step behind until it's too late?Fairy tales and classic stories collide in the fourth adventure in the #1 New York Times bestselling Land of Stories series as the twins travel beyond the kingdoms--now in paperback!"}, {"id": "0756607094", "genre": "Children's Books", "title": "DK Eyewitness Books: Music", "description": "A close-up look at the world of music discusses the history of music and the development of the diverse types of wind, percussion, brass, string, and electronic instruments--from early panpipes to high-tech synthesizers."}]