[{"id": "0984906908", "genre": "Science Fiction & Fantasy", "title": "Close Your Eyes -- Tales from the Blinkspace", "description": "\"Close Your Eyes -- Tales from the Blinkspace\" features 55 new stories from the online blog Welcome to the Blinkspace. It's a great new work of fantasy/horror fiction from independent publisher, Hellbender Media. Edward Martin III dips into Lovecraftian Mythos and makes it his own in stories that take you to the treacherous edge of the ocean, across harsh desert sands, and well into the future. From the soft subtlety of \"True Love\" to the violent end of love in \"Scales\", this book is thought-provoking, intriguing, often humorous, and just plain fun to read."}, {"id": "1601259468", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Flip-Mat: Bigger Caverns", "description": "Whether you’re tracking a dragon into its lair or trying to escape from the underground prisons of an ancient evil, Pathfinder Flip-Mat: Bigger Caverns has you covered. Each side of the Flip-Mat features a massive underground cave complex. One side shows an underground river and jewel-encrusted chamber, while the other details the twisting passages leading out! Don’t waste your time sketching when you could be playing. With Pathfinder Flip-Mat: Bigger Caverns you’ll be ready next time your players want to venture into the lightless depths of the world!Bigger Flip Mats are 45% larger than normal Flip-Mats. Flip-Mat: Bigger Caverns is 27\" x 39\" unfolded, and 8\" x 10\" folded. Its coated surface can handle any dry erase, wet erase, or even permanent marker. Usable by experienced GMs and novices alike, Pathfinder Flip-Mats fit perfectly into any Game Master’s arsenal!On tabletops across the world, the Flip-Mat Revolution is changing the way players run their fantasy roleplaying games! Why take the time to sketch out ugly scenery on a smudgy plastic mat when dynamic encounters and easy cleanup is just a Flip away?Price Includes VAT"}, {"id": "0316379379", "genre": "Science Fiction & Fantasy", "title": "Into the Drowning Deep", "description": "New York Times bestselling author Mira Grant, author of the renowned Newsflesh series, returns with a novel that takes us to a new world of ancient mysteries and mythological dangers come to life.  The ocean is home to many myths, But some are deadly...Seven years ago the Atargatis set off on a voyage to the Mariana Trench to film a mockumentary bringing to life ancient sea creatures of legend. It was lost at sea with all hands. Some have called it a hoax; others have called it a tragedy. Now a new crew has been assembled. But this time they're not out to entertain. Some seek to validate their life's work. Some seek the greatest hunt of all. Some seek the truth. But for the ambitious young scientist Victoria Stewart this is a voyage to uncover the fate of the sister she lost. Whatever the truth may be, it will only be found below the waves. But the secrets of the deep come with a price. More from Mira GrantNewsfleshFeedDeadlineBlackoutFeedbackRise: A Newsflesh CollectionParasitologyParasiteSymbiontChimera"}, {"id": "B078CXWJBR", "genre": "Science Fiction & Fantasy", "title": "Joined In Battle: Wolfpack Book 4 (Wolfpack Books)", "description": "Every Hero Has Enemies...Captain Dean Blaze has seen the enemy.  His platoon has fought the Kroll, but his biggest threat isn’t among the stars, it’s found in the ranks of the Extra Solar Defense Force.  After saving a diplomatic mission from complete annihilation, Dean and his platoon return home, only to find trouble brewing among the people he is fighting to save.  With a predatory empire moving closer to human held space, an Admiral with an axe to grind, and internal politics threatening his career, Dean quickly realizes his problems are much larger than he ever expected.Joined In Battle is the fourth book in the exciting Wolfpack series by Toby Neighbors.  A sweeping Military Space Opera, Joined In Battle is full of action and adventure, with a heart pounding pace and characters you’ve come to know and love.  It continues the epic story that began in We Are The Wolf exploring a new kind of space marine and an exciting science fiction journey that spans multiple alien worlds.  Join Dean and his Off World Force Recon platoon on their grandest adventure yet."}, {"id": "1555602517", "genre": "Science Fiction & Fantasy", "title": "Invading Clans: A Battletech Sourcebook", "description": "INVADING CLANS describes the history, culture, and military capabilities of Clans Smoke Jaguar, Nova Cat, Ghost Bear, Steel Viper, and Diamond Shark. Also included is an overview of occupied worlds, deadly new BattleMechs, and eight full-color pages featuring renderings of Clan uniforms and ceremonies."}]