[{"id": "B014164Z0E", "genre": "Children's Books", "title": "Yetunde: The Life and Times of a Yoruba girl in London (1)", "description": "Yetunde is a series of stories that follows the every day life of 6 month old Yetunde as she's narrated African folktales by her mom Iya Yetunde whilst growing up in London. Iya Yetunde also tries to improve her Yoruba speaking ability, so we see a nice mish mash of Yoruba and English. The folktales are of West African origin. You can read this book for FREE with  Kindle Unlimited subscription Amazon Prime members can also read the book for FREE on kindle deviceThe book has been written in such a way that it can be enjoyed by both adults and children alike. Adults can read the book for their own enjoyment or as bedtime stories for kids ages 3-8 (even younger).  Older children can read the book by themselves as it is also a suitable kids books ages 9-12. Each story has a moral lesson with colourful illustrations for early readersYou can check the book trailer here https://www.youtube.com/watch?v=CCMv4wU5sHI"}, {"id": "0754816702", "genre": "Children's Books", "title": "The World Encyclopedia of Naval Aircraft: An illustrated history of shipborne fighters, bombers and helicopters, including the Sopwith Pup, B-25 ... Lynx, Sikorsky Sea King and many more.", "description": "Features a directory of over 120 aircraft with 500 identification photographs"}, {"id": "0613022874", "genre": "Children's Books", "title": "Mr. Putter & Tabby Row The Boat (Turtleback School & Library Binding Edition) (Mr. Putter and Tabby)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. On a hot summer day, Mr. Putter, his cat Tabby, their neighbor Mrs. Teaberry, and her dog Zeke go for a picnic and a rowboat ride."}, {"id": "1575131471", "genre": "Children's Books", "title": "Champion Rose (Magic Attic Club)", "description": "Following a disagreement with a friend, Rose visits the magic mirror in Ellie's attic and finds herself as the captain of the Wildcats soccer team"}, {"id": "0803737890", "genre": "Children's Books", "title": "Skippyjon Jones Snow What", "description": "The #1 New York Times bestselling Skippyjon Jones stars in his own playful fairy tale set in a winter snowscape!Mirror mirror on the wall, who is the bravest Chihuahua of them all? Skippyjon Jones, the Siamese cat who thinks he's a dog! While his sisters listen to Snow White and the Seven Dwarves, Skippy bounces on his big-boy bed and heads off for the REAL adventure awaiting him in his closet. Once inside, he finds himself in a magical snowy forest of make-believe, where the seven Chimichangos challenge him with his most dangerous task yet: to wake up Nieve Que, the frozen princess, by kissing her! Yuck! Will this hero agree to don a prince’s pantelones and save his poochitos?With rhymes, rollicking wordplay, and mucho fairy tale fun, this fuzzy tale is sure to end happily ever after."}]