[{"id": "B00AETCZBO", "genre": "Children's Books", "title": "The Passage (Guardians, #5)", "description": "Daniel has fallen into the realm of shadows. There he struggles to fight the evil seed taking root inside him. He makes a miraculous return after receiving an ancient remedy, given to him by the cherubs. The remedy cannot prevent the inevitability of his rebirth though, so he is forced to hasten his departure from the cherubs' haven. Now he must find the strength needed to retrieve the Stone of Destiny, a magical artifact crafted by the shape-shifters, and the only means through which he could ever hope to bring his brother back from a path of destruction. But the dragon riders are hot on his trail, and would stop at nothing to ensure that he doesn't get in the way of their plan."}, {"id": "0448462877", "genre": "Children's Books", "title": "What Was the March on Washington?", "description": "On August 28, 1963, more than 200,000 people gathered in Washington, DC, to demand equal rights for all races. It was there that Martin Luther King Jr. delivered his \"I Have a Dream\" speech, and it was this peaceful protest that spurred the momentous civil rights laws of the mid-1960s. With black-and-white artwork throughout and sixteen pages of photographs, the March is brought to life!"}, {"id": "1548938890", "genre": "Children's Books", "title": "Noah Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "1890651028", "genre": "Children's Books", "title": "365 Devotionals for Children", "description": "If you’re looking for a meaningful (and fun) present for a child, consider this book. 365 Devotionals for Children contains a short devotional for each day of the year. Every devotional has a date at the top, so you can begin at any time during the year, and use it for the next 365 days. Each devotional includes a short Bible story, an application, a scripture and a prayer. It’s no secret that it’s hard for families to have regular devotionals. This beautiful book will provide your family with time each day to learn more about the people of the Bible and God’s will for your precious children. The book is being used by children from pre-school to high school. Beautifully crafted, it can be handed down from generation to generation. It’s a gift that will provide memories and encouragement for your children now and as they share the devotionals with their children in years to come."}, {"id": "1444931253", "genre": "Children's Books", "title": "Wibbly Pig: Wibbly Pig's Silly Big Bear", "description": "From the creator of Kipper, this picture book shows that it is what's inside that matters.Wibbly Pig has a new friend - a bear so BIG, he can hardly fit on the page. He does not know how to brush his teeth or comb his hair and he can't even use a spoon. But Wibbly loves him just the same!A heart-warming story about loving friends for who they are from the award winning Mick Inkpen.'A simple story about love and friendship, happiness and loss.' Mail on Sunday"}]