[{"id": "1848585756", "genre": "Children's Books", "title": "Start a Blog! (Find Your Talent)", "description": "Explains the basics of how to create and run a blog, citing popular blogs, giving design ideas, suggesting host sites, and utilizing social networking tools."}, {"id": "006177314X", "genre": "Children's Books", "title": "Tiger Pups", "description": " This is the true story of Nasira, Anjika, and Sidani, three white Bengal tiger cubs whose mother stopped nursing them only fifteen hours after their birth. Luckily, two zookeepers, Tom and Allie Harvey, were keeping a close eye on them.   The Harveys paired the hungry cubs with their golden retriever, Isabella—who was still nursing her own puppy—to see if Isabella would feed and care for the baby tigers. The match was a success: Isabella immediately adopted the cubs as if they were her very own . . . Tiger Pups! This sensational story swept the country, and Isabella and the tiger pups have become the darlings of the media.   Captured in adorable, intimate, and exclusive images by Tom Harvey and National Geographic photographer Keith Philpott, here is the fascinating story of the cubs and how they make the transition from living in the house with the Harveys to their new den outdoors. At two months, the cubs are active, curious, and playful. They get into everything! Share in this remarkable and heartwarming story that marks a truce in the age-old battle between cats and dogs. "}, {"id": "B074KRJ8MB", "genre": "Children's Books", "title": "Adrift in New York (Annotated & Illustrated): Tom and Florence Braving the World", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors.\"Adrift in New York\" involves the disappearance of a son from the household of his wealthy father, John Linden. The boy has been kidnapped by the villainous Curtis Waring, John Linden's nephew, who hopes to inherit the family fortune. Grown up, the youngster lives a precarious life on the streets of New York. When Linden's ward Florence rejects the unwanted attentions of Waring, she is disinherited, forced to live in a tenement and work in a sweatshop . . . until it is discovered that the young man who befriends her is, in reality, Linden's long-lost son."}, {"id": "B00CKU95ZE", "genre": "Children's Books", "title": "Bella Sue and the Mother's Day Thank You (Holidays and Celebrations with Bella Sue Book 5)", "description": "18 Pages/IllustrationsBella Sue and her Dad have many surprises planned for her Mom on her special day. Homemade breakfast, jewelry, a card, a special walk, a cake and more!"}, {"id": "1599617137", "genre": "Children's Books", "title": "4: Star Wars: The Clone Wars: Slaves of the Republic: Auction of a Million Souls", "description": "Fearing that the entire population of the planet Kiros may have been forced into slavery, the team has traveled to the Zygerria system to attend the first slave auction in years. Anakin must work his charm on the Queen of Zygerria, while \"slave\" Ahsoka and \"slave traders\" Rex and Obi-Wan search for clues. Can our heroes pull off this incredible deception? Spotlight editions are printed on high-quality paper and with reinforced library bindings specifically printed for the library market. Grades 6-12."}]