[{"id": "1599209497", "genre": "Children's Books", "title": "Life in Ancient Egypt (Everyday History)", "description": "Introduces the everyday life of ancient Egyptians, describing their occupations, clothing, housing, food, music, religion, and belief in the afterlife."}, {"id": "0999515810", "genre": "Children's Books", "title": "Oy, Elephants!", "description": "There’s big fun to be had at Delray Retirement Village!Joel is a bit uncertain when he travels to visit his grandparents in Delray Beach, Florida. He is excited to see them, but afraid he might be bored at their quiet retirement village. Imagine his surprise when he meets his grandparents’ new neighbors—a pair of retired circus elephants who just moved in. They require lots of sunscreen, they’re too big for the furniture, and they turn the community pool into a water park!It looks like Joel might end up having an adventure, after all!"}, {"id": "B00Y1QS75O", "genre": "Children's Books", "title": "The Extraordinary Ordinary Life of Mark Rodriguez", "description": "Have you ever fallen in love? What would happen if you fell in love with God and He loved you back?On May 30, 2014, seventeen-year-old Mark Rodriguez was gunned down in an apparent random act of violence while driving home from his school's graduation. The story made national headlines when it was discovered that Mark had recently blogged that he could not wait to go to Heaven to be with God.Upon reading his private journals, Mark's parents witnessed an amazing, intimate love relationship between a boy and the Creator who made him. They also discovered Mark's premonition that he was going to die, as well as his determination to change the world, one life at a time.This book contains Mark Rodriguez's private journals. They are a window into the extraordinary inner world of a boy who chose to know God intimately, to love others recklessly, and was willing to die sacrificially."}, {"id": "B01MRM2ZFE", "genre": "Children's Books", "title": "Abigail Adams and the Women Who Shaped America (Social Studies Readers)", "description": "With the Abigail Adams and the Women Who Shaped America e-Book, students will take a look at the revolutionary women who have helped shape America during the war. This informational text profiles the life of Abigail Adams and the important message she had about women's rights after the colonies declared independence. Ignite a passion for past events as students delve deeper into historical events with primary source materials. Build literacy and subject content knowledge with this nonfiction reader that explores US history, geography, and other social studies topics. The Abigail Adams and the Women Who Shaped America e-Book provides access to every type of learner with appropriately leveled content. The reader contains text features such as captions, bold print, glossary, and index to increase understanding and build academic vocabulary. Aligned to McREL, WIDA/TESOL, NCSS/C3 Framework and other state standards, this text readies students for college and career readiness."}, {"id": "0689822588", "genre": "Children's Books", "title": "I Love You", "description": "Provides young children with a brightly illustrated Valentine's Day book with color-faceted foil designed to highlight different animals and objects with each turn of the page."}]