[{"id": "1575726335", "genre": "Children's Books", "title": "Golf (Top Sport)", "description": "Each title in this series provides a detailed introduction to a popular sport - in this case, golf - with an explanation of its history, its rules, and the skills it demands, accompanied by step-by-step illustrations. There is also coverage of equipment and preparatory exercises."}, {"id": "093921749X", "genre": "Children's Books", "title": "1-2-3 Draw Mythical Creatures", "description": "Freddie Levin spirits kids away to a world of fantastic beasts with sections covering Medieval Europe, the British Isles, Asia, the Middle East, and Greek and Roman Mythology. Starting with simple lines and shapes, young artists are shown step-by-step how to draw a variety of Mythical Creatures."}, {"id": "B00NI7GCD6", "genre": "Children's Books", "title": "The Kingdom of the Sun and Moon", "description": "The König is a tyrant. His subjects are starving. And all-out war is fast approaching. Will a pair of young, courageous brothers save their kingdom? When an emissary sent by the König himself stops by the remote mouse colony of Long Meadow, the peaceful life Sommer and Nesbit have shared is turned upside down-and the brothers are catapulted into separate death-defying adventures. Sommer, levelheaded and clever, is ordered to the palace to join the König's illustrious Eagle Guard as it prepares to face a full-scale invasion by the nefarious Emperor Wolfsmilch and his army of a hundred thousand forest mice. Meanwhile, the small but spirited Nesbit is banished to the Forest of Lost Life for insulting the König, and must dodge hungry predators at every turn. The brothers struggle to reunite and defy the oppressors who threaten everyone and everything they have ever known and loved. But time is quickly running out for both of them-and the fate of the kingdom hinges on one last, daring mission. Set against the magnificent backdrop of Schönbrunn Palace in Vienna, Austria, The Kingdom of the Sun and Moon is an action-packed adventure story for young readers and adults alike. Ages 10 and up"}, {"id": "0780790936", "genre": "Children's Books", "title": "Betsy and Tacy Go Downtown (Betsy-Tacy Books (Prebound))", "description": "Betsy, Tacy, and Tib are now old enough to do a lot of things...including going bobsledding and venturing into town on their own. They discover the joys of the public library, riding in a horseless carriage, and the theater. And as if it weren't enough to see a real play, they find themselves acting in one. They find a new friend, Mrs. Poppy, whose husband is the manager of the theater. Although Mrs. Poppy lives in a beautiful house with red carpets, gold chairs, and lace curtains, Betsy discovers that she is lonely just the same. But the three girls are going to make sure that changes."}, {"id": "1250090261", "genre": "Children's Books", "title": "Microsaurs: Tiny-Raptor Pack Attack", "description": "WATCH OUT FOR TINY DINOSAURS!!!Danny and Lin are expert secret keepers. They’re brave, smart, and maybe a little bit crazy. Which, as it turns out, is exactly what you need to be to take care of a rare collection of hungry, curious, extra-tiny dinosaurs. But when their friend Professor Penrod sends them a mysterious package filled with toothy, scratchy microsaurs hungry enough to chew through walls, along with a very large microsaur egg, even the bravest adventurers might find themselves outnumbered and in over their head.Honey, I Shrunk The Kids meets Jurassic Park in this fabulous illustrated chapter book series by Dustin Hansen."}]