[{"id": "0613572610", "genre": "Children's Books", "title": "A Perfect Place: Joshua's Oregon Trail Diary, Willamette Valley, Oregon, Book Two, 1848 (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Late in 1848, nine-year-old Joshua McCullough starts a second journal, this time recording events in Willamette Valley, Oregon Territory, as his family and others they met on the trail begin to get settled."}, {"id": "1614931348", "genre": "Children's Books", "title": "Portal to Florida's Past, an Archaeology Adventure", "description": "Portal to Florida's Past is an adventure story about archaeology and Florida's prehistoric people. Enter a portal to the past and take a journey back in time with Al the alligator and his animal friends. On this virtual field trip, you will be a time traveler, dig for artifacts and learn about native plants and animals. When you have completed the trip you will earn a Junior Archaeology Certificate.  KID TESTED, TEACHER APPROVED!  HISTORY - DIG IT!  www.amyaelder.com  www.oldetymeartsandcrafts.com"}, {"id": "1425858120", "genre": "Children's Books", "title": "Engineering Marvels: Bridges Around the World: Understanding Fractions (Mathematics Readers)", "description": "What would we do without bridges? They allow us to cross over great heights and dangerous waters that would be inaccessible without bridges. But some bridges are more than a link between two places. From New York to Singapore, the stories of these bridges celebrate the engineers, architects, and the workers who built them. Learn about the world's famous bridges while learning fractions. This nonfiction book combines math and literacy skills and uses everyday examples of problem solving to teach subject area content. The full-color images, math charts and diagrams, sidebars, and practice problems make learning math easy and fun. Text features include a table of contents, glossary, and index to increase understanding of math and reading concepts. An in-depth problem-solving section provides additional learning opportunities while challenging students' higher-order thinking skills."}, {"id": "0768415845", "genre": "Children's Books", "title": "God is Really Good", "description": "Start seeing God's goodness all around you!   In God is Really Good, discover that God’s goodness is all around us—we just need to learn how to see it!   Get ready to follow Sparrow and his friends as they go on a journey to learn just how good God really is.  The world can feel like a very big, scary place for kids sometimes and it can be easy to get wrapped up in its big problems – but, we can rest safely knowing that that even when things worry us, God takes care of everything and that He is always good.     Based on the teaching of Pastor Bill Johnson, God is Really Good features a fun new story written by Seth Dahl, Bethel Church's children's pastor, and illustrations by Lamont Hunt.  This inspiring story will help children learn to see the presence of God's goodness all around them and tell the difference between the good things that come from God and the bad things that do not. "}, {"id": "B00BJYA28Q", "genre": "Children's Books", "title": "Lifelines: Leonardo Da Vinci", "description": "At just twelve years old, Paulo becomes an apprentice to Leonardo da Vinci, the brilliant artist and inventor. Dull is not how Paulo describes life in Leonardo’s busy studio. There are floors to sweep, paints to mix, errands to run, and drawings to be made. But there are mysterious events, too. Another apprentice is not all that he seems, and an evening visit to a hospital uncovers some very interesting happenings… Paulo’s diary tells of an exciting moment in Renaissance Italy; it’s a young boy’s insight into a fascinating time and place and his glimpse into the mind of one of the world’s greatest geniuses, as well as a story told from the heart.  "}]