[{"id": "0689848463", "genre": "Children's Books", "title": "The First Thanksgiving of Low Leaf Worm", "description": "Lowly Worm travels back to 1620 to tell of the Pilgrims' first Thanksgiving at Plymouth with their Native American friends through a historical overview of how this special celebration first came to be, enhanced with fun lift-the-flap illustrations. Original."}, {"id": "1426330227", "genre": "Children's Books", "title": "National Geographic Kids Extreme Records", "description": "The biggest, wackiest, wildest, and weirdest of all the world record facts are jam-packed into this informative and superexciting fact book.From the awesome to the weird to the downright gross, get ready to meet the world's record setters! You'll find fantastic firsts, awesome extremes, and weird wonders in achievements made by animals, humans, and Mother Nature. Paired with eye-popping design and unforgettable photographs, this book blows the record-book competition away and takes first place as the zaniest, most eye-catching, unbelievable, and best of the best record books you can find!"}, {"id": "1580893724", "genre": "Children's Books", "title": "Whiskers, Tails & Wings: Animal Folktales from Mexico", "description": "Judy Goldman retells animal folktales from five indigenous groups in Mexico--the Tarahumara, Seri, Huichol, Triqui, and Tseltal. Each story is followed by information about the featured culture, enriching readers' understanding of the diverse peoples who make up Mexico.Fabricio VandenBroeck's lush art portrays the richness of the many peoples, animals, and places that make up Mexico.Includes a map of Mexico, showing the location of each indigenous group. Back matter includes a glossary and tale sources, as well as an index and a bibliography."}, {"id": "B01D7JPJDS", "genre": "Children's Books", "title": "To Be A Bee Like Me", "description": "A simple poem book about a bee and his daily life, filled with bright colors and cartoonist art. This book is suitable for young toddlers through kindergartners. This would be a great book for a bedtime story."}, {"id": "1421542366", "genre": "Children's Books", "title": "Thomas Edison: Genius of the Electric Age (Biographical Comic Series)", "description": "The lives of great figures in history are full of inspiring and moving episodes. Young people especially can learn from these stories, gaining hope, courage, and even hints on how to live their own lives. Children everywhere benefit from reading about the lives of heroic achievers, and indeed, these stories are an important part of their education and growth. Shogakukan Biographical Comics is a series of biographies of inspirational historical figures in an easy-to-read manga format. These books are as fun to read as any manga, but the stories they tell are based entirely on historical fact. Every volume includes a map and a historical timeline, rounding out a package that teaches even as it entertains. The creator of over 1,300 inventions that have shaped our modern world, Thomas Alva Edison was truly the “king of invention.” The movie projector, the phonograph, the storage battery, and the electric light bulb are just a few of the revolutionary devices Edison invented that have enriched our lives and even changed the course of civilization."}]