[{"id": "0766089770", "genre": "Children's Books", "title": "Living and Working in the Pre-Columbian Americas (Back in Time)", "description": "Everyone knows Europeans did not discover the Americas, despite what Christopher Columbus may have believed. People had been living there for thousands of years before the first Europeans landed on its shores. This title explores the ancient civilizations, including the Incas and Mayas, that peopled the North and South American continents long ago."}, {"id": "1857923529", "genre": "Children's Books", "title": "Too Many Toys (God's Little Guidebooks)", "description": "Sam and Katy have a lot of toys, but this does not make them really happy. Find out why and learn abut God's second commandment."}, {"id": "1434987841", "genre": "Children's Books", "title": "The Adventures of C. H. Mouse", "description": "The Adventures of C. H. Mouse is set, for the most part, in a rural area. C.H. is one of three children of Mr. and Mrs. Mouse. They get into trouble, as real children do, when they are young and curious.Grandfather Mouse comes to their rescue numerous times, sparing them from being hurt, from the big yellow cat to the owls in the woods. He imparts his wisdom on the Mouse children and tells them about the world outside their surroundings.Located at the end of the story are pages for the reader to create their own drawings to illustrate the book, making it personal for each individual child who reads it."}, {"id": "0778735133", "genre": "Children's Books", "title": "Your Brain: Understanding Your Body’s Control Center (Exploring the Brain)", "description": "This comprehensive title examines the structures and functions of the brain. Accessible text and supportive design elements introduce different parts of the brain and explain their key functions. Readers will also discover how the brain interprets and responds to messages received from different sensory receptors. Hands-on investigations help reinforce and extend core concepts. This title supports NGSS Structure, Function, and Information Processing - 4-LS1-1; MS-LS1-8."}, {"id": "B007TXDZSU", "genre": "Children's Books", "title": "#2 The Not-So-Perfect Planet (Way-Too-Real Aliens)", "description": "Josh Higgins has an alien gizmo that lets him think his way to other planets—and he does NOT want to use it. But his sister Maggie won't stop bugging him, so he agrees to an off-world vacation. Josh dreams up a planet full of blue oceans, white beaches, and sunny weather. And he prepares for everything...well, almost. A parade of cranky creatures soon spoils Josh and Maggie's perfect getaway—including a one-horned beast, a sharp-toothed sea princess, and a two-tailed monkey. The planet's locals just can't get along, and Josh and Maggie find themselves caught up in the squabbling. As the Earth kids rush from one danger to another, will they discover a way to keep the peace? Or will Josh and Maggie become prisoners of the not-so-perfect planet?"}]