[{"id": "0547318367", "genre": "Children's Books", "title": "Civics in Practice: Student Edition 2011", "description": "Book is in very very good condition! . Crisp pages and spine. Cover has .05/10 on wear. Otherwise it would be listed LIKE NEW"}, {"id": "B00DSS4PIE", "genre": "Children's Books", "title": "The Accidental Wonder Pig: A Lamby Lambpants Adventure (Lamby Lambpants & Friends Book 2)", "description": "Age Range: 6-8 | Series: Lamby Lambpants and FriendsLamby's SECOND Exciting Magical Playroom Adventure! It's Super Hero Day. Jonesy the Chinese puppy dragon and Lamby Lambpants both have hero names and costumes for a fun, imagination-filled day with babysitter Katie Beagle. Even she has a pair of snazzy hero goggles (to hide her true identity, of course). Lamby's best friend Snout has a cape and mask too, but he doesn't have a hero name yet. Having been very recently brought to life, the anxious toy pig doesn't feel super at all. He's still shy and quite embarrassed about his missing ear and broken tail. But after a wild ride on an out-of-control toy helicopter, Snout discovers there's more to him than he ever thought. This beautifully illustrated, fun-to-read out loud picture book is for early readers."}, {"id": "1510736174", "genre": "Children's Books", "title": "Dad Can Do Anything", "description": "It’s not easy being small. Especially not for Little Elephant who isn’t tall enough to reach things, like the hook to hang a coat, a shelf to get toys, or the pedals of a bike. Kitchen counters, the shower, and a light switch are all too high. But with dad close by anything is possible and nothing is out of reach."}, {"id": "1974319563", "genre": "Children's Books", "title": "Best Coach Ever: Soccer Coach Gifts (Soccer Notebook Journal)(Soccer Books For Kids)(V3)", "description": "The Best Gift Ever For Soccer CoachesDo you have that special Soccer coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your Soccer coach will appreciate the thoughtful gift and use it for seasons to come.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any Soccer player’s tastes. Great Soccer books for kids to give as gifts.Grab your Soccer notebook journal today. "}, {"id": "0778774902", "genre": "Children's Books", "title": "Top 10 Slowest (Crabtree Contact)", "description": "Discover fascinating facts and figures about the slowest things in the world! From the sleepy-seeming sloth to incredibly sluggish cars, find out what creeps into the slowest top ten ever."}]