[{"id": "B00DESJG4G", "genre": "Science Fiction & Fantasy", "title": "The Descent to Madness (The Graeme Stone Saga Book 1)", "description": "Across the cosmos, on a world with no name, the battle between good and evil rages, the fate of all sentient life in the universe hanging in the balance.On Earth, Graeme Stone, ordinary man with a humdrum, downtrodden life, finds himself beset by a run of bad luck and maddening visions that drive him to the edge. But when he makes the snap decision to end it all, he finds himself not dead... but elsewhere.Dragged by dark powers to that far-flung world of magic, monsters and barbarian slavers, Stone, his memories of his former life all but wiped from his mind, finds himself caught up in a cosmic tug of war. His body grows stronger, larger, new powers beginning to manifest with every passing day. Friends and foes alike seek to use his new power for their own gain.For it turns out he's no ordinary man at all, but a freak of nature, with the potential within him for ultimate power; be that for good or for ill.As the extent of the evil powers that threaten the very universe, including his homeworld the Earth, become apparent, Stone must decide whether to use his powers to fight for what is right... or to join the enemy and reap the Earthly rewards once denied him."}, {"id": "0394748468", "genre": "Science Fiction & Fantasy", "title": "The Norse Myths (The Pantheon Fairy Tale and Folklore Library)", "description": "Here are thirty-two classic myths that bring the Viking world vividly to life. The mythic legacy of the Scandinavians includes a cycle of stories filled with magnificent images from pre-Christian Europe. Gods, humans, and monstrous beasts engage in prodigious drinking bouts, contests of strength, greedy schemes for gold, and lusty encounters. The Norse pantheon includes Odin, the wisest and most fearsome of the gods; Thor, the thundering powerhouse; and the exquisite, magic-wielding Freyja. Their loves, wars, and adventures take us through worlds both mortal and divine, culminating in a blazing doomsday for gods and humans alike. These stories bear witness to the courage, passion, and boundless spirit that were hallmarks of the Norse world.Part of the Pantheon Fairy Tale and Folklore Library"}, {"id": "B074FDN6RX", "genre": "Science Fiction & Fantasy", "title": "The Robots of Gotham", "description": "A thrilling adventure in a world one step away from total subjugation by machinesAfter long years of war, the United States has sued for peace, yielding to a brutal coalition of nations ruled by fascist machines. One quarter of the country is under foreign occupation. Manhattan has been annexed by a weird robot monarchy, and in Tennessee, a permanent peace is being delicately negotiated between the battered remnants of the U.S. government and an envoy of implacable machines.       Canadian businessman Barry Simcoe arrives in occupied Chicago days before his hotel is attacked by a rogue war machine. In the aftermath, he meets a dedicated Russian medic with the occupying army, and 19 Black Winter, a badly damaged robot. Together they stumble on a machine conspiracy to unleash a horrific plague—and learn that the fabled American resistance is not as extinct as everyone believes. Simcoe races against time to prevent the extermination of all life on the continent . . . and uncover a secret that America’s machine conquerors are desperate to keep hidden."}, {"id": "1500168386", "genre": "Science Fiction & Fantasy", "title": "1: The Trials of Hercules: Book One of The Osteria Chronicles (Volume 1)", "description": "Myths and heroes may be reborn, but the whims of the gods never change.In a world where mortals contend with the gods' vengeful jealousy, one man must ask himself if he will risk his life to protect the goddess who has done everything to ruin him.Perfect for fans of mythology and historical fantasy fiction by S.J.A Turney, Glyn Iliffe, Christian Cameron, and Madeline Miller, The Trials of Hercules is a page-turning tale of revenge and valor, loyalty and betrayal. After waking to a heinous crime he doesn't remember committing, Herc Dion faces two options: death by live burial or atone for his crime through a series of trials. Trials that will force him to face vicious creatures, test his loyalties, and send him into the depths of Hades. Filled with an unshakable sense of honor, Herc readily accepts the risks. Adding to these challenges, Herc unknowingly endures the brutal cruelty of Hera. The goddess's blinding hatred of Herc has led to the near ruin of her realm and to her ignorance of plans that could spell the end of her existence.When he learns that Hera has done everything to destroy his life, will Herc face death itself to save her? The Trials of Hercules is the first installment of the Osteria Chronicles, an irresistible historical fantasy series in which Greek myths, gods, and heroes come to life as they never have before."}, {"id": "1601452756", "genre": "Science Fiction & Fantasy", "title": "GALOOT", "description": "On a Galactic Service training exercise, Dipperson Kiddwell, Cougar Leader, inadvertently rockets the man-made comet entombing science's perfect doomsday machine, the GALOOT. Freed, the mutable monster superlights off to wreak havoc on the quadrant. Kiddwell's job? Locate, engage, destroy!"}]