[{"id": "B00WRO3Q58", "genre": "Children's Books", "title": "The Story of Shavuot (The Jewish Holidays)", "description": "This colorfully illustrated story is one of a series of rhyming stories about the Jewish holidays. It brings to life the history of Shavuot, creating an educational, engaging and fun read for children and adults alike. The story relates the tale of Moses receiving the ten commandments, and describes some of the traditional customs practiced on Shavuot."}, {"id": "014230011X", "genre": "Children's Books", "title": "Two Cool Coyotes", "description": "\"The playful protagonist of Way Out West Lives a Coyote Named Frank returns, this time to find a new friend when an old one departs.\"--BooklistFrank’s best friend, Angelina, is one of a kind. Angelina is smart and brave and she can howl at the moon even louder than Frank can. But one day Angelina tells Frank that her family is moving far away. With his best friend gone, Frank finds that tickling tarantulas and counting cloud bunnies just aren’t the same. Then Larry and his family move in next door. Larry is different from Angelina, but Frank soon finds that he’s special in his own way.  \"A good book to share with one or two children on a lap. All in all, a well-done title with lots of personality.\"--School Library Journal“Plenty of giggle-inducing visual jokes.”—Booklist"}, {"id": "B003L77WV4", "genre": "Children's Books", "title": "Harry S. Truman: Thirty-Third President of the United States (Childhood of Famous Americans)", "description": "One of the most popular series ever published for young Americans, these classics have been praised alike by parents, teachers, and librarians. With these lively, inspiring, fictionalized biographies -- easily read by children of eight and up -- today's youngster is swept right into history."}, {"id": "0606152830", "genre": "Children's Books", "title": "Hippo & Rabbit In Three Short Tales (Turtleback School & Library Binding Edition) (Scholastic Reader, Level 1)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Friends Hippo and Rabbit spend the day together having breakfast, playing on the swings, and waiting for a thunderstorm to end."}, {"id": "1406305928", "genre": "Children's Books", "title": "Encyclopedia Prehistorica: Mega-beasts", "description": "This third and final volume of the bestselling \"Encyclopedia Prehistorica\" series tackles the furry titans of the ancient world. Fearsome sabre-toothed cats, bears taller than basketball hoops and everyone's favourite Ice Age giant, the woolly mammoth, come to life through 35 astounding pop-ups. Full of captivating facts, this is the ultimate book for monster-lovers to tear into!"}]