[{"id": "1584236523", "genre": "Children's Books", "title": "The Origins of Bunny Kitty: A Tale for All Ages", "description": "Enter the magical world of Bunny Kitty. The first book in a brand new kids series, The Origins of Bunny Kitty begins the adventures of Daisy the cat, also known as Bunny Kitty. Accidentally left behind when her family moves from the country to the big city, Daisy is taken in by an adoptive family of rabbits whose mother lovingly sews her a bunny suit so that she can feel more at home but sadly, Daisy still misses her mother and brothers. When she meets a bunny fairy that recognizes her courage and independence, she is given a spell that transforms her into the magical Bunny Kitty, and Daisy sets off in search of her lost family. Charmingly told with wonderfully vibrant illustrations, this is a sweet tale of how sometimes everyone needs a little help."}, {"id": "0340525193", "genre": "Children's Books", "title": "Understanding Forces (Science Scene)", "description": "This text looks at forces in the world around us and considers how and why they change things. The first section is divided into double-page spreads to introduce important concepts. The second part consists of longer, more varied activities."}, {"id": "B00CDB8L00", "genre": "Children's Books", "title": "10 Fun Fairy Tales (A Collection of Original Fairy Tales)", "description": "An outstanding collection of fun and entertaining fairy tales. Over 60 full-color photos and illustrations help tell these lesson teaching stories. These are all original tales, sure to inspire you, your children and your grandchildren, as all true fairy tales should. The titles included in this volume are:Imagine That!The Spoiled PrinceOut Foxed!The Magic CoinsThe Trouble with TrollsThe Shy KnightThe Last American DragonThe Princess with Two MothersA Brother's WishThe Patient Princess"}, {"id": "161655598X", "genre": "Children's Books", "title": "Emily and the Strangers Volume 2: Breaking the Record", "description": "Emily--and her new band, the Strangers--won the battle of the bands and received a record contract with Awesomely Awesome Records, but can the girl who just figured out how to get along with her friends manage dealing with a major corporation? And what's the deal with the legions of stray cats around town?Emily the Strange creator Rob Reger reteams with cowriter Mariah Huehner (True Blood, Angel) and artist Cat Farris (Angry Birds) for a brand-new, full-color Emily the Strange story full of evil record companies, stray cat struts, science, and music!"}, {"id": "0773733183", "genre": "Children's Books", "title": "The Happy Prince", "description": "\"Swallow, Swallow, little Swallow,\" said the Prince, \"will you not stay with me one night longer?\" \"It is winter,\" answered the swallow, \"and the chill snow will soon be here. In Egypt the sun is warm\" From his high vantage point, the glittering statue of the Happy Prince is the pride of city officials. But the Prince’s sapphire eyes are filled with tears because of the suffering he sees below. Stuck fast on his pedestal, there is nothing the gem-encrusted statue can do to help relieve the poor, until a little swallow stops to rest at his feet. The Prince persuades the bird to be his messenger, and to pluck out and carry one precious jewel after another to those in need. In order to survive the winter, the swallow must fly to a warmer place, but his love for the now-shabby Prince compels him to stay despite the consequences. Time after time, the brave little bird does all that is asked, until both he and the Happy Prince have nothing left to give. Oscar Wilde’s classic fairy tale of compassion and selflessness is given new life by Robin Muller’s exquisite illustrations in this special edition."}]