[{"id": "1547112603", "genre": "Children's Books", "title": "Happy Birthday 9: Birthday Books For Boys, Birthday Journal Notebook For 9 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1558851836", "genre": "Children's Books", "title": "Caldo, Caldo, Caldo/Sip, Slurp, Soup, Soup (English and Spanish Edition)", "description": "A bilingual picture book offers up a celebration of a kitchen where mom has just pulled out the large stew pot to begin a fabulous vegetable soup and all the kids are invited to help."}, {"id": "B073K15SD2", "genre": "Children's Books", "title": "Adorable Animal Friendships (Stranger Than Fiction)", "description": "Adorable Animal Friendships checks out the sweetest animals friendships in the world--too strange to be made up! The book is written with a high interest level to appeal to a more mature audience with a lower level of complexity for struggling readers. Clear visuals and colorful photographs help with comprehension. Fascinating information and wild facts that will hold the readers' interest are conveyed in considerate text for older readers, allowing for successful mastery of content. A table of contents, glossary, and index all enhance comprehension and vocabulary."}, {"id": "B077WZYY18", "genre": "Children's Books", "title": "Roughing It: (Illustrated)", "description": "\"JBS Classics specializes in selling JUST BEST SELLERS (JBS).'Roughing It' by Mark Twain Kindle Formatting details:'Roughing It' by Mark Twain 100% perfectly on ALL devices (including Kindle, Android, iBook, Cloud Readers etc.).Book formatting details:1) Active Table of Contents.Footnotes & Endnotes.2) Word Wise – Enabled.3) Illustrations & Tables (if any) are available with ZOOM feature on double-click.“Roughing It” by 'Mark Twain' Book DescriptionThough known throughout the world for his fictional novels The Adventures of Tom Sawyer and Adventures of Huckleberry Finn, Mark Twain was also a skilled chronicler of his own life and experiences. In his youth, Twain traveled extensively throughout the untamed American West with his brother, working his way from town to town in a variety of jobs, including gold prospector, reporter, and lecturer. Roughing It is Twain's personal recollection of his wanderlust years. It is a wildly humorous adventure yarn that combines hard facts with a healthy dose of the author's unique perspective, one that helped define the course of American literature.\""}, {"id": "140480188X", "genre": "Children's Books", "title": "Martin Luther King, Jr.: Preacher, Freedom Fighter, Peacemaker (Biographies)", "description": "A brief biography that highlights some important events in the life of the man who won a Nobel Peace Prize for his nonviolent support of civil rights."}]