[{"id": "031234743X", "genre": "Science Fiction & Fantasy", "title": "Exploring Philip Pullman's His Dark Materials: An Unauthorized Adventure Through The Golden Compass, The Subtle Knife, and The Amber Spyglass", "description": "His Dark Materials is one of the most popular, award-winning fantasies of all time, a bestselling trilogy hailed as \"a modern classic\" by The New York Times.  Now, for the first time ever, Lois H. Gresh helps young readers examine Pullman's intricate universe with Exploring His Dark Materials, the ultimate companion guide. Gresh's fun, interactive book explores the complex science, religion, and fantastic elements of His Dark Materials in a way that's both informative and fun for younger readers.  Exploring His Dark Materials is filled with sidebars, history, facts and an in-depth analysis of the books, answering questions like:*What are daemons?*Why is dust important to the series?* Is Dark Material real and how does it relate to our universe?* What are the origins of ghosts and shapeshifters?*And much more! Exploring His Dark Materials is a thrilling and essential guide for young adults to help them explore this fantastic and challenging fantasy world."}, {"id": "B074DXY2C7", "genre": "Science Fiction & Fantasy", "title": "Cloak Games: Hammer Break", "description": "Nadia Moran is in serious trouble.Bad enough that Lord Morvilind is forcing her to work with the Rebels. Even worse that the murderous Rebels want her dead.But this time, the Rebels want her to rob a bank.Specifically, the Royal Bank itself, the best-defended building in North America. And unless Nadia uses all her magic and all her cleverness, she’s going to take the fall for the heist of the century…"}, {"id": "0987736310", "genre": "Science Fiction & Fantasy", "title": "2012 Rabbits and the Happy Apocalypse on Shortwave Radio: A Pleasant End of the World Novel", "description": "Finally. It's the apocalypse. The old world is over. You wake up and now it's just you or just about you. Turns out, Stanley Brown has a problem. It's the end of the world and he doesn't have a date for Saturday night.     A cataclysm of world events pushes Stanley out of his used book store into a lonely poisoned planet with only the buzz of shortwave radios and dogs for company. As the apocalypse approaches, Stanley seeks out the rest of the world to discover the year of the rabbit.     Angry tirades, polemics and prescient conspiracy speculation fuel the novel. In the aftermath of the apocalypse, Stanley relocates to a century farm house. Enduring years of solitude and reflection, Stanley seeks human company. Shortwave radio, weather and dogs form part of Stanley's path in an amusing, hostile, literary, tirade of a demented hare raising tale.     Using 2012 as a pretext for liberation, light hearted, heavy handed, here is my own never ending, take on tomorrow. ________________ Roy Berger lives in the legendary artist's colony of Ottawa, Ontario  where the palm trees bloom in the winter and a cool breeze blows in the summer."}, {"id": "B00II956LI", "genre": "Science Fiction & Fantasy", "title": "The Antithesis: Renovatio", "description": "            THE ANTITHESIS 1 (OF 5)Heaven, Hell, genetic engineering, particle physics and bloodshed. Civil war between demons and angels lies just on the horizon.Alezair Czynri, member of the Purgatorial Jury, is thrown into a world of murder, exploitation, chemical substances, betrayal and bureaucratic red tape as he and his court attempt to diffuse escalating conflicts.Yet things are not as they seem. Ever since his induction into the Celestial Court, Alezair has been treated with cool indifference by the Justice Commander, Leid Koseling. A former prisoner of the Nexus Initiative, Justice Czynri exists without any memories of his former life, the consequence of being a slave merc for hire.But Purgatory is strangely familiar, and slowly little pieces start coming back. There might be a good reason why Alezair's boss keeps him at arm's length."}, {"id": "1521797951", "genre": "Science Fiction & Fantasy", "title": "2207: A Legend Of Rebirth", "description": "In the midst of a rising greater than human intelligence, the son of a man to survive the fall of men has a chance to cement his father's legacy. From between the technological abundance of a new age, and the forsaken savage remnants of humanity's past, the preservation of one's heritage is the only way forward. To unveil the sky and start a new trend for the future, he must serve as an example some may never even recognize. In the interplay of consciousness and reality he shapes his fate, a subject of time within his own mind."}]