[{"id": "0141366524", "genre": "Children's Books", "title": "It's Your World: Get Informed, Get Inspired & Get Going!", "description": "In It's Your World: Get Informed, Get Inspired & Get Going, Chelsea Clinton tackles some of the biggest challenges facing our world today, especially for kids. Using data, charts and stories she unpacks challenges related to Poverty, Climate Change, Gender Equality, Health, Endangered Species and more. She also talks about what's being done to make a difference in each area, particularly by kids and teenagers. With lots of suggestions and ideas for action, Chelsea Clinton shares her passion for helping others and shows readers that the world belongs to every single one of us, and every one of us counts. The book will have three main thrusts: Informing young readers using facts and research; Inspiring them with stories of hope and empowerment; and; Suggesting practical ways that young readers can make a difference in their own communities and in the larger world. Filled with visuals including charts, graphs and photographs, this book has the potential to influence an entire generation's activism and involvement in local and global issues."}, {"id": "1499801742", "genre": "Children's Books", "title": "Love You Too", "description": "A sweet, interactive picture book about a father and daughter's fun day!When I say I love, you say you! I love                 you! I love                 you! When I say love you, you say too! Love you                 too! Love you                 too! It’s another bright morning, and there’s a whole day of fun activities ahead! Over the course of a day, a father and his little piglet wake up, get dressed, eat pancakes with syrup, ride bicycles, go on the swings, eat lunch, play hide-and-seek, take a bath, and then get ready for bed, eager for the next day to come. This rhythmic call-and-response picture book is an entertaining and interactive reading experience perfect for children who like hands-on books. Kids will love reciting the text when prompted with \"When I say pancakes, you say more. . . . When I say syrup, you say pour. . . . When I say swing me, you say high. . . . When I say to the, you say sky,\" and more!"}, {"id": "1979762864", "genre": "Children's Books", "title": "Adventures for Kids: The Coolest Diaries and Stories for Children to Enjoy (Kids’ Adventure Stories 4 in 1)", "description": "A bundle of 10 adventures for kids  How about a cool story? Or wait, how about 10 in 1 book? Sounds better, doesn’t it? In this epic collection, you’ll read about wolves in the cold winter, horses, cows, and other farm animals; you’ll read about political friction between the poor and the rich, knights who can’t stand each other, silly witches looking for a potion, necromancers and zombies, secret mysteries and organizations, time travelers and entrepreneurs. A story for each night? Sounds like a plan. Happy reading!"}, {"id": "1429619627", "genre": "Children's Books", "title": "Muay Thai (Martial Arts)", "description": "Fitness, mental discipline, and confidence are all required to excel in martial arts. Learn all about the origin of each technique and the skills involved in mastering it."}, {"id": "B06ZYK2Z5G", "genre": "Children's Books", "title": "100% JESUS: Healthy decisions. Beyond the body", "description": "Healthy decisions is a work regarding the unconscious damage we, human beings, make when straying from a healthy life and how we can take advantage of the God's recommendations to reach well-being. From a cruise to a triathlon in Hawaii Luis Dávila invites us to reflect on our physical, social and mental health. Monique, Alexander and Anna hold on to their beliefs in scenarios where the circumstances influence their way of thinking. Sexuality, nourishment, patience, friendship, exercise, humility and prosperity are the ingredients that will accompany the reader towards a new life with Jesus Christ."}]