[{"id": "154329412X", "genre": "Children's Books", "title": "1: The Magical Adventures of Lilly The Great Dane: Adventure One: Paris France", "description": "This whimsical children's book series is inspired by a real Harlequin Great Dane named Lilly, who currently lives on Kauai. Join Lilly as she joyfully explores the magical city of Paris, encountering a rare purple Poodle, then making friends with a beautiful black Poodle almost as big as her, while visiting the French countryside. Follow Lilly as she travels around the world on Magical Adventures!"}, {"id": "1928034152", "genre": "Children's Books", "title": "Attack My Anxiety!", "description": "Anxiety can be a complex issue to understand and to approach. Through beautiful illustrations, a charming storyline and a straightforward approach, Attack My Anxiety! engages children and empowers them to use techniques to identify and tackle feelings of anxiety.  This compelling book offers practical strategies for parents and guardians. It is also an excellent tool and resource for both teachers and counsellors who wish to teach their students vital skills, behaviours and a mindset that can be used to cope with challenges in the real world.  Attack my Anxiety! is the perfect balance of learning, laughing, and leaving with strategies for life."}, {"id": "077873174X", "genre": "Children's Books", "title": "Slap shot Hockey (Sports Starters)", "description": "Looks at the sport of ice hockey, and including information about the rink that it is played on, the moves that players use, the different player positions, and the rules of the game."}, {"id": "1474820123", "genre": "Children's Books", "title": "Disney Princess Sticker Scenes", "description": "Relive the magic and complete scenes from your favorite Disney Princess movies! Help Rapunzel achieve her dream of seeing the floating lights, awaken Sleeping Beauty with true loves first kiss, and help Cinderella get ready for the ball using your beautiful stickers."}, {"id": "0756978394", "genre": "Children's Books", "title": "Beck and the Great Berry Battle (Disney Fairies (Random House))", "description": "The wonderful, magical world of Disney Fairies, recently launched with Fairy Dust and the Quest for the Egg by Newbery Honor author Gail Carson Levine, is expanded with these new chapter books, each featuring full-color art by Judith H. Clarke and fairy-dust glitter on the covers."}]