[{"id": "0967395828", "genre": "Children's Books", "title": "More Reptiles Up Close", "description": "A new children's book about the incredible world of reptiles. This book contains original up close photography, scientific information, and large doses of humor. The author, David M Nieves, is a professional herpetologist and took the 95 full color photographs himself. Some of the reptiles included are Komodo Dragons, Chameleons, Cobras, Tree Skinks, Alligators, Tuataras, and Anacondas. This title is the follow up to \"Reptiles Up Close\"."}, {"id": "1593018509", "genre": "Children's Books", "title": "Praying Mantis (Readings)", "description": "This nonfiction book about the praying Mantis has been leveled at the GG 100 Book Challenge Reading Level. This readable, photographically illustrated book is engaging and educational for the beginner reader."}, {"id": "1418421766", "genre": "Children's Books", "title": "Andrew The Tadpole Becomes A Frog", "description": "Andrew the tadpole becomes a frog is about a tadpole named Andrew who lives in the pond in Mr. Cobb's meadow. He loves living in the pone and does not like change. When he learns he is becoming a frog he is very upset. Andrew is a type of tadpole that takes eight months to become a frog. This story will teach children how tadpoles becomes frogs. It will teach that change comes to everyone, and that change although scary can be a good thing. Andrew's friend Donald helps him through the change and helps him adjust. So this story also teaches about the value of friendship. This is a story you and your child will enjoy sharing for generations."}, {"id": "1404219242", "genre": "Children's Books", "title": "America Debates United States Policy on Immigration", "description": "Presents the issues at stake in the current U.S. immigration policy, discussing what immigration is; different perspectives on the economic, social services, and security aspects of immigration; and the future of the debate."}, {"id": "0807567442", "genre": "Children's Books", "title": "Rooting for Rafael Rosales", "description": "Rafael has dreams to someday play Major League Baseball. Maya has worries, especially about the bees that are dying all over the world. Follow Rafael and Maya in a story that shifts back and forth in time and place, from Minnesota to the Dominican Republic. In their own ways, Maya and Rafael search for hope, face difficult choices, and learn a secret—the same secret—that forever changes how they see the world."}]