[{"id": "0008206783", "genre": "Children's Books", "title": "Collins Primary Dictionary: Learn With Words (Collins Primary Dictionaries)", "description": "For children aged 7 and over, this dictionary contains up-to-date coverage of a wide range of everyday and curriculum vocabulary. It offers additional language tips and carefully selected and annotated illustrations to help students with more complex language. The Word Wizard section provides in-depth support on spelling, punctuation and grammar.This book is designed to build confidence and develop young learners’ language skills at home and in the classroom.Includes the latest vocabulary from a range of curricular areas with example sentences and tips on grammar and spelling to help children understand the meaning of words and use them confidently. Synonyms (similar words) and antonyms (opposite words) are given to build vocabulary.Beautiful annotated illustrations add an extra dimension and provide children with additional information on a range of topic areas.The Word Wizard offers invaluable support in the key areas of spelling, punctuation and grammar and creative writing."}, {"id": "146770802X", "genre": "Children's Books", "title": "Let's Meet a Firefighter (Cloverleaf Books - Community Helpers)", "description": "Are you curious about fire trucks? Firefighting clothes? Hoses and ladders? You're in luck! Firefighter Jim works at the fire department. He knows how to handle all kinds of emergencies. He shows a group of kids how he does his job. Let's hear it for firefighters!"}, {"id": "B0031MA7WK", "genre": "Children's Books", "title": "Exploratopia: More than 400 kid-friendly experiments and explorations for curious minds", "description": "From physics to forensics, from the largest clouds to the tiniest ants, from Issac Newton to elephant dung, \"Exploratopia\" overflows with things readers can explore using the simplest, everyday items, such as eggs, paper clips, soda bottles, vinegar, and plastic cups. Kids will love these innovative activities and will have fun learning all at the same time."}, {"id": "9881239435", "genre": "Children's Books", "title": "Amma Tell Me About Krishna!: Part 1 in the Krishna Trilogy", "description": "The festival of Janamashtmi – Celebrates the birth of Krishna,An avatar of Lord Vishnu,Born to rid the world of evil Kansa.The story of his magical escape from prison,Across the flooded river Yamuna.Helped by a snake called Shesh Naag,His arrival at the home of Nand and Yashodha!\"Amme  Tell Me\" is a charming and informative series of children's books that introduces the major Hindu festivals and figures to young readers, and are perfect for families wanting to share stories of Hinduism with their children or for educators looking for resource on the Hindu culture for their students.  Written in rhyme with vivid, captivating illustrations, this series brings Hindu mythology to its readers in a fun and non-preachy way. The Series has ten books on the festivals of Holi, Diwali, and on the Hindu gods Krishna, Hanuman and Ganesha."}, {"id": "B00LFZ0B9Y", "genre": "Children's Books", "title": "Twenty-Four Francisco Goya's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Francisco Goya's Paintings. Twenty-Four Francisco Goya's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}]