[{"id": "0517800586", "genre": "Children's Books", "title": "Down by the Bay (Raffi Songs to Read)", "description": "A classic silly song that toddlers know and love, Down by the Bay has been a favorite and best-selling Raffi Songs to Read/reg/ since it was first published in 1988. In this friendly board book edition, irresistible art by Nadine Bernard Westcott depicts wonderfully amusing creatures such as a bear combing his hair, a goose kissing a moose, and a whale with a polka-dot tail. Very young children will find this book both entertaining and instructive in early language skills such as rhyme, rhythm, and repetition, and will delight in hearing it read or sung aloud to them."}, {"id": "B00LHAN5VS", "genre": "Children's Books", "title": "Freddie Learns to Jump", "description": "This book can be read aloud to your kids.  The story is about a little frog name Freddie who had a big problem.  He could not jump.  He was very upset about this situation.  He wanted to take part in a big Jumping Competition. Freddie did not let that stop him.  Will Freddie be learn to jump? Will he be able to take part in that big jumping competition.  Read on to see how Freddie is able to overcome this problem."}, {"id": "059035342X", "genre": "Children's Books", "title": "Harry Potter and the Sorcerer's Stone", "description": "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright. From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny."}, {"id": "0996066616", "genre": "Children's Books", "title": "The Adventures of Black Dog: Beached Whale", "description": "Whale is in some trouble! Black Dog, Captain, Tess and Jack to the rescue! From the docks of Vineyard Haven, our fearless friends come to the aid of a friend in need in this wonderful new adventure story for children.The first tale in The Adventures of Black Dog series, Beached Whale follows the iconic Black Dog of Martha’s Vineyard as she sets sail with Captain and crew aboard the majestic tall ship schooner the Shenandoah. Black Dog and friends journey together through the islands, shores, and harbors of New England and beyond."}, {"id": "1981520481", "genre": "Children's Books", "title": "Merry Christmas Dudley - Xmas Activity Book: (Personalized Children's Activity Book)", "description": " Merry Christmas Dudley is a personalized kids activity book, it includes personalized crosswords, word searches, number puzzles, jokes, drawing and coloring  >It is suitable for children between 6-11 years old   It is a unique Christmas present for Dudley, and is the perfect gift this Xmas  This personalized book is also available for other names This is a great gift for children and an amazing keepsake for parents"}]