[{"id": "B00B7NQ3X2", "genre": "Science Fiction & Fantasy", "title": "Old Nathan", "description": "FIFTH YEARS AFTER THE AMERICAN REVOLUTION, MAGIC IS LOOSE IN THE BACKWOODSThe forces of evil are poised to prey on the folk of the hamlets and hollows: witches, demons, and red-handed men—but first they'll have to overcome Old Nathan the Wizard.He doesn't claim much for his magical powers, but they're real enough for what they are—and besides, he hasn't forgotten how to use his long flintlock rifle ....Enter the gritty, realistic world of Old Nathan, a backwoodsman who talks to animals and says he'll face The Devil himself-and who in the end will have to face The Devil in very fact.At the publisher's request, this title is sold without DRM (Digital Rights Management)."}, {"id": "1568820836", "genre": "Science Fiction & Fantasy", "title": "S. Petersen's Field Guide to Lovecraftian Horrors: A Field Observer's Handbook of Preternatural Entities and Beings from Beyond the Wall of Sleep (Call of Cthulhu Roleplaying)", "description": "With its clear visuals and hard-won information, this guide has saved my bacon on more than one occasion! Ernest P. Wilderbeast, Visiting Professor of Preternatural Studies Miskatonic University Weird shapes in the park? Odd rumbling noises in the basement? A lurking dread in the kitchen? Bad dreams involving strange adventures and bizarre creatures? Identifying the lurking horrors of the Cthulhu Mythos is never an easy task, so researchers need all the help they can get don t leave home without the Field Guide! An essential spotter s guide for the budding and experienced preternaturalist. Accurate and complete 53 Lovecraftian creatures categorized and detailed Full color illustrations Size comparison charts Habitat, distribution, and life cycle notes How to distinguish similar-seeming entities Observer warnings Bibliography and recommended reading list Illustrations and descriptions from the Cthulhu Mythos and Dream Cycle based upon the creations of H.P. Lovecraft."}, {"id": "0972380191", "genre": "Science Fiction & Fantasy", "title": "Date Night on Union Station (Earthcent Ambassador)", "description": "\"Good SciFi comedy is as rare as hen's teeth. This was a fun read.\"  Kelly Frank is EarthCent's top diplomat on Union Station, but her job description has always been a bit vague. The pay is horrible and she's in hock up to her ears for her furniture, which is likely to end up in a corridor because she's behind on rent for her room. Sometimes she has to wonder if the career she has put ahead of her personal life for fifteen years is worth it.  When Kelly receives a gift subscription to the dating service that's rumored to be powered by the same benevolent artificial intelligence that runs the huge station, she decides to swallow her pride and give it a shot. But as her dates go from bad to worse, she can only hope that the supposedly omniscient AI is planning a happy ending."}, {"id": "B00MX629FI", "genre": "Science Fiction & Fantasy", "title": "The Highland Dragon's Lady (Highland Dragons Book 2)", "description": "He's Out of the Highlands and on the Prowl... Regina Talbot-Jones has always known her rambling family home was haunted. She's also aware her brother has invited one of his friends to attend an ill-conceived séance. She didn't count on that friend being so handsome...and she certainly didn't expect him to be a dragon.  Younger son of a family of shapeshifting dragons, Highlander Colin MacAlasdair has lived a life free of both family duty and mortal cares. Moving in and out of human society as he wishes, he takes very little seriously-until Regina drops onto his balcony one midnight, catching his attention and his interest. She's like no mortal he's ever met, and no matter how hard he tries, he can't seem to get her out of his head.Bound by circumstance, drawn by the fire awakening inside of them, Colin and Regina must work together to defeat a vengeful spirit-and discover whether their growing love is powerful enough to defy convention.The Highland Dragons Series: Legend of the Highland Dragon (Book 1) The Highland Dragon's Lady (Book 2)Night of the Highland Dragon (Book 3)Praise for Legend of the Highland Dragon, a Barnes and Noble Best Romance of 2013 \"The mix of hard-headed realism and fantasy in this novel is enchanting...\"-Barnes and Noble Reviews\"An outstanding read! ...fast-paced, smartly written...impossible to put down.\"- RT Book Reviews, 4 ½ Stars, Top Pick!"}, {"id": "B00ZDVK02O", "genre": "Science Fiction & Fantasy", "title": "Immersed: A Romantic Steampunk Adventure (The Clockwork Siren Series Book 1)", "description": "WHAT IF LOVE TURNED YOU INTO A MONSTER?Forget petticoats and demure female behavior. Melusine Doré prefers armored corsets and knives and slays evil creatures for a living. The grim and gruesome don’t frighten her; she’ll take on a cyclops or a dragon and not even break a sweat.  But when her rival, the charismatic Levi Cannon, comes to town, all her buried fears begin to surface.  Melusine realizes she is in danger of something much more horrifying than facing blood-thirsty beasts – she’s in danger of falling in love.  Because love alone has the power to reveal a secret terrible enough to completely shatter her world. Set in the muddy streets of 1850s steampunk Chicago, Immersed by Katie Hayoz is a dark yet romantic fantastical romp.  It is a stand-alone novella, the first in a series of adventures that follow Melusine on her quest to rid the world of monsters…and her struggle to come to terms with every monstrous facet of herself."}]