[{"id": "B077GKGKW1", "genre": "Science Fiction & Fantasy", "title": "George MacDonald: The Complete Novels (The Greatest Writers of All Time)", "description": "This book, newly updated, contains now several HTML tables of contents that will make reading a real pleasure!The first table of contents (at the very beginning of the ebook) lists the titles of all novels included in this volume. By clicking on one of those titles you will be redirected to the beginning of that work, where you'll find a new TOC that lists all the chapters and sub-chapters of that specific work.Here you will find the complete novels of George MacDonald in the chronological order of their original publication.- Phantastes- David Elginbrod- The Portent- Alec Forbes of Howglen- Annals of a Quiet Neighbourhood- Robert Falconer- The Seaboard Parish- At the Back of the North Wind- Ranald Bannerman's Boyhood- The Princess and the Goblin- The Vicar's Daughter- Wilfred Cumbermede- Gutta Percha Willie- The Lost Princess- Malcolm- Thomas Wingfold, Curate- St. George and St. Michael- The Marquis of Lossie- Sir Gibbie- Paul Faber, Surgeon- Mary Marston- Castle Warlock- Weighed and Wanting- Donal Grant- The Princess and Curdie- What's Mine's Mine- Home Again- The Elect Lady- A Rough Shaking- There and Back- The Flight of the Shadow- Lilith- Salted with Fire "}, {"id": "1594261083", "genre": "Science Fiction & Fantasy", "title": "Electronic Echoes of the Mind", "description": "A dead ex-girlfriend. A genetically engineered super soldier. An evil corporation that corrupts everything it touches. A subversive computer-worshipping cult. A deranged AI assistant. And Bob. What do they all have in common? Me. I'm Jake Turner, the best damn pilot in the Solar System. Buy me dinner and I'll fill you in. During a routine shuttle run down to Mars, my 'good friend' Bob asked me to pick up some 'sensitive' software on my way to dinner. I should have known better. Before I could eat my fajitas, I was shot, tortured, and had sustained more concussions than an OSF target dummy. Even worse, my AI assistant developed a serious personality disorder. OmegaCorp ruined my life, killed my ex-girlfriend, blew up my shuttle, and interrupted my dinner. Now they're going to pay! My only allies are an elite group of super hackers, and the most dangerous warrior ever to break free of OmegaCorp's Elite program. Nice allies, eh? Only they're also lunatics who keep worshipping electronic devices and seem to think that I'm some kind of Holy Man. Everything centers on my ex-girlfriend, Holly. And I thought she was a pain in the ass when she was alive!"}, {"id": "0373626312", "genre": "Science Fiction & Fantasy", "title": "End Day (Deathlands)", "description": "TIME WARPED  Ryan Cawdor and his six companions struggle to survive postnuclear America, a grim new world where hope for the  future is lost amid the devastation. APOCALYPSE REDUX In pursuit of a hardened enemy—Magus—Ryan and the companions find themselves in a land more foreign than any they've encountered. After unwittingly slipping through a time hole, the group lands in twentieth-century New York City, getting their first glimpse of predark civilization. And they're not sure they like it. Only Mildred and Doc can appreciate this strange metropolis, but Armageddon is just seventy-two hours away, and Magus will stop at nothing to make sure Ryan and his team are destroyed on Nuke Day…"}, {"id": "0983780137", "genre": "Science Fiction & Fantasy", "title": "Living All Day", "description": "In a world of wide-spread brain enhancements and everyday nanotech, one tiny breakdown means everyone is in danger. Aidra Scott has every PI's dream job. All she has to do is prove that Jean Claude Gascoigne killed a man in cold blood. It should be easy. After all, Gascoigne committed the murder in front of thousands of witnesses. But he claims that the nanotech enhancements in his brain made him do it, putting Aidra in the bizarre position of proving a man guilty by proving a technology innocent. Aidra, like millions of others, has been using that same nanotech to sleep less and work more, keeping her business afloat and her son in college. She has to find the truth behind the technology and its all-too-human inventors, and she has to do it quickly.Because if Gascoigne is innocent, no one is safe.Living All Day is the latest \"Detroit Next\" science fiction thriller from the authors of Zoners and The Caline Conspiracy."}, {"id": "1946777323", "genre": "Science Fiction & Fantasy", "title": "Tales from the Canyons of the Damned No. 17 (Volume 17)", "description": "This seventeenth issue of Tales from the Canyons of the Damned consists of five sharp, suspenseful, thought provoking short stories—each from a different featured master of speculative fiction. D.K. Cassidy counts down 103 Days Jason LaVelle invites us to Keep Rolling Jon Frater ponders the Moon Paul K. Swardstrom shares a comedic B-Movie Novelette And Daniel Arthur Smith shares another clip from the Lost Tapes series Tales from the Canyons of the Damned (canyonsofthedamned.com) is a dark science fiction, horror, & slipstream magazine we've been working on since 2015. What is Dark Science Fiction and Horror? Think of it as a literary Twilight Zone, Night Gallery, or Outer Limits, it's Netflix's Black Mirror in the short story format. And it's a bargain. Each monthly issue has three-to-five sharp, suspenseful, satirical tales from today's top speculative fiction writers. These are Dark Sci Fi Slipstream Tales like you've never read before."}]