[{"id": "B0778Q691P", "genre": "Children's Books", "title": "The Adventures of Miss Croc (4 Book Series)", "description": "From Book 1: This is the story of a deliciously chubby old croc that lives in the murky waters of the Florida Everglades. The croc takes immense pride in her smelly rundown canal that she finds quite charming. In this story the croc tantalizes a pompous old walrus with her good fortune and undeniable love."}, {"id": "0984598677", "genre": "Children's Books", "title": "Cheyanna and the Holey Horse", "description": " Cheyanna has never won a rodeo on her favorite horse, Rocky. With Rocky growing old, Cheyanna's family decides it's time for her to get a horse she can win on. The horse her mother brings home, BigHornCatchMeQuick, comes with a slight surprise, however: a gaping hole in his neck from a tracheotomy. Cheyanna's father refuses to support the horse, while Cheyanna struggles with her insecurities over the horse's appearance and people's opinions of her, as well as her father's disapproval.Will Cheyanna be able to look past BigHorn's disability and ride him proudly in the rodeo? Will her love for the horse convince her father that appearances and unique conditions do not define success?Cheyanna and the Holey Horse is a story that will teach children that no matter what issues they may be faced with and what conditions they might have, the courage to listen to one's own heart is what truly makes a winner. "}, {"id": "1554530865", "genre": "Children's Books", "title": "This is Daniel Cook Making Honey", "description": "Buzz! Buzz! Join Daniel as he visits a bee farm in this title in the This is Daniel Cook series. Learn about different kinds of bees, how they make honey and how a beekeeper gets the honey from the hive. Lucky Daniel also gets a taste test. Yum! Charmed by his boundless enthusiasm, children will be eager to join Daniel and learn about the world from a kid's perspective. Each book closes with an activity that encourages young readers to create along with Daniel. Kids will be eager to join in the adventures of a little boy who gets to do so many different things. If Daniel can do it, so can they!"}, {"id": "014038541X", "genre": "Children's Books", "title": "Math Riddles (Easy-to-Read, Puffin)", "description": "Enhanced by vibrant, playful illustrations, this easy-to-read humor collection offers a number of amusing riddles that also teach simple math concepts. Simultaneous."}, {"id": "0062430084", "genre": "Children's Books", "title": "Spirit Hunters", "description": "We Need Diverse Books founder Ellen Oh returns with Spirit Hunters, a high-stakes middle grade mystery series about Harper Raine, the new seventh grader in town who must face down the dangerous ghosts haunting her younger brother. A riveting ghost story and captivating adventure, this tale will have you guessing at every turn!Harper doesn’t trust her new home from the moment she steps inside, and the rumors are that the Raine family’s new house is haunted. Harper isn’t sure she believes those rumors, until her younger brother, Michael, starts acting strangely. The whole atmosphere gives Harper a sense of déjà vu, but she can’t remember why. She knows that the memories she’s blocking will help make sense of her brother’s behavior and the strange and threatening sensations she feels in this house, but will she be able to put the pieces together in time?"}]