[{"id": "B0753YS8HB", "genre": "Children's Books", "title": "Brown Bear Can't Sleep", "description": "This book is specially designed in Amazon's fixed-layout KF8 format with region magnification. Double-tap on an area of text to zoom and read.It is the coldest day of winter, and most of the animals have gone to bed. But Brown Bear can't fall asleep. He wants to go outside, but he needs a disguise so the cold-loving animals won't recognize and ridicule him. But to look like a polar bear, he needs lots and lots of white wool. And for lots of wool, Brown Bear needs lots and lots of sheep. So, Brown Bear starts calculating how many sheep he will need... Will his sweater plan succeed?"}, {"id": "0516250965", "genre": "Children's Books", "title": "Lewis And Clark: Path To The Pacific (Trailblazers of the West)", "description": "Discusses the events and key figures behind the incredibly adventurous and treacherous exploration of the United States' western frontier."}, {"id": "1474892035", "genre": "Children's Books", "title": "Discovery Stem Stars Women Who Rocked Space", "description": "STEM Stars Women Who Rocked Space is a wonderfully inspiring book for any budding scientist who needs awesome girl role models. From the first woman astronomer, to the ladies known as computers, to a record-holding spacewalker . . . Discover the inspiring stories of 19 of the most awesome female explorers of our solar system and beyond!"}, {"id": "0756965527", "genre": "Children's Books", "title": "My Brother Martin: A Sister Remembers Growing Up with the Rev. Dr. Martin Luther King Jr.", "description": "Mother Dear, one day I'm going to turn this world upside down.Long before he became a world-famous dreamer, Martin Luther King Jr. was a little boy who played jokes and practiced the piano and made friends without considering race. But growing up in the segregated south of the 1930s taught young Martin a bitter lesson -- little white children and little black children were not to play with one another. Martin decided then and there that something had to be done. And so he began the journey that would change the course of American history."}, {"id": "150263211X", "genre": "Children's Books", "title": "Majority Rule and Minority Rights (Civic Values)", "description": "Today, many votes are decided by majority rules. Likewise, many people are protected by minority rights. This book examines both concepts, explains what they mean, what the Constitution says about them, and how they can be practiced in everyday situations."}]