[{"id": "B01JM85MJ4", "genre": "Science Fiction & Fantasy", "title": "Knights of the Roundtable: King Arthur ( 2017, Annotated)", "description": "King Arthur, a legend of old, has captivated the hearts of many throughout generations. It is an exciting tale of a British leader who defended his country from Saxon invaders. Arthur’s story starts out as just a young boy, the son of King Uther Pendragon, who has no knowledge of his royal heritage. He takes his rightful place as king when he is able to pull the sword, Excalibur from the stone. His story goes on to tell of his life as King and the many great things he does for his people. - Foreword by Rachael Dawn"}, {"id": "0998530905", "genre": "Science Fiction & Fantasy", "title": "Nostalgic Rain: Galaxies Away", "description": "What seventeen-year-old Leland finds in the abandoned basement of his house is something he will never forget. Leland lost his father when he was seven. Since then, he has successfully adapted to the awful life of being a student, the man of the house, and a father figure to his two younger siblings. All of that changes when he and his best friends stumble upon a secret in his deserted basement, and fall into another dimension with three moons, foggy woods, and an ancient castle-Oremanta.Learning who he really is, how he came to this remote planet, and the shocking, ugly mystery of Oremanta aren't as bad as the quest he finds himself obligated to complete-killing someone he never thought he'd meet in Oremanta to save everyone.                          "}, {"id": "B008BU6ZNC", "genre": "Science Fiction & Fantasy", "title": "Luck of the Draw: The Chronicles of Xanth", "description": "Bryce is summoned to Xanth as part of a wager between the Demons Earth and Xanth. To his surprise, he has left behind his home and family and eighty-year-old body forever, in exchange for youth and magic….and a quest. He must court and marry Princess Harmony, who is anything but willing to be courted!Luck of the Draw is Piers Anthony's thirty-sixth pun-filled adventure in the magical land of Xanth.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}, {"id": "B075J9FGJ8", "genre": "Science Fiction & Fantasy", "title": "Into Twilight (The Stefan Mendoza Trilogy Book 1)", "description": "Double-crossed and abandoned behind enemy lines. It’s an agent’s worst nightmare.In the 22nd Century, Stefan Mendoza is a loyal operator for the Agency, an organization that does the United States’ dirty work. Extraction, systems hacking, assassination—allies and enemies, he never questions the mission. And then the day comes when he’s considered expendable. His conditioning prevents him from breaking under torture, even if he wants to, and he refuses to die. Through it all, he has only one wish: revenge against the agent who double-crossed him.But when he escapes and the opportunity for vengeance arises, Stefan finds the world has changed and so has he.Pick up your copy of the first Stefan Mendoza cyberpunk thriller, and follow him Into Twilight."}, {"id": "153530054X", "genre": "Science Fiction & Fantasy", "title": "Skills: for Mythic Fantasy Role-playing Game", "description": "DO NOT BUY THIS BOOK unless you want a separate book for the skills in MYFAROG. This small (5 * 8 inch, 66 pages) book contains the same information about the skills as the core rule book, only with font size 10 instead of 9, for more easy reading. The purpose of this book is to enable myth masters and players alike to fast and easily be able to look up on the skill modifications and skills in general. NB! This second edition of Skills is for v. 2.6!"}]