[{"id": "1885865333", "genre": "Science Fiction & Fantasy", "title": "A Thing of Rags and Patches", "description": "This is a book of fireside fancies, mythos, monsters. Stories that peer sidelong at fairy tales, urban myths, history and pop culture, alongside poetry that leads convention in a quickstep around the room, then steals its wallet. You'll find Devils and princesses who don't want your sympathy, but who demand your understanding. You'll address the perils of parenting, whether you're a vampire or a rock star.  You'll meet folks who trade in books, in secrets, in navigational coordinates, and in monsters. You'll witness the consequences of leaving some doors shut too long, and the cost of opening others at all."}, {"id": "178535826X", "genre": "Science Fiction & Fantasy", "title": "Methods Devour Themselves: A Conversation", "description": "Methods Devour Themselves is a dialogue between fiction and non-fiction. Inspired by Quentin Meillassoux's Science Fiction and Extro-Science Fiction that was paired with an Isaac Asimov short story, this book examines the ways in which stories can provoke philosophical interventions and philosophical essays can provoke stories. Alternating between Benjanun Sriduangkaew's fiction and J. Moufawad-Paul's non-fiction, Methods Devour Themselves is an interstitial project that brings fiction and essay into a unique, avant-garde whole."}, {"id": "1559586435", "genre": "Science Fiction & Fantasy", "title": "Falcon 3.0: The Official Combat Strategy Book: Revised Edition", "description": "Bornstein takes players on an eye-opening tour of duty over Falcon's three-dimensional contoured terrain maps of Kuwait, Panama, and Israel to detail the strategies and tactics that players need to know to win. Players select weapons, locate targets, and engage the enemy with confidence. This revised edition contains valuable information on the MIG 29 Falcon companion as well as F-18 Hornet."}, {"id": "B077KBXCZR", "genre": "Science Fiction & Fantasy", "title": "Young Aina", "description": "Seeing her father followed by strange men, Aina races to warn him. But soon they’re pursued by a deadly enemy. They escape deep into the ancient forest in search of a haven. But something quite alien calls to Aina.As it calls, her magic awakens. Her father fears what’s happening to his daughter, but it’s neither the ancient heart of the forest nor the highly intelligent species that live there that scare Aina—it’s the humans who hunt them.Will her magic save Aina and her father from the men who wish to kill them or will it cost her all she loves?If you like fast-paced, fantasy adventures on distant planets you’ll love this exciting prequel to Ned Marcus’s Blue Prometheus series.Download Young Aina today!"}, {"id": "1480479527", "genre": "Science Fiction & Fantasy", "title": "Across a Billion Years", "description": "A team of space archaeologists makes an astonishing discovery about an ancient alien race in this science fiction tale from “a master of his craft” (Los Angeles Times). Graduate student Tom Rice is thrilled to embark on his first deep-space archeological expedition. He is part of a team from Earth, venturing out in search of artifacts from a civilization that ruled the universe many millennia ago. Called the High Ones, the members of this long-gone society left tantalizing clues about their history and culture scattered throughout space. One such clue, a “message cube” containing footage of the ancient ones, is more interesting than all of the others combined. It seems to indicate that the High Ones aren’t extinct after all—and just like that, Tom Rice’s archeological mission has become an intergalactic manhunt, one filled with ever-increasing danger that will send the explorers hurtling headlong into the greatest adventure—and peril—of their lives. This ebook features an illustrated biography of Robert Silverberg including rare images and never-before-seen documents from the author’s personal collection."}]