[{"id": "1564518930", "genre": "Children's Books", "title": "2.5x Magnifier Set (set of 12)", "description": "Affordable and dependable plastic magnifiers. Get one for every student in your classroom! Each has a 1 1/4\" (3cm) diameter lens. Set of 12."}, {"id": "B073JZK1GY", "genre": "Children's Books", "title": "States of Matter (My Early Library: My World of Science)", "description": "Using the new Next Generation Science Standards (NGSS), the My World of Science series provides the earliest readers with background on key STEM concepts. States of Matter explores basic chemistry and the states of solid, liquid, and gas in a simple, engaging way that will help readers develop word recognition and reading skills. Includes a glossary and index."}, {"id": "031612656X", "genre": "Children's Books", "title": "Crankenstein", "description": "BEWARE OF CRANKENSTEIN! Who is Crankenstein?HE IS A MONSTER OF GRUMPINESS THAT NO ONE CAN DESTROY! MEHHRRRR!!! HE'S ALIVE!He may look like any ordinary boy, but when faced with a rainy day, a melting popsicle, or an early bedtime, one little boy transforms into a mumbling, grumbling Crankenstein. When Crankenstein meets his match in a fellow Crankenstein, the results could be catastrophic--or they could be just what he needs to brighten his day!"}, {"id": "0764209531", "genre": "Children's Books", "title": "11: The Mandie Collection (Mandie Mysteries) (Volume 11)", "description": "More Mandie Favorites from a Bestselling AuthorLongtime enthusiasts and new fans will love this final volume of THE MANDIE COLLECTION, following Mandie through her last year of school in Mandie and the Missing Schoolmarm and Mandie and the Graduation Mystery. Two holiday adventures, Mandie and Joe's Christmas Surprise and Mandie and Mollie and the Angel's Visit, along with two bonus drama scripts for Mandie fans to perform, round out the collection."}, {"id": "1460297202", "genre": "Children's Books", "title": "Magical Eyes", "description": "A fantasy coming of age adventure with a female protagonist. A MYSTICAL WHITE EAGLE, A CHARMED BOOK, AND A GIRL WITH SPECIAL POWERS... In a world where sorcery is feared, Princess Martina conceals her paranormal powers, especially when her brother is against her. Finding a true friend in the peasant boy Enzo, her secret seems safe. But when tragedy strikes the royal palace, Martina's careful world is torn to pieces. Brother and sister find themselves on an epic magical quest to save the kingdom from war and famine, vicious mythical beasts, and a tyrannical king. But Prince Drago has secrets of his own, and a heart of wickedness that no amount of good magic can brighten. Dark days cloud Brightalia, and only one last hope remains before total devastation. Can Martina be a hero and defeat the evil that lurks throughout her land? Or are the days of her beloved kingdom over forever?"}]