[{"id": "B077GZ21BL", "genre": "Children's Books", "title": "The Freedom Ship of Robert Smalls (Young Palmetto Books)", "description": "Robert Smalls, born a slave in 1839 in Beaufort, South Carolina, gained fame as an African American hero of the American Civil War. The Freedom Ship of Robert Smalls tells the inspirational story of Small’s life as a slave, his boyhood dream of freedom, and his bold and daring plan as a young man to commandeer a Confederate gunboat from Charleston Harbor and escape with fifteen fellow slaves and family members. Smalls joined the Union Navy and rose to the rank of captain and became the first African American to command a U.S. service ship. After the war Smalls returned to Beaufort, bought the home of his former master, and began a long career in state and national politics.This new edition of The Freedom Ship of Robert Smalls, originally published in 1971, features Louise Meriwether’s original narrative, now illustrated by the colorful paintings of renowned Southern artist Jonathan Green."}, {"id": "B00A0ADIDQ", "genre": "Children's Books", "title": "ABC Book of Birds (Original Illustrations and Text) (Classic Books for Children 54)", "description": "This is a book on identifying birds. It has short descriptions of each bird and full-color, full-page drawings of many of them.* This ebook is an exact, high-definition copy of a pre-1923 print version of the book. Unlike other e-copies of the book, it is not a transcription, which may be full of typographic errors. * \"Exact\" means that if the print version has any inscriptions or previous owner's name in the front of the book, so, too, will this e-book; blank pages that often separate chapters might be left in; and, any pages that may have a folded corner or other, similar factor might be included, too.* In other words, no changes or as few as possible have been made to either the illustrations or the text in order to bring you a book that is as close to the original as possible."}, {"id": "1887714294", "genre": "Children's Books", "title": "All the Mamas : A True Love Story for Mothers and Daughters of All Ages", "description": "Based on genealogical records from one family, this story briefly recounts historical events as experienced by generations of mothers and the daughters they loved and cared for"}, {"id": "B01N21HHQR", "genre": "Children's Books", "title": "Kisa Adventures", "description": "One stormy night, when Zahra couldn't fall asleep, Ali came rushing into her room with a book she had never seen before. They jumped under the blanket and began to read the story told by Lady Fatima, the daughter of the Holy Prophet whom they loved so much. Suddenly, something amazing happened...Discover the deep meaning of Hadith al Kisa by following Zahra and Ali on an exciting Kisa adventure.Can you find the Ahlulbayt in the world around you?Contains Hadith al Kisa in Arabic and English in Full ColourAllah (swt) said: \"I have not created the elevated Sky, the stretched earth, the illuminated moon, the bright sun, the rotating planets, the flowing seas and the sailing ships, but for the love of these five who are under the cloak”"}, {"id": "0811474798", "genre": "Children's Books", "title": "38: Pacific Islands (Portrait of America)", "description": "Discusses the history, economy, culture, and future of the American territories in the Pacific: Guam, the Northern Marianas, and American Samoa"}]