[{"id": "1680521497", "genre": "Children's Books", "title": "Valentine's: Lift-a-Flap Board Book (Babies Love)", "description": "With colorful artwork and especially sturdy lift-a-flaps, this board book introduces classic Valentine's Day traditions like giving cards and candies. Simple sentences reinforce future language structure. Grasping and lifting the flaps helps develop fine motor skills. ISBN: 978-1-68052-149-85.0\"w x 5.0\"h6 lift-a-flap spreadsembossed cover with foil"}, {"id": "B003MNGIPS", "genre": "Children's Books", "title": "Flight: General Knowledge", "description": "Learn about the history of Flight with iMindsJNR learning series for younger minds. Have you ever wondered how a bird flies, or how a heavy airplane stays in the sky? Flight occurs when an object moves through the atmosphere instead of falling towards the Earth. This object can be an aircraft, a spaceship, a rocket, a balloon, a bird, or an insect. In order for something to fly, it has to be lighter than the air around it or powerful enough to defy gravity, which is the Earth’s pull. When a plane gains a lot of speed, its wings push air underneath and the plane rises. When a bird flaps its wings, it creates lift by pushing air underneath.Perfect to engage, entertain and broaden young thinkers.. iMindsJNR brings targeted knowledge to your eReading device with short information segments to whet your mental appetite and broaden young minds. iMindsJNR offers 6 main categories for ages 7-14years including General Knowledge, Geography & Nature, Famous People, Science & Maths, The Arts and History. Clear, concise and engaging, open young minds to a love of learning."}, {"id": "1624053661", "genre": "Children's Books", "title": "The Chronicles of Narnia Collector's Edition (Radio Theatre)", "description": "The classic stories of C. S. Lewis’s The Chronicles of Narnia come to life through this beautifully boxed edition of fully dramatized audio adventures. Produced by Focus on the Family’s acclaimed Radio Theatre, the series is now presented in a collector-quality tin with original artwork and map of Narnia.Recorded in London with an all-star cast of England’s brightest talent from the stage and screen, an original orchestral score, and cinema-quality digital sound design, this innovative recording includes all seven original stories and nearly 22 hours of entertainment! Adults and children alike will be entranced by stories of courage, self-sacrifice, friendship, and honor―in a world where talking creatures conspire with men, dark forces are bent on conquest, and the great lion Aslan is the only hope.This is a repackaged, collector’s edition of this bestselling Radio Theatre resource, which has sold more than 340,000 copies."}, {"id": "1933390166", "genre": "Children's Books", "title": "Secret of the Ninja (Choose Your Own Adventure #16)", "description": "Secret Of The Ninja by Jay Leibold takes YOU to an aikido dojo in Kyoto, Japan where a number of mysterious happenings are taking place. 9-12 year old readers will use their ninja skills to investigate a strange relic that arrives at the dojo, travel back in time, and fight five ninjas at once!   Choose Your Own Adventure Secret Of The Ninja is an interactive adventure book in which YOU decide what happens next.   An ancient samurai sword arrives on the doorstep of your aikido dojo. Does the ninja sword hold magical powers that date back many decades ago? If you trace the history of this mystical sword, will your life be in danger? Without warning, five ninjas attack! Are they after the samurai sword, or out for your head?   For readers who enjoyed other titles from the Choose Your Own Adventure series, including: The Lost Jewels of Nabooti by R. A. Montgomery, Cup Of Death by Shannon Gilligan, and Mystery of the Maya by R. A. Montgomery."}, {"id": "159845210X", "genre": "Children's Books", "title": "Aerosmith: Hard Rock Superstars (Rebels of Rock)", "description": "On March 19, 2001, Aerosmith rocked New York City's Waldorf-Astoria hotel. But it wasn't just another concert. After over thirty years performing together, Aerosmith had made it to the Rock and Roll Hall of Fame. Through good times and bad, band members Steven Tyler, Joe Perry, Tom Hamilton, Brad Whitford, and Joey Kramer know how to rock. Read about their lives and how Aerosmith formed, and almost fell apart."}]