[{"id": "1610806751", "genre": "Children's Books", "title": "From Locusts To... Automobile Anti-Collision Systems (21st Century Skills Innovation Library: Innovations from Nature)", "description": "From airplanes to football helmets, some of the greatest inventions of all time have been based on the natural abilities of plants and animals. Readers will learn how some of history's most imaginative inventors were inspired by nature and how their incredible creations continue to improve our lives today. Available in reinforced library and paperback bindings."}, {"id": "079228304X", "genre": "Children's Books", "title": "Moon (Jump Into Science)", "description": "A cartoon cat and bug explain scientific history and concepts regarding the Earth's moon: its ever-changing appearance, composition, comparisons to Earth and the sun, Galileo's observations and discoveries in 1609, astronauts, orbits, and other topics. Busy, colorful borders are full of decorative details based on the main pictures. A concluding craft project gives instructions on how to make craters."}, {"id": "0736962379", "genre": "Children's Books", "title": "Great Horse Stories for Girls: Inspiring Tales of Friendship and Fun", "description": "Girls love horses! Horsewoman Rebecca Ondov invites tweens (ages 8 to 12) to experience life around horses—caring for them, getting to know their personalities, training them, and loving them. Along the way, girls will discover more about themselves—who they are, how much God loves them, and what He wants them to do.Using their love for horses as a base, Great Horse Stories for Girls helps girls:build confidence in God's love and provisioncreate stronger friendshipsknow how to handle \"the blues\"make wise choicesdevelop an active prayer lifeDaughters will enjoy these true stories of interacting with horses and encounter life-changing truths that will help them grow strong spiritually, emotionally, and mentally."}, {"id": "1479431419", "genre": "Children's Books", "title": "Championship Ball (The Chip Hilton Sports Series)", "description": "The basketball season was opening at Valley Falls High and Chip Hilton, star center of last year's varsity, had his leg in a cast. In spite of Doc Jones' encouraging words, it looked like curtains for a sports career which had started out so brilliantly under Coach Hank Rockwell’s canny tutelage. It was a bitter dose to swallow for a youngster with Chip's strong spirit and will to win. Many a kid in his shoes would have given in to self-pity and let the circumstances throw him. But because he loved the game and because of his loyalty to \"the Rock\" and to the school, Chip swallowed his pride and took over the uninspiring job of managing the basketball team. This is the story of Chip Hilton, manager, who with one bum leg and an unquenchable spirit, won the state championship for his team over all contenders, and won an even greater victory over himself.CLAIR BEE, one of the most famous athletes in American collegiate history -- and later a winning coach -- has drawn upon his own experiences for two of the most unforgettable characters in sports’ fiction: Chip Hilton, the hero, and Hank Rockwell, the understanding coach."}, {"id": "1481447432", "genre": "Children's Books", "title": "War of the Realms (Valkyrie)", "description": "Freya and the Valkyries must stop a war before two worlds are destroyed in this third book of an exciting series that School Library Journal described as perfect for “those looking for Rick Riordan read-alikes.”In the world of Asgard, living among Odin, Thor, and Loki, are the Valkyries of legend. They are Norse goddesses who reap the fallen souls from human battlefields and have the power to cause death with just one touch. At the end of The Runaway, Freya and the Valkyries were about to leave the human world when they learned that the Frost Giants, Fire Giants, and Dark Searchers had united to declare war on the Realms. Bitfrost, the legendary rainbow bridge linking the human world to Asgard, had been closed. With their only entry back to Asgard barred, how can the Valkyries get back to fight to protect their homeland? Loki claims he knows a secret route but can they trust him? And even if they found a way—is there anything they can do to stop the war? As the War of the Realms spills over into Earth, Freya and the Valkyries must find a way to save not just the Norse world but the human world as well. With everything at stake, can Freya become the Hero she was destined to be?"}]