[{"id": "B008E8P7MG", "genre": "Children's Books", "title": "The Young Adult's Guide to the Economy.. What it is, Why it Stinks and What You Can Do About it!!", "description": "Do what I say, not as a I do might be the message that many parents give to their children regarding finances.  While we might want to protect children from the realities and impact of our current economic woes, knowledge is power.  This book intends to help educate and rececession proof future generations. Targeted toward young adults or those of any age who want an understandable explaination of how our economy works and why we are in a recession. Learn about the housing bubble, debt, and globalization.  The book uses easy to understand analogies that simplifies economics into something that is not so hard to understand.  The debt habits of most Americans mirrors the debt patterns of our US government.  Young adults cannot learn the benefits of living a fiscally responsible life when they have no financial role models.  After reading this book I hope that young adults will choose the path of debt free living and spending money on things that matter, like experiences and education."}, {"id": "1780273916", "genre": "Children's Books", "title": "Robert Burns and All That", "description": "Meet the lassies who stole Robert Burns' heart and the creatures that inspired his poetry. Join his quest to rescue a lost musical treasure—and get chased by ghouls as he explores the dark side of life. Understand the meaning of \"To A Mouse,\" \"A Man's a Man For A' That\" and Burns' other classics. Investigate why Burns supported the French Revolution. Discover the origins of Burns Night and find out what's really in a haggis. Bursting with hilarious illustrations, Robert Burns and All That is a book that simply must be read for the sake of auld lang syne!"}, {"id": "0750227842", "genre": "Children's Books", "title": "Motocross (To The Limit)", "description": "Speed ad excitement rule motocross. From learning what equipment to use, how and where motocross began and riding skills to trial riding, Enduro racing, supercross and race tactics, this title offers the best advice, coolest photos, the biggest stars and much more."}, {"id": "1426318960", "genre": "Children's Books", "title": "National Geographic Kids Mission: Tiger Rescue: All About Tigers and How to Save Them (NG Kids Mission: Animal Rescue)", "description": "Inspiring young animal lovers to get up close to elusive tigers and the real-life challenges they face is what Mission: Tiger Rescue is all about. This compelling narrative combines fun and amazing adventure stories, gorgeous photography, hands-on activities, fascinating information, and more, connecting the reader in-depth with the animal's real world. Meet real-life tigers and learn about their habitats, challenges, and successes, plus learn how YOU can take action and save these amazing endangered creatures.From the Trade Paperback edition."}, {"id": "0375966404", "genre": "Children's Books", "title": "What Cat Is That?: All About Cats (Cat in the Hat's Learning Library)", "description": "The Cat in the Hat learns all about cats—wild and domestic—in this feline-focused Cat in the Hat's Learning Library book! Traveling aboard his Kitty-Cat-Copter, the Cat takes Sally and Nick to meet lions in Kenya, tigers in Bangkok, Siamese down the block—learning along the way those traits that all cats share: scratchy tongues, padded paws, sensitive wiskers, sharp claws, and those things unique to different species. With information about the anatomy and behavior of well-known species and breeds—including lions, tigers, leopards, cheetah, jaguar, ocelots, cougar, American shorthair, Persian, Siamese—and lesser-known ones, like clouded leopards, caracals, Turkish Vans, Scottish folds, American curls, Raga Muffins, and more—there's something here for cat/Cat lovers of all kinds! Fans of the hit PBS Kids show The Cat in the Hat Knows a Lot About That! (which is based on the Cat in the Hat's Learning Library) won't want to miss this purrfect new addition to the series."}]