[{"id": "1499880812", "genre": "Children's Books", "title": "Nighttime Bunny", "description": "It's nearly Bunny's bedtime, but he's just not ready yet! Settle down for a delightful bedtime tale and follow Bunny on this wonderful woodland adventure. With charming illustrations by James Newman Gray, this adorable story will keep little ones entertained before bedtime. "}, {"id": "1515814556", "genre": "Children's Books", "title": "Gracie LaRoo", "description": "Gracie LaRoo is a synchronized swimming pig extraordinaire! She is a shooting star on her team, the Water Sprites, but is also the youngest of the bunch. Follow Gracie as she manages fame, works on her confidence, and navigates tricky situations while living into her talent and her craft!"}, {"id": "B00AEM5PMC", "genre": "Children's Books", "title": "My Safari Adventure", "description": "All aboard! Join the rough, tough Safari Crew and hold on tight for a Safari Adventure you'll never forget! A bright and fun story overflowing with wild animals in their natural habitat.  If our rough and tough safari crew are lucky they will see families of elephants and jackals, and if they were really lucky they just might see a crocodile! And they just might get more than they bargained for! Snip Snap!!"}, {"id": "B00FH82FQ2", "genre": "Children's Books", "title": "The Story of Garibaldi and the Italian Unification (Illustrated)", "description": "Our brief sketch of Garibaldi and his comrades has been based, as far as possible on G. M. Trevelyan's notable trilogy—Garibaldi and the defense of Rome, Garibaldi and teh Thousand, and Garibaldi and the Making of Italy. Mr. Trevelyan's very full and highly picturesque narratives do not take in, or only cursorily, the later phases of his hero's career, in with Garibaldi appears to less advantage. Here we have been compelled to fall back on Garibaldi's autobiography, which as been satisfactorily translated by Mr. A. Werner, supplemented by Signora Mario's recital.A legend which seems impossible but has nevertheless gained acceptance in some quarters represents Garibaldi as having been killed at Aspromonte, when a 'double' named Sganerelli, a stevedore of Genoa, was substituted for him by the chiefs of the party for political reasons. The supposed fraud has been put forward as an explanation for the Liberator's failures after 1862. The theory is not only unnecessary, but even preposterous. \" 'Tis not in mortals to command success,\" and as it was Garibaldi's uniform experience to strive against heavy odds, it should excite no surprise that sometimes his military genius was beaten by circumstances. What is really surprising is that a man untrained in the arts of war should have accomplished such signal results, at any period of life, with such cruelly inadequate means."}, {"id": "1981481648", "genre": "Children's Books", "title": "Merry Christmas Cormac - Xmas Activity Book: (Personalized Children's Activity Book)", "description": " Merry Christmas Cormac is a personalized kids activity book, it includes personalized crosswords, word searches, number puzzles, jokes, drawing and coloring  >It is suitable for children between 6-11 years old   It is a unique Christmas present for Cormac, and is the perfect gift this Xmas  This personalized book is also available for other names This is a great gift for children and an amazing keepsake for parents"}]