[{"id": "1540443256", "genre": "Science Fiction & Fantasy", "title": "1: Planetary Domination: The Blemockian Chronicles (Volume 1)", "description": "One thousand years after the Old Wars had ended, a Second War has begun that will be far greater than any other and will reshape the very foundation of the Adorious Galaxy. The noble and imperialistic humanoids known as the Blemockians that have lived in peace for a thousand years had their very existence suddenly threatened with war. An unlikely jetball superstar, Brock Laizender, rises to the challenge against the alienoid corruption that is exploding into an unbridled mobocracy across the Nine Sectors. To regain tranquility, they will have to reunite once more with their longstanding allies, the Cryanids, to restore peace throughout the Pea’Agrus Sector. Lord Quatarroe, the emerging dictator of the evil Sorkian Empire, has now joined the mysterious Illvexx Collective. They are instilled with an extreme loathing toward the Blemockians and their potential; fearing them as they think the humans are far too reckless. Lord Quatarroe plans to wipe out all the Blemockians and their allies, but all will soon find out there is something far greater at stake. An ancient prophecy of the Universe will soon be unveiled and forever change all things in existence…"}, {"id": "B006ARUEYE", "genre": "Science Fiction & Fantasy", "title": "Initiation Rites: The Bones of the Earth, Part 1 (The Dark Age)", "description": "The Dark Age. The Earth has turned on humanity with earthquakes, volcanic eruptions and a new plague that kills the Roman Emperor himself. Barbarian invasions shatter civilizations. In this chaos, Javor comes of age in a poor, remote village. Try as he might, though, he never fits in with his own people. There is just something about him that keeps him apart from the others. When barbarian raiders kidnap the girl he loves, he takes a mysterious dagger handed down from his great-grandfather and tries to rescue her. But while he's away, a horror that Javor could never believe existed murders his parents and devastates his village.Javor begins his quest for revenge, not realizing that he is entering a war against forces bent on eliminating humanity."}, {"id": "0062218867", "genre": "Science Fiction & Fantasy", "title": "Snuff (Discworld)", "description": "At long last, Lady Sybil has lured her husband, Sam Vimes, on a well-deserved holiday away from the crime and grime of Ankh-Morpork. But for the commander of the City Watch, a vacation in the country is anything but relaxing. The balls, the teas, the muck—not to mention all that fresh air and birdsong—are more than a bit taxing on a cynical city-born and -bred copper.Yet a policeman will find a crime anywhere if he decides to look hard enough, and it's not long before a body is discovered, and Sam—out of his jurisdiction, out of his element, and out of bacon sandwiches (thanks to his well-meaning wife)—must rely on his instincts, guile, and street smarts to see justice done. As he sets off on the chase, though, he must remember to watch where he steps. . . . This is the countryside, after all, and the streets most definitely are not paved with gold."}, {"id": "1555601294", "genre": "Science Fiction & Fantasy", "title": "Mechwarrior: The Battletech Role-Playing Game (2nd Edition)", "description": "Very Good in Wraps; 4to;  Paperback; 165 pages + advertisements; B/W & Color Illustrations; Fasa Corporation; 1991; First Thus; Minor shelf wear to spine and wraps; Text unmarked; text smells of smoke."}, {"id": "0451529014", "genre": "Science Fiction & Fantasy", "title": "The Black Jewels: Trilogy: Daughter of the Blood / Heir to the Shadows / Queen of the Darkness", "description": "From the New York Times bestselling author of the Novels of the Others comes the award-winning Black Jewels trilogy—Daughter of the Blood, Heir to the Shadows, and Queen of the Darkness—together in one volume for the first time!Anne Bishop’s critically-acclaimed Black Jewels Trilogy is the saga of one young woman’s destiny played out against the backdrop of three powerful realms...Seven hundred years ago, a Black Widow witch saw an ancient prophecy come to life in her web of dreams and visions.   Now the Dark Kingdom readies itself for the arrival of its Queen, a Witch who will wield more power than even the High Lord of Hell himself. But she is still young, still open to influence—and corruption.   Whoever controls the Queen controls the darkness. Three men—sworn enemies—know this. And they know the power that hides behind the blue eyes of an innocent young girl. And so begins a ruthless game of politics and intrigue, magic and betrayal, where the weapons are hate and love—and the prize could be terrible beyond imagining...Includes an Introduction by Anne Bishop"}]