[{"id": "1532110545", "genre": "Children's Books", "title": "Venezuela (Explore the Countries)", "description": "Welcome to Venezuela - home of the world's highest cable car and South America's largest natural lake! Maps, a timeline with photos, and fun facts complement the text. The book closes with a facts page including Venezuela's population and total area, as well as images of the country's flag and currency. Students will find valuable report information while exploring Venezuela! Table of contents, glossary with phonetic spellings, and index included. Aligned to Common Core Standards and correlated to state standards. Big Buddy Books is an imprint of Abdo Publishing, a division of ABDO."}, {"id": "1941367496", "genre": "Children's Books", "title": "I Can Do That! Cut & Paste", "description": "Tiny hands can turn torn paper scraps into spectacular art with this unique, colorful activity book!This beautiful, thoughtfully designed book, provides the prompts and the materials for making striking collages. Children as young as 3 can cut (or tear) and paste colorful scales onto a school of fish, petals onto a bouquet of flowers, feathers onto birds, and more clever, pretty projects that also build fine motor skills."}, {"id": "1448825741", "genre": "Children's Books", "title": "Let's Throw a St. Patrick's Day Party! (Holiday Parties)", "description": "You don’t have to be Irish to enjoy St. Patrick’s Day. This book will help young readers throw a fun party that celebrates Irish culture but is fun for all. Ideas and instructions for crafts and activities, such as a scavenger hunt where partygoers follow the clues to find the pot of gold, will ensure guests get into the party spirit. Plus, the host or hostess will learn important life skills, such as planning and organization. Erin Go Bragh!"}, {"id": "B00KBEBX1A", "genre": "Children's Books", "title": "Bim and Bom (Revised Edition): A Shabbat Tale", "description": "Bim, a builder, and her brother Bom, a baker, live on opposite sides of town. All week long they work hard but when Shabbat comes, they celebrate the day together. A warm story of village life inspired by the well known song “Shabbat Shalom.” Song notes and lyrics included."}, {"id": "1681445123", "genre": "Children's Books", "title": "Air (Blue)", "description": "Last year, one amazing summer was enough to turn Iris's world upside down. She met the boy of her dreams, the super talented Zeke, and the two of them set off on a pro-surfing adventure around the globe.Now, one week in Miami could be enough to tear her life apart.When Iris and Zeke take a break from competitions to relax on South Beach, Iris feels more than just the draw of the surf pulling Zeke away from her. Something's not right, and soon Iris will have to decide if she and Zeke are really the best thing for each other after all.Air is the thrilling follow-up to Blue; a gorgeous story of sun, sea and first love."}]