[{"id": "B077MFYXFQ", "genre": "Science Fiction & Fantasy", "title": "Find Them: an apocalyptic survival thriller (180 Days and Counting... series Book 6)", "description": "Word of survivors reaches Cady. Can she brave the rotting world to find her family?This journey isn’t over yet! Find out just how far into the end of the world you can go!***BR Paulson Books***180 DAYS AND COUNTING… SERIESNo Time, bk 1Last Chance, bk 2Hold On, bk 3Too Late, bk 4Look Away, bk 5Find Them, bk6Try Hard, bk 7Move On, bk 8Fit In, bk 9Death Days, bk 10Long Gone, bk 11No More, bk 12WORTH OF SOULS SERIESCost of Survival, bk 1Exchange Rate, bk 2Worth of Souls, bk 3BoxSet books 1 - 3INTO THE END SERIESInto the End, bk1Through the Flames, bk 2Out of the Ashes, bk 3BoxSet books 1 - 3BARELY ALIVE SERIESBarely Alive, bk 1Falling Apart, bk 2Mostly Dead, bk 3Viral IntentBoxSet books 1 - 4MEMOIRS OF A CANNIBAL SERIESMemoirs of a CannibalCannibal HolidayCooking with the CannibalCannibal CookBookKeeping up with the Cannibals"}, {"id": "1612642063", "genre": "Science Fiction & Fantasy", "title": "The Mountain & The Vortex: and Other Tales", "description": "Twelve stories of dark futures and odd imaginings to catch your breath and unhinge your mind: these stories deliver what Marianne Moore called, “Imaginary gardens with real toads.” Though “The Mountain and The Vortex” - the novella that gives this collection its name - is a complex tale, intricately interlaced with historical allusions and genre-jumping subplots, it remains imminently readable. These are the works of a true storyteller, and are accompanied by seventeen mind-bending illustrations by masters of the craft.   Séquanon flew backward in time and crashed into the eye of God.   The impact sent him swinging wildly in his hammock. The instrument panels went blank and a moment later displayed data that made no sense. The stasis generators had disengaged before he’d reached his destination. Drones deployed and transmitted exterior views to the monitors. It appeared that his ship had lodged in the side of a mountain... "}, {"id": "B077CB29YZ", "genre": "Science Fiction & Fantasy", "title": "Weather Menders", "description": "What if Time Travel were real? What if Time Travelers from 300 years in the future told you that there was a chance that you could prevent catastrophic climate change, plagues, and wars by going back in time to key Pivot Points and ethically altering the outcome of rigged elections? What if failure would result in the destruction of the biosphere? Would you go?In post-plague 2050 Britain, palm trees tower over the rice paddies of Stonehenge. Tara MacFarlane, a weary 96-year-old anthropologist originally from Taos, New Mexico, longs only to finish out her life in peaceful Buddhist meditation, and rejoin the great love of her later years, the humanitarian Scottish-Afghan doctor Xander, in a future incarnation. Suddenly one stifling autumn day Tara, her great-granddaughter Leona, and Leona’s boyfriend Janus are faced with a trio of Time Travelers from a future alternate Timeline where humanity and the eco-system survived and thrived. The fate of Earth’s biosphere falls squarely on the shoulders of Tara, Leona, Janus, and Tara’s small gray cat, Georgie, who shows a surprising aptitude for telepathy. Time is short to reverse catastrophe that will bleed through into the alternate Timeline, and the Time Travelers must first determine the ideal Pivot Points by reading Time Code vibrations off the great standing stones of Avebury.  Unexpectedly joined by the brave and wise cat Georgie, the six plunge into the Time Circle of Stonehenge on their mission. Where and when will they go, and will they succeed in restoring the Earth and humanity to balance?"}, {"id": "145493011X", "genre": "Science Fiction & Fantasy", "title": "Daredevil Psychology: The Devil You Know", "description": "An in-depth analysis of the psychology behind the popular character Daredevil. In the early 1960s, Stan Lee and company revitalized the comic book market by imbuing new characters and their stories with human, emotional depth lacking in other superheroes. Among those creations was the character Daredevil. Now this superhero is the subject of 20 essays that explore different facets of his psychology, including:The risk-taking behavior that earned Daredevil his nameThe pathology of stalking, obsession, and mental manipulationThe process of “othering” in regards to disabilityThe question of justice versus revenge—with asides related to the assassin Elektra"}, {"id": "0692361081", "genre": "Science Fiction & Fantasy", "title": "Tamberlin's Account: Artifact Edition", "description": "Tamberlin's Account: Artifact Edition is the journal of a woman's physical and psychological journey during a zombie apocalypse - a frightening and heartbreakingly realistic portrayal of one woman's efforts to survive in a world where there is very little left to live for. This is not your average zombie apocalypse novel - be prepared for an unflinching first person account of mankind's last days. READ HER DIARY - LIVE THE NIGHTMAREThis Artifact Edition takes the survival journal to awful bloody realism."}]