[{"id": "0553565079", "genre": "Science Fiction & Fantasy", "title": "Forward the Foundation", "description": "A stunning testament to his creative genius. Forward The Foundation is a the saga's dramatic climax -- the story Asimov fans have been waiting for. An exciting tale of danger, intrigue, and suspense, Forward The Foundation brings to vivid life Asimov's best loved characters: hero Hari Seldon, who struggles to perfect his revolutionary theory of psychohistory to ensure the survival of humanity; Cleon II, the vain and crafty emperor of the Galactic Empire,"}, {"id": "1560768266", "genre": "Science Fiction & Fantasy", "title": "Fighter's Challenge II (Advanced Dungeons & Dragons, 2nd Edition)", "description": "Fighter's Challenge II is a special ONE-ON-ONE ADVANCED DUNGEONS & DRAGONS adventure designed for a DUNGEON MASTER and one player - perfect for very small groups, for those times when the whole group can't get together, and for the player who wants his or her character to earn some extra experience while playing the role of a knight errant."}, {"id": "1555603165", "genre": "Science Fiction & Fantasy", "title": "Classic Battletech: Field Manual: Free Worlds League (FAS1699)", "description": "Spared from the ravages of the Clan invasion, the Free Worlds League flourished as an arms supplier to the embattled legions of the Inner Sphere. Captain-General Thomas Marik patiently guided the Free Worlds League Military through a long-overdue reformation as the troops of his Great House rivals battled the invaders. Bolstered by the League's powerful military-industrial complex, the FWLM now stands as one of the largest and best-equipped forces in the Inner Sphere. This classified field manual, seized from the League's intelligence organization, reveals the inner workings of the FWLM, from the humble Marik Militia to the elite Knights of the Inner Sphere. An invaluable resource for both allies and enemies of the League, the BattleTech Field Manual: Free Worlds League provides a complete survey of House Marik's military. The manual includes dossiers that describe the history, officers and tactics of all FWLM BattleMech® regiments; special rules that reflect the unique capabilities of each regiment; new weapons, equipment, exclusive FWLM BattleMechs and more."}, {"id": "1556344805", "genre": "Science Fiction & Fantasy", "title": "Traveller Deck Plan 2 Modular Cutter (v. 2)", "description": "This set includes 8 two-sided maps . . . the 50-ton modular cutter itself and seven different modules: Class I starport, expandable base, laboratory, medical, prison transport, safari, and survey.\n\nAlso included is a sheet of all-new Traveller Cardboard Heroes miniatures, created specifically for this set."}, {"id": "1588460924", "genre": "Science Fiction & Fantasy", "title": "Players Guide to the Wilderlands (Sword and Sorcery D20)", "description": "Whether a veteran Judges Guild fan or a new player just-now discovering the Wilderlands, you'll find plenty of adventure in this landmark fantasy setting. The Wilderlands of High Fantasy: Players Guide provides you with everything you need to begin a campaign in the epic Wilderlands, including the classic City State of the Invincible Overlord! The Players Guide has details on everything in the Wilderlands, from key cities and geographic features to important groups and organizations. You also get information on monsters and even gods that are unique to the setting. Notes on the City State of the Invincible Overlord and surrounding region and a large color fold-out map give you everything you need to start your own Wilderlands campaign!"}]