[{"id": "163471282X", "genre": "Children's Books", "title": "Goby Fish and Pistol Shrimp (21st Century Junior Library: Better Together)", "description": "The Better Together series presents an introductory look at some of nature's most exciting cooperative pairs. Goby Fish and Pistol Shrimp explores the close mutualistic relationship between the two aquatic creatures. Sidebars encourage readers to engage in the material by asking deeper questions or conducting individual research. Full color photos, a glossary, and a listing of additional resources all enhance the learning experience."}, {"id": "B00S48ZUT6", "genre": "Children's Books", "title": "The Fox and the Grapes Nakka mariyu drākṣalu  : Children's Picture Book English-Telugu (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week. Nakka konni rucikaramaina drākṣa ākalitō mariyu kaḷḷu undi. Nakka ī drākṣa ponduṭaku maḷlī maḷlī prayatnistundipoḍigin̄cina nakka verṣan mariyu āsaktikaramaina panulanu nakka drākṣaprayatnin̄caṇḍi mariyu drākṣa pondaḍāniki. Vāraṁ rōjula bōdhistundi."}, {"id": "1515798194", "genre": "Children's Books", "title": "Becoming an Astronaut (An Astronaut's Life)", "description": "What does it take to become an astronaut? How do astronauts train to be in outer space? Readers will learn all about what it's like to become an astronaut. Low-leveled, chunked text alongside stunning photographs will engage the youngest space enthusiasts."}, {"id": "1526301024", "genre": "Children's Books", "title": "Generation Code: I'm an Advanced Scratch Coder", "description": "I'm an Advanced Scratch Coder is perfect for those who have mastered the basics of Scratch, and want to try building some more tricky programs before progressing to real-world coding languages. Try writing thirteen different programs in Scratch, and get to grips with key coding concepts like loops, variables and functions.The Generation Code series is a hands-on guide to computer coding, designed to train you in the coding languages used by real-world computer programmers. You'll discover how to code exciting programs, web pages, apps and games, and learn how the tools and functions you're using can be applied to other situations.Other books in the Generation Code series:I'm a Python ProgrammerI'm an HTML Web Page BuilderI'm an App DeveloperI'm a JavaScript Games Maker: The BasicsI'm a JavaScript Games Maker: Advanced Coding"}, {"id": "1542773873", "genre": "Children's Books", "title": "Filly's Day on the Farm: \"Animal Sounds\" with Filly the Dutch Warmblood (A Stableton Adventure) (Volume 1)", "description": "From English Minter’s “Stableton Adventure” series, imaginative hand-drawn and watercolor painted farm animals come to life as you teach your little one about the delights of Filly’s Day on the Farm. Gallop through the pages with Filly the Dutch Warmblood pony and your child as they learn about all the baby farm animals and the adorable sounds they make. The bright colors and animated scenes make it the perfect gift for baby showers, as well as a meaningful addition to any young child’s library."}]