[{"id": "0786820748", "genre": "Children's Books", "title": "Bone Man: A Native American Modoc Tale", "description": "Told by his grandmother from an early age about his destiny to defeat the Bone Man and bring water back to his village, young Nulwee lives in fear of the moment when he will have to confront his dreaded enemy."}, {"id": "1681570947", "genre": "Children's Books", "title": "All About Stephen Hawking (All About...People)", "description": "As an Oxford student, Stephen Hawking never expected that people across the world would know his name, or that his hobby of stargazing would lead him to be one of the world’s greatest scientists. Stephen Hawking made cosmology, or the study of the universe, accessible to everyone.  He was diagnosed with amyotrophic lateral sclerosis at the age of twenty-one, but didn’t let that stop him from receiving a graduate degree from Cambridge and going on to be an expert in the scientific origin of the universe and black holes.  Hawking is best known for writing A Brief History of Time, which explained cosmology in non-scientific terms so that non-scientists could understand it.  "}, {"id": "0778753891", "genre": "Children's Books", "title": "Fungi: Mushrooms, Toadstools, Molds, Yeasts, and Other Fungi (A Class of Their Own)", "description": "Looks at the fungus kingdom, providing information and examples of species from the major groups of fungi, as well as case histories involving certain fungi and how they have affected man."}, {"id": "162031892X", "genre": "Children's Books", "title": "Needs and Wants (Bullfrog Books: Money Smarts)", "description": "In Needs and Wants, early readers learn the difference between a want and a need. Vibrant, full-color photos and carefully leveled text will engage early readers as they discover basic economic principles."}, {"id": "0736436057", "genre": "Children's Books", "title": "I Am a Princess (Star Wars) (Little Golden Book)", "description": "Read all about brave Princess Leia, hero of the Rebel Alliance, as she joins forces with Luke Skywalker and Han Solo to battle Darth Vader and the evil Galactic Empire! Featuring stunning retro illustrations, this book is perfect for Star Wars—and Little Golden Book—fans of all ages."}]