[{"id": "1533202672", "genre": "Children's Books", "title": "Oakey's World of Colors", "description": "Oakey is a happy young oak tree in a forest until his world suddenly changes. Strange sounds fill the once quiet forest. Uncertain of his future, he is confused when a pink ribbon is tied around his trunk. Oakey soon finds he is in a new place full of changes, new sounds and colors."}, {"id": "B06XDRXZZ5", "genre": "Children's Books", "title": "The adventures of Griggle Bear: Griggle Bear goes camping", "description": "The Adventures of Griggle Bear, a set of four short picture books aimed at children of primary school age. The books tell the story of the adventures of Griggle Bear and his two special friends, Fredbear and Harry the Hungry HittamapotamasaurusIn each of the stories, which have a gentle moral tale, I have incorporated the same characters in different guises to create continuity and using humour and fun, have created a framework from which to learn. All four books are fully illustrated with alternate pages and each book is formatted exactly the same way."}, {"id": "1493181750", "genre": "Children's Books", "title": "African-American Sons and Daughters of Bethania, N.C.", "description": "African American Sons and Daughters of Bethania, North Carolina traces the history of the original freedmen and their descendants in this small North Carolina community. Using interviews, letters, photographs and historical documents, it tells the story of how a newly freed people built their community following the Civil War. Their place of worship, originally established as a Black Moravian Church, joined the African Methodist Episcopal Zion denomination. Community members with meager resources went about the business of educating their children, creating self-help societies, building their own homes and developing and displaying their agricultural and homemaking skills. From its humble origins an economically self-sufficient community developed that would send forth many of its descendants to higher education and successful careers."}, {"id": "0374327874", "genre": "Children's Books", "title": "Grierson's Raid: A Daring Cavalry Strike Through the Heart of the Confederacy", "description": "\"The most brilliant expedition of the Civil War.\" --General William Tecumseh Sherman In 1863 Union colonel Benjamin H. Grierson was chosen for a secret mission: to lead three regiments of horsemen and a battery of artillery -- seventeen hundred men in all -- on a slashing raid through the state of Mississippi. Their objective was to damage a major Confederate rail line, spreading alarm and destroying enemy supplies in the process. Union leaders were relying on Grierson to provide cover as they moved thousands of troops into position for a major and ultimately victorious assault on Vicksburg, the South's vital transportation hub on the Mississippi River. Owing to Grierson's shrewd tactics, as well as luck and the skilled soldiering of his men, the raid was wildly successful in every respect.Here is an exciting day-by-day account of this grueling sixteen-day adventure, which weaves together several first-person accounts from Grierson and his soldiers themselves and is heavily illustrated with maps and period photographs."}, {"id": "B006ZG9NV0", "genre": "Children's Books", "title": "14 Fun Facts About Bamboo: A 15-Minute Book (15-Minute Books 86)", "description": "A lot of people think that bamboo is a tree because it grows so tall. It also has a trunk with leaves and branches sprouting from it.Bamboo is not a tree, it is a grass. Scientists have found that it has much more in common with the lawn in front of your house than it does with any trees growing in the forest.Which is stronger, a pound of bamboo or a pound of steel?How does bamboo spread?When a bamboo plant fruits, why does it bring starvation to the surrounding area?How fast can bamboo grow?Find out more about this amazing plant, and surprise your family and friends with these fun facts.All measurements in American and metric.LearningIsland believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Many books are appropriate for hi-lo readers. Open the world of reading to a child by having them read for 15 minutes a day."}]