[{"id": "1512431192", "genre": "Children's Books", "title": "Cristiano Ronaldo (Sports All-Stars)", "description": "Cristiano Ronaldo is a superstar soccer player for Spanish club Real Madrid. In 2015 he became the leading scorer in Champions League history with a career record 76 goals. He has claimed four Golden Shoe awards as the top goal-scorer in European soccer. Though many know him for his skills with a soccer ball, Ronaldo also has an active life off the field. Learn all about his journey to the top of the soccer world, how he stays fit, his fashion and modeling career, and much more."}, {"id": "1426329881", "genre": "Children's Books", "title": "Explore My World: Lions", "description": "In this charming picture book for pre-schoolers, curious kids will learn all about the wild world of lions--one of nature's most fascinating and charismatic creatures.Readers learn how lions communicate, what they eat, and how they play. A habitat map also shows where they live around the world. These engaging Explore My World picture books, on subjects kids care about, combine simple stories with unforgettable photography. They invite little kids to take their first big steps toward understanding the world around them and are just the thing for parents and kids to curl up with and read aloud."}, {"id": "1512483044", "genre": "Children's Books", "title": "Mini Horses (Lightning Bolt Books)", "description": "Clomp! Clomp! Mini horses are lovable and make good pets. But do you know how often they need to eat? Or if you can ride a mini horse? Read this book to learn all about these strong, active pets!"}, {"id": "1628321954", "genre": "Children's Books", "title": "AC Milan (Soccer Champions)", "description": "A chronicle of the people, matches, and world events that shaped the European men's Italian soccer team known as AC Milan, from its founding in 1899 to today."}, {"id": "1682973360", "genre": "Children's Books", "title": "Seashore Watcher (Watcher Guide)", "description": "Find out everything there is to know about the seashore, such as what causes the tides, what sand is made up of and how pebbles are formed. Seashore Watcher includes everything from rock pooling tips, to a recipe for seaweed jelly as well as plenty of other creative ideas to try out by the sea.What better time than right now to learn about what lives in different habitats at the coast? What lives on the beach? What about in the shallow water? What are you waiting for, head out to the sea and be amazed!"}]