[{"id": "1405281642", "genre": "Children's Books", "title": "The Last Kids on Earth and the Zombie Parade", "description": "Wimpy Kid meets The Walking Dead in this hilarious post-apocalyptic graphic novel series. Jack Sullivan is back. It's still TOTAL MONSTER ZOMBIE CHAOS on the streets, but now Jack has a gang of friends to help him through - science genius and best friend Quint, super-strong Dirk and all-round coolest girl ever, June. Not to mention Rover, Jack's awesome monster pet! Plus the treehouse is more souped up than ever, chockablock with defensive gizmos and ready to withstand anything that the monster apocalypse can throw at it. Which is just as well, because there's something extra-big and extra-monstrous marching right around the corner...\"Terrifyingly fun! Max Brallier's The Last Kids on Earth delivers big thrills and even bigger laughs.\" (Jeff Kinney, author of Diary of a Wimpy Kid). This is the second book in a hilarious new monster adventure series. With fresh, funny illustrations on every page, this is perfect for fans of comics and graphic novels aged 8 and over."}, {"id": "1496555783", "genre": "Children's Books", "title": "The Iliad (Classic Fiction)", "description": "After ten years of siege by Greek forces, the walls of Troy remain intact. Only the intervention of the greatest warrior of all time, Achilles, can tilt the balance in favor of the invaders. On the Trojan side, Prince Hector is the only one who can face him. This is the story of the greatest war of all time. The war that brought all the heroes of ancient Greece together and turned them into immortal legends. It is the war that made the gods of Olympus face each other, due to their envy and vanity. This is the Trojan War."}, {"id": "1519662025", "genre": "Children's Books", "title": "A Blue Chair Christmas", "description": "Join Hannah Kate, The Princess of Peachtree, a little \"special needs\" girl, and her two new friends...Sandy and Burt, two fun-loving seagulls, as she magically travels the world to see how other kids celebrate Christmas. Along the way, she learns a little about herself and why her \"special needs\" makes her special to the world. It's a great story for kids of all ages. It will make the perfect bedtime story for the twelve days leading up to Christmas."}, {"id": "1785089161", "genre": "Children's Books", "title": "My First Bilingual Book–Sharing (English–Japanese)", "description": "Guaranteed to enrich a toddler's vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting more complex concepts that go beyond colors and numbers, titles in the series feature animals, fruit, home, and vegetables. This collection combines photographs, bright illustrations, and dual-language words in clear, bold text. Suitable for both individuals and groups, these books are a child's perfect introduction to exploring other cultures."}, {"id": "1772753270", "genre": "Children's Books", "title": "Disney/Pixar Cars Comics Treasury (Disney Pixar Comics Treasury)", "description": "Zoom through this giant collection of Disney•Pixar Cars comics with Lightning McQueen, Mater, Sally, and more of your favorite quirky characters! Drawn by Disney's master artists, this 800-page comic treasury is perfect for fans who can't wait for Disney•Pixar Cars 3 to hit the big screen in the summer of 2017."}]