[{"id": "0375833870", "genre": "Children's Books", "title": "One Fish, Two Fish, Three, Four, Five Fish (Dr. Seuss Nursery Collection)", "description": "Five fish-shaped beads that move across the top of this sturdy board book allow toddlers to count along as they this adorable book based on the classic Beginner Book One Fish Two Fish Red Fish Blue Fish! Safety-tested for children of all ages, the bright colors and interactive elements will make this a hit with little fish-lovers everywhere!   The Dr. Seuss Nursery Collection introduces the most beloved Dr. Seuss characters to the littlest of listeners. Based on Dr. Seuss’s signature art and rollicking rhymes, each book introduces the most popular characters of the title on which it’s based in a bold and simple format, which will engage babies and toddlers at each stage of development."}, {"id": "B073V5XX37", "genre": "Children's Books", "title": "The Nervous System (Wonders of the Human Body)", "description": "Come explore this in-depth examination of the body’s master control mechanism, the nervous system!The third volume of the Wonders of the Human Body series is the next step in our journey though the most amazing thing in the universe, the human body. Our nervous system must process vast amounts of information each second, information that comes from all parts of the body. Then nerve signals are sent out in response to those inputs. If this sounds simple, rest assured, it is not. It is all quite extraordinary! But as with all things in our fallen cursed world, things do go wrong. We will also explore the problems that occur when the nervous system is damaged by disease or injury.In The Nervous System, you will learn about:- How nerve signals are generated throughout the body- How these nerve signals are transmitted to and from the brain- The structure of the brain and how it processes input from the body- Our senses: sight, hearing, taste, and moreWhen you see the incredible complexity of the nervous system, you will realize that our bodies cannot be the result of chemical accidents occurring over millions of years. The human body is the greatest creation of an all-knowing Master Designer!"}, {"id": "1439539154", "genre": "Children's Books", "title": "Afghanistan (Witness to History)", "description": "Step back to the time of the wars in Afghanistan and see history through the eyes of those who lived it. Find out about life in the city of Kabul during the fighting of the early 1990s. Read about the importance of reconstructing the country so that the people can live peacefully without the constant threat of war. Age 12+."}, {"id": "148252709X", "genre": "Children's Books", "title": "Young Knights of the Round Table: The King's Ransom", "description": "Action AdventureTales & Legends from the Ancient & Medieval Worlds. Answer the hero's call to Adventure with the Young Knights of the Round Table on their Quest. Three friends. Three quests. Three mysterious predictions.In medieval Wales, eleven-year-old Prince Gavin, thirteen-year-old orphan Philip, and fifteen-year-old blacksmith's apprentice Bryan are brought together in friendship by one they call the Wild Man. When an advisor to the king is killed and a jewelled medallion is stolen from the king's treasury, the Wild Man is accused of the theft and murder. Filled with disbelief at the arrest of the Wild Man, the three friends embark upon a knight's quest to save their friend's life. To succeed, the three must confront their fears and insecurities, and one of them will have to disclose the biggest secret of all. Join Gavin, Philip, and Bryan on their quest and share the adventures that await them in the land of King Arthur and his Knights of the Round Table."}, {"id": "1589808398", "genre": "Children's Books", "title": "Henriette Delille: Rebellious Saint", "description": "Born in 1812, free woman of color Henriette Delille resisted her family's efforts to steer her toward a traditional life as the mistress of a white man. Instead she pursued a calling to care for slaves, the sick, and the poor, and established a religious community for women of color. As a result of her work, she is the first African-American candidate for canonization. This middle-reader historical novel offers a fascinating glimpse into her life and into the history and unique culture of the free people of color in New Orleans."}]