[{"id": "0143187562", "genre": "Children's Books", "title": "Unspeakable", "description": "Now in paperback, a heart-wrenching, beautifully written account of a forgotten maritime tragedy that rivals the Titanic disaster, for readers of Ruta Sepetys and Elizabeth Wein.On her first voyage as a stewardess aboard the Empress of Ireland, Ellie is drawn to the solitary fire stoker who stands by the ship's rail late at night, often writing in a journal.     Jim. Ellie finds it hard to think of his name now. After their wonderful time in Quebec City, that awful night happened. The screams, the bodies, the frigid waters ... she tries to tell herself that he survived, but it's hard to believe when so many didn't.     So when Wyatt Steele, journalist at The New York Times, asks her for her story, Ellie refuses. But when he shows her Jim's journal, she jumps at the chance to be able to read it herself, to find some trace of the man she had fallen in love with, or perhaps a clue to what happened to him. There's only one catch: she will have to tell her story to Steele and he'll \"pay\" her by giving her the journal, one page at a time."}, {"id": "0679882820", "genre": "Children's Books", "title": "Mr. Brown Can Moo, Can You : Dr. Seuss's Book of Wonderful Noises (Bright and Early Board Books)", "description": "Kids will love this noise-filled Bright and Early Book classic from the  one and only Dr. Seuss! Mr. Brown is a sound-making wonder! He can hoo hoo like an owl and buzz buzz like a bee. It is so much fun to make noises that you hear every day, like moo and tick-tock. But stranger sounds are fun to make, too . . . like the pip of a goldfish kiss and the grum grum of a hippo chewing gum. Encouraging imaginative play while learning to read, Mr. Brown Can Moo! Can You? will keep kids laughing (when they’re not tick-tocking). Combining  brief and funny stories, easy words, catchy rhythm, and lively  illustrations, Bright and Early Books are an ideal way to introduce the  joys of reading to children."}, {"id": "B01MUDRSK0", "genre": "Children's Books", "title": "Zoey's First Plane Ride", "description": "Zoey and her parents are off to visit grandma!  Join Zoey as she takes her first plane ride and learns the steps required for traveling through the airport."}, {"id": "1467783099", "genre": "Children's Books", "title": "Native Peoples of the Plateau (North American Indian Nations)", "description": "When explorers and traders moved west across the United States in the 1800s, they found many nations of American Indians already living in the Plateau region near the Columbia River. These nations had their own languages and governments, and they were experts at living in this land surrounded by mountains and filled with rivers. The Nez Perce could catch salmon with their bare hands. The Modoc wore woven skullcap basket hats. The Kootenai made paintings on huge rocks and cliffs using red ocher and fish eggs. Many Plateau Indians still live in this region. They work in a variety of industries, from fishing and logging to hospitality. Read more about the history and culture of the native peoples of the Plateau."}, {"id": "1495208508", "genre": "Children's Books", "title": "A Crown For Big Tuna", "description": "This is a new endeavor for me. One that I found I like. It all came about because my son lost his wedding ring in the Bay. This incident created my story. I felt so sad for my son. I thought this book might lighten his sad feelings. My story began with a fact and became a whimsical tale. My story takes place under the sea. It is a tale of sea life looking for the ring which will be a crown for Big Tuna."}]