[{"id": "1681522152", "genre": "Children's Books", "title": "Bats (Spot)", "description": "Introducing emergent readers to vocabulary has never been so fun! This series includes a search-and-find feature that's perfect for engaging even the youngest readers. From geckos to owls, Backyard Animals utilizes captivating photos to teach kindergarteners new words and simple facts about animal habitats, body parts, and behaviors. This search-and-find book invites emergent readers to look for new vocabulary words and pictures while giving simple facts about a bat's habitat, body parts, and behaviors."}, {"id": "B00HOHMRDU", "genre": "Children's Books", "title": "My Body...His Temple a Bible study for 9-12 year olds on purity", "description": "A personal Bible study for 9-12 year olds teaching them why purity is important and what the Bible says about living a pure life."}, {"id": "0618065679", "genre": "Children's Books", "title": "Curious George Takes a Train", "description": "Curious George heads to the train station to take a trip with the Man with the Yellow Hat, but when he tries to help out the station master, he gets himself into trouble. George finds himself a hiding place\u0097only to discover that his help is really needed when a little boy’s toy train is about to fall onto the tracks. NEW on inside and back covers: connect-the-dots, fun facts, and telling time activities."}, {"id": "0439996414", "genre": "Children's Books", "title": "Rickety Hall", "description": "High on a hill, half hidden by trees and snow, lies Rickety Hall. No one knows who lives there and no one ever goes there. That is until the night Jonas Jones does."}, {"id": "191123840X", "genre": "Children's Books", "title": "The Story of Jesus (Classics Illustrated)", "description": "A retelling of the story of the life of Jesus Christ. Classics Illustrated tells this wonderful tale in colorful comic strip form, offering an excellent introduction for younger readers. This edition also includes a biography of Anna Sewell, theme discussions and study questions, which can be used both in the classroom and at home to further engage the reader in the story. The Classics Illustrated comic book series began in 1941 with its first issue, Alexandre Dumas’s \"The Three Musketeers\", and has since included over 200 classic tales released around the world. This new CCS Books edition is specifically tailored to engage and educate young readers with some of the greatest works ever written, while still thrilling older readers who have loving memories of this series of old."}]