[{"id": "0737738626", "genre": "Children's Books", "title": "Ken Kutaragi: PlayStation Developer (Innovators (Kidhaven))", "description": "Details the life and career of Ken Kutaragi, including his early years at Sony in the 1980s, his decision to develop the gaming console PlayStation, and the future of the gaming console."}, {"id": "1563977362", "genre": "Children's Books", "title": "The Starry Night", "description": "On a summer day in Central Park, a boy meets a man named Vincent. He is a painter, and the picture on his old wooden easel shows the park's daffodils in all their yellow splendor. The painting captures the boy's imagination. Soon Vincent and the boy are exploring Manhattan, from Battery Park to Harlem, from Fifth Avenue to Greenwich Village. Vincent paints the city in bright and beautiful colors. Then one day he takes the boy to a museum. He leads him to a painting of a country village. No sooner does the boy recognize the painting as one of Vincent's than his friend disappears. But Vincent has left the boy a gift: the desire to paint a picture. Neil Waldman's special book, featuring stunning Van Gogh-inspired paintings of Manhattan, speaks to that part of a child that knows no limits—the imagination."}, {"id": "1626176493", "genre": "Children's Books", "title": "Mary Pope Osborne (Blastoff Readers. Level 4: Children's Storytellers)", "description": "Back in 1992, writer Mary Pope Osborne first invited readers to follow Jack and Annie into a tree house with magical books, and readers have been time traveling with these characters ever since! In this biography, elementary students will meet a talented literary travel agent."}, {"id": "1423178289", "genre": "Children's Books", "title": "The Thank You Book (An Elephant and Piggie Book)", "description": "Gerald is careful. Piggie is not.Piggie cannot help smiling. Gerald can.Gerald worries so that Piggie does not have to.Gerald and Piggie are best friends.In The Thank You Book!, Piggie wants to thank EVERYONE. But Gerald is worried Piggie will forget someone . . . someone important. "}, {"id": "0780778154", "genre": "Children's Books", "title": "Mystery on the Ice (Boxcar Children Special)", "description": "The Boxcar Children's first Winter Special combines the usual lively mystery with a heartwarming holiday story. In a subplot with holiday appeal, the Aldens welcome their new cousin, Sue Lee, whom cousins Joe and Alice have adopted from Korea. This edition includes 16 pages of activities, puzzles and games."}]