[{"id": "1934547727", "genre": "Science Fiction & Fantasy", "title": "Hero High, Revised Edition: A Mutants & Masterminds Sourcebook", "description": "Hero High was one of the most popular and sought after books in the history of Mutants & Masterminds―and now it’s returned for the game’s Third Edition! The book examines the genre of teen heroes (and villains), provides players and GMs with all the information they need to create characters and run games featuring teenaged heroes, and includes pages and pages of plot ideas and story hooks. Finally, Hero High includes information on the Claremont Academy, a private school for the “gifted,” and introduces a team of eight playable heroes―and their evil counterparts from a rival school known as the Elysian Academy. This Revised Edition updates and expands the original, making Hero High a must for any Third Edition Mutants & Masterminds campaign."}, {"id": "B01FPZJP46", "genre": "Science Fiction & Fantasy", "title": "Cloak Games: Shadow Jump", "description": "Nadia Moran is an illegal wizard, an expert thief, and an occasional killer.So robbing the mansion of the Elven noble Lord Castomyr should prove no challenge at all. Except another thief has an eye on Lord Castomyr's treasures, a thief with magical abilities Nadia does not understand. And unless Nadia outwits this master thief, she'll be the one left holding the bag...and among the Elves, the punishment for theft is death. ABOUT THE AUTHORStanding over six feet tall, USA Today bestselling author Jonathan Moeller has the piercing blue eyes of a Conan of Cimmeria, the bronze-colored hair of a Visigothic warrior-king, and the stern visage of a captain of men, none of which are useful in his career as a computer repairman, alas.He has written the DEMONSOULED series of sword-and-sorcery novels, and continues to write THE GHOSTS sequence about assassin and spy Caina Amalas, the COMPUTER BEGINNER'S GUIDE series of computer books, and numerous other works."}, {"id": "0385245629", "genre": "Science Fiction & Fantasy", "title": "1: The Supernatural Tales of Fitz-James O'Brien: Volume One: Macabre Tales", "description": "SUBJECT: \"A collection of 11 Macabre Tales by this Irish-born American who, from 1852 until his death from a wound during the Civil War (1862-1865), was the preeminent writer of horror stories of his time. PARTIAL CONTENTS: The Lost Room; The Child That Loved a Grave; The Diamond Lens; The Bohemian; Seeing the World; What Was it? A Mystery; A Dead Street; Jubal, the Ringer; and more.\""}, {"id": "B01BMWYOAQ", "genre": "Science Fiction & Fantasy", "title": "Angry Birds Star Wars 2: Game Guide, Walkthrough, Cheats, Download", "description": "Are you a fan of Angry Birds Star Wars 2? With our unofficial game guide, we can teach you how to master the game! Do you want to install and play the game on any phone, PC, or tablet? This guide will also help you install on the Kindle, Kindle HD, Kindle HDX, any Android phone/tablet, PC, Windows phone, Blackberry, or iPhone/iPad. Following this guide, you can get the game installed and begin playing right away, in as little as a few minutes! Help, tips, strategies, getting coins, walkthroughs, and the complete guide are also included with the order. Here are more details as to what is included when you purchase: How to download Angry Birds Star Wars 2 for free Secrets, tips, cheats, and tricks used by pro players Support for PC, iPhone, & Android Angry Birds overview & basic information A detailed overview of all bird types Step by step how to beat, get three stars, and get the high score for every level How to get three stars on every level and rank as the high score Achievements overview Treasure maps overview Bonus boxes overview Detailed, easy-to-follow, step-by-step instructions General game play strategies Plus much more! Disclaimer: This guide is not associated with, affiliated with, or endorsed by the game's creator or owner. We cannot guarantee that this specific title will be available for download on each and every platform mentioned. "}, {"id": "1770412921", "genre": "Science Fiction & Fantasy", "title": "2113: Stories Inspired by the Music of Rush", "description": "18 exhilarating journeys into Rush-inspired worldsThe music of Rush, one of the most successful bands in history, is filled with fantastic stories, evocative images, and thought-provoking futures and pasts. In this anthology, notable, bestselling, and award-winning writers each chose a Rush song as the spark for a new story, drawing inspiration from the visionary trio that is Geddy Lee, Alex Lifeson, and Neil Peart.Enduring stark dystopian struggles or testing the limits of the human spirit, the characters populating 2113 find strength while searching for hope in a world that is repressive, dangerous, or just debilitatingly bland. Most of these tales are science fiction, but some are fantasies, thrillers, even edgy mainstream. Many of Rush’s big hits are represented, as well as deeper cuts . . . with wonderful results. This anthology also includes the seminal stories that inspired the Rush classics \u0093Red Barchetta” and \u0093Roll the Bones,” as well as Kevin J. Anderson’s novella sequel to the groundbreaking Rush album 2112.2113 contains stories by New York Times bestselling authors Kevin J. Anderson, Michael Z. Williamson, David Mack, David Farland, Dayton Ward, and Mercedes Lackey; award winners Fritz Leiber, Steven Savile, Brad R. Torgersen, Ron Collins, David Niall Wilson, and more."}]