[{"id": "B077WJ5DF6", "genre": "Science Fiction & Fantasy", "title": "Leaving Earth Vol. 1 (Leaving Earth Omnibus)", "description": "When Grum Hewson leaves academia to head up the world's first dedicated antimatter production site, he is totally unprepared for what the business world is going to throw at him.From an incompetent boss to an ethically-challenged board of directors, Grum must negotiate his way through the treacherous waters of industry and commerce before this haphazardly lethal company does something that everyone is going to regret.On the way he tries to get antimatter power generation on a sound commercial footing, help the Space Division with setting up a lunar base, orbital platforms, and a Moon-Mars shuttle.Oh, he gets married and has a son. He does that, too. And that's never easy.The Leaving Earth series is a new addition following that style of high-tech, science-heavy, sci-fi which incorporates a dose of sardonic humour, as epitomised by the likes of Iain M Banks, Neal Stephenson, and Andy Weir."}, {"id": "1932564179", "genre": "Science Fiction & Fantasy", "title": "Classic Battletech: Map Set Compilation 2 (FPR35012)", "description": "Classic BattleTech? Map Set Compilation 2 contains 22 previously published maps for use with:  CLASSIC BATTLETECH, BATTLEFORCE? and AEROTECH 2?    Includes:  From Map Set 5:    Large Mountain #1  Large Mountain #2  Deep Canyon #1  Deep Canyon #2  Open Terrain #1  Open Terrain #2  Moonscape #1  Moonscape #2    From Map Set 6:    City (Downtown)  City (Residential)  City (Skyscraper)  City (Suburbs)  Wide River  Woodland  Box Canyon  BattleForce 2    From BattleForce 2:    Planetary Assault Map (1 & 2)    From BattleSpace:    BattleSpace (4)    The maps in this compilation have their terrain clearly marked on every hex. Each map is printed in full color"}, {"id": "1785654586", "genre": "Science Fiction & Fantasy", "title": "Infinite Stars", "description": "The one definitive anthology of space opera and military science fiction. Today's most popular writers produce all-new stories set in their most famous universes.The seductive thrill of uncharted worlds, of distant galaxies... and the unknown threats that lurk in the vastness of the cosmos. From Foundation to Lensman, Star Wars to Guardians of the Galaxy, space opera continues to exert its magnetic pull on us all.INFINITE STARSThis is the definitive collection of original short stories by many of today's finest authors, writing brand new adventures set in their most famous series. Herein lie canonical tales of the Honorverse, the Lost Fleet, Dune, Vatta's War, Ender Wiggin, the Legion of the Damned, the Imperium, and more.Also included are past masterpieces by authors whose works defined the genre, including a Miles Vorkosigan adventure, a story from the author of the Dragonriders of Pern, and a rare tale co-authored by the screenwriter for The Empire Strikes Back.Nebula and Hugo Award winners, New York Times bestsellers, and Science Fiction Grand Masters--these authors take us to the farthest regions of space."}, {"id": "1612960014", "genre": "Science Fiction & Fantasy", "title": "Ashes for Beauty", "description": "Lily Wright knew everything would change the night she gave her blood to save Gabriel Martin's life. Still, she wasn't prepared for all the complications loving a vampire would bring.  Now she is trying to balance the demands of her \"normal\" life as a doctoral student, daughter, and friend, while adjusting to the new normal - a boyfriend who is struggling to control his craving for her blood, a best friend who is more overprotective than ever now that he knows vampires really do exist, and - oh yeah - burgeoning psychic abilities that may end up being more deadly to her than the mysterious vampires who are out to kill Gabriel's sire, including anyone who might try to stand in their way.    In this continuation of the romance that began in Through A Glass Darkly, Lily and Gabriel fight to hang on to the beauty of their love, even as the world seems to be burning down around them."}, {"id": "078690139X", "genre": "Science Fiction & Fantasy", "title": "Spellbound: Thay, Aglarond, and Rashemen (AD&D/Forgotten Realms) [BOX SET]", "description": "The Spellbound Campaign Expansion boxed set contains: * A 128-page Campaign Guide to the three countries, including city maps and unique sites, new character kits, spells, magical items, and major NPCs. * Two 32-page adventures that immerse the PCs in the often-deadly power politics of the region. In Throne of Deceit the characters must defend Rashemen from a deadly invasion by Thayan wiardry. The Runes of Chaos sends adventurers into the heart of Thay itself to foil the mad schemes of the would-be Thayan conqueror Szass Tam. * A 16-page MONSTROUS COMPENDIUM booklet featuring twisted Thayan creations, the unpredictable nature spirits of Rashemen, and fearie creatures from the depths of Aglarond's magical Yuirwood. * Eight full-sized card sheets providing adventure hooks and encounter charts for the three realms, useful DM information, and player aids for the adventures. * Three full-color maps - two of the region, displaying greater detail than ever seen before, and one of Eltabbar, the capital city of Thay."}]