[{"id": "B00IEOTIUM", "genre": "Children's Books", "title": "Mice", "description": "The lights are out—and so are the impy house mice—in this delightful nighttime cat-and-mouse adventure.Could it be true that mice are…nice? That’s certainly what the cat thinks in this after-dark romp just perfect for young children. Featuring whimsical, comforting text and vibrant collage illustrations from Caldecott Honor medalist Lois Ehlert, this engaging story puts a fresh spin on the classic cat-and-mouse dynamic."}, {"id": "0060573856", "genre": "Children's Books", "title": "The Berenstain Bears Hug and Make Up", "description": "When everyone wakes up a bit grumpy, the mood in the Bear house is anything but happy. As the Bear family learns, though, sometimes laughter is all it takes to hug and make up!"}, {"id": "0310755379", "genre": "Children's Books", "title": "The Beginner's Bible My First Book of Prayers", "description": "The Beginner’s Bible® has been a favorite with young children and their parents since its release in 1989 with over 25 million products sold.The Beginner's Bible My First Book of Prayers helps young children discover that they can talk to God about anything from the beauty of creation to their friendships and emotions. Thankfulness, praise, and requests for God's help are all included.Sixteen sweet prayers, written with the child's daily experiences in mind, focus on important character traits such as caring and forgiveness. For each prayer, charming illustrations from The Beginner's Bible highlight a different Bible character or scene that illustrates the truth found in the prayer. Ideal gift for a new parent or young child, and a great addition to church or daycare library."}, {"id": "1404877088", "genre": "Children's Books", "title": "Lance Dragon Defends His Castle with Simple Machines (In the Science Lab)", "description": "Hey, dudes! Skateboarding is my thing, but when barbarians invade my castle, I have to defend myself. Watch me launch a water balloon with a lever and lower a key with a pulley. Roll with me and find out how simple machines simply rock!"}, {"id": "0544748026", "genre": "Children's Books", "title": "Hooray for Books!", "description": "Turtle has looked everywhere for his favorite book, but it's nowhere to be found! Maybe his book was borrowed by Zebra, Owl, Giraffe, Elephant, or Lion. As Turtle searches, his friends offer to share their own favorite stories, but other books just won't do. Or is it time for Turtle to try something different? A tribute to books, reading, and the joy of sharing stories with others from Brian Won, the author/illustrator of Hooray for Hat! and Hooray for Today!."}]