[{"id": "0919441548", "genre": "Children's Books", "title": "Kwulasulwut II", "description": "This is Ellen White's sequel to Kwulasulwut: Stories from the Coast Salish. The new volume features four more freshly written and translated English versions of traditional Salish legends adapted for children."}, {"id": "0448449811", "genre": "Children's Books", "title": "Valentine's Day Fun! (Max and Ruby)", "description": "Book annotation not available for this title.Title: Valentine's Day Fun!Author: Penguin Group USA (COR)Publisher: Penguin Group USAPublication Date: 2008/12/26Number of Pages: 16Binding Type: PAPERBACKLibrary of Congress:"}, {"id": "B0046LUOK0", "genre": "Children's Books", "title": "CliffsNotes Parent's Crash Course Elementary School Science Fair Projects (Cliffsnotes Literature Guides)", "description": "When the science project is due, this book comes to the rescue  With the trend toward hands-on learning, millions of elementary students have to do science projects. Typically, they mention this to their parents the night before the project is due. This book helps busy parents help their children create last-minute science projects using materials commonly found around the house. It features chapter breakouts grouped by science project subject, two-page spreads devoted to specific science projects, and factoids to get kids interested in the subject. Parents can quickly pick an appropriate project and spur their future scientists toward success!  Faith Hickman Brynie (Bigfork, MT) is a writer specializing in science and health; she holds a PhD in science education, curriculum, and instruction and is a frequent writer for the children’s science magazine Odyssey, as well as the editor of various elementary school science textbooks."}, {"id": "B00W1YXURS", "genre": "Children's Books", "title": "Anna Brown and The Missing Uniforms: A Wheelchair Basketball Mystery", "description": "When a package containing the Rollin’ Hornets' new uniforms mysteriously disappears from the coach’s front door, the wheelchair basketball team is faced with forfeiting all their games in the big Atlanta tournament.  Eleven year old team member, Anna Brown, is determined to find the uniforms and save the team from being thrown into automatic last place.  But will Anna succeed when it looks like the uniforms may have been stolen, or even worse- destroyed?"}, {"id": "1467760579", "genre": "Children's Books", "title": "Tim Howard (Amazing Athletes)", "description": "Goalkeeper Tim Howard makes blocking streaking soccer balls look easy. But soccer is more than a game for Tim. When he was diagnosed with Tourette syndrome as a child, Tim turned to soccer. He could focus on the game and not worry about anything else. He was focused on soccer at the 2014 World Cup. Tim's incredible 16 saves for the United States against Belgium set a world record for most saves in a single match. Read all about the life of one of the world's best goalkeepers. "}]