[{"id": "0765318504", "genre": "Science Fiction & Fantasy", "title": "The Darker Mask", "description": "Expanding on the concept behind Byron Preiss's Weird Heroes from the 1970s, George R. R. Martin's Wild Card series, and Michael Chabon's McSweeney's Mammoth Treasury of Thrilling Tales, The Darker Mask is a collection of original prose stories recalling the derring-do of the beings we call Superheroes and the worlds they fight to save.  But unique to The Darker Mask stories is that these plots and characters color a literary universe outside of what has been predominantly white, idiosyncratic, and male in previous homages to pulp.  This is the stuff of urban legends, new mythos, and extraordinary folks who might live in a soon-to-be-gentrified ghetto, the dreary rust-belt of the city, or in another dimension.  The Darker Mask offers an eclectic mix of popular fiction writers exploring worlds gritty, visceral, and fantastic. Including stories by: Walter Mosley, L. A. Banks, Naomi Hirahara, Lorenzo Carcaterra, Tananarive Due and Stephen Barnes, Mike Gonzales, Gar Anthony Haywood, Ann Nocenti, Jerry Rodriguez, Reed Farrell Coleman, Doselle Young, Mat Johnson, Peter Spiegelman, Alexandra Sokoloff, Christopher Chambers, Gary Phillips, Victor LaValle, and Wayne Wilson."}, {"id": "B0064IT7KQ", "genre": "Science Fiction & Fantasy", "title": "Highland King (People of the Wall Book 2)", "description": "Highland King, the sequel to Draegnstoen, continues the saga of the royal families in 5th Century Scotland and Northern England. Doncann (nephew of Coel from Draegnstoen) is a young Pictish prince. Swept up in the politics and murderous infighting of claimants to his grandfather’s throne, he is falsely accused of murder and exiled to the north. Often fighting for his life, he is protected by the magic of women, mentored by a Celtic demigod and shown how his fate is part of the collective future of his people. Who can unite an ancient kingdom broken apart for generations? Stand up to an invading army threatening to overrun the entire country? Learn the secret of the Stone of Destiny? No one but the Highland King."}, {"id": "B004VB514O", "genre": "Science Fiction & Fantasy", "title": "Stay Dead", "description": "THEY WON’T STAY DEAD.A band of road-weary survivors struggling to find refuge from the living dead.A family sticking together, barricaded in their home while the living dead besiege the town.Scientists working under the thumb of the United States government in the Mount Weather Special Facility are trying desperately to understand why the dead are returning to life, and they might have found out why…STAY DEAD, the first novel in the series, is a fast-paced journey through the ruined streets of a world gasping for one last breath. It blends action and adventure into a dreadfully bleak look at what the inevitable zombie apocalypse will look like.Contains preview chapters for Stay Dead 2: The Dead and The Dying."}, {"id": "B006EP8EYE", "genre": "Science Fiction & Fantasy", "title": "Traitor: Dystopian Science Fiction Adventure (The Turner Chronicles Book 1)", "description": "One man. Two worlds. Last Chance.On the edge of a far frontier rests a place of gentle manners and common civility--Last Chance. Threats of war change all of that. A hero is needed. A Savior. Meet Aaron Turner, the unassuming man who runs the Last Chance General Store. He may not be all that they hoped for.The Turner Chronicles - Traitor - Betrayed - Pawn - Crusade"}, {"id": "B009AHSRP4", "genre": "Science Fiction & Fantasy", "title": "2052 Prophecies: The Last 40 Years", "description": "Synopsis:Mankind may be on the brink of extinction. This story begins with a family living in an underground bunker in the year 2052, while the world above is in total chaos. Nicholas and his family escaped their home in Denver and are now in New Mexico trying to survive an apocalyptic event caused by an approaching comet.The earth has been subject to natural and man-made disasters never before experienced by man. In the bunker, Nicholas reflects back on the past forty years of his life. He remembers the joyful times and the tragic events that changed everything.He relives the taking down of America by terrorist groups, the battle of Armageddon in the Middle East, natural disasters caused by great earthquakes and asteroids that changed the landscape around the world, and the great plague that killed a third of the world’s population.In this doomsday scenario, 2052 Prophecies: The Last 40 Years puts readers in the bunker alongside Nicholas and his terrified family huddled together as the earth shakes violently from the comet’s approach. Is it in the Prophecies that mankind will survive?About the Author:Originally from Massachusetts, Paul V. Suffriti moved to a small town in New Mexico to find spiritual refuge. “I am a very spiritual person who has always been drawn to the unknown and supernatural.” This is his second book.Publisher’s website: http://sbpra.com/PaulVSuffriti"}]