[{"id": "1101940352", "genre": "Children's Books", "title": "Thomas' Tall Friend (Thomas & Friends) (Step into Reading)", "description": "Thomas the Tank Engine has been given a tall order—to deliver a giraffe! This Step 2 Step into Reading leveled reader is just right for train-loving girls and boys who are ready to read! Step 2 Readers use basic vocabulary and short sentences to tell simple stories. For children who recognize familiar words and can sound out new words with help."}, {"id": "0679873031", "genre": "Children's Books", "title": "On Beyond Bugs: All About Insects (Cat in the Hat's Learning Library)", "description": "Find out all you ever wanted to know about insects when the Cat and company get an up-close view of life as a bug. Kids will learn how insects -- from the spittlebug to the honeybee to the moth -- see, smell, communicate, and pollinate, as well as sometimes pester and amaze and generally make life better for us humans. Catch the bug buzz with the Cat in the Hat and all his friends!"}, {"id": "1909263109", "genre": "Children's Books", "title": "Shackleton's Journey", "description": "Winner of the 2015 Kate Greenaway MedalA New York Times Best Illustrated Book of 2014Best Children's Book of 2014, Wall Street JournalBest Children's Book of 2014, Brain PickingsA 2015 USBBY Outstanding International BookYoung, up-and-coming illustrator William Grill weaves a detailed visual narrative of Shackleton's journey to Antarctica.Grill's beautiful use of colored pencils and vibrant hues effortlessly evokes the adventure and excitement that surrounded the expedition. His impeccably researched drawings, rich with detail, fastidiously reproduce the minutiae of the expedition.Children will love examining the diagrams of the peculiar provisions and the individual drawings of each sled dog and packhorse. This book takes the academic and historical information behind the expedition and reinterprets it for a young audience."}, {"id": "076608583X", "genre": "Children's Books", "title": "Rice (All About Food Crops)", "description": "Rice is an essential crop. It is a staple of many diets and cuisines. But theres more to rice than being served in a bowl. Young readers can learn about how rice is grown, different ways its used, and why its such an important crop! Full-color photos and easy-to-read text help readers understand the basic concepts of agriculture."}, {"id": "1585361887", "genre": "Children's Books", "title": "1 Mississippi, 2 Mississippi: A Mississippi Numbers Book (America by the Numbers)", "description": "1 Mississippi, 2 Mississippi is a fitting follow-up to its companion state alphabet book. This fun, colorful, and superbly informative book teaches children about numbers using recognizable places, events, and facts from their respective states. Numbers throughout the books are explained with simple rhyme for younger children and are accompanied by detailed expository text for older learners.Michael Shoulders is a Federal Programs Supervisor for the Clarksville-Montgomery County School System. His \"Story Time\" column appears every week in the Clarksville Leaf-Chronicle. He lives in Clarksville, Tennessee. Rick Anderson taught art for twenty-five years. His tenure in teaching included all levels from elementary through university, as well as workshops, and seminars. Rick lives in Clinton, Mississippi."}]