[{"id": "185028279X", "genre": "Children's Books", "title": "Caves to Cathedrals (Ideas & Inventions)", "description": "A title in the IDEAS AND INVENTIONS series, with colour 'how do they work' pictures and cutaways by Robert Ingpen, following the rise of humanity from cave dwellers to the first civilisations of India, Egypt and Mesopotamia, describing the effects of developing religions, the concept of time and the progress of cures and remedies."}, {"id": "1567112080", "genre": "Children's Books", "title": "Holocaust Series: Holocaust Resource Guide, Vol. 8: A Comprehensive Listing of Media for Further Study (Blackbirch Series , No 8) (Book 8)", "description": "A Comprehensive Listing of Media for Further Study -- Compiled by Dr. William L. Shulman, President, Association of Holocaust Organizations."}, {"id": "1414439695", "genre": "Children's Books", "title": "199: Contemporary Authors New Revision Series: A Bio-Bibliographical Guide to Current Writers in Fiction, General Non-Fiction,  Poetry, Journalism, Drama, Motion Pictures, Television, & Other Fields", "description": "In response to the escalating need for up-to-date information on writers, Contemporary Authors® New Revision Series brings researchers the most recent data on the world's most-popular authors. These exciting and unique author profiles are essential to your holdings because sketches are entirely revised and up-to-date, and completely replace the original Contemporary Authors® entries."}, {"id": "1474754139", "genre": "Children's Books", "title": "Prehistoric Sites (Raintree Perspectives: Historic Places of the United Kingdom)", "description": "Which prehistoric places or remains still exist in the UK today? And what do they tell us about how our ancient prehistoric ancestors lived? This book takes a tour around of some of these places, giving a fascinating glimpse of how prehistoric peoples built their houses and communities as well as why they are significant."}, {"id": "1681522691", "genre": "Children's Books", "title": "Journey through a Desert (Amazing Adventures)", "description": "What's more fun than exploring? In this beginning reader series, young readers will dive deep, journey far, and discover new parts of their world. Colorful action photos and carefully chosen text makes reading these books truly an Amazing Adventure! This beginning reader helps young people explore the heat and beauty of the world's sandy deserts! Using text aimed at emergent readers, each book also features vocabulary specific to its place in the world. Colorful photos make exploring fun!"}]