[{"id": "1612423892", "genre": "Science Fiction & Fantasy", "title": "Galaxy's Edge Magazine: Issue 29, November 2017", "description": "A Magazine of Science Fiction and FantasyISSUE 29: November 2017Mike Resnick, Editor Taylor Morris, Copyeditor Shahid Mahmud, PublisherStories by Larry Hodges. David L. Hebert, Mercedes Lackey, Jean-Claude Dunyach, Daniel J. Davis,  Kevin J. Anderson, Eric Leif Davin, Steve Pantazis, Barry N. Malzberg, Dan Koboldt, Sandra M. Odell,  Nancy KressSerialization: Daughter of Elysium by Joan SlonczewskiColumns by: Robert J. Sawyer, Gregory BenfordRecommended Books: Bill Fawcett and Jody Lynn NyeInterview: Joy Ward interviews Nancy KressGalaxy’s Edge is a Hugo-nominated bi-monthly magazine published by Phoenix Pick, the science fiction and fantasy imprint of Arc Manor, an award winning independent press based in Maryland. Each issue of the magazine has a mix of new and old stories, a serialization of a novel, columns by Robert J. Sawyer and Gregory Benford, book recommendations by Bill Fawcett and Jody Lynn Nye and an interview conducted by Joy Ward."}, {"id": "B0163P3Z8Y", "genre": "Science Fiction & Fantasy", "title": "A Princess of Mars: by Edgar Rice Burroughs (Illustrated and Unabridged)", "description": "Her oval face was beautiful in the extreme, her every feature finely chisled and exquisite, her eyes large and lustrous and her head surmounted by a mass of coal black, waving hair, caught loosely into a strange yet becoming coiffure. Similar in face and figure to women of Earth, she was nevertheless a true Martian--and prisoner of the fierce green giants who held me captive, as well!"}, {"id": "B077X3S3MG", "genre": "Science Fiction & Fantasy", "title": "Polar Fates: A Reverse Harem Novel (The Drowning Book 2)", "description": "Last night, we became one, the lines blurred between our minds for just a moment, but the echo of it is still vivid in my memories. I want to feel that again, and if I have to chain them all to my bed. That actually sounds like a pretty good idea.The Fates like to play with our lives. They're not malicious, just bored. But that also means that sometimes, we have to take our destiny in our own hands and defy the Fates.I will do anything to save the bear shifters from extinction, even if that means going against the will of the most powerful beings in the universe.Because the bears are no longer just friends. They're family.Be warned, this book contains four sexy bear shifters that will make your hormones bubble and your ovaries squeal. 18+."}, {"id": "B008ZOQOVC", "genre": "Science Fiction & Fantasy", "title": "Abduction (Outcasts Book 1)", "description": "Zelia had spent her whole life on a backwater colony planet, where nothing ever happened. It was harvest time, and she was, along with most of the other young adults from the Home Farm complex, picking Tatos. It was autumn. The sun was shining. The weather was good. What could possibly go wrong?"}, {"id": "B074G5W7N2", "genre": "Science Fiction & Fantasy", "title": "Tilt-a-Whirl: A Sinister Short Story", "description": "If you’re a fan of unconventional horror by the likes of Robert Coover and Brian Evenson, you’ll love this short story.He thought this time, things would be different… and they were.Two teen boys and a girl head to the seashore. For the shy, awkward redhead, this is his chance to rekindle his love. But things quickly turn dark when she spurns him for the handsome blond, pushing an already fragile psyche over the edge. Unbeknownst to them, they are the first to visit the beach since a tragic roller coaster accident ten years ago. Chaos ensues as they enter a macabre house of mirrors where past lives resurface to assault them full force. "}]