[{"id": "B00N4YPZMW", "genre": "Children's Books", "title": "A Flying Ace Needs Lots of Root Beer (Peanuts)", "description": "Snoopy, The World War I Flying Ace, finds refuge from the war in a little French café (a.k.a. Marcie’s house). A bemused Marcie lets Snoopy take over her house—until he drinks all her root beer and makes a mess with the empty mugs. Can Marcie get Snoopy to go back to Charlie Brown and his doghouse, and can the World War I Flying Ace evade the Red Baron?Charles Schulz’ Peanuts comic strip charmed and delighted millions of fans—both kids and adults—for more than 40 years. In November 2015, a new 3D Peanuts movie will be released—the first in 35 years. Just in time for the new movie, this new ebook edition introduces the memorable Peanuts gang—Snoopy, Lucy, Linus, Peppermint Patty, Sally, Marcie, Schroder, Woodstock, and Charlie Brown—to a whole new generation of readers."}, {"id": "0807500070", "genre": "Children's Books", "title": "Chester Nez and the Unbreakable Code: A Navajo Code Talker's Story", "description": "As a young Navajo boy, Chester Nez had to leave the reservation and attend boarding school, where he was taught that his native language and culture were useless. But Chester refused to give up his heritage. Years later, during World War II, Chester—and other Navajo men like him—was recruited by the US Marines to use the Navajo language to create an unbreakable military code. Suddenly the language he had been told to forget was needed to fight a war. This powerful picture book biography contains backmatter including a timeline and a portion of the Navajo code, and also depicts the life of an original Navajo code talker while capturing the importance of heritage."}, {"id": "0785740848", "genre": "Children's Books", "title": "Horse Tale (Saddle Club)", "description": "Helping Kate at the Bar None Ranch, Lisa, Stevie, and Carole are delighted Stevie's parents give her permission to buy her favorite horse at the Devine's auction, until Stevie wonders if Stewball is happier with ranch life."}, {"id": "1442492007", "genre": "Children's Books", "title": "The Best of Girls to the Rescue―Girls Save the Day: The 25 most popular stories about clever and courageous girls from around the world", "description": "The 25 most popular stories about clever and courageous girls from around the world! In most fairy tales, the helpless girl waits around for a prince to rescue her. But the girls featured in the Girls to the Rescue series' seven books are not only smart, they're also spunky enough to save the day when the going gets tough. And the response to the series from girls, parents, teachers, booksellers, and reviewers has been overwhelmingly positive. For The Best of Grils to the Rescue, Bruce Lansky selected twenty-five stories that rise above the rest.Bruce Lansky is the creator of the Girls to the Rescue series, as well as one of the authors of stories in the series. He also created the New Fangled Fairy Tales series, the Can You Solve the Mystery Series, a series of humorous poetry books (including Kids Pick the Funniest Poems and Rolling in the Aisles), and a series of silly song books."}, {"id": "1616416459", "genre": "Children's Books", "title": "Bill Clinton: 42nd U.S. President (Presidents of the United States Bio-Graphics (Graphic Planet))", "description": "Graphic Planet is bringing the Presidents of the United States to Bio-Graphics! World-class art presents young readers a pictorial chronology of Bill Clinton's life, background on his campaign to be president, major influences on the country, and his influence on history. A timeline, Fast Facts, the president's cabinet, and a glossary provide report information for young readers. Bring the Oval Office to your classroom! Graphic Planet is an imprint of Magic Wagon, a division of ABDO Publishing Group. Grades 3-6."}]