[{"id": "1444917854", "genre": "Children's Books", "title": "Happy Birthday, Mr Croc!", "description": "It's Mr Croc's birthday, and children can join in the celebration For every child who loves balloons, presents, party games, and cake surprises, it's time for Mr Croc's fabulous birthday party. All young readers are invited to join the festivities with this fabulously interactive book that will keep small hands busy for hours."}, {"id": "0199154937", "genre": "Children's Books", "title": "GCSE German for OCR Resources and Planning OxBox", "description": "GCSE German for OCR is one of a suite of Courses for the 2009 GCSE OCR specification. Each course will have a Students' Book, Self-Study Guide, Teachers' Resource pack (inc. e-Copymasters), audio CDs and OxBox components. The OxBox component is a useful addition to presentation and planning resources"}, {"id": "1450868711", "genre": "Children's Books", "title": "Disney® Story Reader® Electronic Reader and 8-Book Library", "description": "Story Reader Electronic Reader and 8-Book Library is an electronic reading system. The Reader is an electronic pad that reads out loud each of eight storybooks feat. Disney  illustrations."}, {"id": "0766085090", "genre": "Children's Books", "title": "Misty Copeland: Principal Ballerina (Influential Lives)", "description": "Misty Copeland is probably the most famous ballerina in the world. She didn't begin dancing until age thirteen, but she quickly surpassed all her peers to be declared a prodigy. Her hard work and talent have landed her the career of a lifetime. Through engaging text and quotes from the dancer, readers will learn about Copeland's life, hardships, and accomplishments. Full-color photos from throughout Copeland's life will give readers insight into the dancer's personal life and career. The glossary helps readers learn new vocabulary, while Further Reading encourages deeper exploration into the world of dance."}, {"id": "1491829834", "genre": "Children's Books", "title": "Tame Your Manners: At KAMP Safari", "description": "Tame Your Manners is a fun, meaningful, and most important, memorable way for a child to learn manners. Any adult or child who reads this book will delight in the clever illustrations and correlations of animal characteristics to the manners advice. Phrases like Lions Don't Need to Roar, Don't Be a Whino Rhino, and Stand Tall Like a Giraffe are easy-to-grasp concepts for children. With the demanding schedules of parents, caregivers, and teachers, the importance of social skills is often overlooked. Learning social skills early, especially during childhood, can shape a child's character and greatly impact his or her life for the better. The EW Foundation's (EWF) vision is to teach, inspire, and motivate children to perform spontaneous acts of kindness and consideration. The benefits they receive from simple, good behavior with be both tangible and intangible. Our belief is that children can \"do well by doing good deeds.\"The topics covered in this book are part of the EWF's KAMP curriculum, a 2015 Promising Practices national award winner by Washington, DC based Character.org."}]