[{"id": "1534684484", "genre": "Science Fiction & Fantasy", "title": "Silhouette", "description": "Born a slave to an alien corporation, Susan Singh escaped with the help of a politician who would shape the young girl into a deadly force of human vengeance.Alien factions are tearing down the walls of human civilization. Men and women struggle to survive in a universe where humankind is considered an inferior species to all other sentient life. Leslie Folami presides over a clandestine council of world leaders bent on establishing the respect humanity deserves, even if it means starting a war that they cannot win. Unknown to her peers, Folami has sent her assassin on a perilous mission that might give them a fighting chance.Raised as a secret tool for Folami's political schemes, Susan was trained in the ways of the Enforcers from the past, taught to harness the shadow to her will and live as death incarnate. A decade passed under Folami's tutelage before Susan was given the assignment she had been waiting for, revenge on the alien menace plaguing her home world and a chance to free her family."}, {"id": "B0134J2U4C", "genre": "Science Fiction & Fantasy", "title": "IU-137: Free robot adventure", "description": "Deep in the heart of the Lucan Institute is the dormant form of the android: IU-137. The robot is the life's work of Professor Jarrad Shamtack. But...its about to be controlled by an unknown source and will attack and destroy at will. Can Professor Shamtack and his henchmen Huey and Bod get his beloved robot back? This is only the beginning... Join my mailing list: http://goo.gl/2p6Aq4 IU-137 is a prequel - a short novella, added to Amazon on July 31st 2015. The synthetic human is really brought to life in Crank Tech One: DESTRUCTION, a full novel. I've written this novella, so you can get a feel for the robot before reading the main book. Crank Tech One, has been out since 2013 and is a very popular sci-fi adventure. But I've always felt that I should explain where Crank originally came from.The story continues...Crank Tech One: DESTRUCTION."}, {"id": "B0749FNQ4F", "genre": "Science Fiction & Fantasy", "title": "Claimed by Magic: a Baine Chronicles novel (The Baine Chronicles: Fenris's Story Book 2)", "description": "Fenris and Mina's story continues in the second book of this Baine Chronicles spinoff trilogy...Now that Fenris and Mina have finally admitted their feelings for each other, for the first time, they both face something they'd thought impossible--settling down with someone who accepts and loves them for who they are.But the future is not so certain, particularly when Mina gets a letter in the mail that her inheritance is about to be forfeit. Suddenly, she must confront the shadows of her own past, or lose the inheritance her loving grandmother has left behind to the abusive family members that drove her away in the first place.Even with Fenris at her side to advise and protect her, wresting Mina's family fortune back from greedy relatives proves more difficult than expected. Someone is determined to deny Mina's rights, at any cost. And when Fenris meets an unexpected enemy from his past, things go from difficult to downright dangerous...Don't miss the next installment of Fenris and Mia's journey. Scroll up and grab your copy today!"}, {"id": "B01MRXL47O", "genre": "Science Fiction & Fantasy", "title": "Sanguine (Improbable Truths Book 1)", "description": "Love.  Murder.  Revenge.Sherlock Holmes is no ordinary man…but this is no ordinary crime.  With his partner Dr. John Watson at his side, Holmes is called to the scene of a suspicious death where the writing is on the wall…literally.  Intrigued by a bloody mark left at the scene, Holmes and Watson chase down leads that could take them beyond the realm of possible.Sanguine is a retelling of Arthur Conan Doyle’s A Study in Scarlet with a supernatural twist and is the first of the Improbable Truths series."}, {"id": "0998678511", "genre": "Science Fiction & Fantasy", "title": "The Bandit Mask", "description": "The cap made him a raccoon - His courage will make him a hero.  Sam is new in town and having a tough first week of middle school. When he receives an unusual gift- an animal-faced stocking cap far too childish for someone his age- Sam is inexplicably transformed into a raccoon and popularity quickly becomes an afterthought.  Lost in the unfamiliar forest, Sam makes an unlikely friend. Zip Ric, a talking squirrel, is on a mission to save his family's three-hundred year old oak tree from destruction, and needs Sam's help to seek out the wise Wood Seer.   But the woods can be a dangerous place, especially for one unfamiliar with the territory. Dangers lurk beneath the stones of dry river beds, within dark corners of abandoned shopping malls, and even from the night sky.    Sam will need all the courage and cunning of a real raccoon to save Zip's family, their tree, and his own skin on a harrowing quest through the forest, even as Sam tries to find his way back home.  An exciting adventure for readers of all ages, with plot twists and a cast of memorable, talking animal characters."}]