[{"id": "B01M0BMG8O", "genre": "Children's Books", "title": "Celebrate Durga Puja With Me! (From The Toddler Diaries)", "description": "Durga Puja is here! What does it mean to a child? New clothes, laughing with friends, yummy food and being immersed in a colorful cultural experience. Step into this book and share in Riya’s excitement as you watch this festival come alive!‘Celebrate Durga Puja With Me!' is part of the series 'From The Toddler Diaries' and celebrates Durga Puja as experienced by 3 year old Riya. This artful portrayal of the '5 Days of Pujo' appeals to young and old alike. Shashti, Saptami, Ashtami, Navami and Bijoya Dashami - the cultural colors have a pronounced Bengali connection, but are universal to Durga Puja celebrations the world over. Woven in poetry and color, it is easy to read and has been enthusiastically endorsed by children and their parents.A charming and informative book. A great way to introduce children to the culture. ~ Chitra Banerjee Divakaruni, Award winning author of ‘The Mistress of Spices’ and ‘Before We Visit the Goddess’When I read Shoumi Sen’s Celebrate Durga Puja With Me, brilliantly illustrated by Abira Das, I must admit that I want to witness at least one Durga Pujo in my life… ~ Indian Moms Connect"}, {"id": "1481432761", "genre": "Children's Books", "title": "No Summit out of Sight: The True Story of the Youngest Person to Climb the Seven Summits", "description": "Jordan Romero climbed Mount Everest at age thirteen—and he didn’t stop there. In this inspiring young adult memoir that includes color photos, he tells how he achieved such great heights.On May 22, 2010, at the age of thirteen, American teenager Jordan Romero became the youngest person to climb to the summit of Mount Everest. At fifteen, he became the youngest person to reach the summits of the tallest mountains on each of the seven continents. In this energizing memoir for young adults, Jordan, recounts his experience, which started as a spark of an idea at the age of nine and, many years of training and hard work later, turned into a dream come true.“The emotional pitch of the story remains high as Romero contends with extreme weather, frustration, exhaustion, and homesickness to reach, with almost palpable exhilaration, each peak” (Publishers Weekly)."}, {"id": "0375944443", "genre": "Children's Books", "title": "Runemarks", "description": "Seven o’clock on a Monday morning, five hundred years after the end of the world, and goblins had been at the cellar again. . . . Not that anyone would admit it was goblins. In Maddy Smith’s world, order rules. Chaos, old gods, fairies, goblins, magic, glamours–all of these were supposedly vanquished centuries ago. But Maddy knows that a small bit of magic has survived. The “ruinmark” she was born with on her palm proves it–and makes the other villagers fearful that she is a witch (though helpful in dealing with the goblins-in-the-cellar problem). But the mysterious traveler One-Eye sees Maddy’s mark not as a defect, but as a destiny. And Maddy will need every scrap of forbidden magic One-Eye can teach her if she is to survive that destiny.From the Hardcover edition."}, {"id": "019913958X", "genre": "Children's Books", "title": "OCR GCSE German Assessment Oxbox CD-ROM 2010", "description": "The Assessment OxBox CD-ROM contains computer-based, auto-marked assessments in the key skill areas of reading, listening, speaking, writing and grammar to prepare students for the OCR GCSE. Familiar, user-friendly question types are used throughout, making the CD-ROM immediately accessible to all users. Record and Playback activities offer ideal preparation for speaking controlled assessments. Student and class results can be aggregated into overview charts, allowing users to identify particular areas of weakness at a glance. Results can also be exported automatically."}, {"id": "B0085LK6AK", "genre": "Children's Books", "title": "Fighter Jets! Learn About Fighter Jets And Learn To Read - The Learning Club! (45+ Photos of Fighter Jets)", "description": "Do your kids like Fighter Jets? Great! You are in the right place.  You can help them learn about Fighter Jets today.Here is What You Will Get Inside \"Fighter Jets! Learn About Fighter Jets And Learn To Read - The Learning Club!\"...Fighter JetsFighter Jet PicturesFighter Jet FactsFighter Jets FlyingFighter Jet EvolutionFighter Jet FormationsFighter Jet RadarFighter Jet ShapesAnd Lots More!How can I get some Fighter Jet photos into my kid's hands today?Other Things inside of \"Fighter Jets! Learn About Fighter Jets And Learn To Read - The Learning Club!\":This book has photos of Fighter Jets.This book has info on Fighter Jets.This book has facts on Fighter Jets.This book will help you learn.This book will help you read better.Buy the book \"Fighter Jets! Learn About Fighter Jets And Learn To Read - The Learning Club!\" Right Now!"}]