[{"id": "1532822103", "genre": "Science Fiction & Fantasy", "title": "13 After Midnight", "description": "WITH AN INTRODUCTION TO THE SHORT STORY OF THE FANTASTIC Nobel Prize for Literature nominee Jaime Martinez Tolentino presents 13 stories of the fantastic to read after midnight, and also sets out to explore the differences between the various kinds of such stories—the uncanny, the supernatural, the marvelous, the fantastic, magical realism, etc. The stories contained in 13 AFTER MIDNIGHT all belong to what is, arguably, the most misunderstood literary genre, or modality: the Fantastic—and fantastic they are, in all sense of the word!"}, {"id": "B008M88WG6", "genre": "Science Fiction & Fantasy", "title": "The Farmhouse Secret", "description": "When Noreen, an adventurous fourteen year old girl, discovers a mysterious farmhouse on her family’s recently acquired property she thinks she has found the perfect hideout.  Hidden under the floorboards, Noreen finds a jar containing unusual marbles and realizes they possess super powers. Noreen and her friend Harvey try some out and comically find having super powers is not as simple as fictional super heroes make it look.  When word gets out about their unusual discovery, Noreen and Harvey struggle to protect the powers from the wrong hands. Harvey finds himself in mortal jeopardy, while Noreen leads a power hungry villain on a wild goose chase.  Noreen can only hope it ends with her and Harvey still alive."}, {"id": "B00AFPWIUU", "genre": "Science Fiction & Fantasy", "title": "The Secret Beneath the Ice (The Epic of Aravinda)", "description": "When a thoughtship and its pilot finally reach Avani, the shimmering gem of the western spiral arm, they barely have a chance to marvel at its sapphire forests before they are ambushed by an enemy far beyond their understanding.In the midst of the attack, a fragment is sliced off of the ship causing them to tumble out of control, down to the planet's surface. An ice-covered continent to the south is the only viable landing site. Lucky for them, what hides beneath may give them the chance to escape before isolation drives them mad.This short story is a prequel to the fast-paced Sci-Fi novel \"The Truth Beyond the Sky.\" Heavily inspired by ancient mythology and Joseph Campbell's work, this first book kicks off the THE EPIC OF ARAVINDA series.What Top Reviewers Say... \"It is a helpful setup...very solid and engaging, which is enough to get me to come back and try more.\" --Pop Bop, Top-500 Amazon Reviewer\"It's the perfect carrot to lure you in. The personalities of pilot and machine are firmly established and very likable.\" --Jeri A. Ramirez\"One of the best science fiction stories I have read in the last year.\" --Russ, Reviewer"}, {"id": "B074MJ76KM", "genre": "Science Fiction & Fantasy", "title": "The Luminated Threads Volumes 1-3: A Steampunk Fantasy Romance Trilogy Box Set", "description": "A steampunk fantasy romance trilogy now in an ebook boxed set!\"A fun, well-crafted Harry Potteresque story, with all sorts of fun elements to lose yourself in---history, romance, gardening, geography, animal behavior, geology, flora and fauna, lots of magical wonderings.\"~Amazon reviewerIn 1868 England, nineteen-year-old artist Annmar Masterson flees the ruthless industrial magnate who wants to control her and her fantastical drawings, leaving the city for a tucked-away farm.But danger mounts in this land of wild magic.Magic that shapeshifter Daeryn Darkcoat knows well. Or does he? When unfamiliar crop-eating pests threaten to destroy their livelihood, every shifter and Knack-bearer in the hidden valley scrambles to stop them—and can’t.Desperation drives landowners to utilize dangerous steam machinery, but Annmar’s growing magical abilities with the mysterious luminated threads and her knowledge of Outside ways might be the key to saving their home. And her home, for the more Annmar learns about herself, the more entangled she becomes with Daeryn, the threads and the people of Blighted Basin.Weaving witches, shapeshifters, steampunk engines, and a sweet, coming-of-age romance in a secret corner of England brings an exciting new adventure to historical fantasy."}, {"id": "B01ALZDY6A", "genre": "Science Fiction & Fantasy", "title": "Risen: First Book of the Nameless Chronicle", "description": "In the middle of nowhere, a nameless individual rises from the dark. With barely any knowledge apart from how to speak and how to kill, he finds himself in a world gone mad. Worse off, nearly everything that moves is out for his blood.Not knowing where to turn, the wanderer traverses the desolate landscape of a ruined continent. Along his travels, his mind and body are pushed to their limits as he desperately tries to make sense of what is going on, what he is, and why he exists.Foe after foe meets their end at his hands, yet each kill only serves to raise more questions. Is he even human? What has happened to the world? Where does his path lead? The answer lies beyond the blood-stained horizon."}]