[{"id": "B077XKQV6D", "genre": "Children's Books", "title": "The Queen Who Saved Herself: A story to help children understand addiction", "description": "A touching and uplifting fairy tale about a queen who realizes that she must fight her own dragons. Realizing that nobody else can see the beasts who have haunted her since childhood, she embarks on a quest that takes her far from her family and castle to conquer them herself.  A story of courage and recovery that touches on mental illness, trauma, addiction and co-dependence and explains the process of a 12-step recovery in terms that children can understand.  The author--herself an alcoholic who has suffered childhood trauma--wrote the story initially for the sake of explaining these challenges to her own children.  She now hopes that other children will benefit from the story by fostering a family dialogue about recovery, addiction and the pursuit of stronger mental health. A portion of the proceeds from the sale of this book will be donated to an addiction recovery scholarship fund."}, {"id": "0595175554", "genre": "Children's Books", "title": "2 Picture Books by Carol Fenner: Tigers in the Cellar and Gorilla Gorilla", "description": "Tiger, Tiger A quiet, well-conceived picture book.Publishers Weekly Warm and deliciously suspenseful and scary.Booklist A poetic, completely harmonious and beautiful picture book.HornbookGorilla Gorilla1973 Christopher Medal for non-fiction; Library of Congress Book of the Year; ALA Notable Book; Outstanding Science Trade Book for Children. Fenner has turned a reading of Schallers Year of the Gorilla and her own zoo observations into a sound and vividly empathic account, and Shimins soft, gray drawings reinforce the mood of her prose.Kirkus Based on impressive research, this is the story of a young gorilla who grows from a babe in his mothers arms to become the strongest male of his tribe. The illustrations are spellbinding and so is the story.Publishers Weekly"}, {"id": "0763695718", "genre": "Children's Books", "title": "Pick a Pine Tree", "description": "A festive read-aloud brimming with all the joy and excitement of Christmastime — beginning, of course, with picking out a tree!Part of the magic of the Christmas season stems from the traditions that families and friends take part in every year: hanging up stockings; putting lights in the windows; and, one of the most important of all, picking out and taking home the Christmas tree. With style and warmth, debut author Patricia Toht and Jarvis, the author-illustrator of Alan's Big, Scary Teeth, evoke all the rituals of decorating the tree — digging out boxes jam-packed with ornaments and tree trimmings, stringing tinsel, and, at long last, turning on those twinkling lights. Joyously drawn and rhythmically written, this celebration of family, friends, and the holiday season is as merry as the tradition it depicts."}, {"id": "B014Q5GL5C", "genre": "Children's Books", "title": "The Marshmallow Adventure.: Bedtime Story for children and toddlers. (The Mini-King's Bedtime Adventure Series Vol. Book 2)", "description": "Jimmy hates Bedtime until his new pillow comes to life and takes him on an incredible adventure to the magical Martian Marshmallow Mines."}, {"id": "B06XJGT7LJ", "genre": "Children's Books", "title": "Bears Can Fly - Picture Book for Beginner Readers About Friendship, Fun and Creative book for Early Learning.", "description": "Bears can fly! And they really enjoy it.How is that possible? — Kids will find out with this сute, funny and delightful illustrated book.This short, but full of positive emotions story with a deliciously satisfying surprise ending is perfect for read-aloud and beginning readers. Let’s fly with two adorable bears!"}]