[{"id": "1426328222", "genre": "Children's Books", "title": "National Geographic Kids Chapters: White Water! (NGK Chapters)", "description": "From hippo attacks on the Okavango River to Chitina headwaters in Alaska, this chapter book is full of raging rivers and thrilling adventures. With gripping – and TRUE – stories of incredible adventures, extreme excursions, and ultimate survival, White Water! will have you on the edge of your canoe– er seat. Perfect for all readers who love an exciting, real-life, adrenaline-fueled drama."}, {"id": "B00HDTPVEQ", "genre": "Children's Books", "title": "The ABC Unicorn: An Alphabet Story Book (The ABC Series 2)", "description": "Follow Alice the ABC Unicorn on her adventure. A great book to introduce your preschool child to the alphabet. In this colourful and educational story your child will delight at the characters Alice encounters, whilst becoming familiar with their ABC's.Book 2 in The ABC Series."}, {"id": "1477788018", "genre": "Children's Books", "title": "Ferdinand Magellan: First Circumnavigator of the Earth (Spotlight on Explorers and Colonization)", "description": "Although Magellan led the first expedition to circumnavigate the globe, he perished before the trip was completed. Readers will learn about the challenges that his expedition faced on its long, arduous journey, as well as how this Portuguese explorer ended up leading a Spanish expedition in the first place. Other highlights include his travels as a young man, the discovery of the strait now named after him, and his partnership with astronomer Rui Falerio. This engrossing account of Magellan’s life and fateful last voyage concludes with a consideration of Magellan’s legacy."}, {"id": "B00RZSI7GY", "genre": "Children's Books", "title": "Mexican Mug Eggs (Easy Reader Recipes 2 Book 4)", "description": "Easy Reader Recipes 2 is a new series with the same type of recipes as the original Easy Reader Recipes; I had to start a new line because CreateSpace tops the numbers out at 100. This book contains the recipe for a mug eggs with a Mexican twist. The recipe is presented in both an easy, photo-enhanced version and a more standard version, which usually contains decorating ideas and possible substitutions. My intent with this series is to have a format that new readers or people who have difficulty reading can follow because of related photographs and simple language, as well as a version for people who don't. In addition, Text-to-Speech is available for those units that can use it. People who are learning English or who have disabilities limiting their reading may enjoy this title, as well as young English-speaking children. A mom uses this series with her middle school daughter, a new cook, and adults use the recipes for food they can make very quickly. These titles might also come in handy for bad weather days because I've tried to stay away from strange, expensive, or hard-to-find ingredients."}, {"id": "9962690404", "genre": "Children's Books", "title": "Jake's Best Birthday EVER! * ¡El MEJOR cumpleaños de Jake!", "description": "Go on tour with Grandma Terry as she decides what parts of the BIG APPLE she will give to Jake for his birthday. It's all there in NEW YORK CITY! Bilingual story in English and Spanish. Contains lots of interesting facts about New York City's famous sights - a \"must read\" for anyone planning to visit New York City with children, with detailed descriptions of the many magnificent structural buildings and the varied activities to be enjoyed. The author includes and explains more than 13 interestings sites. Anticipation and enthusiasm for the Big Apple is engendered throughout with the recalling of Grandma Terry's childhood in the city and her planning for Jake's visit. Jake's Best Birthday Ever! is a quick page turner as the eye catching illustrations help capture the thrilling ambience of the busy Big Apple and secures the reader's attention. The Spanish and English appearing on the same page is a good practice in both languages for children as well as adults."}]