[{"id": "1567111939", "genre": "Children's Books", "title": "America's Top 10 - Skyscrapers", "description": "Now reference can be accessible even to younger readers! Thousands of captivating facts and figures about America are packed into these ten colorful introductory reference volumes. Clear, simple spreads about our nation's most awe-inspiring natural features and landmarks make America's Top 10 books a wonderful way to get young readers hooked on reference. Easy-to-digest entries provide the most important background and history while bulleted boxes offer quick, at-a-glance highlights and facts. Beautiful full-color photographs make the pages come alive as the text sparks curiosity and further interest in the subjects. Also included are a glossary, further reading section and an index."}, {"id": "1981479716", "genre": "Children's Books", "title": "Coyote: Fun and Fascinating Facts and Photos about These Amazing & Unique Animals for Kids", "description": "Coyote: Fun and Fascinating Facts and Photos about These Amazing & Unique Animals for Kids"}, {"id": "1547088559", "genre": "Children's Books", "title": "Happy 13th Birthday: Birthday Books For Children, Birthday Journal Notebook For 13 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B005R209BG", "genre": "Children's Books", "title": "14 Fun Facts About Lions: A 15-Minute Book (15-Minute Books)", "description": "How far away can a lion’s roar be heard?How much can a lion eat in one meal?How do you tell how old a lion is?What does a lion’s tongue feel like?Learn the answer to these questions and many more in this 15-Minute Book. Lions are wild, exciting animals that like to do things their way. How much do you know about them?All measurements given in both American and metric.Ages 8 and up.This book is also included in the compilation \"101 Fun Facts About Mammals\".LearningIsland.com believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Open the world of reading to a child by having them read for 15 minutes a day."}, {"id": "0516209159", "genre": "Children's Books", "title": "Aircraft Carriers", "description": "Provides an introduction to aircraft carriers, the ships known as \"floating airports,\" from their inception in the early twentieth century, through their development during World War II, to the various classes of carriers in use today."}]