[{"id": "1499420072", "genre": "Children's Books", "title": "How Do Irrigation Systems Work? (STEM Waterworks)", "description": "Describes how irrigation systems have worked throughout history, exploring the technology involved with such types as drip irrigation and subsurface irrigation."}, {"id": "1481452061", "genre": "Children's Books", "title": "I'll Catch You If You Fall", "description": "In the spirit of Someday and Guess How Much I Love You comes a lyrical and endearing picture book about the people in our lives who are always there to look out for us.Who will keep the boy safe? “I will,” said his mother. “I will hold him close... and never let him lean too far.” Big or small, near or far, we all need someone to watch over us. This touching picture book is a reassuring tale about a journey and the people who are with us as we travel through life. It is for anyone who has wondered, Who will keep me safe? and for anyone who has answered, I will."}, {"id": "0521608236", "genre": "Children's Books", "title": "Essential VCE Legal Studies Units 3 and 4", "description": "Essential VCE Legal Studies 3 & 4 provides comprehensive coverage of the 2006 VCE study design to help students develop the knowledge, skills and confidence needed for success at VCE level."}, {"id": "0064421023", "genre": "Children's Books", "title": "A Pride of Princesses: Princess Tales from Around the World (Trophy Chapter Books)", "description": "Meet the princesses...Mpunzanyana, the brave princess of the South African Xhosa, marries a five-headed serpent to save her sister. Lina, the spoiled princess of Germany, foolishly turns away the love of a king. And Maix, a headstrong princess of the Central American Maya, defies her father and runs away with her true love--only to be captured by an ogre.  Join these three princesses and many more for a breathtaking journey around the world and back through time, where anything can happen--including a happy ending."}, {"id": "B01LW255J9", "genre": "Children's Books", "title": "Initiates (The Book of Adam 3)", "description": "After discovering the note with his father’s intitials in the Killaly graveyard, Adam McTaggart knows that his father, Edward, moved the Heartstone. He also suspects that Edward might still be alive, but has no idea where he or the Heartstone could be.Because Adam barely escaped capture by Larix’s men and is now clearly a target, the Sentinel League has decided that the best thing for Adam is to make him and his friends full initiates. That means putting the boys through the program at the League’s secret training facility. But if the boys fail at the training facility, they risk relocation far away, with their memories wiped, never to see home again.Being the youngest initiates in a century, brings its own challenges at the training facility, but trying to figure out what Edward did in the last months before his ‘death’ is the biggest challenge of all.Can Adam and his friends uncover the information they need in order to recover the Heartstone, all while making sure they aren’t rejected by the League?"}]