[{"id": "B005MZCEIO", "genre": "Children's Books", "title": "Storm Boy", "description": "An American Indian prince is flung from his canoe during a storm. Washed ashore in the mysterious world of the Killer Whale people, the boy finds himself in an unfamiliar village, being welcomed by a strange and giant tribe. • 50,000 copies in print!• American Book Award Winner• A PBS \"Storytime\" Selection• Best Children's Book of the Pacific Northwest• Washington State Governer's Award Winner"}, {"id": "B01N3MC1K4", "genre": "Children's Books", "title": "Twisted: The Girl Who Uncovered Rumpelstiltskin's Name", "description": "The mystery of Rosamund Hodge’s Crimson Bound meets the romance of the best Beauty and the Beast retellings. An old tale tells the story of how a little man named Rumpelstiltskin spun straw into gold and tricked a desperate girl into trading away her baby. But that’s not exactly how it happened. The real story began with a drunken father who kept throwing money away on alcohol and women, while his daughter, Aoife, ran the family farm on her own. When he gambled away everything they owned to the Duke, it was up to her to spin straw into gold to win it all back. With her wits and the help of a magical guardian, she outsmarted the Duke and saved the day. Well almost…Her guardian suddenly turned on Aoife and sent her on a quest to find his name, the clues to which were hidden deep in the woods, a moldy dungeon, and a dead woman’s chamber. Her feelings for one of the men who tricked her from the start threaten to complicate everything. Not the tale of a damsel in distress, this is the story of a tenacious, young woman who solved a mystery so great that not even the enchanted man who spun straw into gold could figure it out. Not until Aoife came along."}, {"id": "B00K71MXVG", "genre": "Children's Books", "title": "Sweet Passover", "description": "In this charming and humorous story, Miriam discovers—with the help of her family and a little matzah bread—the true meaning and importance of Passover. Miriam loves spending time with her family during Passover, and all week long she is happy to eat lots of matzah. But when she wakes up on the last day of the holiday, she is sick of matzah and refuses to eat it ever again. Then Grandpa makes his special matzah brei for the whole family, and Miriam learns there’s more to Passover than just the matzah. Award-winning illustrator David Slonim brings to life this story by celebrated author Lesléa Newman. The book includes a recipe for matzah brei, a brief summary of the Passover holiday, and a glossary of terms."}, {"id": "1547230584", "genre": "Children's Books", "title": "Happy 95th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 95 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1403456011", "genre": "Children's Books", "title": "1: Mountains (My World of Geography)", "description": "What is a mountain range? How can you help protect mountains? What is a volcano? Read this book to find out all about mountains! Each book in the My World of Geography series explores one of Earth's physical features. Find out what each one is like, where it is found, and how it can look in different parts of the world. Discover how the physical feature can affect the way people live."}]