[{"id": "B00XD3A8A8", "genre": "Children's Books", "title": "Aw Yeah Comics Volume 2: Time for.... Adventure!", "description": "The Action and Adventure begin again! Time for more awesomeness with the superheroes of beautiful downtown Skokie--Aw Yeah Comics' very own Action Cat and Adventure Bug! See our heroes battle dastardly villains! Wonder as a burning asteroid hurdles toward earth! Beware of the lurking Golden Age evil! That's right--Golden Age Action Cat! This all-ages collection has everything and more! Brought to you by the Eisner Award-winning cartoonists Art Baltazar and Franco, and collecting issues #5-#8 of their original Aw Yeah Comics! series! Also featuring stories from the Aw Yeah crew--Scoot McMahon, Alejandro Rosado, Denver Brubaker, and Kurt Wood! True story!"}, {"id": "0778733947", "genre": "Children's Books", "title": "How to Build Robots (Technology in Motion)", "description": "How to Build Robots instructs readers on how to make useable robots, including one that will scrub a table! Featuring easy-to-follow instructions, vivid photographs, easily accessible materials, and a handy template, readers will delight in watching their creations come to life!"}, {"id": "0836862376", "genre": "Children's Books", "title": "Focus on Germany (World in Focus)", "description": "Examines the geography, history, politics, economy, and culture of Germany, discussing topics including immigration, reunification, and European Union membership."}, {"id": "0689817770", "genre": "Children's Books", "title": "Pinky and Rex and the Perfect Pumpkin (Pinky & Rex)", "description": "When Rex is invited to go along on the traditional pumpkin-picking trip with Pinky's grandparents, she doesn't feel that Pinky's cousin Abby really wants her to be part of the fun."}, {"id": "1931636850", "genre": "Children's Books", "title": "My Mouth Is a Volcano!", "description": "All of Louis thoughts are very important to him. In fact, his thoughts are so important to him that when he has something to say, his words begin to wiggle, and then they do the jiggle, then his tongue pushes all of his important words up against his teeth and he erupts, or interrupts others. His mouth is a volcano! My Mouth Is A Volcano takes an empathetic approach to the habit of interrupting and teaches children a witty technique to capture their rambunctious thoughts and words for expression at an appropriate time. Told from Louis’ perspective, this story provides parents, teachers, and counselors with an entertaining way to teach children the value of respecting others by listening and waiting for their turn to speak."}]