[{"id": "1338133950", "genre": "Children's Books", "title": "Hurricane Katrina Rescue (Ranger in Time #8)", "description": "Ranger, the time-traveling golden retriever with search-and-rescue training, arrives in New Orleans as Hurricane Katrina approaches and residents start to evacuate the city. Ranger meets Clare Porter, who is searching for her grandmother. Once Ranger helps Clare find Nana, he takes shelter with them at their home in the Lower Ninth Ward, and they wait for Clare's father to return from the gas station. But there's no sign of him as hours pass and the weather gets worse. The wind picks up and rain pours down. And when the levees break, floodwaters dangerously rise, and Clare and Nana are separated. Can Ranger help Clare navigate the flooded streets to safety and back to her family?"}, {"id": "043935806X", "genre": "Children's Books", "title": "Harry Potter and the Order of the Phoenix (Book 5)", "description": "The next volume in the thrilling, moving, bestselling Harry Potter series will reach readers June 21, 2003 -- and it's been worth the wait!We could tell you, but then we'd have to Obliviate your memory."}, {"id": "B00J3FPYV8", "genre": "Children's Books", "title": "Robin Hood: Outlaw of the 21st Century #1", "description": "In this modern update of the classic Robin Hood legend, the bold outlaw steals medicine and gives it to those in need."}, {"id": "0606148604", "genre": "Children's Books", "title": "The Chronicles Of Meap (Turtleback School & Library Binding Edition) (Phineas & Ferb (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When a UFO crashes in their backyard, Candace takes its cute pilot, Meap, away with her, while Phineas, Ferb, and Isabella get captured by Meap's nemesis, Mitch, and Dr. Doofenshmirtz tries to get his childhood balloon back."}, {"id": "1474892264", "genre": "Children's Books", "title": "Be Brave, Little Tiger!", "description": "Follow the adorable tale of Little Tiger as he learns how to be truly courageous in this picture book, Be Brave, Little Tiger! by Margaret Wise Brown and illustrated by Jean Claude."}]