[{"id": "B0039UUB16", "genre": "Science Fiction & Fantasy", "title": "Branded (Fall of Angels Book 1)", "description": "Join the ONE MILLION readers who have fallen hard for Branded: Fall of Angels!On the remote shores of Lake Samish hides a woman losing touch with reality.  Haunted by violent dreams of angels, standing judgment for the sins of others, Jessica has resorted to a life of solitude and nightmares.But when two men she can’t ignore enter her life, everything changes, including the afterlife that calls to her.  Can she hide the physical scars that follow her into the land of the living from the enigmatic and easygoing Alex?  And why is her gorgeous and assertive new neighbor, Cole, so fascinated with her?A chance at love sits within reach, but the clock is ticking, and it might not be long until Jessica stands her own judgment and becomes the object of her greatest fear.Featured in THE WALL STREET JOURNAL as a \"Self-Published Big Seller.\"  The entire series is now available!BRANDED - Book OneFORSAKEN - Book TwoVINDICATED - Book ThreeAFTERLIFE - Novelette Companion to Vindicated"}, {"id": "1469208954", "genre": "Science Fiction & Fantasy", "title": "Embedded", "description": "The colony planet of Eighty-Six looks as dull as all its fellow new worlds to veteran journalist Lex Falk. But when a local squabble starts to turn violent, and the media start getting the runaround from the military high command, his interest is seriously piqued.Forbidden from approaching the battlezone, he gets himself chipped inside the head of a combat veteran―and uncovers the story of a lifetime. When the soldier is killed, however, Falk must use all his resourcefulness to get safely back home again… and blow the lid off the whole damn thing.\"With a firm grasp of character and a superior ability to convey action (you can almost hear the bullets roaring overhead), Abnett delivers a great, readable science fiction novel and earns his comparisons to an SF Bernard Cornwell.” ―Wertzone"}, {"id": "1537753525", "genre": "Science Fiction & Fantasy", "title": "The Gender Game 2: The Gender Secret (Volume 2)", "description": "The pulse-pounding second book in The Gender Game series.Gliding over the treacherous Green in a shaky aircraft that she has no idea how to land, Violet Bates is still in shock. The harrowing events of the previous night play over in her mind as she asks herself question after question.Why did Lee Desmond Bertrand behave the way he did?What is the truth about the mysterious silver egg stowed beneath her seat?What happened to Viggo and where is her brother? Is either of them still alive?When Violet manages to reach the toxic ground alive, she has landed in a world of unimaginable danger. She has barely time to catch her breath before she is sucked into a perilous journey at breakneck speed - to uncover secrets guarded for centuries and find the only two people that matter.BUY NOW!*Beware of spoilers in the reviews below that are without spoiler alerts*"}, {"id": "0765392631", "genre": "Science Fiction & Fantasy", "title": "All Those Explosions Were Someone Else's Fault: A Novel", "description": "Monsters are real.But so are heroes.Sparks are champions of weird science. Boasting capes and costumes and amazing super-powers that only make sense if you don’t think about them too hard, they fight an eternal battle for truth and justice . . . mostly.Darklings are creatures of myth and magic: ghosts, vampires, were-beasts, and the like. Their very presence warps reality. Doors creak at their approach. Cobwebs gather where they linger. Kim Lam is an ordinary college student until a freak scientific accident (what else?) transforms Kim and three housemates into Sparks―and drafts them into the never-ending war between the Light and Dark. They struggle to master their new abilities―and (of course) to design cool costumes and come up with great hero-names.Turns out that “accident” was just the first salvo in a Mad Genius’s latest diabolical scheme. Now it’s up to four newbie heroes to save the day, before they even have a chance to figure out what their team’s name should be!"}, {"id": "0062566849", "genre": "Science Fiction & Fantasy", "title": "Rebellion's Fury (Flames of Rebellion)", "description": "The battle for freedom begun in Flames of Rebellion continues in this action-packed military science fiction tale from the author of the Crimson Worlds and Far Stars Confederation series.Damian Ward thought he was done fighting. But the retired veteran and war hero is now leading the revolution against the oppressive Federal America—a bloody battle for the future of his adopted planet that will cost brave rebel lives. But failure means living under the yoke of tyranny—a price Ward and the people of Haven refuse to pay.Federal America cannot allow Haven to break away. If rebellion is successful on one colony, it will spread, and threaten the flow of wealth and raw materials the government needs. With its superior troops and weaponry, it will crush the traitorous rebellion, and retain the empire’s standing and power.The colonists have won the first battle, and driven the government forces from the planet. But the Federals are by no means defeated. For just months after the brutal Colonel Semmes and his defeated troops return to Earth, a new force is gathering, larger, better-equipped, and augmented with front line units, veterans of the last war, ready to take back the planet and end the threat of rebellion once and for all."}]