[{"id": "0516254529", "genre": "Children's Books", "title": "Mysterious Creatures: A Chapter Book (True Tales: Exploration And Discovery)", "description": "Discusses evidence of animals that may exist, such as Champ the monster from Lake Champlain, Bigfoot, and giant octopuses."}, {"id": "1909402036", "genre": "Children's Books", "title": "Roxy May, Help my Boyfriend is a Fairy", "description": "Roxanne May McDonald lives as simple a life as any fifteen year old, she goes to school, studies hard and she has her crush, Brandon to admire from afar. Roxy's world is turned upside down when her beloved Grandfather dies. She is broken hearted and can't imagine her life without her only Granda in it. On the morning of the funeral Roxy gets a surprise, clad in a pair of moccasin slippers her Granda pays her a visit. He's just as shocked as she is, after all who expects to see the ghost of their dead grandfather in their bedroom? Turns out its not just her Granda she can now see, someone seems to have told all the stray ghosts in Aberdeen that Roxy is accepting visitors and she soon finds herself helping a number of lost souls including the sad ghost of Carrie, a girl who was murdered by an old headmaster in Roxy's school. While Roxanne is getting used to her new profession she is asked to give Brandon maths tuition, things couldn't get any better! She can't help but feel that Brandon is flirting with her and as she gets to know him better she senses something is different about him but what is it and why is he constantly eating, i mean constantly?"}, {"id": "0794501788", "genre": "Children's Books", "title": "What Were Castles For? (Usborne Starting Point History)", "description": "Answers questions about castles and everyday life in medieval times, including why castles were built, how people who lived in them amused themselves, knighthood, and the Crusades."}, {"id": "B005Q7JEL8", "genre": "Children's Books", "title": "Basketball: A Flowmotion Book: Learn How to Put Speed in Your Step, Do the Drills, and Master All the Moves", "description": "Step by step, photo by photo, put some fire in your basketball game. In this book, even the fastest moves are slowed down to frame-by-frame detail, thanks to FlowMotion™ photography. Here is everything you need to know to become a first-class player, from spacing, cutting, and setting screens to shooting, passing, and rebounding. See how to beat people off the dribble and achieve some explosive defensive footwork. There's advice on taking care of the ball, offensive and defensive strategies, drills, and speed and agility training. Thanks to FlowMotion, you'll really see the science behind the ball playing."}, {"id": "190796729X", "genre": "Children's Books", "title": "Good Luck Baby Owls", "description": "Frost-coated silence, a chill winter's night. All is quiet in the big dark barn. All is quiet except for a squeak. A squeakity-squeak in the big dark barn. \"Daddy, Daddy, Daddy!\" squeak two baby owls. \"Please, Daddy, please, can we learn how to fly?\" In this lyrical story about two baby owls impatient to grow up, stunning collage paintings perfectly capture the warmth and energy of the irresistible babies as they stretch and grow and prepare to test their wings."}]