[{"id": "0545387604", "genre": "Children's Books", "title": "STAT: Standing Tall and Talented #2: Double Team", "description": "STAT: Standing Tall and Talented-- A slam-dunk new fiction series from NBA superstar Amar'e Stoudemire!Eleven-year-old Amar'e Stoudemire has finally realized that out of all his hobbies, basketball is his true passion. Amar'e starts competing in tournaments with his two best friends, Deuce and Mike, and they are winning. While they play great together as a team, the real reason for their success is Amar'e's incredible abilities. He's carrying them. After a few big wins, Amar'e starts getting attention from some of the older, more elite players in Lake Wales. They all want him to join their squads. Amar'e wants to elevate his game and the only way to do that is to move on but his friends feel like he's leaving them behind. Without Amar'e they're barely contenders plus he never seems to have time for them anymore.Based on the life of All-Star NBA sensation, Amar'e Stoudemire, who overcame many obstacles to become one of the most popular figures in sports today."}, {"id": "0807503797", "genre": "Children's Books", "title": "Anybody's Game: The Story of the First Girl to Play Little League Baseball", "description": "In 1950, Kathryn Johnston wanted to play Little League, but an unwritten rule kept girls from trying out. So she cut off her hair and tried out as a boy under the nickname “Tubby.” She made the team―and changed Little League forever. A great story about what it means to want to do something so badly you’re willing to break the rules to do it―and how breaking the rules can lead to change."}, {"id": "1338193090", "genre": "Children's Books", "title": "Classic Chapter Book Collection (Pokémon)", "description": "Discover the original adventures of Ash and his loyal Pikachu in this classic chapter book collection! These characters can be found in Pokemon GO and the classic animated series on Netflix.This boxed set includes paperback reissue editions of the following eight Pokémon titles:THE FOUR-STAR CHALLENGEJOURNEY TO THE ORANGE ISLANDSPSYDUCK DUCKS OUTRACE TO DANGERSCYTHER, HEART OF A CHAMPIONSECRET OF THE PINK POKéMONTALENT SHOWDOWNTHUNDERSHOCK IN PUMMELO STADIUM"}, {"id": "1848986211", "genre": "Children's Books", "title": "Superbikes (Wild Rides)", "description": "\"Features the fastest and most powerful motorcycles on the roads. Provides stats and facts on each model of bike, including engine size, max speed, and cost\""}, {"id": "1482459604", "genre": "Children's Books", "title": "5: Sacagawea (Meet the Greats)", "description": "Sacagaweas critical role in the Lewis and Clark Expedition of 1804 to 1806 is irrefutable. Without her, the Corps of Discoverys exploration of the newly acquired western territory might not have been successful. However, her life before that celebrated journey is just as absorbing. This volume, with a colorful design, fun fact boxes, and historical artwork, tells the intriguing story of this Shoshone woman, including such life-changing events as her kidnapping at a young age and marriage to a French fur trapper. Readers will undoubtedly admire this woman as they learn of her courageous acts and of the Native American cultures to which she belonged."}]