[{"id": "B00JJDG02Q", "genre": "Children's Books", "title": "The Hummingbirds: A pictoral story of three little birds survival in a big world.", "description": "Stunning photographs depict a story of how a family of hummingbirds survive against tremendous odds. Pictures are interactive making the reader feel up close and personal with these elusive little birds."}, {"id": "1608869008", "genre": "Children's Books", "title": "Abigail & The Snowman", "description": "An imaginative young girl makes a new best friend—an invisible yeti!Abigail is a nine-year-old with a huge imagination but when she and her dad move to a small town, that imagination only makes it harder to fit in at her new school. All that changes when she meets a loveable and sophisticated yeti named Claude who has escaped a top secret government facility. Abigail and Claude quickly become best friends, even if no one believes that he’s real. The fun can’t last and it’s not long before the mysterious Shadow Men chasing Claude are hot on his trail. To keep him safe from his former captors, Abigail and Claude embark on a great adventure to find his real home, but it might not be exactly where they expected. Eisner and Harvey Award-winning cartoonist Roger Langridge (Thor: The Mighty Avenger, Snarked) takes readers on a heartwarming journey of loyalty and friendship."}, {"id": "1627793941", "genre": "Children's Books", "title": "Pip & Pup", "description": "An adorable baby chick and puppy become barnyard friends in this wordless picture book from Newbery Honor author Eugene Yelchin.Across the barnyard, Pip the chick spots a new friend to play with―Pup! But Pup isn't sure he likes how Pip plays―too rough. These two friends will weather the storm though. A bright, fun celebration of spring and friendship!- GODWIN BOOKS -"}, {"id": "B00UCJ63O6", "genre": "Children's Books", "title": "St. Patrick's Day for Kids!: The Amazing Story of St. Patrick's Day, Its Traditions, and How We Celebrat It (Holiday Books for Kids)", "description": "St. Patrick's Day is the day when we celebrate everything Irish.But you don't have to be Irish to enjoy St. Paddy's Day - everyone can join in the fun!Read this book and discover the rich history and traditions of St. Patrick's Day.Including...* Why do we celebrate St. Patrick's Day?* Who was Saint Patrick and why is he such an important person in history?* Why did so many Irish people come to America?* What are the fascinating traditions of St. Patrick's Day?* What are traditional Irish foods that people eat on St. Paddy's Day?* How did St. Patrick's Day get started in America?... and Much, Much More!So scroll back up and download the amazing history and traditions of St. Patrick's Day."}, {"id": "1681522276", "genre": "Children's Books", "title": "Flies (Spot)", "description": "Let's learn about creepy, crawly critters! A perfectly age-appropriate introduction to reading, this series introduces simple facts and new vocabulary to emergent readers. From butterflies to spiders, up-close photographs and carefully leveled text provide basic information about these critter's body parts and behaviors. A search-and-find feature keeps even the youngest readers engaged and entertained. This search-and-find book invites emergent readers to look for new vocabulary words and pictures while giving simple facts about a fly's body parts and behaviors."}]