[{"id": "B01949TPNK", "genre": "Children's Books", "title": "The Bird Feeder of Istanbul", "description": "In the heart of old Istanbul, a boy and his grandfather sell birdseed to travelers, who come from far away to explore the city and marvel at its beautiful mosques. Experience pigeons cooing in the square, ferryboats crossing the Bosphorus, Turkish crafts and foods, and Yeni Camii – the 350-year-old “New Mosque” at the center of community life. Discover Istanbul through your senses!The Bird Feeder of Istanbul is a charming children's picture eBook featuring color photography and an extensive glossary of Turkish and Arabic language terms for added learning."}, {"id": "0440463025", "genre": "Children's Books", "title": "Nate the Great Goes Undercover", "description": "Beginning readers are introduced to the detective mystery genre in these chapter books. Perfect for the Common Core, kids can problem-solve with Nate, using logical thinking to solve mysteries! Somebody has been raiding Oliver's garbage can each night. How can Nate narrow the long list of suspects down to one? Nate the Great might just have to go under cover . . . under cover of the garbage can lid, that is!Check out the Fun Activities section in the back of the book!  Visit Nate the Great and Sludge! NatetheGreatBooks.com*“Marc Simont’s charcoal and pastel illustrations provide the perfect backdrop for this clever case.” —School Library Journal, Starred   “First graders’ favorite private eye solves the case of Oliver’s scattered garbage in those short, easy sentences that Sharmat transforms into crisp, tough-guy humor.” —Kirkus Reviews (A Kirkus Reviews Editor’s Choice)"}, {"id": "B00KQWLPV0", "genre": "Children's Books", "title": "The Misadventures of Salem Hyde: Book Three: Cookie Catastrophe", "description": "Ah, the great outdoors. Tents, sleeping bags, nature walks, campfires . . . and maybe a few spells thrown in for good measure! In this entry in the series, Salem takes her first camping trip with the Squirrel Girls, but neither Whammy nor Salem is cut out for roughing it. Salem believes a bit of magic will smooth the way . . . but as usual, it creates more problems than it solves. Salem and Whammy are an irresistible duo in a book perfect for the youngest independent readers."}, {"id": "1788285263", "genre": "Children's Books", "title": "Color by Numbers: Under the Sea", "description": "In Color by Numbers: Under the Sea, kids ages 4 and up will lose themselves in an amazing, underwater world of color!Use the provided key to reveal enchanting under-the-sea scenes, from clownfish and coral reefs to sharks and shipwrecks, from fierce killer whales and other sea predators to leaping dolphins and cute crabs.A fresh and fun approach to the classic color by numbers activity."}, {"id": "0753462206", "genre": "Children's Books", "title": "Flip The Flaps: Baby Animals", "description": "In Baby Animals, children explore the amazing range of creatures born all over the world. In the kid-friendly language and interactive pictures, young zoologists will find answers on everything from the hatching of a baby penguin to the transformation of a tadpole. A perfect introduction to the planet's youngest inhabitants, whether furry, feathery, or scaly."}]