[{"id": "B00T76H6M8", "genre": "Children's Books", "title": "Keiki Monsters Surf At Night...", "description": "Keiki MonsTer Book Co. Keiki MonsTeRS surf at Night.... While we sleep they creep, and At night Young(Keiki) Monsters Session all of our Favorite spots and Travel to International locations like... Tahiti, Hawaii, Bali, Java, Cali, South Africa & secret spots too. Come enjoy these perfect waves And take a Journey around the World. The Keiki Monsters don't hold back with their surfing so be prepared to see extreme Monster Surfing which is happening Somewhere now, and while you are drooling on your pillow at night these creature kids are having their turn in the beloved Ocean. CHECK IT!! Written and illustrated by A.H.Brigante Keiki Monster™ is a registered Trademark by Keiki Monster Inc. and Brigante Family All rights reserved C Keiki Monster 2008-2011 Please Visit www.Keikimonster.com"}, {"id": "B019C3NRYG", "genre": "Children's Books", "title": "Fancy Nancy: Best Reading Buddies (I Can Read Level 1)", "description": "Ooh la la—Fancy Nancy is so lucky! She and her reading buddy, Violet, read together every Monday. But when a few Mondays go by without being able to meet, Nancy begins to miss her new friend. Will Violet and Nancy find a way to read together even if they’re not at school?Beginning readers will delight as Nancy has fun with her reading buddy in this Fancy Nancy I Can Read!, Best Reading Buddies, from New York Times bestselling team Jane O’Connor and Robin Preiss Glasser!Best Reading Buddies is a Level One I Can Read book, which means it’s perfect for children learning to sound out words and sentences. "}, {"id": "1558746099", "genre": "Children's Books", "title": "Chicken Soup for the Kid's Soul: 101 Stories of Courage, Hope and Laughter (Chicken Soup for the Soul)", "description": "Today's kids face grave issues and harder decisions than ever before. Gang warfare, violence, drugs, alcohol, smoking, pregnancy, depression and suicide have found their way into middle and elementary schools. Divorce splits apart families every day. These issues make kids feel as if they must understand and accept all the troubles of the world. Now more than ever, kids want and need the inspiration and hope that Chicken Soup for the Soul provides. In this special volume, young readers will find empowerment and encouragement to love and accept themselves, believe in their dreams, find answers to their questions and discover hope for a promising future."}, {"id": "0778739384", "genre": "Children's Books", "title": "Explore With Sir Walter Raleigh (Travel With the Great Explorers)", "description": "Follows the voyages of an English explorer, focusing on his journey to North America to find the Northwest Passage."}, {"id": "B071JL33TR", "genre": "Children's Books", "title": "A Strange Friendship", "description": "An exciting new and funny way, allowing small children and young persons to appreciate diversity, gain new friendships whilst maintaining self-esteem and reflecting on their behaviors in an effort to improve their quality of life.The best children's book out now. Get it and encourage your children to read."}]