[{"id": "0810942186", "genre": "Children's Books", "title": "Arches to Zigzags: An Architecture ABC", "description": "Through lively verse and striking photographs, a large-format book helps young readers learn the ABCs of architecture, including gargoyles, hinges, I-beams, urns, and more."}, {"id": "0439192595", "genre": "Children's Books", "title": "The Best Halloween Hunt Ever", "description": "Young readers are challenged to use the clues and rebus pictures to find the Halloween treats hidden amongst the pages in this fun-filled holiday book with bold illustrations, complete with answer guide. Original."}, {"id": "0439376149", "genre": "Children's Books", "title": "Captain Underpants And The Preposterous Plight Of The Purple Potty People", "description": "The eighth book in Dav Pilkey's mega-bestselling Captain Underpants series. Now with super-cool foil covers! Shiny! Fun!When we last saw George and Harold, they were about to take their pet pterodactyl Crackers back to the Cretaceous period. But things didn't work out quite as they had hoped. They've entered an absurd alternate reality where teachers are nice, kids are allowed to read banned books, and the cafeteria food doesn't smell like dirty diapers. Even worse, they've discovered alternate versions of themselves--Evil George and Evil Harold--who plan to unleash some preposterous plans on Piqua, Ohio. Now it's up to George and Harold to defeat the evil twins and THEIR superhero, Captain Blunderpants!"}, {"id": "B0096DLDGC", "genre": "Children's Books", "title": "Happy Halloween (Holidays in 3D)", "description": "There are strange goings on in the graveyard late at night. Puss the cat is watching from beneath the pale moon light. It's the spookiest Halloween party ever! Extra-thick and super-sturdy board books that make up the  Holidays in 3D  series encourage toddlers to enjoy themselves when they celebrate favorite holidays or have winter outdoor fun. Each front cover's bright illustration has layered sections that lend a three-dimensional effect to details in the cheerful pictures. Kids will love the vivid illustrations and merry stories, and parents will appreciate the books' rounded corners for safety."}, {"id": "B01551MO4S", "genre": "Children's Books", "title": "Diary of a Minecraft Iron Golem: Book 1: (An Unofficial Minecraft Book)(Minecraft Books, Minecraft Secrets, Minecraft Comics, Wimpy Diary, Minecraft Handbook, Minecraft Stories)", "description": "Ever wonder what it would be like to be a Minecraft Iron Golem?In the first book of this hilarious Minecraft adventure series, we get to read the diary of a Minecraft Iron Golem. Are Iron Golem really different from us? You'll be surprised at what you discover. So, jump into this Minecraft adventure and find out!. Diary of a Minecraft Iron Golem is a must-read for any kid who loves Minecraft. Kids ages 5+ can't wait to jump into to these Minecraft adventures! Get Your Free Copy With Kindle Unlimited Or Prime Membership Read it on your Kindle, PC, Mac, Tablet Or Smartphone! "}]