[{"id": "0545383749", "genre": "Children's Books", "title": "Scholastic Discover More: Night Sky", "description": "In-depth and up-to-date books on popular nonfiction subjects, re-imagined with eye-popping graphics, vetted by world-reknowned experts.We all star-gaze. On a cloudless night we wonder about the extraordinary myriad of bright lights in the sky. But do we really understand what we are looking at? From earliest times, people have been intrigued by the night sky. Over the centuries they have developed ever-more ingenious devices, from binoculars to powerful telescopes to spacecraft powered by the Sun's rays. With these, they have explored everything we can see, from our Moon to the most hard-to-reach areas of space. Using specially devised star charts, this book helps readers identify particular constellations, recognize the difference between a star and a planet, and understand why the entire sky appears to spin. They will discover how stars are born and die, what nebulae are, and how comets and asteroids are formed. This book is packed with the latest stunning images of our Universe and is a must-have for all young, aspiring astronomers. Hang onto your seats for this informative, stellar tour of our amazing Universe!"}, {"id": "0439878802", "genre": "Children's Books", "title": "Get Test Smart!: The Ultimate Guide to Middle School Standardized Tests", "description": "For most middle school students around the country, standardized tests have become commonplace. Now, students, parents, and teachers will finally have a guide for all they need to succeed.With Dr. Rozakis's concrete, experienced advice, middle school students will learn how to get themselves into the \"test mind-set.\" Whether the issue is deciding exactly what they need help on, building up their vocabulary, reviewing their math skills, or writing essays--Get Test Smart! has the answer. In a lucid, yet comprehensive fashion, middle grade students will have all they need to know in one easy go-to source."}, {"id": "0912777338", "genre": "Children's Books", "title": "The Art of the Catapult: Build Greek Ballistae, Roman Onagers, English Trebuchets, And More Ancient Artillery", "description": "Whether playing at defending their own castle or simply chucking pumpkins over a fence, wannabe marauders and tinkerers will become fast acquainted with Ludgar, the War Wolf, Ill Neighbor, Cabulus, and the Wild Donkey—ancient artillery devices known commonly as catapults. Building these simple yet sophisticated machines introduces fundamentals of math and physics using levers, force, torsion, tension, and traction. Updated and improved instructions and diagrams illustrate how to build ten authentic working model catapults, including an early Greek ballista, a Roman onager, and the apex of catapult technology, the English trebuchet. Additional projects include learning how to lash and make rope and how to construct and use a hand sling and a staff sling. The colorful history of siege warfare is explored through the stories of Alexander the Great and his battle of Tyre; Saladin, Richard the Lionheart, and the Third Crusade; pirate-turned-soldier John Crabbe and his ship-mounted catapults; and Edward I of England and his battle against the Scots at Stirling Castle."}, {"id": "1974270580", "genre": "Children's Books", "title": "Idea School Journal: Back To School Notebooks (School Supplies For Students)(Notebooks for School)(Composition College Ruled 8.5 x 11)(V26)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "1570611645", "genre": "Children's Books", "title": "Lootas Little Wave Eater: An Orphaned Sea Otter's Story", "description": "Lootas, Little Wave Eater tells the story of a four-week-old orphaned sea otter that was adopted by the Seattle Aquarium. Color photographs throughout the book show how human handlers raised Lootas, then introduced her to other otters, and finally weaned her from constant human contact. Illustrations help educate young readers about sea otter habitat, food, anatomy, predators, and more. Royalties from sales of this book benefit the Seattle Aquarium's Sea Otter Program."}]