[{"id": "0794504523", "genre": "Children's Books", "title": "The Amazing Adventures of Ulysses (Young Reading Series, 2)", "description": "Retells the classic Greek tale of Homer that presents Ulysses' contribution to the end of the Trojan War and his attempt to journey home."}, {"id": "B00FTDK6ES", "genre": "Children's Books", "title": "Discover Bicycles:  Level 3 Reader (Discover Reading)", "description": "Discover Reading Early Reader  Time to take a spin!  Introduce your young reader or preschooler to bicycles or get an older child excited about taking a ride. This Level 3 Reader works well for inquisitive toddlers and kids ready to stretch their reading muscle.   Discover Reading titles feature short sentences, word lists, and questions at the end of each book to further the learning process.   Find More Great Options for Kindle Kids Books! Xist Publishing Children's Books  Choose from over 180 illustrated children's books! "}, {"id": "1973358883", "genre": "Children's Books", "title": "\" PEACE TRAIN \" (Animal Bedtime story kids books)", "description": "GIVE PEACE A CHANCE *********************** Down in the valley, so peaceful, so still Stood a train with five cars right by a hill. Each car had a different animal friend And in ten more minutes, its wait there would end."}, {"id": "B00B14SECU", "genre": "Children's Books", "title": "Caterpillar: A Magical Caterpillar Picture Book for Young Readers", "description": "Download Caterpillar FREE with your Kindle Unlimited membership.Do you like insects and bugs, and everything else that crawls and flies?“Caterpillar” is a children’s picture book about the fascinating world of caterpillars.E.T. Aardentee presents close up photos of caterpillars, cocoons, and butterflies, as well as fun facts in this nature book for young readers. This carefully crafted children’s picture book makes learning and reading fun, and uses a variety of sight words critical to early reading development.Click the cover image above to take a closer look at “Caterpillar.”"}, {"id": "1617723096", "genre": "Children's Books", "title": "Aaron Rodgers and the Green Bay Packers: Super Bowl XLV (Super Bowl Superstars)", "description": "Highlights the life and accomplishments of the Green Bay Packers quarterback and examines notable moments in Super Bowl XLV."}]