[{"id": "0062304186", "genre": "Children's Books", "title": "Pete the Cat: Five Little Pumpkins", "description": "New York Times Bestseller!Bestselling author and artist James Dean brings us a groovy rendition of the classic favorite children’s song “Five Little Pumpkins,” sung by cool cat Pete and perfect for Halloween.Pete the Cat: Five Little Pumpkins is in a sturdy paper-over-board format and filled with vibrant, engaging illustrations for even the youngest of Pete fans.Young Halloween fans will enjoy chanting along with Pete:Five little pumpkinsSitting on a gate. The first one said, \"Oh my, it’s getting late.\""}, {"id": "081728107X", "genre": "Children's Books", "title": "Kwanzaa (World of Holidays)", "description": "Discusses the origins and symbols of Kwanzaa, the holiday that focuses on African American history, culture, and experiences, and offers suggestions for ways to celebrate this holiday"}, {"id": "0763638919", "genre": "Children's Books", "title": "All for Pie, Pie for All", "description": "In this merry, multi-species story cooked up with folksy warmth and humor, everybody gets a piece of the pie -- and then some.Grandma Cat makes a delicious apple pie, and there's plenty for everyone -- and even a piece left over. Grandma Mouse finds a piece of apple pie, and there's plenty for everyone -- and even crumbs left over. Grandma Ant spies some crumbs of apple pie, and there's plenty for everyone. But what's left over after cats, mice, and ants have had their fill? Little readers will eat up this scrumptious, gently math-related story that's as sweet and satisfying as a fresh-baked dessert."}, {"id": "178344648X", "genre": "Children's Books", "title": "The Funniest Dinosaur Joke Book Ever", "description": "What does a Triceratops sit on?Its Tricera-bottom! What do you call a sleeping dinosaur?A dino-snore!Why do dinosaur parties always go wrong?Because T. rex everything!Kids will roar with laughter at these dynamite dinosaur jokes!"}, {"id": "B00BQDSOB2", "genre": "Children's Books", "title": "Start It Up: The Complete Teen Business Guide to Turning Your Passions into Pay", "description": "Do you have a passion you want to turn into pay? Or maybe you are looking for a way to make some extra cash in high school? Start It Up shows teens how to turn their hobbies and talents into full-fledged businesses. Inside you ll find comprehensive and fun information on how to know what is the best business for you, pull together a company, and sell your product and let the world know about it! Whether your business is cake baking, dog walking, website design, or house painting, Start It Up offers the A-Z on getting it going and making it successful. Also featured are quotes from other successful teen entrepreneurs who turned their dreams into dollars."}]