[{"id": "1741751616", "genre": "Children's Books", "title": "Battle Order 204", "description": "David's boyhood dreams of flying led him to England for months of training to be a bomber pilot in World War II at age 19, but his final flight was a nightmare. Seconds after the bombs were released, David was wounded in five places and his fellow pilot Dog was hit. Flying metal slashed his right knee, thigh, and shoulder; the tendons and artery in his right hand were severed; and shrapnel ripped through his thick leather helmet, fracturing his skull as his aircraft went into a dive. This riveting true story takes young people through the events of a young WWII pilot’s heroic journey and his courage and endurance in the face of terrifying conditions."}, {"id": "193697519X", "genre": "Children's Books", "title": "Sonic the Hedgehog Archives 19", "description": "Sonic the Hedgehog is the longest running video game-inspired hit comic ever!Signalling a momentous change for the Sonic the Hedgehog series, Sonic the Hedgehog Archives 19 features flashbacks, time-twisting plots, and the reappearance of important figures long thought dead. Sonic himself is transformed to his contemporary form, as King Elias returns to reclaim his throne in the Kingdom of Acorn... and all of our heroes brace for the return of their greatest adversary.SONIC ARCHIVES VOLUME 19 collects issues #71-74 of the Sonic the Hedgehog comic book."}, {"id": "B00KD3OZP0", "genre": "Children's Books", "title": "HARRY STYLES - Your One Direction Guy?: 101 Fab Facts + Bonus QUIZ", "description": "Discover 101 Fabulous Facts & Secrets About British Heartthrob HARRY STYLES!Are you a fan of One Direction heartthrob, Harry Styles? Do you know everything there is to know about this amazing guy? In 'HARRY STYLES- Your One Direction Guy?', author and directioner TD Cleary brings you 101 fab facts, with Harry’s own words to back them up, and a bonus quiz to add to the fun. Find out what Harry has to say about girls, tattoos, being part of the best boy band around and much more, in his own words!. Here’s what you’ll find inside:Life Before One DirectionQuirky Facts & Funny IncidentsRomanceBeing Part of IDHarry’s FavoritesHere’s Tweeting At Ya & More Embarrassing Moments & RegretsHarry’s Best QuoteBonus Quiz QuestionsClick on the buy now button and you can be reading about Harry in 30 seconds. "}, {"id": "B003IYI7I2", "genre": "Children's Books", "title": "Jesus Calling: Enjoying Peace in His Presence", "description": "After many years of writing her own words in her prayer journal, missionary Sarah Young decided to be more attentive to the Savior's voice and begin listening for what He was saying. So with pen in hand, she embarked on a journey that forever changed her—and many others around the world.  In these powerful pages are the words and Scriptures Jesus lovingly laid on her heart. Words of reassurance, comfort, and hope.  Words that have made her increasingly aware of His presence and allowed her to enjoy His peace.  Jesus is calling out to you in the same way. Maybe you share the author’s need for a great sense of “God with you”. Or perhaps Jesus seems distant without you knowing why. Or maybe you have wandered farther from Him that you ever imagined you would. Here is a year’s worth of daily readings from Young’s journals to bring you closer to Christ and move your time with Him from monologue to a dialogue.  Each day is written as if Jesus Himself were speaking to you. Because He is. Do you hear Him calling?"}, {"id": "8854412570", "genre": "Children's Books", "title": "The Greatest Fairy Tales", "description": " This big, beautiful collection of the world’s best-loved fairy tales belongs on every child’s bookshelf.     Every child loves the imaginative power of fairy tales, and this extensive anthology is pure magic. The stories come from three of the world’s most renowned children’s authors of all time: The Brothers Grimm (“Cinderella,” “Hansel and Gretel,” “The Brementown Musicians”), Charles Perrault (“The Sleeping Beauty,” “Donkey Skin,” “Bluebeard”), and Hans Christian Andersen (“The Little Mermaid,” “The Snow Queen,” “The Wild Swans”). Francesca Rossi’s enchanting watercolor illustrations illuminate these classic stories and bring them to life."}]