[{"id": "B01H0HWUP8", "genre": "Children's Books", "title": "Amazing Pictures and Facts About Meerkats: The Most Amazing Fact Book for Kids About Meerkats", "description": "Kid’s U Presents...Meerkats - Amazing Pictures and Facts about Meerkats.  Have your children ever wondered what a meerkat looks like? Where do meerkats live? What do they eat? Are meerkats social animals? In this book you will explore the wonderful world of meerkats, finding the answers to these questions and so many more. Complete with incredible pictures to keep even the youngest of children captivated, you will all embark on a little journey into the great unknown.  In school our children aren’t taught in a way that makes them curious and want to learn. I want to change that!  This book will show your children just how interesting the world is and help ignite a passion for learning.  Your children will learn how to:    Become curious about the world around them.   Find motivation to learn.   Use their free time to discover more about the world-and have fun while doing so!   And much more! "}, {"id": "1471123197", "genre": "Children's Books", "title": "The Magical Ice Palace: A Doodle Girl Adventure", "description": "Doodle Girl uses her magic pencil to create adventures by transforming doodles into fantastical lands, full of amazing animals!On their latest outing, Doodle Girl and her friends find a curly, curvy shape. What is it supposed to be? While trying to work it out, they find a sad, lonely mammoth high up on a mountain. What’s he doing there? Will Doodle Girl be able to help him? And what is the curly curvy shape going to be? Find out in this gorgeous picture book that inspires creativity and fun—and includes a giant, free doodling poster and stickers."}, {"id": "1612253431", "genre": "Children's Books", "title": "My Trip Around the World", "description": "For ages 3-9  I woke up this morning with a smile on my face, and I began to dance and twirl.  Today is the day my family goes on a trip around the world!  A child and his family go an amazing vacation unlike any other. From the rolling green hills of Ireland, to seeing lions on an African Safari, their adventure is filled with the sights and sounds of some of the greatest places on Earth!"}, {"id": "0448401703", "genre": "Children's Books", "title": "Just a Few Words, Mr. Lincoln: The Story of the Gettysburg Address (Penguin Young Readers, Level 4)", "description": "Abraham Lincoln was one busy man. He had a country to run. And a war to win. And a family to care for. But when it came time to honor all the soldiers who had died in the great battle of Gettysburg, President Lincoln still took time to say a few words. Two hundred and seventy-one to be exact. Here is a true story about a great man and his famous speech."}, {"id": "1482421828", "genre": "Children's Books", "title": "Pirates (100 Facts You Should Know)", "description": "Many of us gathered our knowledge of pirates from books and movies. But real-life pirates were even more savage and dangerous. Through 100 facts, readers can sneak aboard various pirate ships, from ancient Greece to modern day. They'll discover pirate hideouts and how they hid their treasures. They'll learn about famous pirates, such as Black Bart, Edward Teach, Mary Read, Grace O'Malley, and others. Picture puzzles, \"I Don't Believe It!\" fact boxes, and instructive and amusing illustrations present an engrossing view of life on a pirate ship as well as a unique glimpse into several time periods of history."}]