[{"id": "097707384X", "genre": "Science Fiction & Fantasy", "title": "Dungeon Crawl Classics #29: The Adventure Begins", "description": "Remember the good old days, when adventures were underground, NPCs were there to be killed, and the finale of every dungeon was the dragon on the 20th level? Those days are back. Dungeon Crawl Classics don't waste your time with long-winded speeches, weird campaign settings, or NPCs who aren't meant to be killed. Each adventure is 100% good, solid dungeon crawl, with the monsters you know, the traps you fear, and the secret doors you know are there somewhere.  Let the adventure begin! This compilation of twenty all-new 1st-level adventures is especially designed to kick-start new campaigns. Written by experienced adventure authors, these stand-alone modules will challenge your heroes with war-worms, hang-gliding kobolds, a hundred-foot-tall colossus, giant bees, an ancient wizard's tower, trained monkeys, dangerous mushrooms, a gigantic white salamander -- and more!  Features:  • All-new cover art by legendary TSR artist Jim Roslof!  • TWENTY adventures for 1st-level characters, every one of them suitable for kick-starting an entire campaign  • A wide variety of plot hooks and unique encounters to spice up your game"}, {"id": "B01G0Q6R7C", "genre": "Science Fiction & Fantasy", "title": "Bull's Labyrinth", "description": "Early Praise for Bull’s Labyrinth:Bull's Labyrinth is an extraordinary work, seamlessly blending myth and magic with ancient and modern times. It is a love story and an adventure story that spans generations and cultures, and explores the possibilities of fates come to fruition outside the constraints of time. Exquisitely researched and rich with atmospheric detail. Witchey has written an unputdownable tale. Highest recommendations. --Elizabeth Engstrom, author of Lizzie Borden, Candyland, and Baggage CheckBull’s Labyrinth:How is a girl supposed to break a curse she doesn’t know was placed on her in a past life?Bull's Labyrinth is the story of a love that survives three-thousand years and battles an ancient Minoan curse and modern corruption.In ancient Minoan Crete, Daedalus fell in love with a herding girl named Nikkis. Yes, that Daedalus—the master mason who built the great Palace of Knossos on the island of Crete, who is said to have built the false cow in which the Minotaur was conceived, who is said to have constructed the labyrinth, who built working wings that lead to the death of his own son. Good thing he fell in love with Nikkis. Her love, intelligence, integrity, and irrepressible determination survive three-thousand years of cursed existence into the present day. In modern Crete, her work as a researcher in ancient languages takes her to Greece where she battles corruption, her own fears, and a curse she can’t begin to understand. Only finding Daedalus, breaking their curse, and triumphing over international artifact smugglers and corruption will free them both from a cycle of pain and suffering set in motion by a corrupt king three-thousand years ago."}, {"id": "B077WWZS52", "genre": "Science Fiction & Fantasy", "title": "Mercenary (Little Death Bringer Book 1)", "description": "Marin doesn’t want to be a lady. She wants to kick ass and take names. But that’ll be hard to do if she gets captured by an unknown enemy… Being raised by the King and Queen of the Elves has given Marin quite a diverse background. Burdened by her humanity and femininity, she must push herself and train every day to hold her own against the elves around her. But while Marin wants to be the first girl to graduate Macon Academy as a mercenary, her mother wants her to be a lady. And an attempt by an unknown enemy to kidnap Marin is not helping her case. Between the kidnapping attempt, growing feelings for her best male friend, and now a fiery magic growing within her, Marin’s life is changing in ways she can’t understand. If she doesn’t get a grasp on things quickly, she may lose everything she’s fought so hard to gain. If she survives at all. Fans of Kristin Cashore and Sarah J Maas will love this fantastical adventure of passion, love, and loyalty."}, {"id": "B00N2ZKQMW", "genre": "Science Fiction & Fantasy", "title": "13 Secret Cities (The full novel)", "description": "From the imagination of author Cesar Torres comes 2013's most compelling supernatural thriller. THE STORYClara Montes has a single goal in life: to achieve social justice. As she begins her freshman year in college, Clara joins the Occupy Liberation Front, a controversial political group that has planned a gathering of thousands in Chicago’s Millennium Park on a chilly Friday afternoon to protest the city’s negligence. Nothing will stop Clara from attending. When the protest turns into a riot, Clara is swept into a maelstrom of events that will change the course of American history. Clara will need to atone for her transgressions by traveling to the mythical city of Mictlán, the realm of dead spirits. During the journey, she will face the Lords of the Dead, two merciless ancient gods who thrive on the taste of human blood. Are these gods and goddesses real? What power do they have over the events in Chicago? Only Clara can find out at she descends into the underworld.What are the 13 Secret Cities? #13SC"}, {"id": "1469225875", "genre": "Science Fiction & Fantasy", "title": "1&2: Toll the Hounds (Malazan Book of the Fallen Series)", "description": "“Extraordinarily enjoyable.… Erikson is a master of lost and forgotten epochs, a weaver of ancient epics.” —SalonIn Darujhistan, the city of blue &#64257;re, it is said that Love and Death shall arrive dancing. It is summer and the heat is oppressive, but for the small, rotund man in the faded red waistcoat, discomfiture is not just because of the sun. All is not well. Dire portents plague his nights and haunt the city streets like &#64257;ends of shadow. Assassins skulk in alleyways, but the quarry has turned and the hunters become the hunted. Hidden hands pluck the strings of tyranny like a fell chorus. While the bards sing their tragic tales, somewhere in the distance can be heard the baying of hounds…and in the distant city of Black Coral, ruled by Anomander Rake, Son of Darkness, ancient crimes awaken, intent on revenge. It seems Love and Death are indeed about to arrive…hand in hand, dancing. A thrilling, harrowing novel of war, intrigue, and dark, uncontrollable magic, Toll the Hounds is the next chapter in Erikson’s monumental series—epic fantasy at its most imaginative and storytelling at its most exciting.“Truly epic in scope, Erikson has no peer when it comes to action and imagination, and joins the ranks of Tolkien and Donaldson in his mythic vision and perhaps then goes one better.” —SF Site\"This novel and all others in the Malazan Book of the Fallen series follow my own pronunciations of 'Malazan' words and names. My thanks to Michael and Jane and everyone at Brilliance Audio.\" —Steven Erikson, Victoria, B.C. Canada, January, 2014"}]