[{"id": "168152001X", "genre": "Children's Books", "title": "Down in the Jungle 1,2,3: A Rain Forest Counting Book (1,2,3... Count With Me)", "description": "Young readers will build counting skills and content knowledge with these delightful counting books! Each book increases number familiarity and counting skills, while also introducing fun facts about popular early childhood topics. Each spread clearly displays the featured number, plus photos to depict that number of objects. Simple text and high-impact photos develop basic math skills. Introduces rain forest plants and animals, such as orchids, jaguars, and snakes, while teaching the concept of counting to ten."}, {"id": "1633223965", "genre": "Children's Books", "title": "50 Wacky Things Humans Do: Weird & amazing facts about the human body! (Wacky Series)", "description": "Did you know that a sneeze moves at about 100 mph? Or that an average person sheds up to 500 million skin cells a day? Did you know that a large portion of the cells in your body are not human?50 Wacky Things Humans Do describes 50 unbelievably weird things about the human body that seem too crazy to be true, but are! Whether amazing, silly, or just plain gross, these peculiar and fascinating things about the human body will surprise and delight fun-fact lovers of all ages."}, {"id": "0399549854", "genre": "Children's Books", "title": "Everything Is Awkward", "description": "The authors of the New York Times bestselling Awkward Family Photos franchise shine a light on the awkwardness of childhood. Warning: May cause uncontrollable laughter, snorting, and milk-spewing awkward moments for parents and kids alike.   Life isn’t perfect, and things don’t always go as planned. Like when you try to feed yourself and the food ends up all over your clothes. Or when you try to ride a bike and end up taking an epic spill. Or when you try to go potty and end up in the potty!   But laughing at ourselves makes it all a little easier, and a whole lot more entertaining. So go ahead and embrace all of life’s awkward moments. Because nobody’s perfect…but everyone’s awkward.From the Hardcover edition."}, {"id": "1547094516", "genre": "Children's Books", "title": "Happy 38th Birthday: Birthday Memory Book, Birthday Journal Notebook For 38 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1616901128", "genre": "Children's Books", "title": "Hockey (Record Breakers)", "description": "Presents some of the records held in the sport of hockey, including the most NHL shutouts, the largest crowd to attend an NHL game, and the highest paid players."}]