[{"id": "0531144992", "genre": "Children's Books", "title": "Under the Ground (Machines at Work)", "description": "Describes underground areas including subways, bank vaults, and basement offices as well as the machines used to construct these places, dig tunnels, mine coal, and drill for oil."}, {"id": "B01D5GKYLA", "genre": "Children's Books", "title": "Women in Blue: 16 Brave Officers, Forensics Experts, Police Chiefs, and More (Women of Action)", "description": "Balancing deeply researched stories of trailblazers from the past with those of contemporary women, Women in Blue serves as both a historical reference and a career exploration resource. Original interviews reveal details of life on the job for various law enforcement positions, as well as practical advice from these remarkable women in the trenches. Packed with photos, sidebars on related topics, excerpts from primary sources, and including a bibliography, source notes, and more!"}, {"id": "B0714QPMKR", "genre": "Children's Books", "title": "Strong as Sandow: How Eugen Sandow Became the Strongest Man on Earth", "description": "Little Friedrich Müller was a puny weakling who longed to be athletic and strong like the ancient Roman gladiators. He exercised and exercised. But he to no avail. As a young man, he found himself under the tutelage of a professional body builder. Friedrich worked and worked. He changed his name to Eugen Sandow and he got bigger and stronger. Everyone wanted to become “as strong as Sandow.” Inspired by his own experiences body-building, Don Tate tells the story of how Eugen Sandow changed the way people think about strength and exercise and made it a part of everyday life. Backmatter includes more information about Sandow, suggestions for exercise, an author’s note, and a bibliography."}, {"id": "B0713YX6XD", "genre": "Children's Books", "title": "Zorro Original Comic Book # 9", "description": "This vintage comic book from 1968 has been digitally converted to downloadable format with original illustrations. A great classic for the home or classroom, an interesting old-fashioned reference book, and an outstanding find."}, {"id": "0141319798", "genre": "Children's Books", "title": "A Touch of Magic (My Secret Unicorn)", "description": "Lauren's pony, Twilight, turns into a beautiful unicorn when she says the magic words.Caring for your pet is really important to Lauren, especially if your pet turns out to be as special and as magical as Twilight, but her little brother Max disagrees. He has grown tired of looking after Buddy, his big, lively puppy and leaves him all alone while he goes out to play on his skateboard. But one day Buddy goes missing and Max is distraught. Lauren secretly turns Twilight into a unicorn and together they fly over the woods in search of the young dog. They find him, but he's badly injured. Twilight uses his new-found healing power to save Buddy. Max promises never to neglect his pet again - after all, you can't be best friends with a skateboard like you can with a dog!"}]