[{"id": "0766085279", "genre": "Children's Books", "title": "How Franklin D. Roosevelt Fought World War II (Presidents at War)", "description": "After Adolf Hitler attacked Poland on September 1, 1939, igniting World War II, it fell to President Franklin D. Roosevelt to keep his nation neutral while preparing it for war. When Japans surprise attack on Pearl Harbor brought that war to America, his strong, steady leadership guided it through all but four months of the most brutal war in the history of the world. Through full-color and black-and-white photos, informative sidebars, and engaging narrative, readers gain insight into Roosevelts administration and the people who advised him, as well as the combat and political strategies of the war itself and its legacy."}, {"id": "0766028941", "genre": "Children's Books", "title": "Chris Rock (African-American Heroes)", "description": "Provides a look at this well-known comedian through a review of his stand-up act, movie roles, and the television show based on his life, enhanced with colorful photos and illustrations."}, {"id": "1508170371", "genre": "Children's Books", "title": "Gymnastics: Girls Rocking It (Title IX Rocks: Play Like a Girl)", "description": "Provides information about gymnastics for girls, including exercises and basic skills, equipment, rules and safety, events and competitions, and well-known gymnasts."}, {"id": "1684151228", "genre": "Children's Books", "title": "Adventure Time: Sugary Shorts Vol. 4", "description": "This series of short stories based on the hit show from Cartoon Network includes adventures with all of your favorite characters.Sugary Shorts collects all original stories based on the hit Cartoon Network show, Adventure Time, and stars all your favorite characters, from Fionna the Human to Billy the Hero. It’s a sugary treat that any fan will enjoy!  Includes fantastical tales from Kat Leyh (Lumberjanes), Jake Wyatt (Ms. Marvel), Michael Dialynas (The Woods), Kel McDonald (Misfits of Avalon), and many more sweet storytellers."}, {"id": "B00MQHIIO0", "genre": "Children's Books", "title": "Robert and Debbie visit Philadelphia (Robert and Debbie vist Book 2)", "description": "This is the story of brother and sister Robert and Debbie and their grandparents as they spend part of their summer vacation visiting Philadelphia.  They learn about the city, and see some of the sites that make Philadelphia the city that it is."}]