[{"id": "0991381122", "genre": "Science Fiction & Fantasy", "title": "Burdened: A Burdened Novel", "description": "Tracey Warren has her last year of high school mapped out--stay focused, graduate in a few months, and get the hell out of Bennington, Virginia. Everything is working out in her favor. Life has finally started to level out, until a car accident sends her plans spiraling out of her control. Her pedestrian reality crashes around her after an innocuous encounter with a diabolically handsome stranger. Nathan Newcomb has her head and her world altering minute by minute. Soon, she discovers the only cure for the uneasy feelings and abrasive pain is Nathan himself. A man whose very existence balances between violent chaos and rigidly controlled dangers. Nathan knows the life of a woman mated to a Burdened Sephlem is destined for peril beyond a human's reckoning, that he'll be required to literally hand over his heart to her. But Tracey calls to his desire to experience love in spite of the hazards. And Nathan's impossibly potent magnetism draws Tracey into a bonding that will put her in mortal danger again and again. Once the pair becomes one, the threat escalates and nowhere is safe. There are enemies that lurk behind every corner. But the greatest danger may be in the bloodlines that course through Nathan's veins. Can their love survive or will their burdened souls surrender and fade away?"}, {"id": "B075SK8B79", "genre": "Science Fiction & Fantasy", "title": "The Can-Can Girl and the Mysterious Woman in Pink", "description": "Thrust into a world 116 years in the past, Adrienne Phillips must decipher the enigmatic words of her dying grandmother. \"Butterfly; Go to Henri. The woman in pink.\" With the help of a can-can dancer and a castaway caught in the past, Adrienne attempts to solve the riddle. The answer lies in a well-known painting by Toulouse-Lautrec at the Moulin Rouge: The Dance. First in a time travel series featuring the butterfly effect, The Can-Can Girl transports you to the world of Henri de Toulouse-Lautrec, the Belle Epoque, the Moulin Rouge, and the bohemian life in 1900 France. Book reviews have applauded the author's ability to capture the atmosphere and ambiance of the era. Come, enjoy the life and times of Paris at the beginning of the 20th century! "}, {"id": "B010GGFATI", "genre": "Science Fiction & Fantasy", "title": "Witches in the Tinderbox: The Succubus Realm", "description": "Succubus are dark witches that seduce men in dreams to do nefarious acts in their awaken states.Simple humans cannot escape their eternal realm without the help of powers beyond the average person.Samuel is just a common man entrapped by a realm of succubus that continue to haunt his eternal soul and his only out is through the help of a mortal woman who convinces an ethereal being to help."}, {"id": "1932564438", "genre": "Science Fiction & Fantasy", "title": "State of the Art 2064 (Shadowrun)", "description": "The Shadows Never Stop New toys hit the street every week, omae. Wiz new tech to exploit security holes, flashy new guns to drill your opponents, wicked new adept fu to kick some major hoop. To keep up with the Johnsons, ya gotta scan what s coming down the pipe, otherwise you ll end up as the unfortunate example in a field-test report. State of the Art: 2064 examines the latest groundbreaking developments in five aspects of the Shadowrun world. It explores the current state of police technology, tactics and prisons and details the murky world of spycraft and political espionage. It also delves deeper into both adept characters, discussing new path, powers and metamagic, and European-specific magical traditions such as street witches. Finally, it provides briefs on the latest trends in mainstream culture, sports and entertainment, with an eye towards shadowrunning opportunities. These sections include a selection of new gear, techniques and rules for both players and gamemasters. For use with Shadowrun, Third Edition."}, {"id": "1934187569", "genre": "Science Fiction & Fantasy", "title": "Unmasked II: More Erotic Tales of Gay Superheroes", "description": "They're all back and they're ready to rescue you ... those hunky, horny superheroes from Unmasked: Erotic Tales of Gay Superheroes (2007), who fulfilled your every dream and desire with their magnificent strength, their super abilities, and their charming personalities. And, we've recruited a few more to our erotic justice league of sorts to save you from those equally sexy villains. In addition, the popular and hilarious Kosher Man returns and discovers two Hebrew heroes who come to his rescue in \"Kosher Man Gets Porked\" by Milton Stern. Just like the first edition, Unmasked II delivers with a punch, a swoon, a whoosh, and quite a few giggles, and the sex is darn right hot as well. This is the most fun you will have while reading erotica because what is more fun than sexy superheroes? UNMASKED II: MORE EROTIC TALES OF GAY SUPERHEROES features erotic fiction from Armand, Derrick Della Giorgia, Erastes, Evan Gilbert, Gerrard Jones, Jamie Freeman, Jay Starre, Kale Naylor, Logan Zachary, Milton Stern, Owen Keehnen, Rob Rosen, Ryan Field, Sedonia Guillone, Stephen Osborne,Stephen Osborne, Tom Cardamone, Troy Storm, and Wayne Mansfield"}]