[{"id": "068985112X", "genre": "Children's Books", "title": "Too Many Leprechauns", "description": "On St. Patrick's Day, leprechauns are lucky. But on every other day of the year, they make for noisy neighbors -- and they're turning the entire town of Dingle upside down! Fortunately, Finn O'Finnegan always has a clever plan brewing, and this time, with a little luck of the Irish, it's a scheme that just might fool even the cleverest of creatures."}, {"id": "1785089005", "genre": "Children's Books", "title": "My First Bilingual Book–Love (English–Polish) (English and Portuguese Edition)", "description": "Guaranteed to enrich a toddler's vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting more complex concepts that go beyond colors and numbers, titles in the series feature animals, fruit, home, and vegetables. This collection combines photographs, bright illustrations, and dual-language words in clear, bold text. Suitable for both individuals and groups, these books are a child's perfect introduction to exploring other cultures."}, {"id": "1612446140", "genre": "Children's Books", "title": "The Lake of Miracles", "description": "The constant struggle between good and evil is staged in the land of Lubathar. Agatha, the great sorceress daughter of the sun and the moon, has in her hands the possibility to maintain the equilibrium between those great forces. But a threat puts her task in jeopardy leaving the human beings of the kingdom of Danvar, and the creatures of the dreams of the kingdom of Molthar at the mercy of destiny. With fantastic creatures, characters from different races, original worlds full of magic and color, action, romance and battles, this epic story travels in time, and invites you to reflect on the capacity of the human beings to build their own destiny, and reveal the true meaning of life: dreams."}, {"id": "0007215991", "genre": "Children's Books", "title": "The Tiger Who Came to Tea", "description": "This classic story of Sophie and her extraordinary tea-time guest has been loved by millions of children since it was first published fifty years ago. The Tiger has been coming to Tea for 50 glorious years! Celebrate this incredible anniversary with this special celebration edition of the classic story in paperback. The doorbell rings just as Sophie and her mummy are sitting down to tea. Who could it possibly be? What they certainly don't expect to see at the door is a big furry, stripy tiger! This inimitable picture book is perfect for reading aloud, or for small children to read to themselves time and again. First published in 1968 and never out of print, it has become a timeless classic enjoyed and beloved by generations of children."}, {"id": "1421523280", "genre": "Children's Books", "title": "The Legend of Zelda: Ocarina of Time, Vol. 2", "description": "A boy named Link sets out on a quest to deliver the Emerald, one of the three spiritual stones that hold the key to controlling the land of Hyrule, to Zelda, the country's princess, facing many perils on his journey."}]