[{"id": "B004RPMXYU", "genre": "Science Fiction & Fantasy", "title": "The AI War (Biofab 3) (The Biofab Wars)", "description": "Defeated at the Battle for Terra Two, the cyborg AIs regroup to destroy mankind. Commodore Detrelna and the battle cruiser Implacable are sent into Quadrant Blue 9 for the only weapon that can stop them. Implacable’s crew aren’t optimistic—it’s been 3,000 years since a ship came home from Blue 9.  Then they meet what’s been waiting for them. \"Kick-butt military science fiction!\"  Amazon reader review\"Space opera in the Grand Ol' Tradition.\"  Other RealmsAbout the AuthorStephen Ames Berry’s novels have been published by Ace/Berkley and Tor/Macmillan. His latest novel is the technothriller The Eldridge Conspiracy.The Battle for Terra Two could have marked mankind’s end.  It still could.  The Kronarins and their Terran allies almost went down under the onslaught of the biofabs' new allies:  AIs—Artificial Intelligences—fearsome cyborgs from humanity’s dawn come at last to kill us all.  Barely defeating AIs and biofabs, the Kronarin battle cruiser Implacable returned to Terra and its home universe, warning of an AI invasion so vast not even the dead Kronarin Empire at its height could have stopped it.Mankind’s only hope lies in a mythic weapon somewhere out in Blue 9—Quadrant Blue 9—an abandoned cube of space from which no ship’s returned since the Empire’s long ago Fall.  Ordered into Blue 9 after the weapon, Implacable’s crew must first master a horror out of their nightmares, an ancient evil that feeds off the undead it makes of the living."}, {"id": "1556346395", "genre": "Science Fiction & Fantasy", "title": "GURPS WW II Frozen Hell", "description": "GURPS WWII: Frozen Hell covers the Finnish campaigns of World War II. Strap on your skis and scrounge for ammo to fight for young Finland's continued freedom, or join the Russian armies trying to secure their border from German attack.  Frozen Hell covers all of the Finnish involvement in WWII, from the struggles of the diplomats through the sacrifices of soldiers on both sides of the wars. It includes:  Information on the Finnish armed forces, from their organization to the weapons they used;  The history of the Winter War (1939-1940), the year between wars, the Continuation War (1941-1944), and the Lapland War (1945);  Advice on diplomacy campaigning, with a character template for Diplomats.  An introduction by William R. Trotter, historian and author of A Frozen Hell, the definitive book on the subject.  GURPS WWII: Frozen Hell brings you into an unfamiliar corner of World War II - a very cold corner of a very hot war."}, {"id": "1493670301", "genre": "Science Fiction & Fantasy", "title": "Heritage (The Grimoire Saga)", "description": "Kara Magari isn't normal, even by Ourea's standards--and in a world of shape-shifters and soul stealers, that's saying something. To the royalty, she's a loose cannon. To the masses, she's a failure. But Kara doesn't have a home to go back to anymore. This war-torn world is all she has left, and she'll save it even if she dies trying.An ancient isen named Stone takes an interest in Kara's training, and it turns out he has more answers than he originally led her to believe. In an effort to unearth a secret that might end the bloodshed, Kara instead discovers an ugly truth about her family--and how much she has in common with one of the most evil men in Ourean history.Braeden Drakonin has slowly rebuilt his life after the betrayal that tore it apart. His father wants him dead, and frankly, his so-called allies wouldn't mind that either. Private alliances are formed. Secrets are sold. Tension is driving the armies apart. A single battle will end this war, and it's coming. Braeden may be a prince, but it will take more than royal blood to survive. He must take the fight to his father's door--and win.---------------- Novels in the Grimoire Saga:Lichgates (#1)Treason (#2)Heritage (#3)Illusion (#4) - Available Fall 2014"}, {"id": "B01FN98I2E", "genre": "Science Fiction & Fantasy", "title": "Dungeons & Dragons 3.5 Edition: Questions and Answers", "description": "If you have a question about Dungeons & Dragons 3.5 Edition this is the book with the answers. Dungeons & Dragons 3.5 Edition: Questions and Answers takes some of the best questions and answers asked on the rpg.stackexchange.com website.You can use this book to look up commonly asked questions, browse questions on a particular topic, compare answers to common topics, check out the original source and much more. This book has been designed to be very easy to use, with many internal links set up that makes browsing in many different ways possible.Topics covered include: Spells, Rules As Written, Character Creation, GM Techniques, Magic Items, Monsters, Optimization, Combat, Skills, Undead, Feats, Balance, Druid, Wizard and many more."}, {"id": "1401203493", "genre": "Science Fiction & Fantasy", "title": "100%", "description": "Six star-crossed characters meet in the urban twilight of Manhattan 2038 - a perversely safe future city where the citizens wear ID tags and police cruisers stalk the streets like slow-moving sharks. There's Daisy, the mysterious, fiery new go-go dancer, who makes sparks fly with the (not-so-average) busboy John. There's Strel, the club manager/mother goddess, pursued by Haitous, a former heavyweight champion fighter. And then there's Kim, the jittery barbabe, charmed by the magnetic Eloy, an artist obsessed with coaxing the perfect pitch from a chorus of 100 tea kettles. Filled with wit, sex, charm, and wonder, 100% is a prescient view of America's future."}]