[{"id": "1454923512", "genre": "Children's Books", "title": "Mission to Mars (Beyond Planet Earth)", "description": "What would it be like to travel to Mars? Find out, in this incredible book, written in coordination with the world-famous American Museum of Natural History. Perhaps no planet has stirred our imagination more than Mars. And this book, based on the American Museum of Natural History's exhibit “Beyond Planet Earth: The Future of Space Exploration,” provides an extraordinary introduction to the Red Planet. Through breathtaking images from NASA, and information sent to Earth from satellites, budding astronomers and astronauts can explore Mars’s climate and features—and find out what it would take for a human to travel there."}, {"id": "0998519405", "genre": "Children's Books", "title": "Izzie's Lost Blanket", "description": "It's almost bedtime and Izzie can't find her pink blanket! Will her brother or sister be able to help? Without her favorite blanket, how can Izzie possibly get any sleep?"}, {"id": "1448896282", "genre": "Children's Books", "title": "St. Patrick's Day (Powerkids Readers: Happy Holidays!)", "description": "St. Patrick’s Day is definitely the day to wear green. This exciting book introduces readers to some of this holiday’s most famous traditions. Readers will remain engaged from cover to cover with full-color photographs and easy-to-follow text."}, {"id": "1554983282", "genre": "Children's Books", "title": "I See the Promised Land: A Life of Martin Luther King Jr.", "description": "This stunning graphic novel biography of Martin Luther King, Jr. describes the apartheid South of his time, which in many ways was not very different from the early days of slavery. Included are descriptions of the Montgomery Bus Boycott, the formation of civil rights groups, mass movements against segregation, such as the Albany Movement and the Children’s Crusade in Birmingham, and the influence on King of Gandhi, with his nonviolent approach to resistance. Flowers’ text smoothly incorporates excerpts from many of King’s most moving speeches and concludes with a brief look at his legacy. Flowers tells a masterful story in musical prose, while Manu Chitrakar carries the tale into the vivid idiom of Patua art, turning King’s historic journey into a truly universal legacy."}, {"id": "162738927X", "genre": "Children's Books", "title": "Sonic the Hedgehog 1: Countdown to Chaos", "description": "Moving at the speed of sound, keeping the world free from robotic tyranny—it's SONIC THE HEDGEHOG! One of the oldest, most beloved videogame icons speeds into brand new comic book stories with new friends, new foes and new adventures! The entire planet has been rocked by Dr. Eggman's Super Genesis Wave! Sonic wakes up to world and a life he doesn't recognize!  It's up to him to gather up his friends, the Freedom Fighters, and figure out what's been changed. Meanwhile, below his very feet, a new threat is threatening to burst out!SONIC THE HEDGEHOG 1: COUNTDOWN TO CHAOS collects SONIC THE HEDGEHOG #252-256."}]