[{"id": "B000SEFI4G", "genre": "Children's Books", "title": "Crunch: A Novel (Soul Surfer Series Book 4)", "description": "Hamilton, Bethany and her friends discover God’s love and guidance as they tackle the waves that life hands them. Also available: Soul Surfer™ Bible, Ask Bethany, and Rise Above. In Clash, it’s a challenge to their tight-knit group when a new girl with a secret crowds Bethany and her friends. Important heart issues lead to difficult decisions. In Burned, Bethany has a run-in with an unpleasant kid on a surf trip to Samoa and discovers something in the Samoan culture that brings healing and forgiveness. In Storm, Bethany helps a young family lost on the Hanakapiai Trail. As Bethany’s youth group struggles to raise funds for a mission trip, her small act of kindness blesses them all. In Crunch, Bethany meets a little boy at an orphanage in Mexico who must have his arm removed. Concerned by his condition, Bethany makes a promise to the child that threatens her opportunity to surf in a prestigious contest."}, {"id": "0995096716", "genre": "Children's Books", "title": "Ice Kingdom (Mermaids of Eriana Kwai) (Volume 3)", "description": "The final adventure in the Mermaids of Eriana Kwai trilogy … Meela and Lysi have unleashed Sisiutl, legendary two-headed serpent of the Pacific Northwest. It was supposed to be an ally that would help them win the war. Instead, it has fallen under the control of King Adaro, ruler of the Pacific Ocean. If Meela and Lysi can’t stop him, Adaro will use the deadly serpent to rid the oceans of mankind. With the American military using catastrophic weapons of their own to retaliate, Meela and Lysi must make peace between humans and merpeople before one race destroys the other. The journey will risk their lives and put their relationship to the test—but the vengeance that has been consuming Meela’s thoughts, day and night, might prove even more dangerous."}, {"id": "0787656321", "genre": "Children's Books", "title": "001: Science of Everyday Things: Real Life Chemistry", "description": "This 4-vol. set illustrates the importance of scientific and mathematical principles through their use in everyday life. Each volume focuses on a specific scientific discipline -- biology, chemistry, earth sciences and physics -- offering students an in-depth understanding of each discipline and its theories. Creating a sense of real-life relevance for students, the Science of Everyday Things expands on the explanations of scientific principles and concepts using a straightforward, step-by-step approach, and presents theories in their everyday applications. Some of the entries covered include: how osmosis is used in dehydrating fruit; how the principles of aerodynamics are applied to cars; Charles' law and the chemical reaction that sets off an airbag; how algorithms are used to figure out the NCAA playoff tournaments; and more. Each volume the Science of Everyday Things presents approximately 40-50 entries and includes photos, diagrams, sidebars containing short glossaries and interesting facts and details relating to each principle."}, {"id": "B01N30XQ35", "genre": "Children's Books", "title": "In Search of Thanksgiving - Episode 2 (In Search of Thanksgiving serial novel Book 1)", "description": "14-year-old Kristopher learns what it really means to be thankful."}, {"id": "0756663024", "genre": "Children's Books", "title": "Tractor (Shaped Board Books)", "description": "Full of simple diagrams and fun facts, Shaped Board Book: Tractor helps kids learn how real farmers use tractors to do important jobs all around the farm."}]