[{"id": "0312513380", "genre": "Children's Books", "title": "Bright Baby Touch and Feel Hanukkah", "description": "This is an ideal first board book to share with your baby or toddler as a first step to discovering Hanukkah traditions. The pages feature familiar Hanukkah images, such as lighting candles, eating latkes and playing dreidel, and there are lots of different touch-and-feel textures, which little fingers will love to explore."}, {"id": "B0119QS8AM", "genre": "Children's Books", "title": "Mr. Goat's Valentine", "description": "After reading in the newspaper that it's Valentine's Day, Mr. Goat sets out in search of very special gifts for his first love. But just what would a goat choose as the perfect gifts to show how he feels? Readers will be in for a surprise at Mr. Goat's nontraditional selections. From acclaimed children's author Eve Bunting comes a sweet holiday tale sure to warm hearts on Valentine's Day and every day of the year."}, {"id": "151574857X", "genre": "Children's Books", "title": "Chinese New Year (Holidays Around the World)", "description": "Out with the old and in with the new! It’s time to celebrate Chinese New Year! Clean the house. Have a feast with relatives. Watch fireworks and dragon dances. Make paper lanterns. Chinese New Year, or Spring Festival, is a celebration of new beginnings."}, {"id": "1441318143", "genre": "Children's Books", "title": "Kids' Travel Journal (Interactive Diary, Notebook)", "description": "Taking a trip? Going on vacation? Great! Use this journal to keep a record of everything!Plan your trip and packing list.Write what happened on the way there and back.Write down what you did.Sketch what you saw.Rate each day.Paste in photos, tickets, maps, postcards, and more.Keep more stuff in the back pocket.Journal also includes:Puzzles and games.Maps of the world, North America, and Europe.Helpful words and phrases in other languages.Metric information.Fun world facts.Travel-related quotes from kid's books.Full-color photos and illustrations.Acid-free archival paper preserves your journaling. Makes a great keepsake!Elastic band attached to back cover keeps your place or keeps journal closed.Recommended for ages 7 to 12.6-1/4 inches wide by 8-1/4 inches high (15.9 cm wide by 21 cm high).Hardcover.96 pages."}, {"id": "0060556501", "genre": "Children's Books", "title": "The Lion, the Witch and the Wardrobe (picture book edition) (Chronicles of Narnia)", "description": "A picture book retelling of C. S. Lewis's classic story The Lion, the Witch and the Wardrobe for the youngest fans! Introduce them to the magic of Narnia with this picture book featuring illustrations by Tudor Humphries.Now younger children can share the magical experience, entering into a world of enchantment that will forever lure them back. Four adventurous siblings step through a wardrobe door and into the land of Narnia, a land frozen in eternal winter—but never Christmas—cursed by the power of the White Witch. Only Aslan, the Great Lion, can reverse her wicked spell.The Lion, the Witch and the Wardrobe can also be read as a novel. It is the second book in C. S. Lewis's classic fantasy series, The Chronicles of Narnia, which has been drawing readers of all ages into a magical land with unforgettable characters for over sixty years."}]