[{"id": "1619695758", "genre": "Children's Books", "title": "I Funny: A Middle School Story", "description": "Jamie Grimm is a middle schooler on a mission: he wants to become the world s greatest standup comedian even if he doesn't have a lot to laugh about these days. He s new in town and stuck living with his aunt, uncle, and their evil son Stevie, a bully who doesn t let Jamie s wheelchair stop him from giving Jamie a good pounding every once in awhile. But Jamie doesn t let his situation get him down. He practices his craft every day on friends, family, and the willing customers at his Uncle Frankie s diner. When Uncle Frankie mentions a contest called The Planet s Funniest Kid Comic, Jamie knows he has to enter. But are the judges only rewarding him out of pity because of his wheelchair, like Stevie suggests? Will Jamie ever share the secret of his troubled past instead of hiding behind his comedy act? Following the bestselling success of the hilarious \"Middle School: The Worst Years of My Life,\" James Patterson continues to dish out the funnies in another highly-illustrated, heartfelt middle school story. \""}, {"id": "0431072698", "genre": "Children's Books", "title": "WorldFocus: South Africa (Paperback)", "description": "Using OXFAM's bank of photographs and its detailed specialist knowledge, the \"WorldFocus\" series provides an authentic portrait of what life is really like for people living in the countries covered. Each book has a country profile, an in-depth study of a typical locality, case studies of real people showing how they spend their time, what their jobs are and the challenges they face. This book looks at the real people, real places and real issues of South Africa."}, {"id": "1579240658", "genre": "Children's Books", "title": "1: Mice of the Westing Wind, Book One", "description": "Charles and Oliver help Admiral Winchester with his plan to recapture the pirate sea dogs who have escaped from prison."}, {"id": "0152004386", "genre": "Children's Books", "title": "Coyote and the Fire Stick: A Pacific Northwest Indian Tale", "description": "On the top of a mountain, guarded by three Evil Spirits, mighty Fire blazes. From their cold, dark lodges in the valley below, the People long for Fire. But how can they get it? This is a job for wise and crafty Coyote. “Sparks in this book fly from the pictures as well as from the words.”--School Library Journal"}, {"id": "1250171105", "genre": "Children's Books", "title": "A Sick Day for Amos McGee", "description": "THE BEST SICK DAY EVER and the animals in the zoo feature in this striking picture book debut.Friends come in all sorts of shapes and sizes. In Amos McGee's case, all sorts of species, too! Every day he spends a little bit of time with each of his friends at the zoo, running races with the tortoise, keeping the shy penguin company, and even reading bedtime stories to the owl. But when Amos is too sick to make it to the zoo, his animal friends decide it's time they returned the favor.A Sick Day for Amos McGee is a 2011 Bank Street - Best Children's Book of the Year and the winner of the 2011 Caldecott Medal. This title has Common Core connections."}]