[{"id": "1593277741", "genre": "Children's Books", "title": "Scratch Coding Cards: Creative Coding Activities for Kids", "description": "Want to introduce kids to coding in a fun and creative way?With the Scratch Coding Cards, kids learn to code as they create interactive games, stories, music, and animations. The short-and-simple activities provide an inviting entry point into Scratch, the graphical programming language used by millions of kids around the world.Kids can use this colorful 75-card deck to create a variety of interactive programming projects. They’ll create their own version of Pong, Write an Interactive Story, Create a Virtual Pet, Play Hide and Seek, and more!Each card features step-by-step instructions for beginners to start coding with Scratch. The front of the card shows an activity kids can do with Scratch—like animating a character or keeping score in a game. The back shows how to put together code blocks to make the projects come to life! Along the way, kids learn key coding concepts, such as sequencing, conditionals, and variables.This collection of coding activity cards is perfect for sharing among small groups in homes and schools.Uses Scratch 2"}, {"id": "1681197375", "genre": "Children's Books", "title": "Girl on Pointe: Chloe's Guide to Taking on the World", "description": "Chloe Lukasiak is a big believer that things happen for a reason. She knows that life would be easier without disappointments, bullying, and medical issues-but sometimes it takes challenges to inspire you to achieve big things. From her status as fan favorite on the hit reality television show Dance Moms through her life as a social media star with millions of fans, Chloe has found that self-acceptance and kindness are the key to getting over the rough spots in life and realizing your passions. This full-color, heavily designed book featuring never-before-seen photos, inspirational quotes, and Chloe's own doodles and poetry offers exclusive insight into Chloe's world as well as a message that will inspire all readers to be their very best selves."}, {"id": "B01GYPT6EA", "genre": "Children's Books", "title": "Emma and the Whale", "description": "In this lyrical picture book with subtle conservation themes, a girl helps rescue a whale who has washed ashore. Here is a beautifully written, moving story that will appeal to all animal lovers, and to those interested in protecting our oceans and marine life.   Emma lives in a crooked house in an old whaling town, and often takes her dog, Nemo, to the beach. On their walks, they find amazing treasures, like shells and stones and sea glass—and even a loggerhead turtle. But one day, they find something completely unexpected: a baby whale, washed ashore. Emma empathizes with the animal’s suffering, imagining what the whale is thinking and feeling. When the tide starts to come in, Emma pushes as the water swirls and rises, and eventually the whale swims free, back to her mother."}, {"id": "1585362395", "genre": "Children's Books", "title": "Loonies and Toonies: A Canadian Number Book (Discover Canada Province by Province)", "description": "What do Shakespeare, salmon, sled dogs and the Queen of England have in common? They all play a part in Canadian life, and they are just a few of the topics covered in this book. Taking its name from the one-dollar and two-dollar coins in Canadian currency, Loonies and Toonies provides a well-rounded view of the country's past and present. This virtual tour briefs children on the metric system, as well as on Canada's ceremonial link to the British monarchy. En route, they'll be inspired by stories of Terry Fox's courageous run for cancer research and the undefeated record of the Bluenose sailing schooner. Before the trip ends, they'll also discover why its not a good idea to go over Niagara Falls in a barrel!"}, {"id": "B0195QJU3M", "genre": "Children's Books", "title": "Trash to Treasure", "description": "This children's book was written and illustrated by The Lego Masters, a First Lego League team. It is a story about a boy, Max, who does not have enough money to buy his grandmother a present. His friend, Jen, teaches Max how to compost to make healthy soil for a garden to grow his own presents. This story was written and illustrated by the Lego Master team as part of a project for the 2015 First Lego League challenge; Trash Trek. The goal of this story is to get children to learn about composting and be inspired to try it themselves."}]