[{"id": "B01N0ZAP3P", "genre": "Children's Books", "title": "Easter (Little Words Matter™)", "description": "A few little words can tell a big story about Easter! From palm branches to an empty tomb—Easter is the biggest story of all. Now toddlers can learn all about it in just 12 child-friendly words.  In the Little Words Matter™ board books, it only takes a few words to tell a big story. Crafted especially for toddlers, these books make biblical truths easily understandable and enjoyable for little ones and their parents too!  "}, {"id": "1631778277", "genre": "Children's Books", "title": "The Adventures of Connor the Courageous Cutter: Caution at Calamity Canal", "description": "he Adventures of Connor the Courageous Cutter: Caution at Calamity Canal is the exciting new sequel to the first book in the series, Saving Sarah. Follow Connor the Cutter as he and Faith the Fireboat set out to explore the wonders of Beacon Island.When Connor and Faith lose track of time, they must choose between the long, safer route or taking a dangerous shortcut through Calamity Canal. Will they abide by the Harbor Master's warning or will their decision lead them into peril? Continue to follow Connor and his fun-loving friends as they learn lessons in courage, teamwork, and friendship with each new adventure."}, {"id": "0471317845", "genre": "Children's Books", "title": "Teresa Weatherspoon's Basketball for Girls", "description": "Great news for the millions of young hoopsters dreaming of someday running with the pros: two-time Olympian and professional star Teresa Weatherspoon is sharing all of her basketball secrets! In this fun and informative book, not only will you get the inside scoop on passing, dribbling, defending, shooting, and all the rules of the game, you'll also learn why Spoon believes that unselfishness, hard work, and a positive attitude are as valuable as technical skill.  With tons of instructional photos and heaping \"Spoon\"-fuls of inspiration, personal history, and inside tips, Teresa Weatherspoon's Basketball for Girls delivers all the goods. In no time, you'll be tearing up the courts, burning up the nets, and showing how it's really done!"}, {"id": "1445140047", "genre": "Children's Books", "title": "Here to Help: Postman", "description": "Have you ever me the person who delivers the post to your home? Perhaps one day you might like to become a postal worker? In this book you will meet our postman, Shaun - and some of his colleagues - and see what he does at work every day. Find out what it is like to deliver the mail, how they stay safe and how they deliver special parcels and letters.Here to Help is a brilliant introductory series books for very young readers (aged 5 and up) that follow real professionals around their place of work to give a flavour of what it means to work in a particular job. Additional question boxes encourage the reader relate the information they are reading to their own experiences. Each book concludes with some advice on the type of person suitable for each job and the education and training you will need to qualify. Specially commissioned photographs of real professionals ensure the books are accurate and a true representation of what it is like to work in a range of public-facing jobs."}, {"id": "142633141X", "genre": "Children's Books", "title": "Absolute Expert: Dinosaurs", "description": "Tear through tons of facts, figures, timelines, and the most up-to-date intel straight from the field, with National Geographic explorer and paleontologist Steve Brusatte as your expert guide, in this cool book all about dinosaurs.Have you met Pinocchio rex? Meet this fascinating dino along with favorites, such as Tyrannosaurus, Stegosaurus, Triceratops, Velociraptor, Apatosaurus, Ankylosaurus, Giganotosaurus. Plus, check out some weird or newly discovered dinos you may not know about. See how fossils are formed. Learn about the epic, earth-shaking extinctions that paved the way for life today. Find out whether dinosaurs really had feathers, and so much more! All this, along with special features, awesome illustrations, sidebars, wacky trivia, and facts from experts in the field, make this the ultimate book to help YOU become an absolute expert on one of your favorite subjects."}]