[{"id": "1946101435", "genre": "Children's Books", "title": "The Monstructor", "description": "Naughty Monsters. Have they forgot? To learn their manners they must be taught. Little monsters are acting like humans at school. Oh no! Their teacher gets the Monstructor to come in a save the day."}, {"id": "0307105342", "genre": "Children's Books", "title": "Music (Find-It-Quick Guides)", "description": "Offers a list of websites that provide information on such commonly asked questions concerning music as \"Where can I teach myself to play guitar?\" and \"Where can I hear live Dj broadcasts?\""}, {"id": "B0716SHZXH", "genre": "Children's Books", "title": "Little Dragon and the New Baby", "description": "Little Dragon just found out he is going to be a big brother... and he's not happy about it. He doesn't want to share his parents' attention, or his room! Little Dragon doesn't even want to look at the egg. He ignores it, tries hiding it, and even \"decorates\" it, which just makes a big mess.But soon enough... Rattle, rattle, CRACK! When the big moment finally arrives, the whole family receives a surprise! Maybe things aren't so bad after all."}, {"id": "B076DX9B7M", "genre": "Children's Books", "title": "World's Weirdest Sharks (Wild World of Sharks)", "description": "Chances are, when you think of sharks, it's the great white or hammerhead that swim into view! But the world's oceans hold around 500 different species of sharks, and some are extremely bizarre. Check out sharks with strong fins used to crawl on land, a whip-like tail to stun fish, a saw-like snout, and cunning seaweed camouflage. Meet the owners of these cool features and find out how they use them. Superb photographs and action-packed text take you down to the depths to view an array of fascinating but rarely seen creatures."}, {"id": "0606106618", "genre": "Children's Books", "title": "Soccer Day (Turtleback School & Library Binding Edition) (After-School Sports Club (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. At the After School Sports Club, Sammy is not as good at soccer as the other children, but he keeps trying to improve before the parents come for Open House."}]