[{"id": "B073Z4ZDW9", "genre": "Science Fiction & Fantasy", "title": "Rilex & Severine's Story  (Uoria Mates IV Book 6)", "description": "With the journey to Penthos nearly over, Rilex and newly-named Severine wake in each other's arms. Something has changed between them, but with the danger still building around them and so many more questions to answer, neither is sure they are ready to find out exactly what. As the ship prepares to land they part to get ready, and Severine overhears a conversation that brings all of the changes that she is facing crashing around her. In an instant, she can no longer see the future that she thought she might be building, and she wonders if she can ever really get beyond her origins. Reeling from Severine's sudden change of heart, Rilex heads out onto Penthos to find Ciyrs, starting a chain of events that will leave both of them questioning everything as the war waits just on the horizon. Read for FREE on Kindle Unlimited!"}, {"id": "1601250371", "genre": "Science Fiction & Fantasy", "title": "Pathfinder #2 Rise Of The Runelords: The Skinsaw Murders", "description": " The Rise of the Runelords Adventure Path continues with the second adventure: \"The Skinsaw Murders.\"  A sudden string of brutal killings terrorizes Sandpoint, and the killer's mark bears a distrubing similarity to the strange rune the goblins in the previous adventure had taken as their tribal totem.  Investigation leads the heroes to confront a sinister murderer who has claimed a notorious haunted mansion as his lair.  Yet this murderer is one of many, a member of a group of killers who call themselves the Skinsaw Men and have adopted an ancient magic involving the seven deadly sins.  The PCs must travel to the bustling city of Magnimar to unravel the truth behind the rune, but in so doing may become prime suspects in the killings themselves!  This volume of Pathfinder includes a detailed description of the city of Magnimar, several new monsters, and rules for new types of wizardly specialists who focus their studies on sin magic.  "}, {"id": "B00UHX9BQE", "genre": "Science Fiction & Fantasy", "title": "The Arena", "description": "Bran was one of the most dangerous and revered humans in the galaxy before he vowed never to fight again.His new existence is not accepted and a bounty is placed on Bran's head. When he's captured and imprisoned, the only way he can earn his freedom is to fight in The ArenaIf he fights, his captors will profit from television rights and gambling and he will earn his freedom. But freedom means nothing to Bran…until his captors raise the stakes.The Arena is a Science Fiction Space Opera short story, that looks at how violence can both empower and destroy"}, {"id": "B077DVHPQ1", "genre": "Science Fiction & Fantasy", "title": "Jank Heroes One-Shot RPG Book: Volume One (Jank Heroes One Shot Book 1)", "description": "Jank Heroes One-Shot is a one hour RPG made for two players. The game takes place in the city of Springdale, home to portals that connect to other dimensions, timelines and universes. Both players play as roommates in Springdale apartments who awaken to an exciting event that kickstarts their journey. The goal of the game, no matter what variation you play, is for both players to achieve their character’s goal without dying within the one hour time-limit. Players have access to their own secret base, vehicle, communicator watch and potentially any set of superpowers they desire. The possibilities for adventure are endless! Included in this book are multiple variations of Jank Heroes One-Shot, each with their own rules and mechanics. Select the game variation that’s right for you and your friends, or create your own based on the game variations provided. Grab your friends, create your characters and jump right into the world of Jank Heroes One-Shot!"}, {"id": "0765379546", "genre": "Science Fiction & Fantasy", "title": "Survival: A Novel (Star Quest Trilogy)", "description": "Ben Bova continues his hard SF Star Quest series which began with Death Wave and Apes and Angels. In Surivival, a human team sent to scout a few hundred lightyears in front of the death wave encounters a civilization far in advance of our own, a civilization of machine intelligences.These sentient, intelligent machines have existed for eons, and have survived earlier “death waves,” gamma ray bursts from the core of the galaxy. They are totally self-sufficient, completely certain that the death wave cannot harm them, and utterly uninterested in helping to save other civilizations, organic or machine.But now that the humans have discovered them, they refuse to allow them to leave their planet, reasoning that other humans will inevitably follow if they learn of their existence.The Star Quest Trilogy#1 Death Wave#2 Apes and Angels#3 Survival"}]