[{"id": "0316512443", "genre": "Science Fiction & Fantasy", "title": "The Saga of Tanya the Evil, Vol. 1 (light novel)", "description": "At the very edge of the front lines stands a young girl. She has golden hair, blue eyes, and pale, almost translucent skin. This girl soars through the skies, mercilessly cutting down her enemies. She barks crisp orders with the unmistakable voice of a child. Her name is Tanya Degruechaff.But her true identity is that of a 40 year old Japanese elite salaryman who was forced by god to be reborn in the vessel of a little girl who must live in a tumultuous world racked by war. Concerned with being ultra-efficient and desiring self-promotion above all else, Degurechaff will join the ranks of the Imperial Army's Military Mages and become one of the most feared existences in this new world..."}, {"id": "B0788BKCTX", "genre": "Science Fiction & Fantasy", "title": "Ogreness: A Black Lake Novel", "description": "Humor—Suspense—Ogre romance Ogres Ike and Nuel are thrust into the middle of dangerous politics and persecution when a troll cop is unfairly arrested for murder with no expectation of justice. Rioters prowl the streets shouting, Ike’s head on a pike. Resentment for ogre success and industry rockets, and with it, the fear humans hold for the giants. There’s nasty history between their peoples. The arrogant Ike and uptight Nuel may not be the best candidates to sketch a path to peace, considering they don’t even like each other."}, {"id": "B01H6PDVM0", "genre": "Science Fiction & Fantasy", "title": "Muramasa: Blood Drinker: A Supernatural Mystery of Feudal Japan", "description": "A cursed blade; a legendary tale...At the bidding of his lord, master swordsman Taoka Yoshio follows the bloody trail of a murderer who is seemingly empowered by sorcery. As samurai, Yoshio acts as retainer to the  beautiful and enigmatic Amaya, the daughter of his sworn liege, on their quest. Amaya, however, has ambitions and plans that are quite different from the tasks appointed by her father. Along their way, they meet and befriend a legendary swordsmith, with whose help they begin to uncover the terrifying truth of the mysterious killer and his demonic blade. As they all become entangled in the webs of the Ashikaga shogunate’s schemes, they must each face the hard truths of their pasts to survive their trials and defeat evil.Danger, intrigue, bloody revenge, and demons await Yoshio, is he strong enough to survive?"}, {"id": "B004YTT2OI", "genre": "Science Fiction & Fantasy", "title": "The Wicked Kiss (Alexa O'Brien Huntress Series Book 2)", "description": "                  Book 2:Alexa O'Brien is a magnet for trouble. Due to the power she shares with bad ass vampire, Arys Knight, power hungry creatures are eager to get a taste of her. That includes Arys' sadistic sire, a vampire that sees her as a toy, perfect for his personal collection. If he doesn't kill her, she just might wish he had.Alexa is in danger, something her wolf mate Shaz blames entirely on Arys. The tension runs high when an argument blows up into a full physical confrontation between the two men. Alexa learns there is one way to protect herself from those who see her as a walking, talking power trip. Now she is faced with her biggest decision yet.But can the two men she loves put aside their differences when it matters most? Because this is one sacrifice that will forever alter her very mortality."}, {"id": "1932241981", "genre": "Science Fiction & Fantasy", "title": "Marvel TCG: Spider-Man Vs. Doc Ock 2-Player Starter Set", "description": "Superpowered action! Upper Deck Entertainment brings the characters of the Marvel Universe to life in this exciting new trading card game. Enlist heroes and villains such as Spider-Man, Green Goblin, or Doc Ock and battle to victory! Each 2-player Starter Set includes two 40 card Decks (80 Total Cards), 2 Variant Foil Cards, Rule Booklet, and Game Mat. 80 Cards per Set. Also available: Marvel TCG: Spider-Man Vs. Doc Ock 2-Player Starter Set Box ($97.50, ISBN: 1-932241-97-3) with 6 sets per box."}]