[{"id": "0060290242", "genre": "Children's Books", "title": "Dinosaur Tracks (Let's-Read-and-Find-Out Science 2)", "description": "Have you ever wanted to take the same steps as a dinosaur or see how your foot compares to that of a Tyrannosaurus rex? Amazingly, the tracks or footprints of dinosaurs that walked on the earth millions of years ago can still be seen today! Read and find out about the astonishing discoveries scientists have made just from the footprint of a dinosaur."}, {"id": "B014LZK1W6", "genre": "Children's Books", "title": "Minecraft: Diary of a Wimpy Blaze (An Unofficial Minecraft Book): (Minecraft, Minecraft Secrets, Minecraft Stories, Minecraft Books, Minecraft Comics, ... Villager, Minecraft Books for Kids)", "description": "Ever wonder what it would be like to be a Wimpy Blaze?In this hilarious Minecraft adventure series, we get to read the diary of a Wimpy Blaze. Are Blazes really different from us? You'll be surprised at what you discover. So, jump into this Minecraft adventure and find out!Diary of a Wimpy Blaze is a must-read for gaming fans of all ages! Get Your Copy Today or Read It FREE With Kindle Unlimited!"}, {"id": "0791066266", "genre": "Children's Books", "title": "The Many Faces of Buddhism (Religions of Humanity)", "description": "Presents the history, principles, and various branches of Buddhism, which was founded in India in the sixth century B.C. by Siddhartha Gautama."}, {"id": "1891806017", "genre": "Children's Books", "title": "Adventures of Captain Love & Dr. Smart", "description": "The Adventures of Captain Love & Dr. Smart is first in a  series of 24 children's books that introduces the characters, a little  boy hero and companion robot with a computer heart, who live on a  loving Planet \"Heartland\", where there is no violence or crime. The  King of Hearts sends these heroes to Earth to teach Earthling kids  (3-8) love and early values. This book teaches choosing right over  wrong, through this fun, entertaining story, in verse."}, {"id": "006022407X", "genre": "Children's Books", "title": "Arthur's Great Big Valentine (I Can Read Level 2)", "description": "\"[In] this lovely valentine from Hoban to all beginning readers, a minor squabble with his best friend, Norman, has left Arthur all alone this wintry Valentine's Day [until] Norman's little brother saves the day, and the two best friends are reunited. This title will warm up any snowy, blustery day.\"—SLJ. "}]