[{"id": "B00GZ1DSMK", "genre": "Children's Books", "title": "Changing the Pattern: The Story of Emily Stowe (Stories of Canada)", "description": "When Emily Stowe was born in 1831, every girl's life followed a set pattern. Her future was limited to housework and childcare. With the help of original sketches and archival material, Changing the Pattern creates a vivid picture of Canada in the late 1800s as it follows Emily's crusade to create new patterns for girls' lives."}, {"id": "B0015AZBC6", "genre": "Children's Books", "title": "Hello Hello", "description": "An illustrated collection of one original and four traditional songs: \"Hello, Hello,\" \"Crawdad Song,\" \"Get on Board Little Children,\" \"Alabama Bound,\" and \"Mairi's Wedding."}, {"id": "0606400893", "genre": "Children's Books", "title": "The Ghostfaces (Turtleback School & Library Binding Edition) (Brotherband Chronicles)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When a massive storm at sea blows the Brotherband crew off course to a land so far west Hal cannot recognize it from his maps, they face an unknown enemy."}, {"id": "B005UGT9Z6", "genre": "Children's Books", "title": "Great Moments in the Summer Olympics (Matt Christopher)", "description": "The Summer Olympics are chock full of epic athletic achievements across hundreds of disciplines, especially Track and Field, Gymnastics, and Swimming. These are the sports that gave us Jesse Owens and Carl Lewis, Wilma Rudolph and Jackie Joyner-Kersee, Olga Korbut and Mary Lou Retton -- tremendous athletes whose Olympic accomplishments thrill us now just as much as they did when they occurred. Now readers can relive those moments in this fact-filled volume just right for young sports enthusiasts. And because it's Matt Christopher, young readers know they're getting the best sports writing on the shelf! "}, {"id": "B00FIPCLEK", "genre": "Children's Books", "title": "The Arch of Avooblis (The Adventurers' Academy Book 1)", "description": "Can a rogue be a hero?Dagdron was raised as a rogue, his dagger his only companion and pickpocketing his favorite pastime. But when his father forces him to attend the Adventurers’ Academy, where warriors, enchanters, and rogues learn how to fulfill quests to become heroes, Dagdron must face a whole new life. When Dagdron is accused of stealing the Arch of Avooblis, he and his ever-honorable roommate, Earl, embark on a quest to recover the magical crystal. Along the way they must deal with the mysterious Headmaster Gwauldron, a snobby princess-enchantress, and the fact that their involvement with the Arch of Avooblis may very well cost them their lives.Book 1 in the Adventurers' Academy Series"}]