[{"id": "B011QAT86O", "genre": "Children's Books", "title": "Sadie and Ori and the Blue Blanket", "description": "Sadie, Ori, and Grandma all love the soft blue \"Together Blanket\" that Grandma knit when Sadie was born. They use it for building forts, for snuggling and fun. As Sadie and Ori grow up and as Grandma gets older, too, the blanket continues to bring the family comfort in very special ways."}, {"id": "0237521180", "genre": "Children's Books", "title": "The Romantic Poets (Writers in Britain)", "description": "This volume is part of the Writers in Britain series which introduces children to great literary figures. This title examines the lives of the romantic poets, taking in Blake, Coleridge, Keats, Shelley, and Wordsworth and considers the time in which they wrote their poetry."}, {"id": "1481460269", "genre": "Children's Books", "title": "The Sea Lion (Lighthouse Family)", "description": "Newbery Medalist Cynthia Rylant brings the peaceful sounds, sights, and characters of the coast vividly to life in the seventh book of the Lighthouse Family series, in which the family cares for a baby sea lion.One morning, the lighthouse family wakes up to find a baby sea lion asleep in their kitchen! The baby, whose name is Topper, explains that his mother left him here and instructed him to wait for her return. Pandora the cat and Seabold the dog are happy to care for Topper, and mouse children Lila, Whistler, and Tiny are excited to make a new friend."}, {"id": "1445158787", "genre": "Children's Books", "title": "EDGE: I HERO: Monster Hunter: Alien", "description": "Take on the role of the Monster Hunter in this fully interactive, flick-through-the pages, choose-your-own-destiny adventure story.YOU are the Monster Hunter, protector of the living, and nightmare of the paranormal. Aliens have landed and your specialist services are urgently required...Written by the award-winning duo Steve Barlow and Steve SkidmoreAge appropriate for 8+. Also suitable for reluctant readers and less confident older readers. Printed using a font approved by the British Dyslexia Association."}, {"id": "1477826300", "genre": "Children's Books", "title": "Pipsie, Nature Detective: The Disappearing Caterpillar (Pipsie, Nature Detective Series)", "description": "Pipsie loves everything wild—from dragonflies to oceans to tall, tall trees. She also loves solving mysteries. That’s why she’s a nature detective! When she and her turtle, Alfred, notice that their new friend, Frannie the caterpillar, has vanished, Pipsie is on the case. She grabs her magnifying glass, goes to her tree-house headquarters, and begins to search for clues. It’s time to make this mystery history!Bursting with personality, this engaging story introduces a spunky new girl detective, a scooter-driving turtle who loves to eat, and a string of simple scientific clues that will keep kids turning the pages until the mystery is solved. Two pages of nature fun facts at the end of the story offer even more information for young nature detectives."}]