[{"id": "0762461764", "genre": "Science Fiction & Fantasy", "title": "Harry Potter Talking Sorting Hat and Sticker Book: Which House Are You? (Miniature Editions)", "description": "Get sorted into House Gryffindor, Ravenclaw, Hufflepuff, or, yes, Slytherin, with this delightfully magic talking sorting hat, just like in the Harry Potter films! This collectible kit includes:  3-inch miniature replica of the Sorting Hat, featuring the voice from the film saying the names of the 4 houses of Hogwarts School of Witchcraft and Wizardry at random for proper sorting 16-page sticker book featuring 8 full-color photographic stickers"}, {"id": "B00HGM0FXW", "genre": "Science Fiction & Fantasy", "title": "Colony (Terran Chronicles Book 3)", "description": "Humanity’s first spacecraft, the Terran, finally returns home. The crew is stunned to discover that while their trek lasted for less than a year, three years has passed on Earth. Gamin technologies have begun making their way into everyday life, which in turn has changed the world’s political landscape.Fearing the Terran lost, a coalition of nations has pooled their resources into building a new spacecraft at the alien construction dock. They also constructed a massive space-station, one to replace the International Space Station which was destroyed by the Gamin.Meanwhile, other nations have not been lax in their integration of alien technologies. China turns their economic might to the study the alien technology, and to further their own plans for space exploration. Other countries, fearing being left behind, join one side or the other, and combine their resources into the escalating space race. But who will launch their spaceship first? The Terran has survived its first foray into space, the crew returning home has made new friends, and discovered fresh dangers. The Terran’s return ignites the world, their survival, and discoveries sparks renewed efforts into humanity’s expansion into space.While the coalition continues to steadily construct their colony ship, China shocks everyone when their spacecraft launches first. In a surprise move, China disavows the ship, and declares it’s crew enemies of the state. This ship causes considerable havoc, then leaves Earth’s orbit, heading into the vast expanse of space."}, {"id": "0765367866", "genre": "Science Fiction & Fantasy", "title": "Unwrapped Sky (Caeli-Amur)", "description": "A hundred years ago, the Minotaurs saved Caeli-Amur from conquest. Now, three very different people may hold the keys to the city's survival. Once, it is said, gods used magic to create reality, with powers that defied explanation. But the magic―or science, if one believes those who try to master the dangers of thaumaturgy―now seems more like a dream. Industrial workers for House Technis, farmers for House Arbor, and fisher folk of House Marin eke out a living and hope for a better future. But the philosopher-assassin Kata plots a betrayal that will cost the lives of godlike Minotaurs; the ambitious bureaucrat Boris Autec rises through the ranks as his private life turns to ashes; and the idealistic seditionist Maximilian hatches a mad plot to unlock the vaunted secrets of the Great Library of Caeli-Enas, drowned in the fabled city at the bottom of the sea, its strangeness visible from the skies above. In a novel of startling originality and riveting suspense, these three people, reflecting all the hopes and dreams of the ancient city, risk everything for a future that they can create only by throwing off the shackles of tradition and superstition, as their destinies collide at ground zero of a conflagration that will transform the world . . . or destroy it. Unwrapped Sky is a stunningly original debut by Rjurik Davidson, a young master of the New Weird."}, {"id": "B077SWBVHN", "genre": "Science Fiction & Fantasy", "title": "Mad Scientist Journal: Winter 2018", "description": "Cooking advice, previously undiscovered species, and tortured artists. These are but some of the strange tales to be found in this book.Mad Scientist Journal: Winter 2017 collects thirteen tales from the fictional worlds of mad science. For the discerning mad scientist reader, there are also pieces of fiction from Laura Arciniega, Judith Field, and Alexander Forbes. Readers will also find other resources for the budding mad scientist, including an advice column, gossip column, and other brief messages from mad scientists.Authors featured in this volume also include E. B. Fischadler, Zach Bartlett, Catherine L. Brooke, Tamoha Sengupta, Darren Ridgley, Maureen Bowden, H. Pueyo, J. A. Psoras, Robert Dawson, J. A. Grier, Stewart C. Baker, Rebecca Siân Pyne, Joachim Heijndermans, Sophie Sparrow, David Wing, Andy Brown, Lucinda Gunnin, and Sean Frost. Art provided by Errow Collins, Scarlett O'Hairdye, Shannon Legler, Luke Spooner, Amanda Jones, Justine McGreevy, and Liz Argall."}, {"id": "1556342837", "genre": "Science Fiction & Fantasy", "title": "Gurps Lensman: Starkly Astounding Space-Opera Adventure", "description": "Based on the Classic Novels by E.E. \"Doc\" Smith  The Galactic Patrol is the army and police force of the Civilization that fills two galaxies. Its prime agents are the Lensmen . . . incorruptible, powerfully psionic, ready for anything. They stand between Civilization and the ancient evil of Eddore. The Eddorians infiltrate with drugs, crime and corruption. The Lensmen fight back with everything from blasters to space fleets.  Players take the part of Lensmen, ultra-tech warriors for good from many alien races. Major characters, important planets, weapons, and the Lens itself are described for player and GM use. The \"Space Opera Combat System\" lets referees quickly moderate space battles to determine who won and what happened to the major characters."}]