[{"id": "0375812105", "genre": "Children's Books", "title": "Meet Christopher Columbus (Landmark Books)", "description": "When Christopher Columbus was young, he worked for his father making cloth. But he did not want to be a cloth-maker all his life. Hewanted to see new lands and have adventures. He wanted to be a sailor! By the time he was 25, Christopher had sailed to France, Africa, and Greece. He had seen strange cities and had many adventures. But his greatest adventure would come when he set out for China and found a whole new world instead."}, {"id": "1454914866", "genre": "Children's Books", "title": "My First Baseball Book (First Sports)", "description": "A child's first introduction to sports Game on! Perfect for parents to share with their toddlers, this simple board book introduces kids to very basic vocabulary associated with this popular sports. The contemporary design features one word per page, a nice big photo, and a diverse selection of children in the pictures. Plus, the covers are appealingly tactile, with deep embossing and eye-catching spot gloss. Kids will grab hold of it again and again.  Baseball. Bat. Glove. Catch. This baseball book is a home run! "}, {"id": "1474741010", "genre": "Children's Books", "title": "Dawn of Time: Creation Myths Around the World (Graphic Library: Universal Myths)", "description": "Gather round to hear of how the earth came to be told from ancient myths around the world! Dawn of Time gathers seven diverse creation stories in one book so readers can discover the unique differences and surprising similarities between these world myths all recreated in gripping graphic novel format. Dive into legends from various mythologies and traditions, including Inuit, Mayan, Egyptian, Chinese, and more. Extra info provides insight into the culture and primary sources from which these myths originated. With the Universal Myth series, readers can experience exciting multicultural tales brought to life!"}, {"id": "1454928549", "genre": "Children's Books", "title": "Know Your Rights!: A Modern Kid's Guide to the American Constitution", "description": "We the People of the United States, in Order to form a more perfect Union . . . establish this Constitution for the United States of America.A simple, unintimidating introduction to the US Constitution and the rights it grants every American citizen. The American Constitution is one of the nation’s most important documents—but what is it saying, exactly? This book helps children understand the answer to that question. In simple, accessible language, it describes how the Constitution was drafted and who the Founding Fathers were; provides a summary of all the articles, amendments, and the Bill of Rights; and explains why the document remains so relevant today."}, {"id": "1482421860", "genre": "Children's Books", "title": "Pyramids (100 Facts You Should Know)", "description": "People travel thousands of miles to see the pyramids in Giza, Egypt. Even with the amazing skyscrapers constructed today, these 4,500-year-old wonders remain some of the most astounding structures on Earth. In this well-researched volume, 100 facts about these intriguing buildings and other pyramids will take readers around the world to Egypt, China, Mexico, and even a glass pyramid in Paris, France. Vibrant photographs, interesting activities, and fun quizzes and diagrams will keep readers engaged as they learn about history, culture, architecture, and more."}]