[{"id": "0310761190", "genre": "Children's Books", "title": "Faithgirlz Promises for You Coloring Devotional: 60 Days Discovering God’s Hope and Love", "description": "Take time to enjoy God’s Word and color images from his beautiful world. In this 60-day coloring devotional filled with unique illustrations and patterns, you will read about God’s unchanging promises through NIV Bible verses, paired with detailed line art. Each page is printed on high-quality, thick paper stock that won’t bleed through. And when you’re finished coloring with markers, metallic pens, or colored pencils, you will have a chance to reflect and journal about each promise from Scripture, and find inspiration for every day. Perfect for girls 8-12."}, {"id": "B01DQIUZNE", "genre": "Children's Books", "title": "Tales of Westerford: Dragons, Knights and Kings", "description": "From deep within the ring of fire, burning logs, and smoldering ash, grows a tale of an adventurous boy and a magical discovery.Nat is a young boy who lives with his family in Sutter, a small village in the Kingdom of Westerford. Like all children his age, Nat loves to play “knights” with his friends. He dreams of one day becoming a knight himself and serving the noble King Edgar. Nat’s other favorite activity is exploring the nearby forest where, one day, he, quite literally, stumbles upon a giant egg.When the egg finally hatches, so does a series of events that leads to the fulfillment of Nat’s wildest dreams. This is the story of two young friends who take on adventures to save the kingdom. With his best friend, Danby, by his side what could possibly go wrong?The Tales of Westerford: Dragons, Knights and Kings is a collection of stories born in the campfire tradition and meant to be shared aloud with family and friends. Watch as the flames come to life before the children’s eyes with the adventures of Nat and Danby and the Knights and Kings of Westerford."}, {"id": "0758604572", "genre": "Children's Books", "title": "My Happy Easter Book - Arch Books", "description": "The most popular children's Bible story series in the world! Generations of Christian children have learned the Bible through the lively poems and colorful illustrations of Arch Books. Parents trust these much-loved books to teach their children Bible stories in a fun, memorable way. The Arch Books series of more than 75 titles is conveniently divided into 10 sections that include related stories for an organized journey through the Bible."}, {"id": "B073VNJXDW", "genre": "Children's Books", "title": "The 13th Doorway (2 Book Series)", "description": "From Book 1: Mark, Megan and Andrew can't help noticing when their teacher's hand goes into his interactive whiteboard and comes out soaking wet. He is as shocked by the situation as they are! It turns out that they have just discovered The 13th Doorway and are desperate to find out what awaits on the other side; in Andrew's case, a little too desperate! They soon realise that they are not the first to use the doorway and are shocked to find out exactly what happened to the last person who did so. Who are the large creatures who reside in this other world? Where do the other twelve doorways lead? Why is our entire Universe in danger?  We have all read stories about other worlds but this is a \"splendidly original\" take on a classic storytelling idea. The creatures who live in the other place and their role in the creation of our world are new to literature.  Written with readers aged 9-16 in mind, The 13th Doorway will have a far wider appeal and is an adventure that everyone can enjoy. Danger, Puzzle, Horror, Excitement, Drama, Romance and a journey back in time to the moment of all creation await any intrepid reader who dares enter .... The 13th Doorway."}, {"id": "1631775855", "genre": "Children's Books", "title": "Common House Creatures, Pests, and Irritants", "description": "Common House Creatures, Pests, and Irritants is a children's book by Cathleen Trotter. Ever wonder how the socks mysteriously disappear from the dryer? Or why toothpaste ends up everywhere? You just might fight the culprit here!"}]