[{"id": "0749651725", "genre": "Children's Books", "title": "1939-1945 (Armies of the Past)", "description": "Armies of the Past looks at how soldiers, sailors and airmen lived and fought in significant historical time periods, from Ancient Egypt to World War II. Packed with information, the series focuses on the social history of warfare, including recruiting, drilling, camp life and caring for the wounded as well as armour, weapons, forts and fortifications and battle tactics. Through realistic artwork and lively fact-filled text, each title in Armies of the Past is a fascinating demonstration of how people were moulded into efficient fighting forces and how they lived and worked together."}, {"id": "1935125850", "genre": "Children's Books", "title": "Sterling's Howl", "description": "An Intriguing Story About A Lone Wolf * * Sterling was a lone wolf born to help animals who want to live in peace. Sterling was raised by Timmy's family after he found the baby wolf on a cold winter day. * * The story explains that the earth also belongs to the animals and unless we take better care of our environment many animals will become extinct."}, {"id": "B00Q5LJE5K", "genre": "Children's Books", "title": "Dugout Hero (Little Rhino #3)", "description": "\"A new chapter book series from Major League Baseball's 2006 National League MVP, Ryan Howard!The Mustangs were on a hot winning streak and every victory was important. Little Rhino's whole team was cheering for him. Even Dylan was standing on the bench rooting for Little Rhino, the home run hitter. It all came down to the next pitch. When the pitcher threw the ball, Little Rhino swung as hard as his arms could handle, felt a pop in his ankle, and dropped to the ground. That was yesterday. Today, Little Rhino is propped up on the couch with a sprained ankle. The doctor said Little Rhino is not going to be able to play baseball for the next two weeks. Rhino's friends keep dropping by to bring him his homework but Rhino just wants to be back on the field. Can he find a way to help his team without playing?\""}, {"id": "1974237656", "genre": "Children's Books", "title": "Composition Notebook: Grade 4 Back To School Notebooks or A Cool Journal for Boys (Notebooks for School)(Composition College Ruled 8.5 x 11)", "description": "Composition Notebooks For The Back To School is Cool KidsWhether it is the start of the school year or half way through it these school journals are great gifts for boys and girls, students of any age and teachers.Filled with ruled paper this school workbook is a must have for every student whether they are Grade 1, 2, 3, or even 6. It is 8.5 x 11, with 120 pages offering ample room for school homework and notes.These back to school journals work great for:Back to School Memory BookBack to School Supplies & EssentialsSchool Year Keepsake BookSchool Record & PlannerHomeschooling School SuppliesComposition Books & HomeworkTeachers Gifts & Stocking StuffersBirthday Gifts for KidsAnd much more…..Scroll up and grab a cool and unique school notebook for kids today!"}, {"id": "B004O0U0UC", "genre": "Children's Books", "title": "The Five Mouse Brothers", "description": "Amazon Prime Members can download this book for FREE on your Kindle deviceFive mouse brothers live happily in Bok Tong Goh Village. But then...One brother, falsely accused of thievery, must face the \"Wheel of Doom.\" What will they do to rescue him from his fate? Fortunately, an ingenious plan with the help of their family secret may just save the day. Join the mouse brothers on this fun and entertaining adventure, adapted from a classic Chinese folktale.Another quality children picture book from the father and daughter team of Michael and Rachel Yu."}]