[{"id": "146540242X", "genre": "Children's Books", "title": "DK Readers L2: Astronaut: Living in Space", "description": "Perfect for kids who have started to read but still need some help, this Level 2 DK Reader explores the fascinating world of an astronaut and what it is like to live in space. With longer sentences, increased vocabulary, information boxes with fun facts, and a simple index, this book shows young readers what it's like to hold down a job in zero gravity."}, {"id": "0735842620", "genre": "Children's Books", "title": "Armstrong: The Adventurous Journey of a Mouse to the Moon", "description": "A long time ago a mouse learned to fly . . . and crossed the Atlantic. But what happened next? Torben Kuhlmann's stunning new book transports readers to the moon and beyond! On the heels of Lindbergh: The Tale of a Flying Mouse comes Armstrong: A Mouse on the Moon—where dreams are determined only by the size of your imagination and the biggest innovators are the smallest of all. The book ends with a brief non-fiction history of human space travel—from Galileo’s observations concerning the nature of the universe to man's first steps on the moon."}, {"id": "0606367527", "genre": "Children's Books", "title": "Who Was Beatrix Potter? (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Born into wealth in 1860's London, Beatrix Potter always had a vivid imagination. Her early interests included natural history and archaeology, and Potter delighted in sketching fossils and fungi. After briefly illustrating Christmas cards with her brother, Bertram, Potter wrote and illustrated her well-known book, The Tale of Peter Rabbit. The book was rejected by several publishes until Frederick Warne eventually took a risk and published the story in 1902 - a risk that paid off. Peter Rabbit was a huge success and readers loved hearing about Peter's mischevious adventures in the lush English countryside. As she got older, Beatrix Potter became a proud conservationist, working hard to defend the landscape she loved so well against industrialization and logging. Now over one hundred years old, Peter Rabbit and his animal friends have become cultural touchstones and continue to delight readers of all ages."}, {"id": "B00I9IMMKG", "genre": "Children's Books", "title": "65 Days of Kindness: A Kindness Kids Adventure (Kindness Kids Adventures)", "description": "The Kindness Kids journey through Cyberspace to learn about the 65 Days of Kindness for the Season for Nonviolence and meet Mahatma Gandhi and Dr. Martin Luther King."}, {"id": "1586176234", "genre": "Children's Books", "title": "Francis: The Poor Man of Assisi (The Life of a Saint)", "description": "Francis of Assisi, one of the most famous and beloved saints, comes to life for young people in this addition to The Life of a Saint series. With vivid, four-color pictures on every page, the book shows Francis becoming a brother and friend to all- lepers, the poor, and animals too. The story begins with the saint's birth and joyful youth. After military service, imprisonment, and illness, Francis has a dramatic encounter with God. He then gives up everything - even the clothes on his back - in order to follow Jesus in poverty and humility. Among the episodes in the life of Francis are the taming of the wolf of Gubbio and the first living Nativity scene. Also included is the conversion of Saint Clare, who was inspired by Francis to leave her life of luxury in order to give herself completely to the love of God. The simple but engaging text can be read independently by young readers or read aloud to small children."}]