[{"id": "0345443020", "genre": "Science Fiction & Fantasy", "title": "Perdido Street Station (Bas-Lag)", "description": "Beneath the towering bleached ribs of a dead, ancient beast lies New Crobuzon, a squalid city where humans, Re-mades, and arcane races live in perpetual fear of Parliament and its brutal militia. The air and rivers are thick with factory pollutants and the strange effluents of alchemy, and the ghettos contain a vast mix of workers, artists, spies, junkies, and whores. In New Crobuzon, the unsavory deal is stranger to none—not even to Isaac, a brilliant scientist with a penchant for Crisis Theory.Isaac has spent a lifetime quietly carrying out his unique research. But when a half-bird, half-human creature known as the Garuda comes to him from afar, Isaac is faced with challenges he has never before fathomed. Though the Garuda's request is scientifically daunting, Isaac is sparked by his own curiosity and an uncanny reverence for this curious stranger.While Isaac's experiments for the Garuda turn into an obsession, one of his lab specimens demands attention: a brilliantly colored caterpillar that feeds on nothing but a hallucinatory drug and grows larger—and more consuming—by the day. What finally emerges from the silken cocoon will permeate every fiber of New Crobuzon—and not even the Ambassador of Hell will challenge the malignant terror it invokes . . .A magnificent fantasy rife with scientific splendor, magical intrigue, and wonderfully realized characters, told in a storytelling style in which Charles Dickens meets Neal Stephenson, Perdido Street Station offers an eerie, voluptuously crafted world that will plumb the depths of every reader's imagination."}, {"id": "1606907840", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Volume 4: Origins", "description": "To prove themselves to the Pathfinder Society, Valeros the fighter and his companions must recount tales of their early exploits in a world beset by magic and evil. Thrill to the solo adventures of Valeros, holy warrior Kyra, Seoni the sorcerer, martial artist Sijan, Harsk the dwarven ranger, and Ezren the wizard, as they journey treacherous lands, survive wild creatures and fairy magic, unearth ancient threats, and prove their heroism time and time again!  With six captivating stories (each connected by a common narrative thread) and explosive artwork, this fourth volume in the Pathfinder graphic novel series expands upon the mythos of Paizo's award-winning fantasy world, fiction line, and tabletop RPG.  Collection Features:  * Pathfinder: Origins issues #1-6 by Erik Mona (Publisher of Paizo Publishing, LLC), game designers James L. Sutter and F. Wesley Schneider, and artists Tom Garcia, Kevin Stokes, and Leandro Oliviera  * All 30 beautiful covers by Stjepan Sejic, Tom Garcia, Sebastian Cichon, Andrew Huerta, Sean Izaakse, Kevin Stokes, Jorge Faras, and Leandro Oliviera  * 24 pages of encounters, characters, and world detail for the Pathfinder RPG  * An all-new, removable poster-map of the region explored in the comic"}, {"id": "B076GT5GBW", "genre": "Science Fiction & Fantasy", "title": "Mermagic (The Witching World Book 6)", "description": "Captured souls. Monstrous creatures from the ocean depths. Secret races of magicians. A threat more terrible than any before it. Magic has never been more deadly.The immortal Count and the dark Merqueen haven't managed to claim Clara or her powers—yet. Even with their personal magic bound, they're hunting Clara with more force than she knows how to handle. They contain the magic of the hundreds of souls they've drained.Clara has her own power, one they haven't been able to touch, a secret binding element that gives life to all magic. She's stronger than ever, with a love great enough to dismantle the Count and Merqueen's devastating illusions.But when you love as fiercely as Clara does, you have too much to lose. If the Count and Merqueen can't have Clara, then they'll take everything—and everyone—she loves. Unless she can find the way to stop the two most feared magicians of the underworld before she loses everything worth living for.If you like stories with non-stop adventure, empowered heroines, moody magicians, mythical creatures with attitude, and castles with personality, you'll love Mermagic, the final installment in The Witching World series."}, {"id": "B073DCB98Y", "genre": "Science Fiction & Fantasy", "title": "Bobiverse (3 Book Series)", "description": "From Book 1: Bob Johansson has just sold his software company and is looking forward to a life of leisure. There are places to go, books to read, and movies to watch. So it's a little unfair when he gets himself killed crossing the street.  Bob wakes up a century later to find that corpsicles have been declared to be without rights, and he is now the property of the state. He has been uploaded into computer hardware and is slated to be the controlling AI in an interstellar probe looking for habitable planets. The stakes are high: no less than the first claim to entire worlds. If he declines the honor, he'll be switched off, and they'll try again with someone else. If he accepts, he becomes a prime target. There are at least three other countries trying to get their own probes launched first, and they play dirty.  The safest place for Bob is in space, heading away from Earth at top speed. Or so he thinks. Because the universe is full of nasties, and trespassers make them mad - very mad."}, {"id": "1925645037", "genre": "Science Fiction & Fantasy", "title": "For Steam and Country (Adventures of Baron von Monocle) (Volume 1)", "description": "Her father's been pronounced dead. Destructive earthquakes ravage the countryside. An invading army looms over the horizon. And Zaira's day is just getting started...   Abandoned at an early age, Zaira von Monocle found life as the daughter of a great adventurer to be filled with hard work and difficulty. She quickly learned to rely on only herself. But when a messenger brought news that her father was dead and that she was the heir to his airship, her world turned upside down.   Zaira soon finds herself trapped in the midst of a war between her home country of Rislandia and the cruel Wyranth Empire, whose soldiers are acting peculiarly—almost inhuman. With the enemy army advancing, her newfound ship’s crew may be the only ones who can save the kingdom.  For Steam and Country is the first book in the Adventures of Baron Von Monocle series by top-10 Amazon best selling space opera author, Jon Del Arroz.    \"Witty, charming and downright thrilling!  Del Arroz nails the feel of good old fashioned Steampunkery with wit, aplomb and of course... panache.\" - Nick Cole, author of the Dragon Award winner, CTRL ALT Revolt  \"FOR STEAM AND COUNTRY is a rousing girl-powered fantasy tale. I thoroughly enjoyed this action-packed airship adventure!\" - Laurie Forest, author of The Black Witch"}]