[{"id": "B072N61KDT", "genre": "Children's Books", "title": "Brother Yun: The Heavenly Man of China (Potter's Wheel Books Book 4)", "description": "Yun lived in the time of the Cultural Revolution of China–no Bibles were to be found anywhere, because all of them had been burned and the families who owned them had been severely beaten or killed. But through a dream and a miracle, God provided Yun with the Bible he needed. Yun began to preach all over China. He was captured, but amazingly escaped, again and again. Thousands of people came to Christ, and together the Chinese Christians saw many miracles."}, {"id": "080506530X", "genre": "Children's Books", "title": "Thanksgiving in the White House", "description": "Hardcover: 32 pages ; Dimensions (in inches): 8.00 x 0.25 x 10.25 Publisher: Henry Holt and Co. (BYR); 1st edition (September 1, 2003) ISBN: 080506530X Ages 4-8 President Abraham Lincoln's youngest son, Tad, is very fond of Jack the turkey. He has tamed him and taught him tricks, and the bird follows him all around the White House yard. But Jack was meant to be the main dish of the first official Thanksgiving celebration. Tad doesn't want his pet to be eaten for dinner, not even for a day as special as Thanksgiving! Can he convince his father to save Jack's life?\""}, {"id": "0606401946", "genre": "Children's Books", "title": "The Battle For Amphibopolis (Turtleback School & Library Binding Edition) (Nnewts)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. In the final, epic installment of the Nnewts trilogy, the fate of all Nnewts hangs in the balance! Herk, falling under the influence of Blakk Mudd, is slowly turning into a Lizzark and abandoning his Nnewt friends. Herk's siblings, Sissy and Zerk, have been corrupted by evil and the Lizzark army is still threatening Amphibopolis with total destruction. Now the Nnewts need a true hero to step up and save the day before it's too late!"}, {"id": "0141325283", "genre": "Children's Books", "title": "Tales of the Greek Heroes (Puffin Classics)", "description": "The mysterious and exciting legends of the gods and heroes in Ancient Greece, from the adventures of Perseus, the labours of Heracles, the voyage of Jason and the Argonauts, to Odysseus and the Trojan wars. Introduced with wit and humour by Rick Riordan, creator of the highly successful Percy Jackson series."}, {"id": "0312550235", "genre": "Children's Books", "title": "Happy Valentine's Day, Dolores", "description": "Time and time again Dolores has been told to keep out of her big sister Faye's room. But when Dolores sees Faye hiding a mysterious heart-shaped box, she can't resist sneaking in and taking a peek. Join the irrepressible Dolores and her long-suffering cat, Duncan, in this hilarious escapade as Dolores pushes the limits of sisterly love and learns that, in matters of the heart, it's important to give, as well as take."}]