[{"id": "0996045880", "genre": "Children's Books", "title": "The Pigs Did It!", "description": "It's bedtime, but Mom hears loud noises and laughter coming from her son's room. When she goes to check on him, she finds clothes and toys everywhere; even a broken broom! He blames the mess on the pigs who sneaked in and tied him to his bed and dared him to clean his room."}, {"id": "B076DKLT6Z", "genre": "Children's Books", "title": "The Curse Ends: The story of the 2016 Chicago Cubs!", "description": "This epic tale tells the story of the 108 years of heartbreak, the infamous Curse of the Billy Goat and the monumental return to glory as World Series Champions in 2016!"}, {"id": "1580131018", "genre": "Children's Books", "title": "Thank You, God! A Jewish Child's Book of Prayers (English and Hebrew Edition)", "description": "A first prayer book for young children, with 21 traditional prayers in simple Hebrew, transliteration, and English. Contains blessings for a new day, bounty of our food, Sabbath, and holiday rituals."}, {"id": "0142300047", "genre": "Children's Books", "title": "Morris' Disappearing Bag", "description": "Bestselling author Rosemary Wells tells a heartfelt holiday story The Chicago Tribune calls “One of the best.”It’s Christmas day and Morris is missing. He was there to open his present—a teddy bear—and to watch his older sisters and brother open their gifts. His siblings went off to play with each other’s new toys, but nobody wanted to play with Morris’s bear. So Morris found something new to play with—a disappearing bag. He jumped right in and became invisible! Now he has something everybody wants to try. But they have to find him first. This warm and humorous story proves that sometimes the littlest bunny gets the last laugh.* “Irresistible . . . The author-artist does some wonderful things with Morris’s cars and eyes, expressing exactly the sentiments of a put-out preschool rabbit.”—Booklist, starred review"}, {"id": "1588100537", "genre": "Children's Books", "title": "Isaac Newton (Groundbreakers)", "description": "A portrait of the physicist's life assesses his accomplishments in the field of science, his rescue of the British mint and its currency, his intellectual battles with his colleagues, and his fascination with religious ideas."}]