[{"id": "0748780815", "genre": "Children's Books", "title": "Philosophy of Religion and Religious Ethics AS/AA2 for OCR Study Guide", "description": "Endorsed by OCR for use with the 2004 A Level Religious Studies specification, and written by popular author Robert Bowie."}, {"id": "5550156946", "genre": "Children's Books", "title": "Mosque (Signed Edition)", "description": "An author and artist who has continually stripped away the mystique of architectural structures that have long fascinated modern people, David Macaulay here reveals the methods and materials used to design and construct a mosque in late-sixteenth-century Turkey. Through the fictional story and Macaulay\"s distinctive full-color illustrations, readers will learn not only how such monumental structures were built but also how they functioned in relation to the society they served. As always, Macaulay has given a great deal of attention to the relationship between pictures and text, creating another brilliant celebration of an architectural wonder."}, {"id": "0805098275", "genre": "Children's Books", "title": "Little Elliot, Big Fun", "description": "In this third story of Little Elliot and Mouse, the friends head off in search of adventure . . . and lots of fun!Little Elliot, the polka-dotted elephant, and his friend Mouse go to the amusement park to see the sights and ride the rides―water chutes, roller coasters, carousels, and more. But Elliot isn't having much fun―the rides are too wet, too fast, too dizzy, and just plain too scary―until Mouse figures out a way to help him overcome his fears. Together, Mouse and Little Elliot can do anything!"}, {"id": "1515797082", "genre": "Children's Books", "title": "Simone Biles: Gymnastics Star (Women Sports Stars)", "description": "Simone Biles is one of the country’s best female athletes. Learn about her childhood, the challenges she has overcome, and this gymnast’s greatest accomplishments. Get the inside scoop on her gold-medal-winning Olympic appearance."}, {"id": "0516263927", "genre": "Children's Books", "title": "Machines We Use (It's Science)", "description": "Examines various simple machines and how they are used to make work easier and provides activities using wheels, levers, pulleys, screws, and more"}]