[{"id": "0689838751", "genre": "Children's Books", "title": "Don't Be Afraid of the Dark (Bear in the Big Blue House, 4)", "description": "Everyone is having fun at Bear's sleepover party. But when the lights are turned off, Bear's friends can't fall asleep because of the scary things they think are in the dark. Help Bear come to the rescue by uncovering the surprises hidden under the flaps."}, {"id": "1338110985", "genre": "Children's Books", "title": "My Rainbow Surprise", "description": "Open your eyes and celebrate a dazzling world of colors in this imaginative rhyming board book with colorful tiered pages and a clever die-cut shape that looks just like a rainbow!My Rainbow Surprise is sure to delight curious readers of all ages with its irresistible rainbow theme, rhyming text, foil title, and eye-catching illustrations by the talented Anna Dunn. A chunky, satisfying novelty board book that celebrates every color of the rainbow!"}, {"id": "1575055848", "genre": "Children's Books", "title": "Ramadan (On My Own Holidays)", "description": "Muslims around the world celebrate the month of Ramadan to honor Allah. During every day in that month, Muslims do not eat food between sunrise and sunset. Then, each night at sunset, they say special prayers and eat a special meal. After almost four weeks of fasting this way, they have a great three-day festival called Eid al-Fitr to celebrate the challenges they met during Ramadan and the coming year."}, {"id": "0785761055", "genre": "Children's Books", "title": "Zack's Alligator (An I Can Read Book)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When Zack soaks his new alligator keychain in water, it grows into a full-sized and fun-loving alligator."}, {"id": "0966225775", "genre": "Children's Books", "title": "Adventures of Riley--Tigers in Terai", "description": "In Riley's first book, Riley and family travel to the exotic and lush Terai Arc region of India and Nepal, where there is much concern over the dwindling Bengal Tiger population and habitat."}]