[{"id": "1101936703", "genre": "Children's Books", "title": "Dream March: Dr. Martin Luther King, Jr., and the March on Washington (Step into Reading)", "description": "An inspiring biography introducing children to the civil rights movement, Dr. Martin Luther King, Jr., and the historic march on Washington.Young readers can now learn about one of the greatest civil rights leaders of all time, Dr. Martin Luther King, Jr., in this Level 3 Step into Reading Biography Reader. Set against Dr. King’s historic march on Washington in the summer of 1963, a moving story and powerful illustrations combine to illuminate not only one of America’s most celebrated leaders, but also one of America’s most celebrated moments.   Step 3 Readers feature engaging characters in easy-to-follow plots about popular topics. For children who are ready to read on their own."}, {"id": "1406377791", "genre": "Children's Books", "title": "The Wolf, the Duck and the Mouse", "description": "Early one morning a mouse met a wolf and was quickly gobbled up...When a woeful mouse is swallowed up by a wolf, he quickly learns he is not alone: a duck has already set up digs and, boy, has that duck got it figured out! Turns out it's pretty nice inside the belly of the beast - there's delicious food, elegant table settings and, best of all, dancing. And there's something more: no more fear of being eaten by a wolf! Life's not so bad, considering the alternatives. That is, until a hunter shows up... With a nod to traditional fables and a wink to the reader, the award-winning Mac Barnett and Jon Klassen of Sam and Dave Dig a Hole, Extra Yarn and Triangle offer a tale of cooperation and creative cuisine that is sure to go down easy."}, {"id": "B072LPDMB3", "genre": "Children's Books", "title": "Leaves: An Early Reader Book (Nature 1)", "description": "Leaves are beautiful and in this Early Reader book, your child will learn new vocabulary in simple sentences associated with different leaves...Spring leaves, Winter leaves, and even leaves with bugs!"}, {"id": "1981154906", "genre": "Children's Books", "title": "Seahorses Coloring Book 1 (Volume 1)", "description": "The perfect coloring book for every child that loves seahorses. 40 coloring pages filled with seahorses. Art is like a rainbow, never-ending and brightly colored. Feed the creative mind of your child and have fun! Each picture is printed on its own 8.5 x 11 inch page so no need to worry about smudging."}, {"id": "0872263878", "genre": "Children's Books", "title": "Sikhism", "description": "This book takes an exciting look at the religion of Sikhism and answers questions about what Sikhism followers believe, where and when Sikhism began, where the followers pray, and what the major holidays of Sikhism are. Using color photographs and detailed illustrations, this book helps young people form a better understanding of Sikhism and its believers."}]