[{"id": "B005L4Z9OW", "genre": "Children's Books", "title": "The Imaginary Friend", "description": "Samantha and Tracy have been best friends since kindergarten, but now that Tracy has gotten over her shyness and made new friends, Samantha is feeling left out. This is nothing compared to how she feels when a strange girl named Jessica tells Samantha that she’s actually an imaginary friend. Tracy has outgrown Samantha, and it’s time for Samantha to help another child who needs her. But will Samantha be able to move on and fulfill her duty as an imaginary friend?"}, {"id": "1515773965", "genre": "Children's Books", "title": "The Dynamic World of Drones: Max Axiom STEM Adventures", "description": "Join super scientist Max Axiom as he explores the technology behind and everyday use of drones in our world. Science and engineering content central to the STEM Initiative comes alive in full-color graphic novel format. Max's adventures make it all fun!"}, {"id": "1848530978", "genre": "Children's Books", "title": "Tamarind Stars: Sporting Heroes", "description": "What does an Olympic champion eat for breakfast? How can you become the fastest runner in the world? At what age can you start training to be a boxer? Interesting facts, super secrets and never before seen photos of some of the best-known sporting heroes including boxer Amir Khan, runners Mo Farah and Christine Ohuruogu, basketball sensation Luol Deng and the gymnast Louis Smith. Look inside for tips on how to get into sports, where you can train, and how you too can become a sporting hero."}, {"id": "B00DGM4QQI", "genre": "Children's Books", "title": "Australia (Modern World Nations)", "description": "- Information-packed volumes provide comprehensive overviews of each nation's people, geography, history, government, economy, and culture - Abundant full-color illustrations guide the reader on a voyage of discovery - Maps reflect current political boundaries"}, {"id": "B06ZYZCJNH", "genre": "Children's Books", "title": "Professional Crocodile", "description": "Mr. Crocodile loves his job. Every morning he gets up with an alarm. He brushes his teeth. He chooses the right tie to match his outfit, eats a quick slice of toast, and heads off to work on a crowded train. But what exactly is his job? The answer may surprise you! Readers will want to pore over this witty, wordless book again and again, finding new details and fresh stories with every reading. Plus, this is the fixed format version, which looks almost identical to the print edition."}]