[{"id": "0448490161", "genre": "Children's Books", "title": "Who Was Charlie Chaplin?", "description": "Who was the real Charlie Chaplin? Kids will learn all about the comic genius who created \"The Little Tramp\"!Charlie Chaplin sang on a London stage for the first time at the age of five. Performing proved to be his salvation, providing a way out of a life of hardship and poverty. Success came early and made Chaplin one of the best loved people in the United States until the McCarthy witch hunts drove Chaplin from his adopted country. This is a moving portrait of a multi-talented man—actor, director, writer, even  music composer—and the complicated times he lived in."}, {"id": "1435835522", "genre": "Children's Books", "title": "Venus and Serena Williams: Tennis Champions (Sports Families)", "description": "Venus and Serena Williams are two of the most successful tennis players of all time. Their success is in part due to the encouragement and support of each other, their mother, and their father. This book explores the lives of two of the greatest athletes of all time and how they achieved their success as a family."}, {"id": "1582703310", "genre": "Children's Books", "title": "Boys Who Rocked the World: Heroes from King Tut to Bruce Lee", "description": "Meet young men with grand goals in these profiles of forty-six movers and shakers who made their mark before they turned twenty.This engaging and thought-provoking collection of influential stories provides forty-six illustrated examples of strong, independent male role models, all of whom first impacted the world as teenagers or younger. This updated and expanded edition of Boys Who Rocked the World encompases a variety of achievements, interests, and backgrounds, from Wolfgang Amadeus Mozart and Steve Jobs to Crazy Horse and Stephen King—each with his own incredible story of how he created life-changing opportunities for himself and the world. Personal aspirations from today’s young men are interspersed throughout the book, which also includes profiles of teenagers who are rocking the world right now—boys like John Collinson, the youngest person to climb the Seven Summits, and Alec Loorz, who founded the nonprofit organization Kids vs. Global Warming.     It’s never too soon to start making a difference, and this empowering collection of accomplished young men makes for ideal motivation."}, {"id": "B06XJMPH8R", "genre": "Children's Books", "title": "4th Book in the Clancy Jones Series: Still Going Strong", "description": "Clancy Jones is well-known to her fans through the books \"1st Year in the Life of Clancy Jones - Pen Thief\", the 2nd book in the series, \"2nd Year in the Life of Clancy Jones - Toothbrush Thief\", and the 3rd book in the series, \"3rd Year in the Life of Clancy Jones - Enjoying Life\". This book chronicles her 4th year of life as she continues to hilariously commit her criminal acts and skids through life, oblivious of the chaos she leaves in her wake.  Readers of all ages will enjoy this photographic romp through Clancy's 4th year of life!"}, {"id": "0375813543", "genre": "Children's Books", "title": "Puss in Boots: The Adventures of That Most Enterprising Feline", "description": "Here's what the old miller left his sons when he died: To his oldest son, the mill. To his middle son, the donkey. To his youngest son, Jacques,the cat. A fine cat, indeed, but still, just a cat.Luckily, as Jacques discovers, Puss is no ordinary kitty. He's smart. He can talk. And he is quite a snappy dresser. He's also planned an exciting future for Jacques-one that involves a princess and a very large fortune.Master storyteller Philip Pullman and prizewinning illustrator Ian Beck team up in this witty retelling, which sparkles with humor and adventure."}]