[{"id": "1633385256", "genre": "Children's Books", "title": "Nick the Chick", "description": "Meet Nick the Chick. In this rhyming story of a tiny chick who things he's larger than life, he will stop at nothing until he sees the problem resolved. Often misunderstanding the meaning of words, he prides himself on \"solving\" the situation at hand. Look for the hidden mouse who follows Nick on each page."}, {"id": "B0766M56WL", "genre": "Children's Books", "title": "Veggie Vero and The Case Of The Missing Calves: Book #3 of the Veggie Vero series (The Adventures of Veggie Vero 1)", "description": "In this adventure, Veggie Vero is helping the cows of CowBell Kingdom to find their missing babies.   With the help of some special friends, she reunites the cow families and teaches the people how switching to plant-based milk is not only compassionate, but delicious!"}, {"id": "B00CVDZ3GK", "genre": "Children's Books", "title": "Amazing Airplanes", "description": "Get ready for take off! The sky's the limit with this soaring, swooping, looping look at the fantastic flying machines that made aviation history. Junior pilots will delight in building and flying 5 models of legendary aircraft, including the 1909 Blériot monoplane and the rocket-powered Bell X-1. From the first flight at Kitty Hawk to breaking the sound barrier, Amazing Airplanes gives kids a chance to go faster, higher and farther as they learn all about the evolution of flight and the incredible technologies that enabled man to fly. Filled with exciting historical photos, detailed diagrams, and colorful comic strips, Amazing Airplanes also tells the stories of pioneers like Wilbur and Orville Wright and Chuck Yeager. This engaging, educational book really lets kids' imaginations soar!"}, {"id": "1538210339", "genre": "Children's Books", "title": "Amphibian Life Cycles (Look at Life Cycles)", "description": "Amphibians have some of the most interesting life cycles on Earth. The metamorphosis frogs, toads, salamanders, newts, and caecilians go through has many steps that readers need to understand and remember. This book offers a concise overview of the general amphibian life cycle as well as representative examples of the many species within the animal group. Most importantly, the accessible language is paired with diagrams of the steps of the life cycle to augment readers understanding of this topic often found in the science curriculum."}, {"id": "1610806336", "genre": "Children's Books", "title": "Polar Bears (21st Century Basic Skills Library)", "description": "Introduces infant polar bears, describing their behavior and growth and period of attachment to their mother as they learn to hunt and be on their own."}]