[{"id": "0763689238", "genre": "Children's Books", "title": "Botanicum: Welcome to the Museum", "description": "Discover more than 160 exhibits in this virtual museum, open all hours.The 2017 offering from Big Picture Press's Welcome to the Museum series, Botanicum, is a brilliantly curated guide to plant life. With artwork from Katie Scott of Animalium fame, Botanicum gives readers the experience of a fascinating exhibition from the pages of a beautiful book. From perennials to bulbs to tropical exotica, Botanicum is a wonderful feast of botanical knowledge complete with superb cross sections of how plants work."}, {"id": "B00B3P1KUK", "genre": "Children's Books", "title": "Sebastian Sleeps in His Own Bed - A Children's Picture Rhyming Book about a Rabbit sleeping in his bed for the first time (Baby-3) (The Adventures of Sebastian Bunny)", "description": "This bedtime book is to help your child with the transition to sleep in his or her own bed.  This story follows Sebastian as he struggles with the transition of sleeping in his own bed.  He learns that it is ok and actually fun to sleep in his own bed.  The book is a rhyming book with 10 gorgeous pictures illustrated by Albert Saavedra.  If you find your child waking up at night and finding him or herself in your bed in the morning this is the perfect bedtime story book for you. :)"}, {"id": "1499427506", "genre": "Children's Books", "title": "We're Going Deer Hunting (Hunting and Fishing: A Kid's Guide)", "description": "Deer hunting is a popular activity in the United States. This is because deer live in many different areas across the country. This book teaches children the basics deer hunting, including where to hunt and how to stay safe. This high-interest topic was designed to appeal to reluctant readers. Full-color images fill each page, and fun facts provide additional information. Children who are preparing for their first deer hunt will find many useful tips and tricks in this book."}, {"id": "0606236651", "genre": "Children's Books", "title": "Dog Days  (Diary of a Wimpy Kid, Book 4)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The latest addition to Diary Of A Wimpy Kid series reveals more of the hazards of growing up before you're ready through the words and drawings in Greg Heffley's diary."}, {"id": "0439083664", "genre": "Children's Books", "title": "Franklin Tv #02: Franklin Says Sorry", "description": "When Franklin tells one of Bear's secrets, their best friendship is threatened and Franklin must find a way to make things right between them once again. Original. TV tiein."}]