[{"id": "1771472774", "genre": "Children's Books", "title": "How to Spot a Sasquatch", "description": "On a camping trip with the Junior Rangers, Jay feels like the odd one out. He’s determined to get a photo of Bigfoot―but none of his friends believe Bigfoot exists. But if there’s no such thing as Bigfoot, why is there a giant footprint? And who is stealing all the snacks?Meanwhile, Sass the Sasquatch and her curious forest friends are playing practical jokes on the campers. On the last day of camp, disaster strikes when Jay falls into a rushing river. Sass comes out of the woodwork―despite her parents’ warnings to stay away from humans!―just in time to save his life. Soon after, Jay and Sass become fast friends, proving that nothing is impossible when it comes to friendship.Told in ten short chapters, this is an accessible book with an action-packed story line perfect for building early literacy skills, with sequential illustrations that provide contextual clues to the text."}, {"id": "1857924401", "genre": "Children's Books", "title": "Amazon Adventures (Adventure Series)", "description": " The Amazon Rain Forest ....  This is the oldest and largest rain forest in the world and one of the longest rivers on the planet cuts through its heart. It covers a huge area of South America and has an extremely varied plant and animal habitat. When you read this book you will be part of an expedition and adventure into its very centre.  Read about the Shocking Electric Eel, the Jungle turncoat, the persistent frog and the mysterious Kinkajou.  Find out what lessons we can learn from these wonderful and amazing animals. Even the little white butterflies can teach us something about life and the love of God.  Discover what it's like to actually live in the rain forest. Join in the adventurers and experience the exciting and dangerous life of a pioneer missionary in South America. "}, {"id": "B005M4VPZ8", "genre": "Children's Books", "title": "Little Book of Fables (Groundwood Books)", "description": "With humorous illustrations and lively language, this book offers new versions of the beloved Aesop's fables, some of the oldest-known fables in the world. Young readers will recognize traditional favorites such as \"The Fox and the Crow\" and \"The Shepherd and the Wolf,\" while other tales such as \"The Milkmaid\" and \"Belling the Cat\" may be new to them. The moral lessons derived from these timeless tales have been adopted by cultures all over the world and are reflected in familiar sayings such as \"Don't kill the goose that lays the golden egg\" and \"Slow and steady wins the race.\" Included are comprehensive endnotes describing the life of Aesop, the origin of fables, and how fables function as morality tales. Beautifully retold and humorously illustrated, this collection will entertain readers both young and old. With its small, compact format and elegant design, it is an ideal gift."}, {"id": "0142405361", "genre": "Children's Books", "title": "Pascual and the Kitchen Angels", "description": "When Pascual is born, angels fly down and sing to him from the trees. When he sings to the sheep as a little boy, they sing back to him. But when Pascual joins the Franciscans, they send him to the kitchen. Pascual doesn't know how to cook even a cup of beans! That's when the kitchen angels fly down, and delicious dinners appear on the friars' table night after night. Finally the friars peek in to see how Pascual does it, and what they see shows them what a blessed man is living among them."}, {"id": "B0099REDD0", "genre": "Children's Books", "title": "Streams to the River, River to the Sea", "description": "In this redesigned edition of Scott O'Dell's classic novel, a young Native American woman, accompanied by her infant and her cruel husband, experiences joy and heartbreak when she joins the Lewis and Clark expedition seeking a way to the Pacific."}]