[{"id": "1608862690", "genre": "Children's Books", "title": "Ice Age: Past, Presents and Future (Ice Age (Paperback))", "description": "Just in time for the holidays, KABOOM! is serving up a mammoth heap of ICE AGE with family-friendly 8 x 8 storybooks!It’s holiday time for the bumbling Sid the Sloth, the practical Manny the Mammoth, the cunning Diego the Saber-tooth Tiger, and the hilarious saber-toothed squirrel Scrat and their growing herd in this exciting all-new yuletide adventure! After planning a perfect holiday celebration for his family, Manny thinks he’s ready for anything -- but when a mysterious lost stranger stumbles into their lives, he must learn the true spirit of the holidays. Featuring beloved characters from the hit film series!"}, {"id": "153820746X", "genre": "Children's Books", "title": "Awesome Experiments With Living Things (Mind-Blowing Science Experiments)", "description": "Yeast can burp? Plants can solve mazes? Readers wont believe the amazing results of these fantastic experiments! This book introduces readers to the science behind plants and other living things through fun hands-on activities. Simple language explains complex concepts, and step-by-step instructions with accompanying photographs make experiments accessible. Nifty tips help readers safely reach the best results. Theyll love trying recommended tweaks and additions to experiments for even cooler outcomes. Real-life examples of the same scientific principles at play in each activity will get readers excited about the science at work in their everyday world."}, {"id": "1426324561", "genre": "Children's Books", "title": "Weird But True Sticker Doodle Book: Outrageous Facts, Awesome Activities, Plus Cool Stickers for Tons of Wacky Fun!", "description": "Grab a pencil and put on your Weird but True hat! It's time to explore our amazing and very weird world with the newest spin-off of the Weird but True series, where YOU get to illustrate just how strange and cool our world can be. Discover amazing weird facts and then doodle, draw, or color a strange scene right on the page. Did you know that giraffes only need to sleep 90 minutes a day? Well, that might make a totally fun sleepover. Did you know that there's a town in France that holds a pig festival every year? Doodle some funny outfits onto those pigs! Enhance your wacky masterpieces with 150 fun stickers, included in the book. It’s a great new way to play and the perfect boredom-buster for rainy days or car rides."}, {"id": "1511372087", "genre": "Children's Books", "title": "Julius Zebra: Rumble with the Romans!", "description": "What happens when you mix the gladiatorial combat of ancient Rome with a fast-talking creature who is DEFINITELY NOT A STRIPY HORSE?From a smelly water hole on the African savanna, Julius Zebra is captured, along with Milus the scarred lion and Cornelius the clueless warthog. Transported to the ferocious clamor of the Colosseum, Julius Zebra and his motley menagerie of friends must gear up to be…gladiators! The only way they will gain their freedom is if they win the love of the Roman crowds. But do they have what it takes to succeed in a world where only the meanest and toughest survive?"}, {"id": "B0777S29D5", "genre": "Children's Books", "title": "Nathan Hale's Hazardous Tales (Issues) (7 Book Series)", "description": "Nathan Hale, the author's historical namesake, was America's first spy, a Revolutionary War hero who famously said \"I regret that I have but one life to give for my country\" before being hanged by the British. In the Nathan Hale's Hazardous Tales series, author Nathan Hale channels his namesake to present history's roughest, toughest, and craziest stories in the graphic novel format.One Dead Spy tackles the story of Hale himself, who was an officer and spy for the American rebels during the Revolutionary War. Author Hale highlights the unusual, gruesome, and just plain unbelievable truth of historical Nathan Hale-from his early unlucky days at Yale to his later unlucky days as an officer-and America during the Revolutionary War."}]