[{"id": "B005DIB3PA", "genre": "Children's Books", "title": "Abraham Lincoln Comes Home", "description": "When Abraham Lincoln was assassinated in 1865, the country grieved for the courageous president who had guided them through the Civil War. Over the course of thirteen somber days, people paid homage as Lincoln’s funeral train made its way from Washington, D.C., to Springfield, Illinois. In moving prose and stunning paintings, a young boy experiences the deep feelings evoked by the death of a major historical figure, during a time of great change in the country."}, {"id": "1467734764", "genre": "Children's Books", "title": "Nonna's Hanukkah Surprise", "description": "Rachel loves visiting her Italian grandmother, even though Nonna celebrates Christmas and Rachel and her parents celebrate Hanukkah. Rachel plans to share Hanukkah with her whole family, so when Rachel's special hanukkiah goes missing, Nonna steps in to save the day."}, {"id": "140629778X", "genre": "Children's Books", "title": "Celebrating Buddhist Festivals (Infosearch: Celebration Days)", "description": "What do Buddhists believe? How do they celebrate what is important to them? What food do they eat during festival time? How do Buddhists in the UK celebrate? Read this book to find out the answers to these questions and more. Celebrating Buddhist Festivals looks at important religious and family days in the Buddhist calendar, and gets readers to take part by cooking some of the food central to Buddhist celebrations. The book looks at both international and UK examples of Buddhist celebrations. Infosearch asks the questions you want answered."}, {"id": "0635005697", "genre": "Children's Books", "title": "West Virginia Survivor: A Classroom Challenge! (3) (West Virginia Experience)", "description": "The Survivor GameBook is reproducible and allows kids to learn about their state through timed activities, prize suggestions and an official survivor certificate. The book includes timed, multiple-choice questions, fill in the blank questions, choose the appropriate dates and matching that are challenging and fun to answer. This book covers fascinating state facts and meets state standards."}, {"id": "1422204286", "genre": "Children's Books", "title": "On the Edge of Disaster: Youth in the Juvenile Court System (Youth With Special Needs)", "description": "From living with blindness, deafness, autism, or brain injury to struggling through the juvenile court or foster care systems, there are many types of special needs among youth today. This 15-book series explores the challenges facing youth with special needs, as well as the many types of services available to support these young people in their quest for personal achievement and social acceptance. By combining factual information with fictional stories, these books bring to life the struggles, challenges, and triumphs of youth with special needs, providing an education of the heart as well as the mind."}]