[{"id": "0739380990", "genre": "Children's Books", "title": "Change-Up: Mystery at the World Series", "description": "Playing in the World Series is every ballplayer’s dream, but no one is more surprised to actually be here than Norbert Doyle–a late call-up for an underdog team.Doyle pitched in the minor leagues for years before making it to the bigs. He went to school in the off-season to earn his degree. He raised two kids on his own after the tragic death of his wife. And now he’s slated to start game two of the World Series. His feel-good story is a media gold mine. And teen reporters Stevie Thomas and Susan Carol Anderson have scored the first in-depth interview with him.At first they’re as charmed by Doyle as everyone else–it’s hard not to root for this guy. But the more Stevie and Susan Carol learn about him, the more conflicting stories they hear. And so Stevie becomes an investigative reporter by day while covering the World Series by night, trying to piece together the truth of one athlete’s life. But along the way he has to wonder–who will be hurt if the truth is known, and who will benefit, and what does it have to do with baseball? There are a million secrets in any locker room. Which ones need to be told?"}, {"id": "0805091688", "genre": "Children's Books", "title": "Chick", "description": "An egg cracks--crickety crack--and out comes a little yellow chick! He peeps, he cheeps, he eats, and at the very end, he sleeps under Mommy's wing--zzzzzz. Each eye-popping page in this interactive novelty book invites the reader to jump in and play with the chick, and Ed Vere's art is appealing and brightly colored . Ed Vere's new pop-up book is the perfect Easter gift for all your little chicks!"}, {"id": "076145683X", "genre": "Children's Books", "title": "Goodnight, Little Monster", "description": "Little Monster needs to get ready for bed. That means howling at the moon, scrubbing his scales, getting into his creepy PJs, and enjoying a nice snack before bed: worm juice and baked beetle bread. And, of course, Little Monster’s mother is nearby to tuck Little Monster into bed and turn on his night-light—because even little monsters can be afraid of the dark. Bonnie Leick’s soft, child-friendly illustrations rendered in watercolor bring a new and quiet twist to the evening’s bedtime ritual. Sweet dreams, Little Monster!"}, {"id": "B01M2YNA6V", "genre": "Children's Books", "title": "Black Belt Bunny", "description": "From the author of the bestselling Ladybug Girl series, this hilarious, empowering picture book about a little black-belt who faces a new challenge is perfect for fans of The Three Ninja Pigs, The Pigeon Finds a Hot Dog, and I Will Never Not Ever Eat a Tomato   Black Belt Bunny is fast and strong and has seriously awesome moves—from front-kicks to back-flips to air-chops. Then he’s faced with something new, something every bunny must learn, something he might not be as good at: He has to make . . . a salad. Black Belt Bunny tries to escape. He even disguises himself with a fake mustache. But when he finally hops to it, he discovers that his seriously awesome moves come in pretty handy, and that—in a funny twist that puts the narrator in the hot seat—he isn’t the only one who has to try new things.From the Hardcover edition."}, {"id": "0985600284", "genre": "Children's Books", "title": "Figley’s Search For The Perfect Pet (Mutasia)", "description": "  0 0 1 107 611 Mutasian Entertainment LLC 5 1 717 14.0      On the island of Mutasia, where everyone is a mix of two or more different animals, it sure is hard to find the perfect pet. But if anyone is up for the challenge, it’s Figley! When his friend, Billie, admits that she’s grown tired of her boring pet pugapillar (pug-caterpillar), Figley sets out to find her the weirdest, wildest, and wackiest pets on the island! He introduces her to an assortment of mixed-up animals like a dolphin-pony, a lizard-cat, and a flamingo-elephant-goldfish! But with each positive feature that comes with a critter’s mix, there’s an unexpectedly troublesome trait too! As the exotic animals begin destroying her house, Billie starts to reassess what’s really important in a perfect pet."}]