[{"id": "1468084097", "genre": "Science Fiction & Fantasy", "title": "In a Flash", "description": "From the year 2234, a Collective novel. After two decades on the moons of Kroma, the Collective colonies have begun to fracture and fray. Twenty-one-year-old Magistrate Tana Kucherov has held office only a few scant months, but already challenges test her leadership at every turn—an untamable alien frontier, a renegade security service, a dissident religious sect. And then, hurtling in from the blind side, there is August the third, the day of days—a split second where, just like that, a civilization is faced with loss and tragedy beyond all human imagining."}, {"id": "0750531053", "genre": "Science Fiction & Fantasy", "title": "Sophia's Secret (Magna (Large Print))", "description": "After three hundred years, Sophia's secret must be told…When bestselling author Carrie McClelland visits the windswept ruins of Slains Castle, she is enchanted by the stark and beautiful Scottish landscape. The area is strangely familiar to her, but she puts aside her faint sense of unease to begin her new novel, using the castle as her setting and one of her ancestors, Sophia, as her heroine. Then Carrie realises her writing is taking on a life of its own and the lines between fact and fiction become increasingly blurred. As Sophia's memories draw Carrie more deeply into the intrigue of 1708, she discovers a captivating love story lost in time."}, {"id": "0575073349", "genre": "Science Fiction & Fantasy", "title": "Dune (S.F. Masterworks)", "description": "The Duke of Atreides has been manoeuvred by his arch enemy, Baron Harkonnen, into administering the desert planet of Dune. Although it is almost completely without water, Dune is a planet of fabulous wealth, for it is the only source of a drug prized throughout the Galactic Empire. The Duke and his son, Paul, are expecting treachery and it duly comes - but from a shockingly unexpected place. Then, when Paul succeeds his father, he becomes a catalyst for the native people of Dune, whose knowledge of the ecology of the planet gives them vast power. They have been waiting for a leader like Paul Atreides, a leader who can harness that force..."}, {"id": "0688157416", "genre": "Science Fiction & Fantasy", "title": "Myth Maker: J.R.R. Tolkien", "description": "As a boy, he created original languages in his spare time. As a man, he created an original world. But imaginative as he was, John Ronald Reuel Tolkien never dreamed that his tales of Middle-earth would transform so many millions of lives."}, {"id": "0553560735", "genre": "Science Fiction & Fantasy", "title": "Red Mars (Mars Trilogy)", "description": "Winner of the Nebula Award for Best Novel • Soon to be a series on Spike TV   Discover the novel that launched one of science fiction’s most beloved, acclaimed, and awarded trilogies: Kim Stanley Robinson’s masterly near-future chronicle of interplanetary colonization.   For centuries, the barren, desolate landscape of the red planet has beckoned to humankind. Now a group of one hundred colonists begins a mission whose ultimate goal is to transform Mars into a more Earthlike planet. They will place giant satellite mirrors in Martian orbit to reflect light to the surface. Black dust sprinkled on the polar caps will capture warmth and melt the ice. And massive tunnels drilled into the mantle will create stupendous vents of hot gases. But despite these ambitious goals, there are some who would fight to the death to prevent Mars from ever being changed.   Praise for Red Mars   “A staggering book . . . the best novel on the colonization of Mars that has ever been written.”—Arthur C. Clarke   “Absorbing . . . a scientifically informed imagination of rare ambition at work.”—The New York Times Book Review   “Tremendous . . . a high-water mark in novels of Earth emigration.”—The Washington Post Book World"}]