[{"id": "1409141225", "genre": "Children's Books", "title": "Rihanna Annual 2012: Spend a Whole Year with Princess Riri!", "description": "The Rihanna Annual 2012 includes everything you need to know about the singer and style icon! Find out how Princess RiRi got her big break and transformed from music-loving schoolgirl to international superstar, how she creates her unique style, who her BFFs are, and how she keeps both feet on the ground when the world's going crazy around her. Plus, it's packed with gorgeous photos, all the latest gossip, and lots of quizzes, word searches and activities-including step-by-step instructions for giving yourself a Rihanna-style makeover!"}, {"id": "0613591399", "genre": "Children's Books", "title": "Super Snacks (Kid Power)", "description": "Intended for ages 7-12, this work offers recipes for nutritious snacks and drinks. It helps readers learn about: the food groups; nutrition; cooking safety tips and allergy alerts; why the body needs water and tasty ways to get it. Recipes include: apple-cranberry crisp; banana almond shake; strawberry chocolate kiss; and more."}, {"id": "B00ZSOV9B2", "genre": "Children's Books", "title": "Along the Way: Roscoe's Journey (The Ragwort Chronicles Book 2)", "description": "“There was a line of pines that bordered the stream, but were far back enough to provide cover for the watching eyes. This time, they were not the eyes of the friendly little tree imps. Three dark shadows were slinking behind the tress and following Roscoe. Although they were just shadows they had luminous yellow eyes, like a cat’s eyes, glowing in the dark.”The second exciting adventure in the Ragwort Chronicles series, featuring the gnome Roscoe Ragwort, the twin brother of Rilefor Ragwort, who left the Brokenfell Village to find his fortune in the haunted Diamond Mine. Like everything else Roscoe did, he took a “short cut.” This time though, he went through the treacherous and unfriendly Bandersnatch Swamp. Totally unprepared for this new journey and the perils awaiting him, Roscoe finds some very unlikely friends and more likely enemies. Travel with Roscoe Ragwort and find out about the fortune he discovers.A delightful read for the early middle grade audience, boys and girls alike. This second book of the Ragwort Chronicles, and companion to the Phillip’s Quest series, has the illustrations of the characters and scenes that have become beloved by children of all ages."}, {"id": "076116927X", "genre": "Children's Books", "title": "Cabinet of Curiosities: Collecting and Understanding the Wonders of the Natural World", "description": "Exactly the book for every young explorer who loves finding stuff in nature and bringing it home. Cabinet of Curiosities is a lavishly illustrated introduction to the wonders of natural history and the joys of being an amateur scientist and collector. Nature writer Gordon Grice, who started his first cabinet of curiosities at age six when he found a skunk’s skull, explains how scientists classify all living things through the Linnaeus system; how to tell real gold from fool’s gold; how to preserve butterflies, crab shells, feathers, a robin’s egg, spider specimens, and honeycombs; how to identify seashells; the difference between antlers and horns; how to read animal tracks. And then, what to do with your specimens, including how to build a cabinet of curiosities out of common household objects, like a desk organizer or a box for fishing tackle.   "}, {"id": "0998820520", "genre": "Children's Books", "title": "Christian von Koenigsegg and His Super-Duper Sports Car", "description": "This is a story about a boy who had a dream of building his own car. Except it wasn't just any old car. You see, this boy had a very special dream. He wanted to build the fastest car in the world!*Made in collaboration with Koenigsegg, the world's most exclusive super sports car manufacturer."}]