[{"id": "0316832901", "genre": "Children's Books", "title": "Bow Wow: A Day in the Life of Dogs", "description": "Photographs depict dogs in all sorts of human activities, from eating breakfast and getting dressed to going to the beach and watching television."}, {"id": "B01N0U3XFU", "genre": "Children's Books", "title": "Bangkok Travel Guide: 2017 edition (Thailand Travel Guide)", "description": "Bangkok is the most vibrant and happening city in Asia. Regularly voted as one of the most popular tourist destinations in the world, it has a treasure trove of attractions waiting for you!This book provides a comprehensive guide for visitors to Bangkok regardless of budget. Full of in-depth and up-to-date information on local customs, sightseeing attractions, accommodation options and transportation tips, it guides you straight to the very best Bangkok has to offer. This ebook edition is created specially for Kindle. It provides: - essential information on all the popular attractions, such as opening hours, ticket prices, phone numbers, etc., to help you plan your itinerary; - transportation tips showing you the most convenient way to get to your destination; - offline colour maps with popular attractions clearly marked, so you don't lost your way; - expert advice from locals so you don't miss the hidden gems.Get this book now and have a wonderful trip to Bangkok!"}, {"id": "B075HZ77B6", "genre": "Children's Books", "title": "Who Is Pele? (Who Was?)", "description": "The story of a poor boy from Brazil who became the greatest soccer player of all time and one of the most important athletes of the twentieth century!His parents may have named him Edson Arantes do Nascimento, but to the rest of the world, he is known as Pelé. The now-retired professional soccer forward stunned Brazil when he began playing for the Santos soccer club at age fifteen. He then went on to captivate the world when he joined his country's national soccer team and helped them win three World Cup championships. Although he's hailed as a national hero for his accomplishments in soccer, Pelé has been an influential person both on and off the pitch. His work with organizations like UNICEF has helped improve conditions for children around the world. Young readers can learn more about the man who connected soccer with the phrase \"The Beautiful Game.\""}, {"id": "B003WUYRU4", "genre": "Children's Books", "title": "Gorillas", "description": "Classic movies show giant gorillas scaling tall buildings and swatting planes from the sky, but actual gorillas are gentle social animals that live together in family groups like humans. In fact, gorillas are one of the closest genetic matches to people. And just like humans, gorillas can  shriek chuckle hiccup even burp!  Award-winning science writer Seymour Simon has teamed up with the Smithsonian Institution to bring you an updated edition of his classic full-color photographic introduction to these fascinating animals."}, {"id": "0763669423", "genre": "Children's Books", "title": "Children Growing Up with War", "description": "Through personal narrative and candid photographs, a photojournalist chronicles young lives upended by violence and strife.The right to adequate nutrition and medical care. The right to free education. The right to a name and nationality. The right to affection, love, and understanding. In conflict zones around the world, children are denied these and other basic rights. Follow photographer Jenny Matthews into refugee camps, overcrowded cities, damaged villages, clinics, and support centers where children and their families live, work, play, learn, heal, and try to survive the devastating impact of war. This moving book depicts the resilience and resourcefulness of young people who, though heavily impacted by the ravages of war, search for a better future for themselves, their families, and their cultures."}]