[{"id": "019839599X", "genre": "Children's Books", "title": "MYP Spanish Language Acquisition Phases 3 & 4", "description": "Secure the essential language foundations. This resource helps you develop vital comprehension and skills in phases 3 and 4, thoroughly preparing learners to progress. An inquiry-based format applies key and related concepts to relevant learning material, helping you fully deliver the MYP approach and build meaningful conceptual connections. Build a strong foundation of Spanish skills and comprehension, preparing MYP learners to progress Simplify early language acquisition, fully securing the basics Fully integrate concept-based learning with an inquiry-based unit structure that drives independent thinking Apply inquiry-based techniques to age and phase-appropriate language-learning material Build interpreting, listening, speaking reading and writing skills framed within key and related concepts Connect activities with the MYP assessment criteria, preparing learners for summative assessment Mapped to the current MYP curriculum framework"}, {"id": "0545077974", "genre": "Children's Books", "title": "A Cuddle For Little Duck", "description": "Little Duck has a busy day ahead!Little Duck is a cute and curious ball of fluff!Come along on a day packed full of small discoveries and big wonder.This rhyming story, paired with gentle illustrations, will enchant little ones everywhere."}, {"id": "1846862779", "genre": "Children's Books", "title": "The Journey Home from Grandpa's: Fun Activities (Hit the Road! Go Barefoot!)", "description": "Children will enjoy all sorts of fun activities in this transportation-based activity book, inspired by our bestselling singalong book, The Journey Home from Grandpa s. Features puzzles, word games, coloring activities and more based on an exciting journey through town. Also includes full-color reusable stickers to use in different scenes throughout the book."}, {"id": "1842156284", "genre": "Children's Books", "title": "Ancient Weapons: History Detectives", "description": "Ancient Weapons examines the enormous range of weapons that were used throughout ancient history for hunting, attacking, and defense purposes."}, {"id": "1338226770", "genre": "Children's Books", "title": "Beginning Readers Workbook (Bob Books)", "description": "Don't miss the companion workbook to the bestselling learn-to-read boxed sets! Millions of books have been sold in the Bob Books program thanks to its silly stories, familiar artwork, and easy-to-comprehend text. For the first time, children can now extend their reading journey into these jumbo workbooks, which feature custom content built around each Bob Books storybook. Complete with full-color art and two sheets of stickers, the Bob Books Beginning Readers Workbook is the perfect way to engage young readers, increase reading comprehension, and nurture pride and confidence in their reading skills. This jumbo workbook ties into three sets: Alphabet, Beginning Readers, and Rhyming Words!"}]