[{"id": "0836880285", "genre": "Children's Books", "title": "Triceratops/Triceratops (Let's Read About Dinosaurs/ Conozcamos a Los Dinosaurios) (Spanish and English Edition)", "description": "Provides information about triceratops, including what they ate, how they interacted with one another, and how they defended themselves."}, {"id": "2745995472", "genre": "Children's Books", "title": "Potty Time! (Pull and Play Books)", "description": "Parents and caregivers can help little ones prepare for this milestone in every child's life with this reassuring pull-tab book. Providing encouragement and empowerment through the gently humorous situations faced by a charming cast of characters, children will recognize that the feelings voiced by Little Crocodile and his friends are similar to their own. Using pull tabs to control the changing pictures, children gain the confidence to apply their newly learned knowledge to their own experiences. A novel and compelling solution to an age-old issue!"}, {"id": "B01N41VDCS", "genre": "Children's Books", "title": "The Ancient Warrior (Myke Phoenix Novelettes superhero adventures Book 1)", "description": "Paul Phillips just wanted to spend a nice night shopping with his girlfriend, but what he found inside that old antique shop changed his life. Now he was Myke Phoenix, superhero protector of Astor City, and lining up against the Forces of Evil in the World. Not even he knows how he inhabits the indestructible body of a long-dead warrior – all he knows is the fate of the city, the continent and perhaps the world depends on him. In THE ANCIENT WARRIOR, a ruthless crime boss sets his sights on destroying the radio talk show host who has targeted his empire, along with the stalwart news reporter who has been telling the story. This is a city that needs a hero, and the answer comes in the form of a long-lost legend and a mysterious bird out of myth."}, {"id": "0316370274", "genre": "Children's Books", "title": "The Secret Life of Squirrels", "description": "An irresistible photographic story featuring wild squirrels in homemade miniature domestic settings -- taking a bath, doing laundry, and barbecuing -- will surprise and amuse readers and animal lovers of all ages!  Adorable squirrels as you've never seen them!You may think you know what squirrels do all day...but Mr. Peanuts is no ordinary squirrel. Instead of climbing tress, he plays the piano. (\"Moonlight Sonutta\" is his favorite.) Instead of scurrying through the woods, he reads books (such as A Tail of Two Cities). But everything is more fun with company, so Mr. Peanuts writes a letter to Cousin Squirrel and invites him for a visit!Featuring candid photographs of wild squirrels in handcrafted, homemade miniature settings, this irresistible book is sure to delight readers young and old!"}, {"id": "B005DZGF0Q", "genre": "Children's Books", "title": "The Adventures of S.C.A.M.P. (The Adventures of SCAMP Book 1)", "description": "SCAMP is an \"evolutionary oddity\" found on an unnamed island off the coast of Brazil. What appears to be a chimp is actually a creature that possesses certain amazing traits of numerous animals. Follow SCAMP on this powerful adventure set uniquely in the mid-twentieth century.Over 45 beautifully drawn color illustrations!Includes 80+ word Glossary and 20+ Fun Facts!Recommended ages: 7-12"}]