[{"id": "1632352133", "genre": "Children's Books", "title": "12 Reasons to Love the Los Angeles Dodgers (MLB Fan's Guide)", "description": "Explores some of the reasons why fans love the Los Angeles Dodgers. Each spread highlights a different fact, player, story, or tradition that helps define the team."}, {"id": "0060556099", "genre": "Children's Books", "title": "Sophia & Benjamin Watch a Train Go By", "description": "Here comes a six–foot fold–out train!  Toddlers will delight in this unique fold–out book of brightly colored train cars. Young readers can learn the car names, count what's in them, name their colors, or stand the book on the floor and pretend it's their own toy railroad. With its great play value, this new fold–out board book is the perfect choice for the inquisitive child!  Ages 2+"}, {"id": "1416941053", "genre": "Children's Books", "title": "Sugar and Spice (Holly Hobbie & Friends)", "description": "In Sugar & Spice, a 48-page C&A book that includes one full spread of great-smelling scented stickers, Holly and her friends discover how sweet-smelling Clover really is! On their adventure, the friends visit Aunt Jessie's Cafe for hot chocolate and lemon pie, find fresh strawberries, visit a field of flowers, climb an apple tree, and much more!"}, {"id": "0590623281", "genre": "Children's Books", "title": "36: Deion Sanders (Sports Shots)", "description": "Long out of print, Sports Shots are pocket-sized, glossy cover mini-biographies of famous athletes, primarily intended for teens and young adults."}, {"id": "B00BQERK2A", "genre": "Children's Books", "title": "World History Biographies: Joan of Arc: The Teenager Who Saved Her Nation (National Geographic World History Biographies)", "description": "Around 1412, a baby girl was born in the village of Domrémy who would change France forever. A farmer’s daughter, she seemed destined for an unremarkable life. But as the dramatic narrative of this World History Biography reveals, Joan’s life was anything but ordinary. By the age of 13, she knew her destiny\u0097to drive the English invaders from France. By 17, she had led an army to victory at Orléans. Captured in battle, and too poor to be ransomed, Joan was burned at the stake before her 20th birthday."}]