[{"id": "0008208956", "genre": "Children's Books", "title": "Collins Big Cat – A History of Baghdad: Band 17/Diamond", "description": "1100 years ago Baghdad was the world's biggest and finest city. Discover this glamorous, glorious desert city - its art, literature and learning - during the Islamic Golden Age.           * Diamond/Band 17 books offer more complex, underlying themes to give opportunities for children to understand causes and points of view.           * Text type - An information book.           * The book is organised into short chapters to help children practise the skills of locating and identifying important information.           * The glossary and index can be used to develop children's information retrieval skills further.           * Curriculum links - History"}, {"id": "0780776348", "genre": "Children's Books", "title": "Going West (My First Little House Books (Prebound))", "description": "The Little House books tell the story of a little pioneer girl and her family as they travled by covered wagon across the Midwest. Laura Ingalls Wilder's classic books, illustrated with Garth Williams' timeless artwork, have been cherished by millions of readers ever since they were first published over sixity years ago.It's a fond good-bye to the Big Woods as Laura and her family pack up the covered wagon and begin their journey westward to the prairie in this latest addition to the best-selling My First Little House Books series. Renee Graef's enchanting full-color illustrations, inspired by Garth Williams's classic artwork, bring Laura and her family lovingly to life in this seventh title in the My First Little House Books series, picture books adapted from Laura Ingalls Wilder's beloved storybooks. "}, {"id": "0876143095", "genre": "Children's Books", "title": "America, I Hear You: A Story About George Gershwin (Creative Minds Book)", "description": "An informative biography of the renowned American composer who created such masterpieces as Rhapsody in Blue, American in Paris, and Porgy and Bess, and who developed jazz into an accepted form of serious music"}, {"id": "1894379152", "genre": "Children's Books", "title": "Ha! Ha! Ha!: 1,000+ Jokes, Riddles, Facts and More", "description": "\"Hardcover: 128 pages ; Dimensions (in inches): 0.58 x 9.28 x 8.12 Publisher: Maple Tree Press; (March 3, 2001) ISBN: 1894379152 Ages 4-8 What's black and white and read all over? It's a cool new book from Owl, that's what! Ha! Ha! Ha! is an abs\""}, {"id": "1481853430", "genre": "Children's Books", "title": "Alex Learns How to Surf: The Amazing Adventures of Alex the Crocodile (Volume 1)", "description": "Alex is the main character in the Amazing Adventures of Alex the Crocodile Children's book series. He lives in Crocodile Cove and wears a letter A because his name is Alex. He is very adventurous, and can only do good. He has a love for life, and always seeks out new adventures. Alex also loves to learn new things. He is not afraid of anything. He has a brother named Derek, and many friends that live near him in Crocodile Cove. In this adventure Alex learns how to surf from a fellow crocodile named Biff. Find out what happens when his brother Derek tries to learn how to surf! This is the 3rd book in the series following the success of \"Alex and the Lava Pit\", and \"Alex Pretends to Celebrate Christmas\". For more information please visit www.alexthecrocodile.com."}]