[{"id": "B00KOYRVW2", "genre": "Children's Books", "title": "Twenty-Four Salvador Dali's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Salvador Dali's Paintings. Twenty-Four Salvador Dali's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "153821203X", "genre": "Children's Books", "title": "The Modern Nerd's Guide to Drone Racing (Geek Out!)", "description": "Drones, those radio-controlled flying machines that everyone's abuzz about nowadays, provide many people with an exciting opportunity to navigate and modulate. The newly developed sport of drone racing, however, brings excitement and competition to the air like never before. Live-streaming directly from a camera mounted onto the drone even makes drone racing a spectator sport. This colorful, dynamic book not only introduces readers to drone racing, but gives them tips and insider information about to how to participate themselves."}, {"id": "0152020071", "genre": "Children's Books", "title": "ABC T-Rex", "description": "T-Rex loves the alphabet so much, he wants to eat it up. So he takes a bite or two, and he finds that C is chewy, D is delicious, and K tastes great with ketchup! Go out to eat with T-Rex, get a taste of this appetizing alphabet--and learn a little about food and a lot about fun! •Nearly half a million Bernard Most dinosaur books sold to date •Uses the alphabet to introduce many foods to very young children"}, {"id": "1250079918", "genre": "Children's Books", "title": "Battle of the Bulge [The Young Readers Adaptation]", "description": "December 16, 1944. In the frozen forests of the Ardennes, a surprise attack by the German army on American Allied forces launched the long, hard slog that was the Battle of the Bulge. Sir Winston Churchill called it \"the greatest American battle of the war and . . . an ever-famous American victory.\" In clear and accessible prose, World War II historian, Pulitzer Prize winner, and New York Times-bestselling author Rick Atkinson skillfully navigates the attacks, counterattacks, advances, and retreats of this terrible bloodbath. Whether history buffs or newcomers to the topic, young readers will appreciate the many fascinating facts, photographs, and statistics included in this book, and thrill in this real-life account of victory against all odds.This thoroughly-researched and documented book can be worked into multiple aspects of the common core curriculum."}, {"id": "0545810914", "genre": "Children's Books", "title": "The Littlest Mummy (The Littlest Series)", "description": "From the New York Times bestselling author that brought us The Littlest Pilgrim comes a sweet new Halloween story filled with gentle spooky fun and one adorable little mummy friend!Mae may be the littlest mummy in the Spooky Woods, but she has a big desire to dance with her family at the big Halloween bash! But Mae just can't seem to moan, groan, and look scary, no matter how hard she shuffles and shouts. Will Mae be able to participate in the party, or is the littlest mummy just too little?"}]