[{"id": "142631695X", "genre": "Children's Books", "title": "5,000 Awesome Facts (About Everything!) 2 (National Geographic Kids)", "description": "More exciting than a video game, this boredom-busting book is an explosion of information about sensational topics kids love: dessert, underwear, amusement parks, pirates, famous criminals, marsupials, Ancient Egypt, famous landmarks, you name it! The new 5,000 Awesome Facts (About Everything!) 2 has even more brain and eye candy rolled into one beautifully designed, high-octane treasure trove that captures kids' attention and keeps them yearning to learn more."}, {"id": "B00MSRW76I", "genre": "Children's Books", "title": "The House That's Your Home", "description": "Like the bestselling title On the Night You Were Born by Nancy Tillman, this picture book is sure to touch the hearts of parents, grandparents, and children. The tender rhythmic text follows a young girl as she moves through her world, while utterly charming watercolors bring that world into vivid focus. Told in second person, as if written by a parent to a child, the story gently highlights all the love and joy that make the girl's world her very own, from the tree that stands in her yard, to the swing that swings her right up to the sky, to her bed that's a ship to the moon. A beautiful ode to a loving family from a bestselling author and illustrator.From the Hardcover edition."}, {"id": "1482439638", "genre": "Children's Books", "title": "20 Fun Facts About Auto Racing (Fun Fact File: Sports!)", "description": "From the drivers on the track to the fans packing the grandstands, auto racing is a thrilling sport that gets everyones adrenaline pumping. This book dives into the amazing facts that make up auto racings greatest stories. Readers will love discovering the history of races like the Indianapolis 500 and Daytona 500, as well as why NASCAR fans call Richard Petty The King. Fun graphics show the different flags used in a NASCAR race and just how Americans managed to win an auto race driving from New York City to Paris in 1908!"}, {"id": "1465402411", "genre": "Children's Books", "title": "DK Readers L2: Astronaut: Living in Space", "description": "Perfect for kids who have started to read but still need some help, this Level 2 DK Reader explores the fascinating world of an astronaut and what it is like to live in space. With longer sentences, increased vocabulary, information boxes with fun facts, and a simple index, this book shows young readers what it's like to hold down a job in zero gravity."}, {"id": "0810939002", "genre": "Children's Books", "title": "On a Windy Night", "description": "  On a windy Halloween night, as a little boy makes his way home after trick-or-treating, he hears a voice:     “Cracklety-clack, bones in a sack. They could be yours—if you look back.” As his heart flip-flops with fear, the boy dashes through woods and fields that seem full of haunting shapes—owls, ghosts, skeletons, and more. The detailed illustrations are packed with visual tricks for children to discover. Are those skeletons or cornstalks? Ghostly hands or tree branches? The playful tone of the text makes this a perfect, not-too-scary read-aloud, with an enjoyable surprise ending."}]