[{"id": "1614793573", "genre": "Children's Books", "title": "World of Reading, Level 1 - Set 2", "description": "The World of Reading line of early readers is designed to offer emerging readers stories featuring the characters they love at a pace that is just right for them to build confidence and a love for reading! Level 1 books feature easy-to-sound-out words for beginning readers. \n \n Leveled Readers is an imprint of Spotlight, a division of ABDO."}, {"id": "B00MBX0A86", "genre": "Children's Books", "title": "#02 Jack and the Wild Life (The Berenson Schemes)", "description": "After a wild plan by his parents left Jack stranded in the Caribbean, the Berenson family decided to lay out some rules. Jack's mom and dad agreed they wouldn't take so many risks. Jack agreed he'd try to live life without worrying quite so much. Then Jack's parents thought up another get-rich-quick scheme. Now the family's driving around Kenya. An animal attack is about to send Jack up a tree—alone, with limited supplies. As Jack attempts to outsmart a ferocious honey badger and keep away from an angry elephant, he'll have plenty of time to wonder if the Berenson Family Decision-Making Rules did enough to keep him out of trouble."}, {"id": "076368094X", "genre": "Children's Books", "title": "Out of Wonder: Poems Celebrating Poets", "description": "The instant New York Times bestseller!A Newbery Medalist and a Caldecott Honoree offer a glorious, lyrical ode to poets who have sparked a sense of wonder.Out of gratitude for the poet's art form, Newbery Award–winning author and poet Kwame Alexander, along with Chris Colderley and Marjory Wentworth, present original poems that pay homage to twenty famed poets who have made the authors' hearts sing and their minds wonder. Stunning mixed-media images by Ekua Holmes, winner of a Caldecott Honor and a John Steptoe New Talent Illustrator Award, complete the celebration and invite the reader to listen, wonder, and perhaps even pick up a pen."}, {"id": "1448807050", "genre": "Children's Books", "title": "Big-Game Hunting: Bears, Elk, and Other Large Animals (Open Season)", "description": "Presents general information about big game hunting, including the types of animals that are considered big game, the equipment and licenses needed, the different types of big game hunting, and what to do with the animal after the kill."}, {"id": "B072WYHY7G", "genre": "Children's Books", "title": "Story of a True Hero: Tests of a Courageous Knight (Kids’ Adventure Stories)", "description": "The journey of a true hero! The life of Rufus the knight is slow but satisfying, until he finds out he could do better. Looking for answers to help him improve his talents, he seeks out the commander of the protecting knight army, who simply asks him if he is ready to face some of the most severe tests in the country. Focused on his goal to become a true hero, Rufus ventures for excellence as he come across mean creatures and vile monsters before he can call himself a “Knight of Honor.” He has to deal with dangerous crows, slithering snakes, and challenging puzzles. Will he be able to prove himself? Quickly start reading and find out!"}]