[{"id": "0765306506", "genre": "Science Fiction & Fantasy", "title": "The Saxon Shore (The Camulod Chronicles, Book 4)", "description": "Merlyn Britannicus and Uther Pendragon---the Silver Bear and the Red Dragon---are the leaders of the Colony, lifeblood to the community from which will come the fabled Camulod.But soon their tranquility is in ruins, Uther lies dead from treachery, and all that is left of the dream is the orphaned babe Arthur. Heir to the Colony of Camulod, born with Roman heritage as well as the blood of the Hibernians and the Celts, Arthur is the living incarnation of the sacred dream of his ancestors: independent survival in Britain amidst the ruins of the Roman Empire.When Arthur is adopted by Merlyn Britannicus, an enormous responsibility is placed on Merlyn's shoulders. Now he must prepare young Arthur to unify the clans of Britain and guard the mighty sword Excalibur.And, above all, Merlyn must see that Arthur survives to achieve the rest of his ancestors' dreams, in spite of the deadly threats rumbling from the Saxon Shore.\"Of the scores of novels based on Arthurian legend, Whyte's Camulod series is distinctive, particularly in the rendering of its leading players and the residual Roman influences that survived in Britain during the Dark Ages.\"--The Washington Post"}, {"id": "085766638X", "genre": "Science Fiction & Fantasy", "title": "Dr. Potter's Medicine Show", "description": "The year is 1878. Dr Alexander Potter, disgraced Civil War surgeon, now snake-oil salesman, travels the Pacific Northwest with a disheartened company of strongmen, fortune-tellers, and musical whores. Under their mysterious and murderous leader they entertain the masses while hawking the Chock-a-saw Sagwa Tonic, a vital elixir touted to cure all ills both physical and spiritual. For a few unfortunate customers, however, the Sagwa offers something much, much worse.For drunken dentist Josiah McDaniel, the Sagwa has taken everything from him; in the hired company of two accidental outlaws, the bickering brothers Solomon Parker and Agamemnon Rideout, he looks to revenge himself on the Elixir’s creator: Dr. Morrison Hedwith, businessman, body-thief, and secret alchemist, a man who is running out of time.File Under: Fantasy [ The Secret Tradition | Chemical Imbalance | Hustlers Hustled | The Carnival is Over ]"}, {"id": "1556348142", "genre": "Science Fiction & Fantasy", "title": "GURPS Bio-Tech", "description": "The Future is Alive  \"Who needs chrome, pal? Meat is where it's at now. Mother Nature always did it best –– she just needed a little help. Get down to the black clinic, old-timer, and you can be 15 again. That is, if you still want to be human at all.\"   It's the technology of the posthuman age: biotech! Upgrade your old body with steroids and smart drugs, transplants, and viral nano . . . or just get a new one. Maybe you don't think being human is so great? Then improve on nature with eugenics and gene-fixing. Or just go parahuman: if you love cats, become one! The technology's changing fast, but you'll have lots of time to get used to it –– death is only a temporary inconvenience with cryonics and immortality drugs. And who needs silicon and steel? Vatbrain biocomputers are where it's really at!  But it's not just about the future. GURPS Bio-Tech includes a full range of 19th, 20th, and 21st-century medical equipment, from early vaccines to surgical robots, along with game stats for the world's most deadly diseases.   GURPS Bio-Tech also includes a complete set of character templates for biotech professions, rules for biotech magic, and two original campaign settings: an alternate Earth ruled by a clone of Alexander the Great, and a living starship on its way to colonize an alien world!   Say goodbye to your old body. Have you upgraded your genetics this year?  This is the second edition of GURPS Bio-Tech. It has been revised to the GURPS Fourth Edition rules and expanded to cover medicine, drugs, magic, and new technologies. Some entries were introduced in GURPS Space, GURPS Robots, and the Transhuman Space series."}, {"id": "B01CLWJ3CK", "genre": "Science Fiction & Fantasy", "title": "Frankenstein: By Mary Shelley (Illustrated And Unabridged)", "description": "“Beware; for I am fearless, and therefore powerful.” : Mary Shelley, FrankensteinYour 'Frankenstein' by Mary Shelley eBook Report:Unabridged (100% Original content)Illustrated.Working Table of Contents, Font adjustments & Navigation.About ‘Frankenstein' by Mary ShelleyFrankenstein; or, The Modern Prometheus, is a novel written by English author Mary Shelley about the young student of science Victor Frankenstein, who creates a grotesque but sentient creature in an unorthodox scientific experiment. ictor begins by telling of his childhood. Born in Naples, into a wealthy Geneva family, Victor and his brothers, Ernest and William, are encouraged to seek a greater understanding of the world through science. As a young boy, Victor is obsessed with studying outdated theories that focus on simulating natural wonders.Top 100 Best-Ever Classics Books: US –> http://amzn.to/1K9ZzqCUK –> http://amzn.to/1L3UgOBCanada –> http://amzn.to/1i02L1h"}, {"id": "0996389237", "genre": "Science Fiction & Fantasy", "title": "Reflection: Harbinger of the Phoenix (Records of the Ohanzee) (Volume 2)", "description": "The masquerade is over and the masks have been removed. But not everyone’s true face has been revealed… King Casimer of Marise has assassinated the Royal Family of Chiyo and usurped the throne. He doesn’t know that the Heiress of Chiyo, Nerissa, is still alive and has joined the Ohanzee, a group of guardians who have secretly protected the country for generations. Disguising herself as a young man, Nerissa seeks a way to depose Casimer and restore her country’s independence. An uncanny stroke of luck leads her to the mysterious seer Shae, who has discovered a fragment of an ancient prophecy warning of events that will bring about the end of civilization. And Casimer has already set some of those events into motion. With the future of not only Chiyo, but all of Renatus at stake, Nerissa and her six Ohanzee companions set out on a journey in search of the remaining fragments, where they will find unlikely allies and uncover new enemies."}]