[{"id": "1481501577", "genre": "Children's Books", "title": "1: Children's Favorites: Disney Bedtime Favorites and Disney Storybook Collection: Library Edition", "description": "Two story collections in one volume!From Bambi to Aladdin, the best-loved stories of all time are now even better. In Disney Storybook Collection, over twenty stories re-create the movie magic of the most beloved Disney films.Perfect for bedtime, the second edition of the popular Bedtime Favorites storybook collection has nineteen stories to choose from. Updated story selections feature characters from Finding Nemo, Cars 2, Toy Story 3, The Lion King, and more."}, {"id": "1632351471", "genre": "Children's Books", "title": "12 Entertainers Who Changed the World (Change Makers)", "description": "Profiles twelve entertainers who work to change the world by promoting national and global initiatives designed to better the lives of others."}, {"id": "0692947531", "genre": "Children's Books", "title": "Princess of the Reformation: Jeanne D'Albret", "description": "An inspiring true story of how one princess changed the course of history! The Protestant Reformation started by  Martin Luther in 1517 was growing. Jeanne D’Albret, a beautiful French princess in the 1550s was faced with a choice: risk her life and royal position for the truth, or oppose the Reformation and let her kingdom and her people remain blind to the truth, never knowing the Bible fully. Jeanne chose to do what was right. She was a princess who knew her mind, and she was not afraid of anyone- not even the Pope in the Vatican. Her bravery, faith and intelligence helped spread the Gospel and ensured that French people had access to the Bible in her corner of the world. "}, {"id": "0823422445", "genre": "Children's Books", "title": "A Difficult Boy", "description": "In 1839 Massachusetts, nine-year-old Ethan experiences hardships as an indentured servant of the wealthy Lyman family alongside Daniel, a boy scorned simply for being Irish, and the boys bond as they try to right a terrible wrong."}, {"id": "B00INKRL7E", "genre": "Children's Books", "title": "3 Friends", "description": "This is the story of 3 pups who were friends.  They are Ski, Spot and Brownie.  They love to play together, most of the times they played at the firehouse where Spot lived.  Captain John keep a few of toys and bowls of food and water for them.  They loved to play with the other firemen when they were at the firehouse."}]