[{"id": "0761309217", "genre": "Children's Books", "title": "Some Cars Can Swim: Amaz Facts (World Around Us)", "description": "Presents the many ways old materials are recycled and put to use once more in relation to the important impact the process of recycling has on the health of the environment."}, {"id": "0744572053", "genre": "Children's Books", "title": "Superkid Handbook (Puzzle Books)", "description": "Find out how to become a superkid, improve wordpower and maths. The \"Superkid Handbook\" is just one of a series of puzzle books aimed to keep children amused for hours. Each book contains a range of different puzzles, jokes, facts and fun."}, {"id": "1938706153", "genre": "Children's Books", "title": "Food: 100 Fun Tear-out Notes for Kids (Lunchbox Jokes)", "description": "Add a joke and make lunch fun! Lunchbox notes are a great way to say I love you  when your child is at school. Each tear-out page contains a joke that will add a smile to the lunch menu. Whether your kid relishes the fun alone or takes center stage and reads to the rest of the table, Lunchbox  Jokes makes it easy, fun, and funny."}, {"id": "1567664105", "genre": "Children's Books", "title": "1996 U.S. Women's Olympic Gymnastics Team (Sports Superstars Olympic Stars)", "description": "Describes the accomplishments of the U.S. Women's Gymnastics team in the 1996 Olympic games"}, {"id": "1101939451", "genre": "Children's Books", "title": "Go to Sleep, Little Creep", "description": "A rhyming picture book with humor and heart that's a wonderful bedtime addition for the \"little monster\" in your life. Includes illustrations from bestselling author/illustrator Ashley Spires of The Most Magnificent Thing.Even monsters have to go to sleep. But before little trolls turn out the light and werewolves settle in to dream, there's fur to be brushed, pajamas to find, and moons that need howling. So grab your cuddly critter and snuggle in for this new bedtime tradition.Debut storyteller David B. Quinn teams up with bestselling author/illustrator Ashley Spires to create a wondrously funny and supremely sweet picture book sure to charm little creeps who aren't quite ready to fall asleep."}]