[{"id": "1515900207", "genre": "Science Fiction & Fantasy", "title": "Marine Cadet (Human Legion)", "description": "2565 AD. When seventeen-year-old Marine cadet Arun McEwan forges an unlikely friendship with an alien scribe, he crashes into a world of treachery and conspiracy. How can he possibly survive three more years until graduation when every day brings a new deadly threat? But survive he must because his new alien allies show him glimpses of his destiny-a vision of a better future that only he can forge. A dream called the Human Legion."}, {"id": "8324141995", "genre": "Science Fiction & Fantasy", "title": "Hobbit (polish)", "description": "Klasyka gatunki i wstep do Wladcy Pierscieni. Hobbit to jedno z najwiekszych i najpopularniejszych dziel Tolkiena. To opowiesc o niebezpiecznej wyprawie podjetej przez krasnoludy, które wyruszaja wykrasc strzezone przez smoka zloto. Ich nieoczekiwanym partnerem jest hobbit Bilbo Baggins. Bilbo bardzo sobie ceni dobre jedzenie, spokój i wygode, lecz jego udzialem staje sie wielka przygoda..."}, {"id": "0982253028", "genre": "Science Fiction & Fantasy", "title": "Grave Whispers", "description": "A girl, pushed by a voice nobody can explain, falls in love with a quiet artist hiding a secret in his attic....a ghost, fueled by centuries of rage, finds a foothold of power in the heart and talent of an innocent.....a succubus, a lover in death - a black widow, finds a new puppet to revitalize her passions.....a rogue vigilante, whose path is a trail of blood, gore, and mayhem, stalks the father of his madness....and a boy - the artist, the innocent, the puppet - who nobody understands....all together entangled in a bizarre story of love, death, and power from beyond the grave. Brace yourself for the ultimate supernatural thriller, told in whispers....Grave Whispers."}, {"id": "0986360198", "genre": "Science Fiction & Fantasy", "title": "An Altered Fate: Echoes of Imara: Book Two (Volume 2)", "description": "Rescued, but not yet saved Although liberated from captivity by his wife and friends, Daro’s ordeal left him tortured, drowning in power he can’t control with voices haunting his mind. Cecily, weary and losing hope, watches with growing dread as her husband’s condition deteriorates. People from the land of Daro’s birth arrive with a possible solution. But to repair the pieces of his shattered psyche, Daro must leave his wife and travel to a home he scarcely remembers, where many believe he is too dangerous and the only answer is for him to die. News of the other captives reaches Cecily, and with an unlikely ally in Pathius, she sets out to prove they can be saved. But Pathius was once the prince and his very presence jeopardizes the peace she and Daro fought for. As tensions mount, Cecily may not be able to stem the tide of violence that threatens to overtake her kingdom, and war may be inevitable if Daro does not return."}, {"id": "1601256698", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Pawns Base Assortment", "description": "Back to bases! Make your heroes and monsters stand at attention with this collection of sturdy Pathfinder Pawns bases. Designed for use with the Pathfinder Roleplaying Game, this set includes 17 plastic bases—10 Medium bases, 5 Large bases, and 2 Huge bases—and are perfectly sized for battles on Pathfinder Flip-Mats, Map Packs, or other gridded game mats. With the Pathfinder Pawns Base Assortment, flood the battlefield with all the creatures your game demands!“Price Includes VAT” "}]