[{"id": "0692805257", "genre": "Children's Books", "title": "Spot: A Sea Pup's Survival Guide", "description": "Why is the ocean so important to this sea pup named \"Spot\"? This book has a simple message: \"Be kind to the planet. Be kind to each other.\" It follows the story of a baby sea lion who gets tangled in trash and rescued by humans. The back of the book includes a very basic teacher/parent guide to encourage conversations with children about a few themes: helping each other, recycling, and protecting our oceans and marine life. Why is this book so special? The main story is told with rhyming words. It includes a charming main character with an important lesson in ecology. Book features vibrant, playful illustrations, ocean photography & facts. Also, it has Lesson Plan Activities inside the book! Genre: Juvenile Fiction, Juvenile Nonfiction, Animals/Marine Life, Environmental Conservation & Protection, Environmental Science & Ecosystems "}, {"id": "0316041475", "genre": "Children's Books", "title": "13 Treasures (13 Treasures Trilogy)", "description": "Tanya is no ordinary girl. She can see fairies. But not the fairies we imagine. Evil fairies who cast spells on her, rousing her from her sleep and propelling her out of bed. At wit's end with her daughter's inexplicable behavior, Tanya's mother sends her away to live with her grandmother at Elvesden Manor, a secluded countryside mansion on the outskirts of a peculiar Essex town. There is plenty to explore, as long as Tanya stays away from Hangman's Wood- a vast stretch of forest, full of catacombs and notorious for people losing their lives. Fifty years ago a girl vanished in the woods, a girl Tanya's grandmother will not speak of. As Tanya learns more about this girl, she finds herself dangerously close to vanishing into the fairy realm forever.Debut author Michelle Harrison weaves an intricate mystery into a beautiful and haunting fantasy that captures a rich world of fairy lore where only the color red can offer protection."}, {"id": "0062432435", "genre": "Children's Books", "title": "I Want to Be a Police Officer (I Can Read Level 1)", "description": "For the child who says, \"I want to police officer when I grow up!\" And for any child who wants a gentle behind-the-scenes look at being a police officer.Police officers help to keep people safe. Did you know that there are many different ways to be a police officer? Join Eva as she meets Officer Green and the other officers at Town Safety Day.With this story blending narrative with nonfiction elements, readers meet police officers who protect people, investigate crimes, and even work with trained dogs.I Want to Be a Police Officer is part of a new I Can Read series that introduces young readers to important community helpers. This Level One I Can Read is perfect for children learning to sound out words and sentences."}, {"id": "141091402X", "genre": "Children's Books", "title": "My Thanksgiving (Festivals)", "description": "How is Thanksgiving celebrated? Find out in this Sprouts series. No matter what religious festivals a young reader may take part in, they’re sure to love reading about all of the festivals that come to life in this new series. Each title looks at the preparations that go into each festival, what people wear, where it takes place, the food that is eaten, when it happens, who celebrates it, and why it’s celebrated. A case study approach is taken, following a young child as they get involved in the preparations and celebrations."}, {"id": "1467757802", "genre": "Children's Books", "title": "Mikaela Shiffrin (Amazing Athletes)", "description": "Alpine skier Mikaela Shiffrin won her first world championship in slalom in 2013. She was just getting warmed up. In 2014, she won a gold medal in the same event as a member of Team USA at the Winter Olympics in Sochi, Russia. Mikaela was the youngest person to ever win an Olympic slalom competition. At an event a few weeks later, she was named world champion for the second year in a row. Learn more about this young star with an incredibly bright future."}]