[{"id": "1423163893", "genre": "Children's Books", "title": "Jake and the Never Land Pirates Bucky Makes a Splash!: A Lift-the-Flap Book", "description": "In need of a ship when the Jolly Roger gets beached, Captain Hook \"borrows\" Jake's pirate ship BUCKY --- not realizing that Bucky is alive! With help from Jake's crew and the reader, Bucky defends himself against Hook, sending the crazed captain back to his own ship thinking he's lost his mind! Kids will have fun peeking under all the lift-the-flaps to see this adventure unfold."}, {"id": "B01IPSEGQC", "genre": "Children's Books", "title": "How to Live Like an Aztec Priest (How to Live Like...)", "description": "It's the year 1492, the height of the Aztec Empire, and Ten Vulture is learning to become a priest—and a deadly warrior. On his adventures, he has to learn a secret language and rituals and make human sacrifices to the gods. Visit the largest city in the Americas and take part in the ultimate bloodletting ceremony alongside Ten Vulture. You'll need a courageous heart and a strong stomach!"}, {"id": "1433960281", "genre": "Children's Books", "title": "Thomas Paine Writes Common Sense (Graphic Heroes of the American Revolution)", "description": "The words of Thomas Paine truly inspired the fight for American independence. He helped define the aims of the Revolutionary War. He even rode alongside George Washington in the 1783 parade celebrating Americas victory. This book teaches readers about his journey from making corsets in England to fanning the flames of revolution in America. Told in the exciting style of a graphic novel, Paines creation of the revolutionary pamphlet Common Sense is presented for even the most reluctant readers to enjoy. Accessible text and engaging drawings allow readers to explore the development of Paines pamphlet and its impact on both the soldiers fighting for independence and those on the home front."}, {"id": "B0091MBPHU", "genre": "Children's Books", "title": "Grasshoppers! Learn About Grasshoppers and Enjoy Colorful Pictures - Look and Learn! (50+ Photos of Grasshoppers)", "description": "Are your kids interested in Grasshoppers? Awesome! You have found the right book. Help your children learn more about Grasshoppers today by reading this book. Here is what is included inside \"Grasshoppers! Learn About Grasshoppers and Enjoy Colorful Pictures – Look and Learn!\"... GrasshoppersGrasshopper BreedsInsectsGrasshopper PicturesGrasshopper FactsBaby GrasshoppersGrasshoppers JumpingGrasshopper FoodGrasshoppers EatingFun Grasshopper FactsAnd Lots More! Includes over 50 high quality photos of Grasshoppers! Other bonuses inside \"Grasshoppers! Learn About Grasshoppers and Enjoy Colorful Pictures – Look and Learn!\"...This book has photos of Grasshoppers.This book has info on Grasshoppers.This book has facts on Grasshoppers.This book will help you learn. Buy the \"Grasshoppers! Learn About Grasshoppers and Enjoy Colorful Pictures – Look and Learn!\" book right now!"}, {"id": "1604723335", "genre": "Children's Books", "title": "Video Games (Let's Explore Technology Communications)", "description": "This Book Describes The Most Current And Popular Video Games, The History Of Video Games, How They Work, And The Impact They Might Have On Our Future."}]