[{"id": "B071WRXKF3", "genre": "Science Fiction & Fantasy", "title": "Winning Commander/EDH: An unofficial guide to winning competitive and casual games of Magic the Gathering", "description": "If you enjoy Commander and wish to take your skills to the next level, this book is here to guide you into making the best of your deck. The book includes deck building techniques and taken from pros and veteran players and includes card lists of suggested cards that will increase your deck's power no matter the Commander you choose. Get ready to start winning and dominate your local game store or friend group with these easy tips and tricks!"}, {"id": "B0145QOFEQ", "genre": "Science Fiction & Fantasy", "title": "Superhighway (Superhighway Trilogy Book 1)", "description": "What if you could fly through the Internet and change data?Alex Fine is a gifted eighteen-year-old with an extraordinary ability to transport himself through the optical passageways of the Internet. While inside the digital web, Alex is capable of downloading databases, manipulating archived data, and traveling to any destination in the world. Alex discovers his powers just as he is ready to enroll in his freshman year at a prestigious West Coast university, causing an unexpected detour in his plans. In a short period of time, Alex Fine becomes one of the richest people in the world, with virtually limitless power. In a hastily arranged scheme, Alex becomes a digital Robin Hood, as he steals money from a criminal oligarch to fulfill his philanthropic goals. It is the story of a young man who wants to use his powers for good, but makes mistakes en route to discovering the truth behind his supernatural abilities."}, {"id": "1556348118", "genre": "Science Fiction & Fantasy", "title": "GURPS Magic", "description": "Now available in softcover, this GURPS Fourth Edition book combines the spells from the Third Edition GURPS Magic and GURPS Grimoire, plus dozens of all-new spells, for the ultimate tome of magic! Within these pages, crackling with mystic energies, you'll find:  The core magic system for GURPS, expanding on the material presented in the Basic Set . . . rules for learning magic, casting spells, enchanting magic items, and more! Complete alchemy rules . . . creating magical elixirs, using them, and even researching new ones . . . with an extensive list of known elixirs and their powers. Alternatives to the core magic system, including complete rules for improvised magic and rune magic. There are also guidelines for the GM who wants to change how magic works in particular worlds in a multi-world campaign. Plus special material from the GURPS Magic Items series and Wizards.  This is a powerful book, indeed. Use it wisely."}, {"id": "B004ISLQYO", "genre": "Science Fiction & Fantasy", "title": "The Invisible Chains - Part 1: Bonds of Hate (Dark Tales of Randamor the Recluse)", "description": "Anaxantis, prince of Ximerion. You will hate him... if your heart isn't big enough.While the kingdom of Ximerion is threatened at its southern border by a major power, the high king sends his two youngest sons, the half brothers Anaxantis and Ehandar, as Lord Governors to the Northern Marches where minor raids by wild barbarians are expected. Under the guidance of an old and trusted general, the king hopes to keep the young princes far from the major conflict in the south, while at the same time providing them with a valuable learning experience. The estranged half brothers are rivals, but soon they feel attracted to each other. As if this was not enough of a complication, they begin to suspect that they were set up by their own father. The result is a fierce struggle for power where the lines between hate and love become almost indistinguishable and where nothing is what it seems."}, {"id": "1476670269", "genre": "Science Fiction & Fantasy", "title": "Star-Begotten: A Life Lived in Science Fiction", "description": "Hugo Award winning writer James Gunn (1923-) has been called \"the last Golden Age author\" of science fiction. In a career of almost 70 years, he has written 28 books and dozens of short stories and participated in the production of films, radio and television programs and comic books."}]