[{"id": "061304617X", "genre": "Children's Books", "title": "Bogeymen Don't Play Football (Turtleback School & Library Binding Edition) (Adventures of the Bailey School Kids (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The students at Bailey School try to overcome their fears and their imaginations when they meet the new football coach and student teacher, Mr. Bogey, whom everyone begins to think may be the bogeyman."}, {"id": "B007E3AOXE", "genre": "Children's Books", "title": "ABC's With Claws the Crab", "description": "Fun with Claws the Crab on the bottom of the sea. This book helps little ones recognize and familiarize themselves with each letter of the English Alphabet. Each letter is displayed in capitol and lower case."}, {"id": "0761112057", "genre": "Children's Books", "title": "Fandex Family Field Guides: Cats", "description": " FANDEX FAMILY FIELD GUIDES CATS Bringing the world of CATS to your fingertips, FANDEX presents a field guide to 47 favorite breeds. Learn all about their mysterious ways-one breed, the La Perm, is a face-kisser. Fascinating and often legendary history-the Egyptian Mau was once worshipped in ancient Egypt as the living form of the cat-goddess Bastet. And unusual quirks-the Norwegian Forest Cat has special claws for climbing rocks. Includes a complete guide to each breeds appearance and temperment.  50 INDIVIDUALLY DIE-CUT CARDS FULL COLOR THROUGHOUT KNOWLEDGE AT YOUR FINGERTIPS FOR THE WHOLE FAMILY"}, {"id": "B0716GZSTQ", "genre": "Children's Books", "title": "Gabby Garcia's Ultimate Playbook #2: MVP Summer", "description": "“Perfect for fans of Big Nate and Dork Diaries.”—Nerdy Book ClubEveryone’s favorite pitcher Gabby Garcia is back and better than ever in the second installment of this laugh-out-loud illustrated middle grade series full of doodles, sports trivia, and home-run humor!Summer is here, and pitching phenom Gabby Garcia has another hot streak all planned out! After she’s invited to join an elite baseball league and asked out by her crush, it seems like Gabby is bound to achieve her MVP dreams. But life loves throwing Gabby curveballs. And when her BFF Diego returns from Costa Rica with a totally oddball new hobby, it feels like their once solid friendship is suddenly biting the dust. Thank goodness Gabby has her playbook!"}, {"id": "B01M6UE56E", "genre": "Children's Books", "title": "Children's Book: Ninja for a Day [Bedtime Stories for Kids]", "description": "Children's Book: Ninja for a DayBedtime Stories for Kids Have you ever seen a bird that knows karate? Well this little bird wants to show you his ninja skills. Strength, stealth, speed and bravery are qualities needed to be a ninja. This red bird believes he has all these traits to be GREAT—but will it truly have what it takes to be a ninja? Read along as you and your child will once again enjoy the silly antics of this quirky bird! This is a read aloud kids book and is easy to read. The target age range audience is for toddlers, preschool and young children. Ninja for a Day is a book that any child will love, especially at bedtime. This book is suitable for parents to read to their children. Grandparents will definitely enjoy reading this book to their grandchildren. Read this children's book FREE as part of your PRIME or Kindle Unlimited membership"}]