[{"id": "141778427X", "genre": "Children's Books", "title": "All In This Together (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. A comprehensive look at the making of the Disney Channel film High School Musical provides detailed profiles of the film's cast members, information on the upcoming sequel, trivia, and more."}, {"id": "1534406182", "genre": "Children's Books", "title": "Unicorn Magic The Royal Collection Books 1-4: Bella's Birthday Unicorn; Where's Glimmer?; Green with Envy; The Hidden Treasure", "description": "Join Princess Bella and Glimmer as they have adventures throughout the Crystal Kingdom in the first four Unicorn Magic chapter books—now available together in a collectible boxed set!In the Crystal Kingdom, members of the royal family receive a very special present: a Unicorn of their very own, who will guide and protect them for the rest of their life. And for Princess Bella, she is super excited when she is matched with Glimmer, her official unicorn. This collection includes: Bella’s Birthday Unicorn Where’s Glimmer? Green with Envy The Hidden Treasure"}, {"id": "1560107545", "genre": "Children's Books", "title": "Fun with Watercolor  Kit (Art Start!)", "description": "Give beginning artists a wonderful introduction to watercolor painting with this complete kit. Inside you’ll find a colorful project book full of easy-to-follow instructions and everything else you need to create 15 fantastic projects: - Watercolor paint palette - Preprinted watercolor paper - 4 paintbrushes - Sea salt - Zigzag scissors - 2 painting sponges - Practice paper pad - Fine-point black marker - 3 \"wax-resist\" crayons - And more! Sure to inspire young painters, ages 8 and up."}, {"id": "B0075B8F5Y", "genre": "Children's Books", "title": "The Goopy Ghost of Halloween", "description": "With vivid illustrations that sing the praises of the darkest and most delightful aspects of Halloween, The Goopy Ghost by V. R. Duin is a fantastically fun rhyming tale that celebrates the goopiest of ghostly goo. When siblings Steven and Sally trace the lines of what can only be described as the fiercest of all pumpkin faces and have their father carve the expression, they never imagine that the goo they toss in the rubbish bin will return to haunt them. A goopy ghost whose “Boo!” includes candy thieving, this ghoul roams the house to find a new house—one that isn’t on fire. Absolutely unforgettable, this ghost story is perfect for even the youngest of beginning readers and is sure to become a Halloween classic."}, {"id": "0822588803", "genre": "Children's Books", "title": "#12 Kung Fu Masters (Journeys) (Twisted Journeys (Paperback))", "description": "Will you succeed on an epic quest in ancient China, full of bandits, ghosts, and flying fists? Can you defeat your foes and become a master of martial arts? Every Twisted Journeys(R) graphic novel lets YOU control the action by choosing which path to follow. Which twists and turns will your journey take?"}]