[{"id": "1680550519", "genre": "Children's Books", "title": "Sir Pigglesworth's First Adventure (Sir Pigglesworth Adventure Series)", "description": "1st Place Winner in the 2016 Royal Dragonfly Book Awards in Children's Chapter Book category What If Pigs Could Fly - And Have Adventures? Sir Pigglesworth Brings Adventure and More to Bedtime Stories! When it comes to bedtime, there s nothing more fun than snuggling up with a good book - or reading out aloud to your child and sharing the ups and downs of a story of a rambunctious young adventurer.  After being knighted by Queen Alexandra for acts of bravery, Sir Pigglesworth was commissioned to travel around the world to spread cheer and smiles with all the children he meets. He is to learn about the culture  and history of each city he visits and pass this information on to all children of the world. First stop...LONDON!! In his first adventure, Sir Pigglesworth follows his parents to the London airport. He was supposed to stay home with his grandmother, but the rambunctious royal rascal was not always very good at following the rules! He wants to surprise his parents with his smiling face in Vancouver! Surely, they would be thrilled to see him there...wouldn t they? After all, what could go wrong?"}, {"id": "B00FV973LO", "genre": "Children's Books", "title": "The Green Beans, Volume 3: The Curious Conundrum of Pan Gu", "description": "SOMETHING LIES BENEATH…Only a handful of days have passed since the nefarious efforts of Jasper, the evil school janitor, were squashed. Although they are exhilarated with their victory, the Beans have come to realize that Jasper is but the tip of the iceberg in the schemes of a larger organization of dubious methods and goals.Be that as it may, they’re happy to have a break from the astonishing events of recent weeks, and their field trip to the Portsmouth Museum of Historical Artifacts seems like the perfect way to relax. It doesn't take long, however, for the Beans to realize that serious weirdness is afoot, and things are not as they initially appear.In this museum, nothing is what it seems at face value. There are artifacts of mysterious, unknown power, and the staff members are acting awfully peculiar. Most significant of all, the building’s primary purpose may not be to serve as a museum at all, but to hide the gargantuan secret that lies beneath it… a secret so big, its unveiling may transform the communities of Portsmouth and Hollow Oak.“The Green Beans” is a series of middle grade novels featuring elements of adventure, mystery, science fiction, and the paranormal. Recommended for ages 9-13 (and anybody who is still young at heart)."}, {"id": "0399247416", "genre": "Children's Books", "title": "Merlin: The Book of Magic, Book 12 (Merlin Saga)", "description": "The ultimate guide to T. A. Barron's Merlin epic! A luminous gift for fantasy fans! In this extraordinary guide to T. A. Barron's award-winning and New York Times bestselling Merlin saga, readers will discover the mysteries of Merlin's worlds as never before. The guide includes full-color art, seven maps, and information about the creatures, places, and magic in Merlin's worlds.Glowing with beautiful art and surprising details, this is a treasure trove of adventure and delight - as well as a collector's item for Merlin fans of all ages.Read T.A. Barron's blogs and other content on the Penguin Community. "}, {"id": "0689870434", "genre": "Children's Books", "title": "When Washington Crossed the Delaware", "description": "\"This is the story that I tell my grandchildren at Christmas. I hope that this book will bring the tradition of sharing history to families all across America.\" -- Lynne Cheney   Christmas night, 1776, was a troubled time for our young country. In the six months since the Declaration of Independence had been signed, General George Washington and his troops had suffered defeat after defeat at the hands of the British. It looked as though our struggle for independence might be doomed, when Washington made a bold decision. He would lead the main body of his army across the Delaware River and launch a surprise attack on enemy forces.  Washington and his men were going against the odds. It seemed impossible that the ragtag Americans could succeed against the mightiest power in the world. But the men who started across the icy Delaware loved their country and their leader. Under his command they would turn the tide of battle and change the course of history.  Best-selling author Lynne Cheney tells the dramatic story of the military campaign that began on Christmas night in 1776. When Washington Crossed the Delaware will teach the young about the heroism, persistence, and patriotism of those who came before them."}, {"id": "B00AWEXFK6", "genre": "Children's Books", "title": "100 Canadian Heroines: Famous and Forgotten Faces", "description": "Augmented by great quotes and photos, this inspiring collection profiles remarkable women — heroines in science, sport, preaching and teaching, politics, war and peace, arts and entertainment, and more. Profiles include mountaineer Phyllis Munday, activist Hide Shimizu, unionist Lea Roback, and movie mogul Mary Pickford."}]