[{"id": "B0195HQTO4", "genre": "Children's Books", "title": "Brains Beats Brawn: Modren Hanukkah Story For Children", "description": "Young Kid Fights School Bullies Like Judah Maccabee Using His BrainsWhen young Jacob gets bullied at school by bigger boys. He thinks nothing can be done. His mother tells him the story of Hanukkah how Judah Maccabee managed to defeat the invincible Greek Army. Jacob decides to learn from Judah Maccabee and to fight back. In this short surprising story kids learn that Brains Beats Brawn, fighting back and self defense can be done by outsmarting the opponent."}, {"id": "0819872512", "genre": "Children's Books", "title": "Shepherds to the Rescue (Gospel Time Trekkers)", "description": "In this first volume of the Gospel Time Trekkers series, children ages 6-9 are taken on a journey that imaginatively retraces the birth of Jesus through the experiences of modern siblings Hannah, Caleb, and Noah."}, {"id": "B00HYV68HC", "genre": "Children's Books", "title": "The Celebrated Jumping Frog of Calaveras County (Annotated)", "description": "“The Celebrated Jumping Frog of Calaveras County” is probably the best-known short story by Mark Twain (pen-name of Samuel Clemens, 1835-1910). First published in 1865, the tale is centered around a bet on the jumping ability of a frog.The ebook also contains a selection of Twain’s best aphorisms and a biographical note on the author."}, {"id": "0375842152", "genre": "Children's Books", "title": "LITTLE GOLDEN BOOK F", "description": "THREE ALL-TIME FAVORITE Little Golden Books (The Poky Little Puppy, The Saggy Baggy Elephant, and Scuffy the Tugboat) are gathered together in this sweet mini-treasury. At a retail price of $5.99, this durable, attractive volume is a great value and perfect for gift-giving."}, {"id": "1599284448", "genre": "Children's Books", "title": "Iguana Mama (Critter Chronicles)", "description": "A newborn iguana sets out to find his mother, getting advice from other animals along the way. Alternating pages provide facts about different types of iguanas."}]