[{"id": "0874835364", "genre": "Children's Books", "title": "Wake, Snake!: Children's Stories and Songs of the South (American Storytelling)", "description": "\"Wake, Snake!\" is a delightful collection of children's stories and songs of the South, featuring 12 traditional tales and songs drawn from the diverse Southern heritage: Cajun, Creole, African-American, Scots-Irish, and Native American. Guitar, mandolin, fiddle, Cajun triangle, and spoon percussion provide down-home musical sound effects. 60-minute cassette."}, {"id": "B019GBLA7A", "genre": "Children's Books", "title": "GREELY IGUANA and his Caribbean Tree House (Greely Iguana Series Book 1)", "description": "\"Greely Iguana and his Caribbean Tree House\" is the adorable story of a baby iguana who survives a hurricane while teaching young children important lessons such as responsibility, self discipline, weather, geography, colors, and self reliance."}, {"id": "B01NH042TX", "genre": "Children's Books", "title": "THE BOOK OF DRAGONS (Illustrated): Fantastic Adventures Series: The Book of Beasts, Uncle James, The Deliverers of Their Country, The Ice Dragon, The Island ... The Dragon Tamers, The Fiery Dragon…", "description": "This carefully crafted ebook: \"THE BOOK OF DRAGONS (Illustrated)\" is formatted for your eReader with a functional and detailed table of contents:The Book of BeastsUncle James, or The Purple StrangerThe Deliverers of Their CountryThe Ice Dragon, or Do as You Are ToldThe Island of the Nine WhirlpoolsThe Dragon TamersThe Fiery Dragon, or The Heart of Stone and the Heart of GoldKind Little Edmund, or The Caves and the CockatriceEdith Nesbit (1858-1924) was the author of world famous books for children - the tales of fantastical adventures, journeys back in time and travel to magical worlds."}, {"id": "0679804196", "genre": "Children's Books", "title": "The Berenstain Bears and the Slumber Party", "description": "This classic Berenstain Bears story is a perfect way to teach children about personal responsibility and privileges!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Sister is going to a slumber party at Lizzie’s house, but when no parents are there and some unexpected visitors show up, things get a bit out of hand. What will Sister do? Includes over 50 bonus stickers!"}, {"id": "B00DTRCRP2", "genre": "Children's Books", "title": "The Elf's Baseball House - A Children's Picture Book", "description": "The Elf's Baseball House: a picture book for children who love fantasy and sports! Tuturdir, a little elf, finds a baseball and turns it in his new house. But one day it starts raining and the children playing nearby..... What will happen to Tuturdir and to his little house?\"The Elf's Baseball House\" is a short story for children of all ages illustrated with beautiful and entertaining images"}]