[{"id": "0764156632", "genre": "Children's Books", "title": "Five Little Ducks", "description": "Five little ducks went swimming one day, over the hills and far away. This delightful rhymed story with charming color illustrations introduces toddlers to numbers and counting. It comes in a durable board format, with covers and pages designed to survive punishment from careless kids."}, {"id": "1617724416", "genre": "Children's Books", "title": "Dwyane Wade (Basketball Heroes Making a Difference)", "description": "Dwyane Wade is a hero both on and off the basketball court. As a high-scoring superstar for the Miami Heat, Dwyane has led his team to an NBA championship and is one of the most popular players in the league. His talents and achievements aren't limited to basketball, however. Dwyane also puts his skills to use with the Wade's World Foundation, an organization he founded in 2003. The foundation's mission is to make a difference in the lives of countless children in underserved communities. In Dwyane Wade, readers will follow this NBA superstar's amazing basketball career and discover how he has made a difference in people's lives both on and off the court. Large, full-color action photos and engaging text will keep readers turning the pages for more."}, {"id": "075661807X", "genre": "Children's Books", "title": "Chess for Kids", "description": "A children's step-by-step visual guide to the rules, skills, and techniques of chess—by International Master and renowned chess tutor Michael Basman.From the history of chess and the aim of the game to essential tactics and taking it even farther in clubs, tournaments, and championships, Chess for Kids covers it all. Before explaining techniques, the book details each piece—pawns, bishops, the king, and more—to ensure kids have a comprehensive understanding before they begin to play. Chess board graphics illustrate different scenarios and support the text explanations so readers can visualize different moves and their potential outcomes as they go.Let Chess for Kids and International Master Michael Basman turn you into a champion chess player."}, {"id": "0692943358", "genre": "Children's Books", "title": "The Smallest Horse ~ A Children's Picture Book About Discovering Your Own Special Talents", "description": "The Smallest Horse tells the story of Trixie, a miniature horse who worries she's not big enough to have an important job on the ranch. Children will delight in this heartwarming tale as they follow Trixie's misadventures and ultimate realization that she does indeed have a very special purpose on the ranch.  This is the first book in the Pony Dreams series. All of the horses in the Pony Dreams stories are real, and each one has a distinct personality, a unique life experience and different likes and dislikes. After children read the story, they can visit the Pony Dreams website to meet Trixie and the rest of the herd through a series of fun and educational videos and posts about the horses and the topics broached in each book."}, {"id": "0545709296", "genre": "Children's Books", "title": "Pip Bartlett's Guide to Unicorn Training", "description": "From bestselling authors Maggie Stiefvater and Jackson Pearce comes the second installment in a series bursting with magical creatures, whimsical adventures, and quirky illustrations."}]