[{"id": "1634721608", "genre": "Children's Books", "title": "Judaism (21st Century Skills Library: Global Citizens: World Religions)", "description": "Using the new C3 Framework for Social Studies Standards, these books explore the six most popular world religions through the lenses of History, Geography, Civics, and Economics. In Judaism, the text and photos look at the history, basic philosophies, and geography of this religion, as well as how it relates to society today. As they read, students will develop questions about the text, and use evidence from a variety of sources in order to form conclusions. Data-focused backmatter is included, as well as a bibliography, glossary, and index."}, {"id": "1549504657", "genre": "Children's Books", "title": "Little Koala goes swimming", "description": "It's a hot Australian summer's day. Little Koala would love to go for a swim...if only he knew someone with a pool. Will Kylie Roo, Spiny, Wombat or Bunyip have a pool? Or does someone else they know have a very, very, big pool?"}, {"id": "B00NI9FKF0", "genre": "Children's Books", "title": "Cooking Recipes Volume 1 - Superfoods, Raw Food Diet and Detox Diet: Cookbook for Healthy Recipes", "description": "Cooking is a craft that everyone cannot grasp after having a few lessons in the kitchen with family members and friends. Some learners need additional tools to further enhance their knowledge of the trade and perfect their talent in the industry; this is where cook books come in. Culinary reading material gives the student a clear picture of what he is preparing along with a scope of what the finished product should look like. It is much easier for a young chef to prepare fried chicken when he is not guessing about how much flour to put into the bag or the amount of time it takes for the coated skin to brown. Cook books are essential tools that help culinary students and amateurs progress in the trade."}, {"id": "0142413046", "genre": "Children's Books", "title": "Froggy Plays T-ball", "description": "It's the first day of T-ball and Froggy can't wait. In his dreams he's hitting home runs and waving to the cheering crowd. But things never go quite right for Froggy. After he bonks his pal Max on the head with his bat, throws himself out at first base, and spends his time in the outfield catching real flies with his tongue, Froggy has one last chance to prove he's a T-ball star."}, {"id": "0571206875", "genre": "Children's Books", "title": "The Archaeologists' Handbook (Insider's Guide to Digging Up the Past)", "description": "The Archaeologists' Handbook takes a look at the role of archaeologists from the discovery of an artefact or archaeological site to the identification, dating, preservation, restoration, and understanding of what has been found. This book looks at everything from the most basic archaeological techniques to the latest technological advances used to assist the modern archaeologist; all explained in Ardagh's inimitable and amusing style. This is a must for amateur archaeologists, young and old."}]