[{"id": "B00LKCPVQA", "genre": "Children's Books", "title": "My Awesome Japan Adventure: A Diary about the Best 4 Months Ever!", "description": "PICKED AS ONE OF THE BEST BOOKS OF 2013 BY THE ASSOCIATION OF BOOKSELLERS FOR CHILDREN!A perfect introduction to Japanese culture for kids, My Awesome Japan Adventure is the diary of an American fifth grader who travels to Japan to spend four exciting months with a Japanese family as an exchange student. He records all his adventures in this diary so that he can tell his friends back home about what he did and saw during his time in Japan. With the help of a Japanese foster brother and sister, he visits a Ninja village, tries new foods, learns brush painting, and gets the inside scoop on daily life in a Japanese school. Readers of all ages will love experiencing life in Japan from a kid's point of view!Dan's adventures include: My First Week of School, Visiting a Ninja Village, Fun with Origami, Practicing Aikido, Making Mochi, and much more… As a multicultural children's book, My Awesome Japan Adventure is perfect for kids who want to explore another culture and have fun in the process!"}, {"id": "1534411763", "genre": "Children's Books", "title": "Daniel Tiger's Day and Night (Daniel Tiger's Neighborhood)", "description": "Daniel learns that by following certain routines in the morning and nighttime he’s guaranteed to have a grr-ific day in this 8x8 storybook based on episodes of Daniel Tiger’s Neighborhood.Get to know all of the morning routines that help Daniel Tiger get ready for a grr-ific day. And when the day is done, Daniel shares all of his important steps for a successful night’s sleep. This storybook includes a checklist to help little ones establish their own morning and nighttime routines and features fun stickers, too! © 2017 The Fred Rogers Company"}, {"id": "B00COB590O", "genre": "Children's Books", "title": "Shavuot for Children - Jewish Festivals for Children", "description": "Jewish people all over the world commemorate Shavuot.Discover why Shavuot is such an important Jewish Festival.Children ages 6 to 10 will enjoy learning about Shavuot with easy to read sentences and colorful illustrations.Discover…* What is Shavuot?* What did families do in Biblical times on Shavuot?* When is Shavuot?* What important event do we remember on Shavuot?* What do we do today for Shavuot?...and Much More!Spend time together with your kids and learn about Shavuot together.I wrote this book for my children and hope your children will enjoy it, as well.Thank you,Hannah GoldAuthor of “Shavuot for Children”"}, {"id": "0061958093", "genre": "Children's Books", "title": "Everything Goes: On Land", "description": "Cars and trucks and bikes and trains!Rvs and construction vehicles too!Everything goesRide along with Henry and his dad as they visit the big city and check out all the amazing vehicles around them. Full of mini-story lines, endless seek-and-find activities, and hundreds of funny details, Everything Goes: On Land is an interactive book that provides hours of fun!"}, {"id": "0823968723", "genre": "Children's Books", "title": "LA Historia Del Patinaje Artistico/the Story of Figure Skating (Historia de los Deportes) (Spanish Edition)", "description": "The first skaters lived more than 1, years ago! Since then, figure skating has become a very exciting and beautiful sport. Students will learn all about the history of the sport in this intriguing book."}]