[{"id": "0824954238", "genre": "Children's Books", "title": "The Illustrated Laws of Soccer", "description": "A clear and concise, illustrated introduction to the rules of the game. Reviewed and endorsed by the U.S. Soccer Foundation, the text presents the 17 basic laws of the game in an easy-to-understand format. The text includes descriptions of players' positions, explanations of fouls and penalties, definitions of key terms and more. Includes detailed, full-color illustrations."}, {"id": "1912050463", "genre": "Children's Books", "title": "The Ice Bear", "description": "In distant northern lands, the ice bear has given birth to two tiny cubs. As she sleeps, Raven the trickster steals one cub away, dropping him as a human child in the path of a hunter and his wife. The childless hunter and his wife rejoice at this wonderful gift and hold their newfound child close. As the years pass, the ice bear never forgets her second cub and pines for what she has lost. This magical tale set in Jackie Morris’s stunning icy landscapes tells a tale of tolerance and understanding, and reminds us of our duty to take care of this world’s wild creatures. Jackie’s glorious illustrations and lyrical text are now matched by the lavish production values of this book."}, {"id": "0789453894", "genre": "Children's Books", "title": "Aladdin and Other Tales from the Arabian Nights", "description": "A retelling of the adventures of Aladdin who, with the aid of a genie from a magic lamp, fights an evil sorcerer and wins the hand of a beautiful princess."}, {"id": "B071FN3WPM", "genre": "Children's Books", "title": "Tales of King Arthur", "description": "Enter the thrilling world of the Knights of the Round Table with these exciting retellings of the Arthurian legends. Henry Gilbert's classic collection includes the adventures of Arthur, Sir Lancelot, Merlin, Gwenevere, and many other famous characters. Filled with daring quests and chivalrous deeds, these stories will enchant readers of all ages. This edition features illustrations by the renowned artist, Walter Crane."}, {"id": "1481487116", "genre": "Children's Books", "title": "Fairy Chase (Mermaid Tales)", "description": "With the help of her fintastic friends, Echo investigates whether or not fairies really DO exist in this sparkling Mermaid Tales adventure.Echo is excited when her Aunt Crabella and Uncle Leopold visit, especially since Aunt Crabella always has amazing stories about all of her many ocean travels. But when Aunt Crabella tells Echo about the Hairy Fairy—a fairy that visits mermaids while they sleep and purposely tangles their hair—Echo is all set to catch the fairy in the act. Shelly and Kiki tell Echo that fairies aren’t real, but Aunt Crabella says she believes they are. And what’s the harm in believing? When Echo can’t seem to catch the Hairy Fairy, she becomes determined to figure out if fairies really do exist! She teams up with Shelly and Kiki and makes “Fairy Juice” (via a recipe from Rocky Ridge) in order to go on a fairy hunt on Trident City’s majestic Sperm Whale Mountain. But what will they find on their fairy hunt? Will all of Echo’s magical fairy dreams come true?"}]