[{"id": "1465435840", "genre": "Children's Books", "title": "Super Shark Encyclopedia", "description": "Super Shark Encyclopedia uncovers the secrets of the oceans by exploring a remarkable array of 80 sharks and other sea creatures — from Barrel Shrimp to Blue Sharks, Starfish to Bat Fish, and Hammerhead Sharks to Sandtiger Sharks, plus surfing penguins, deep-sea monsters, rays, eels and more. Packed with jaw-dropping facts about animal behavior and anatomy, new x-ray artworks utilize cross-sections and strip layers away to show key anatomical features in detail. It showcases record-breaking animals, such as the deadliest predators and the most venomous creatures, and explains how and why their bodies work the way they do. With its combination of spectacular photography and clear yet authoritative text, Super Shark Encyclopedia is the ultimate visual guide to the oceans' most incredible stories."}, {"id": "0142401137", "genre": "Children's Books", "title": "Sadako and the Thousand Paper Cranes (Puffin Modern Classics)", "description": " “An extraordinary book, one no reader will fail to find compelling and unforgettable.” —Booklist, starred reviewThe star of her school’s running team, Sadako is lively and athletic…until the dizzy spells start. Then she must face the hardest race of her life—the race against time. Based on a true story, Sadako and the Thousand Paper Cranes celebrates the courage that makes one young woman a heroine in Japan. \"[The] story speaks directly to young readers of the tragedy of Sadako's death and, in its simplicity, makes a universal statement for 'peace in the world.” —The Horn Book \"The story is told tenderly but with neither a morbid nor a sentimental tone: it is direct and touching.\"  —BCCB"}, {"id": "0836827783", "genre": "Children's Books", "title": "The Stone Age News (History News)", "description": "Uses a newspaper format to present the inventions, lifestyles, climate changes, and progress in hunting and farming of the Stone Age."}, {"id": "0316142239", "genre": "Children's Books", "title": "On the Halfpipe with Tony Hawk", "description": "Delving into the life of skateboarding sensation Tony Hawk, this biography examines how he began skateboarding at age nine and his performance at the 1999 ESPN X Games, where he astonished viewers by performing a trick thought impossible to do. Illustrations."}, {"id": "1783441453", "genre": "Children's Books", "title": "Frog in Love", "description": "The very first picture book to feature the loveable amphibian.      Frog is feeling most unwell. He keeps getting hot, then cold, and something inside his chest is going 'thump, thump'. Hare says it means he's in love! But who with? And how can he show his devotion -- perhaps by performing the biggest jump ever?"}]