[{"id": "0374384363", "genre": "Children's Books", "title": "William Tell", "description": "Legend has it that early in the fourteenth century, when the Swiss were oppressed by Austrian Hapsburg rulers, one man stood up to the tyrants. His name was William Tell.William Tell was appalled that his people were forced to kneel to the hat of their govenor, and he refused to do so. His punishment was severe: An apple was placed on his son's head, and Tell was told to shoot it. If his arrow found its mark, the had would be removed from the town square. If it did not, young Jemmy migh die. . .With vigorous text and stunning paintings, Leonard Everett Fisher adapts and illusrates this story of William Tell, which he calls \"a metaphor for freedom.\""}, {"id": "1634723260", "genre": "Children's Books", "title": "Minecraft Guide to Animals (21st Century Skills Innovation Library: Unofficial Guides)", "description": "With more than 100 million players around the world, Minecraft is one of the most popular video games of all time. Its unique design encourages players to use their creativity and problem solving skills to build entire worlds from scratch. In this book, readers will learn everything they need to know about dealing with animals in the world of Minecraft, including how to tame them and harvest valuable resources from them."}, {"id": "0694011479", "genre": "Children's Books", "title": "The Mixed-Up Chameleon Board Book", "description": "From Eric Carle, the New York Times bestselling author of The Very Hungry Caterpillar and The Grouchy Ladybug, comes a colorful and inventive book about a changing chameleon that wants to be a little bit of everything.There once was a small green chameleon that wished to be handsome like a flamingo, smart like a fox, and funny like a seal. But with each transformation in size, shape, and color, the chameleon learns that maybe being yourself is best of all!The Mixed-Up Chameleon is sure to delight little readers with its interactive art, funny antics, and heartwarming message. This board book edition is the perfect size for small hands and features sturdy pages."}, {"id": "B06WGPCHZ3", "genre": "Children's Books", "title": "The Happy Sailor Of China: The Story of Zheng He - in English & Chinese (Heroes Of China Book 7)", "description": "Zheng’s grandfather has been to many places.Zheng would love to travel, too.Can he make his dream come true?Children aged 2 to 5 will enjoy this story of the explorer Zheng He (郑和), who is thought to have discovered America before Columbus. This bilingual book is part of the Heroes of China series in which Jillian Lin retells tales of famous Chinese figures so they are easy and fun to read. Beautiful illustrations make these books wonderful early readers or read-aloud stories in English and Chinese. Other titles in the series include:The First Emperor Of China (Qin Shihuang)  The Wise Teacher Of China (Confucius) The Music Man Of China (Zhu Zaiyu)The Clever Doctor Of China (Hua Tuo) The Girl Emperor Of China (Wu Zetian) The Star Gazer Of China (Zhang Heng)The Pirate King Of China (Koxinga/Zheng Chenggong) Also available as e-books on www.amazon.com. For more information, visit www.jillianlin.com"}, {"id": "1851034471", "genre": "Children's Books", "title": "Claude Debussy (First Discovery Music)", "description": "As a boy, Debussy wanted to be a sailor. At music college in Paris he used to shock his teachers with the sounds he made on the piano. Children who want to know how to make a glass sing or hear the sound of the sea in a teacup will learn much from Debussy. The accompanying CD contains recordings of some of his most famous works as well as the narration of the story."}]