[{"id": "0385376715", "genre": "Children's Books", "title": "The Wonderful Things You Will Be", "description": "The New York Times bestseller that celebrates the dreams, acceptance, and love that parents have for their children . . . now and forever!    From brave and bold to creative and clever, Emily Winfield Martin's rhythmic rhyme expresses all the loving things that parents think of when they look at their children. With beautiful, and sometimes humorous, illustrations, and a clever gatefold with kids in costumes, this is a book grown-ups will love reading over and over to kids—both young and old. A great gift for any occasion, but a special stand-out for baby showers, birthdays, and graduation. The Wonderful Things You Will Be has a loving and truthful message that will endure for lifetimes."}, {"id": "1434248119", "genre": "Children's Books", "title": "The Man of Steel", "description": "DC SUPER HEROES chapter books feature the WORLD'S GREATEST SUPER HEROES including SUPERMAN. The MAN OF STEEL defeats aliens and super-villains in METROPOLIS, and rescues LOIS LANE and JIMMY OLSEN. With original art by DC COMICS illustrators, these full-color chapter books give young readers glowing examples of bravery, loyalty, and true heroism."}, {"id": "0449810232", "genre": "Children's Books", "title": "4: The Flying Beaver Brothers: Birds vs. Bunnies", "description": "In their fourth adventure, the Flying Beaver Brothers set off in their sailboat to enjoy some well-deserved rest and relaxation at nearby the island. But the birds and bunnies who live on Little Beaver Island have other ideas. Before long, Ace and Bub find themselves embroiled in an all-out war between the feathers and the fuzz. Can the Flying Beaver Brothers bring peace to Little Beaver Island? "}, {"id": "1403436215", "genre": "Children's Books", "title": "Motorcycles (Wheels, Wings, and Water)", "description": "Contents include answers to these questions: What are motorcycles? What do motorcycles look like? What are motorcycles made of? What did motorcycles look like a long time ago? What is a scooter? What is a touring motorcycle? What is an ATV? What is a dirt "}, {"id": "B01A2YJ8ZQ", "genre": "Children's Books", "title": "Mr. Goo Goes Food Tripping: Famous Food and Delicacies in North America: American Food and Drink for Kids (Children's Explore the World Books Book 4)", "description": "Food in North America is on the spotlight in this dedicated picture book. Here, Mr. Goo shares his gastronomic food experience to give you a delicious introduction to its culture and tradition. Grab a copy of this picture book to learn about the spices they use, food presentation, and what food means to the people of North America."}]