[{"id": "0060253169", "genre": "Children's Books", "title": "The Star Maker", "description": "If only Artie had kept his mouth shut.But his mean cousin Petey was putting him down, so Artie started bragging.Now he has to come up with enough money to buy firecrackers for all his cousins by the Lunar New Year.Luckily, there's one person he can count on . . . Uncle Chester!Newbery Honor Book author Laurence Yep celebrates family and Chinese New Year traditions in this story of a boy and his uncle who discover that age doesn't matter when it comes to helping out a friend."}, {"id": "0786936223", "genre": "Children's Books", "title": "Dragon Day (Dragonlance: The New Adventures, Vol. 6)", "description": "The sixth title in an all-new Dragonlance series for young readers.Dragon Day continues a new series of Dragonlance adventures written specifically for readers ages 10 and up. Sized to fit the young reader market, the series features a new group of young companions who band together for friendship and excitement during the golden age of the Dragonlance world."}, {"id": "0545791340", "genre": "Children's Books", "title": "Harry Potter and the Prisoner of Azkaban: The Illustrated Edition (Harry Potter, Book 3)", "description": "The third book in the bestselling Harry Potter series, now illustrated in glorious full color by award-winning artist Jim Kay! For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort. Now he has escaped, leaving only two clues as to where he might be headed: Harry Potter's defeat of You-Know-Who was Black's downfall as well. And the Azkaban guards heard Black muttering in his sleep, \"He's at Hogwarts . . . he's at Hogwarts.\" Harry Potter isn't safe, not even within the walls of his magical school, surrounded by his friends. Because on top of it all, there may well be a traitor in their midst."}, {"id": "1542463858", "genre": "Children's Books", "title": "Passover Count Book Learning To Count 1-13 in Hebrew / English: Based on  Echad Mi Yodea (Who Know One?) Passover Song", "description": "Learning how to count 1-13 in Hebrew for children while getting familiarized with Passover festival main themes. Large images, numbers served in several ways for easy learning. 2 - Two - Shta-im + HEBREW text.  Book includes several practice pages!  Kids can remember the numbers in Hebrew better using the practice pages, exercising counting Jewish traditional Passover song of Echad Mi Yodea (Who knows one?). Great way for Jewish children to practice their Hebrew counting 1-13 while preparing for Passover Seder meal."}, {"id": "0340998849", "genre": "Children's Books", "title": "Wiggle, Jump, Stomp, Mr Croc", "description": "Can you wiggle like a worm, jump like a frog, and stomp like an elephant? If so, join Mr Croc in another fabulous interactive book that is perfect for the very young."}]