[{"id": "1787410242", "genre": "Children's Books", "title": "Hannah + Holly Touch and Trace: In the Garden", "description": "From the bottom of the pond, to the tallest tree tops, where will your finger take you when you trace the trail? Little ones will love exploring the garden with a die-cut trail that they can follow along. With endearing artwork by Hannah and Holly, this book is the ideal gift for toddlers with a sense of adventure!"}, {"id": "048647285X", "genre": "Children's Books", "title": "Day of the Dead/Dia de los Muertos Paper Dolls (Dover Paper Dolls)", "description": "Artfully and accurately rendered in the tradition of Mexico's Day of the Dead, this set of whimsical, vividly costumed skeleton figures honors the memory of the departed. The unique bilingual collection features two paper dolls, fifteen ornate costumes, a variety of altar offerings, and a bonus sticker poster. "}, {"id": "B00VW2MMK6", "genre": "Children's Books", "title": "Intrigue at the Rafter B Ranch (The Lewis and Clark Squad Book 1)", "description": "Cody, Feather, Jeremiah, and Larry have other reasons for calling their 3-on-3 summer basketball league team \"The Lewis and Clark Squad.\" But considering the crazy situations they get into, they might as well have named themselves after the famous adventurers from their history books. In their first adventure, mysterious weird objects keep appearing in an abandoned out-of-state pickup on a neighbor's property. Yet the kids never see anyone around it. It makes no sense until they find their first clue: a roll of film. There's only one way to solve the mystery. They decide to spend a night watching the truck. It's an event they'll never forget!"}, {"id": "B00J25QJ36", "genre": "Children's Books", "title": "Tarsier Man: Greeks and Freaks", "description": "Tarsier Man was listening to disco tunes in his cave when something interrupted his rave. He was grabbed by a huge hand and taken to a new land. There he was attacked by Zeus, who wanted to put a lightning bolt in his caboose. Tarsier Man fights back, avoiding their godly attack. He spies Duke Drazin trapped in a cage and crying. Tarsier Man frees him, but could Duke Drazin be lying? Find out in the eighth adventure of Tarsier Man as he fights Greek gods with more than a frying pan."}, {"id": "0142501417", "genre": "Children's Books", "title": "Dancing in the Wings", "description": "Sassy is a long-legged girl who always has something to say. She wants to be a ballerina more than anything, but she worries that her too-large feet, too-long legs, and even her big mouth will keep her from her dream. When a famous director comes to visit her class, Sassy does her best to get his attention with her high jumps and bright leotard. Her first attempts are definitely not appreciated, but with Sassy's persistence, she just might be able to win him over. Dancing in the Wings is loosely based on actress/choreographer Debbie Allen's own experiences as a young dancer."}]