[{"id": "B00Z7C1DCA", "genre": "Children's Books", "title": "The Crook and the Crown (Mermaid Tales Book 13)", "description": "Shelly Siren and her friends visit King Neptune’s royal castle and attend their first ball in this Mermaid Tales adventure.Shelly, Echo, Kiki, and Pearl are spending their school vacation at Neptune’s castle! Shelly’s aunt, Queen Edwina, has invited the girls to stay for a whole week, and while they’re there the girls can’t wait to visit the Royal Orca Museum, see the Palace Library, ride seahorses, and maybe even attend a royal ball. Shelly is nervous about meeting her royal family, especially since she’s never felt like a princess. But when she arrives at the castle, she is welcomed with curtsies, bows, and sea flowers. Queen Edwina even gives Shelly a sparkling tiara that she once wore as a young princess. Just as Shelly starts to relax and have fun, the tiara disappears and the girls have to find it before the queen finds out! The mergirls have a real mermystery on their fins! But will they be able to figure out who took the tiara before Shelly’s royal visit turns into a royal disaster?"}, {"id": "160142034X", "genre": "Children's Books", "title": "His Mighty Warrior: A Treasure Map from Your King", "description": "How do you captivate the heart of a boy?With words from a loving God about the courageous man of honor he will one day be. He dreams of imaginary castles, knights, and daring adventures–but he is already the child of a real King, and a part of a real kingdom! In a beautifully illustrated, two-way conversation between that King and his warrior-child, His Mighty Warrior offers the truth about what it really means to grow up strong, brave and true. From best selling author Sheri Rose Shepherd, here is a thoughtful gift for reading to–or with–that special boy in your life."}, {"id": "1633632598", "genre": "Children's Books", "title": "Fishing with Dad", "description": "Fishing with Dad by BobbiCat is the story of a boy who went fishing with his father and the fun day they had. The best memories are created with our loved ones.—Vibrant, color illustrations will captivate your young child.—Rhyming lines help engage your child and sustain interest.—Your child will love to read this story over and over with you.Your younger children will enjoy the illustrations and sing-song tone of the story while your older children will particularly like the poignant rhymes.This story will be enjoyed by children of all ages. "}, {"id": "1944328122", "genre": "Children's Books", "title": "Grammy Visits From Heaven", "description": "Grammy Visits From Heaven is an inspirational and uplifting story about a little girl Jamie and her grandmother who are BFF until they are suddenly separated when her Grammy unexpectedly dies. However, something astounding and wonderful happens after Jamie prays and asks God if her Grammy can come back and play with her again.  If a child is wondering where did the person go who has died, and if they can still see and hear them, Grammy Visits From Heaven will easily explain death, the spiritual body, heaven, God, and afterlife visits to a child in a comforting way and heartwarming way.  Grammy Visits From Heaven was inspired by over 100 true stories of afterlife visits  received by children from all belief systems. Their comforting stories are available for reading in Christine Duminiak’s book Heaven Talks To Children."}, {"id": "140031027X", "genre": "Children's Books", "title": "Go to Sleep, Sheep! (Bedtime Barn)", "description": "The silly sheep in Bedtime Barn don’t want to go to bed! Will they ever tire out?“I’m thirsty!” squeaks a little voice.“Please leave on a light!”“I’m still not tired!” one cries out.“Let’s have a tickle fight!” Go to sleep, sheep! If your little ones insist they aren’t sleepy, make bedtime more fun by curling up with this playful story. Once the silly sheep hit the hay, your sleepyheads will realize that bedtime isn’t so bad."}]