[{"id": "B00K6IS7SS", "genre": "Children's Books", "title": "The (True) Tall Tale of Pecos Bill: A Play for Young Audiences", "description": "In this play for young audiences, our intrepid narrator and the rascally jackalope try to set the record straight on the legend of Pecos Bill. From his childhood days being raised by coyotes to roping a tornado and taming Widowmaker to wooing Slew-Foot Sue. This play works for youth theatre and children's theater, has flexible casting from 6 to over 10, and runs for 40-45 minutes."}, {"id": "0995482039", "genre": "Children's Books", "title": "The Big History Timeline Posterbook: Unfold the History of the Universe―from the Big Bang to the Present Day!", "description": "JOURNEY THROUGH the incredible 13.7 billion-year story of the entire history of the world from the Big Bang to the present day on a laminated 10-foot timeline wallchart. Ever wondered what on earth was going on at the time of Henry VIII? Follow your curiosity and see what else was happening at the time: Martin Luther is protesting against the Pope, Columbus has navigated his way to the Americas, Copernicus is expounding his radical theory about the universe, and the Incas are inhabiting their summer palace called Machu Picchu! This giant edition is specially designed to be unfolded and stuck up on a wall and makes a spectacular display for any library, bedroom, classroom, or anywhere curious people dwell. What on Earth? Posterbooks are fully laminated for extra durability and are easy to mount on a wall. Created in association with the American Museum of Natural History."}, {"id": "1404813063", "genre": "Children's Books", "title": "Twist, Dig, and Drill: A Book About Screws (Amazing Science: Simple Machines)", "description": "Provides examples showing how screws are simple machines that make joining things together and moving, easier."}, {"id": "1492659711", "genre": "Children's Books", "title": "Tiny the Utah Easter Bunny", "description": "It's Easter morning in Utah,and Tiny is out for a jog,but he STOPS in his tracks and discoversthe Easter Bunny STUCK in a log!With the Easter Bunny trapped, it's up to Tiny to save Easter in Utah! But being a bunny isn't as easy as it looks, especially for an elephant. In this fun and playful story, find out how Tiny uses his own special talents to save Easter!"}, {"id": "B005R21T1A", "genre": "Children's Books", "title": "14 Fun Facts About Tasmanian Devils: A 15-Minute Book (15-Minute Books 7)", "description": "What is a Tasmanian devil’s favorite food?How much can a Tasmanian devil eat in 30 minutes?How big is a Tasmanian devil when it is born?What happens to a Tasmanian devil’s ears when it gets angry?Learn the answer to these questions and many more in this 15-Minute Book. Tasmanian devils are among the meanest, nastiest animals on earth. How much do you know about them?Ages 8 and up.This book is also included in the compilation \"101 Fun Facts About Mammals\".LearningIsland.com believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Open the world of reading to a child by having them read for 15 minutes a day."}]