[{"id": "1589254058", "genre": "Children's Books", "title": "Good Night, Sleep Tight!", "description": "While baby-sitting, Grandma tries several ways to get Archie to feel sleepy but nothing works until she remembers how she used to put his mother to bed when she was a little girl. Reprint."}, {"id": "1499880324", "genre": "Children's Books", "title": "Twinkle, Twinkle Little Star (A Big Button for Little Hands Sound Book)", "description": "Up above the world so high, something magical is shining in the sky! Children will love to press the big sound button and join in with this beautifully illustrated classic rhyme."}, {"id": "B076DPQCW9", "genre": "Children's Books", "title": "How to Make a Rainbow: A Crayola ® Color Story", "description": "Let's make a rainbow! The sky is our laboratory. We can use the colors all around us! Where can you find red, orange, yellow, green, blue, indigo, and violet?"}, {"id": "0920668372", "genre": "Children's Books", "title": "Love You Forever", "description": "A young woman holds her newborn sonAnd looks at him lovingly. Softly she sings to him: \"I'll love you forever I'll like you for always As long as I'm living My baby you'll be.\" So begins the story that has touched the hearts of millions worldwide. Since publication in l986, Love You Forever has sold more than 15 million copies in paperback and the regular hardcover edition (as well as hundreds of thousands of copies in Spanish and French)"}, {"id": "0763671304", "genre": "Children's Books", "title": "The Fairy Tale Handbook", "description": "Go on an adventure to meet all the legendary fairy-tale characters!Explore the amazing world of favorite fairy tales in this novelty-packed guide. Includes lift-the-flap maps, miniature books, insider information on famous characters like Cinderella and the Gingerbread Man, and a closer look at more troublesome folk, including the Big Bad Wolf! With a wealth of amazing detail to pore over, fairy-tale fans will love to explore this guide again and again."}]