[{"id": "0689838697", "genre": "Children's Books", "title": "Dogsong - 2000 Kids' Picks", "description": "In the Old Days There Were Songs  Something is bothering Russel Susskit. He hates waking up to the sound of his father's coughing, the smell of diesel oil, the noise of snow machines starting up.  Only Oogruk, the shaman who owns the last team of dogs in the village, understands Russel's longing for the old ways and the songs that celebrated them. But Oogruk cannot give Russel the answers he seeks; the old man can only prepare him for what he must do alone. Driven by a strange, powerful dream of a long-ago self and by a burning desire to find his own song, Russel takes Oogruk's dogs on an epic journey of self-discovery that will change his life forever."}, {"id": "0763689718", "genre": "Children's Books", "title": "Little Wolf's First Howling", "description": "Some may favor the proper way to howl, but what if you have a song in your heart that needs to come out? A delightful, disarmingly funny tale for little and big wolves everywhere.Little Wolf can hardly wait. Tonight he will howl at the moon to the top of the sky. First, Big Wolf demonstrates traditional howling form: AAAAAAAAAAOOOOOooooooooo. Then it's Little Wolf's turn. He's sure he is ready, but when the big moment comes, something happens. Something unexpected, something wild, something unbe-beep-bop-believable! Sisters Laura McGee Kvasnosky and Kate McGee have created a wonderful story about the importance of doing things your own way and being true to your heart when it swells with wildness and joy."}, {"id": "0375931775", "genre": "Children's Books", "title": "Thomas & Friends: Go, Train, Go! (Thomas & Friends) (Beginner Books(R))", "description": "Thomas is taking the judge to the train show! He speeds up a hill, across a ridge, through a tunnel, and over a bridge. But as soon as Thomas starts to go fast—screech!—he has to slow down. A goat is in the way, the wind is pushing him back, the tunnel is very dark, and logs are on the track! As soon as Thomas gets past each delay, he gets to go fast—at last! But will they reach the show on time? Go, Thomas, go!From the Hardcover edition."}, {"id": "B00K8O0IZ0", "genre": "Children's Books", "title": "The Cricket Beasts: The Fanatical Fanboys of the 22 Yards", "description": "‘Hey, are you bored with your dull and monotonous life? Do you waste all your spare time reading dull books like Shakespeare and Charles Dickens? Is your life too tame and domesticated? Do you want to inject some excitement and exuberance into it? Do you want to improve your lung power and be able to yell and shriek at hundred decibels for hours and hours? Do you want to get lots of friends of all ages, religions and races who think and act alike? Do you want to extract the maximum out of your gigantic high definition TV? Do you want to be at the edge of your living room couch shivering in nail biting suspense and anticipation? Do you…’  ‘Yes! Yes! Quick, tell me what I need to do.’‘Simple. Just become a real cricket fan and you will achieve all that I just said.’‘What? Don’t be silly! How will that help? I am already a cricket fan in case you didn’t know.’‘Hah! Are you? Don’t make me laugh! You are like a lamb, an insult to all real cricket fans.’‘Hey, what do you mean by insult to all fans?’‘Cool down! What I mean is you look and act too domesticated to be called a real cricket fan. You are still not that fire and brimstone material of cricket – The Ultimate Cricket Fan.’‘Ultimate cricket fan? Who is that?’‘An explosive beast that no one can tame.’"}, {"id": "1538325098", "genre": "Children's Books", "title": "Passwords Are Secret (Keep Yourself Safe on the Internet)", "description": "Online security is a crucial concept for young Internet users to understand. This manageable book teaches readers why it is important to keep your online passwords to yourself and provides tips on how to create secure passwords. Colorful photographs of young computer users will attract readers, while engaging text promotes safety on the web and encourages readers to be responsible Internet users. This essential resource for online safety is sure to be a popular addition to any library."}]