[{"id": "0762429771", "genre": "Science Fiction & Fantasy", "title": "Harry Potter Time Turner Sticker Kit (Miniature Editions)", "description": "Let your imagination spin back time to J.K. Rowling's wizarding world with the collectible Harry Potter Time Turner Sticker Kit! It includes:  Deluxe Time Turner featuring rotating inner rings and a functional hourglass, inspired by the Time Turner used by Hermione Granger in Harry Potter and the Prisoner of Azkaban Book featuring 8 full-color stickers of scenes from the film"}, {"id": "B01M2YI5D7", "genre": "Science Fiction & Fantasy", "title": "Beyond Ever Blue Skies: Can an unlikely romance survive getting to The Promised Land beyond the sky?", "description": "Morgan is a lecy-eng, one of an elite group that has responsibility for maintaining the vital systems of Rundkern. When a circuit in Agri-Prod is suspected of being responsible for a valuable crop’s sickening state, Morgan gets to discover more about the lowly agri-engs than he ever imagined.His tale becomes one of intrigue, love and an unexpected but frankly unbelievable discovery. But before Morgan knows it, he’s committed himself to agri-eng Stephanie and her own people’s long-held hopes about a place that seems to him little more than a pie-in-the-sky dream.Can there really be a “Promised Land”, and if so, will it ultimately snatch Stephanie from him? For the Promised Land is somewhere to which no lecy-eng can ever journey. But then, nor can Morgan be left behind alive in Rundkern knowing of its existence.A gripping SF story from a master storyteller, author of the SF/Fantasy novels “Solem” and the six volumes of the “Realm of Dica” series: all “Beautifully written books with deep, rich and unexpected tales told so engrossingly well”."}, {"id": "B016E2WIKC", "genre": "Science Fiction & Fantasy", "title": "Ships and Stings and Wedding Rings: A Chronicles of St. Mary's Short Story", "description": "It's Christmas again at St Mary's and time for Max's obligatory illegal jump. On this occasion, however, they're right up against it. A loaded gun has been left behind in Ancient Egypt, and it's up to them to retrieve it before anyone accidentally blows their own head off, thus affecting the timeline for centuries to come. And as if that's not enough, someone (Max) has inadvertently poisoned Mr Markham. It's hot, they're running out of supplies, they can't find the gun and it's all going horribly wrong. Again."}, {"id": "0786966203", "genre": "Science Fiction & Fantasy", "title": "D&D Tomb of Annihilation Dice", "description": "ROLL THEM BONES!  Traversing the jungles of Chult can be a harrowing experience, even without a 'death curse' hanging over your head. Don't go without a good set of dice at your side.INCLUDES: A beautiful full metal container embossed with the classic devil face that also appears prominently on the cover of the Tomb of Annihilation D&D adventure A full set of ten dice including: 1d20, 1d12, 2d10, 1d8, 4d6, 1d4The leader in providing contemporary fantasy entertainment, Dungeons & Dragons is the wellspring for the entire modern game industry, digital as well as analog. This newest edition draws from every prior edition to create a universally compelling play experience, and exemplifies the true spirit of a game that holds captive the hearts and minds of millions of players worldwide."}, {"id": "1509803114", "genre": "Science Fiction & Fantasy", "title": "The Never King", "description": "Xavir Argentum is rotting in gaol. Sentenced to life in the squalor of Hell’s Keep, punishment for an atrocity he didn’t commit, the once legendary commander is all but forgotten. His elite band of warriors are dead—and the kingdom he was poised to inherit is oppressed by the tyrant who framed him. For half a decade now, Xavir has ruled nothing but a prison gang. Yet vengeance comes to those who wait. When a former spymaster infiltrates the Keep, bearing news of his old enemy’s treachery, plans are forged. A few are compelled to restore peace—an exiled queen, an outcast witch, and an unlikely alliance of rogues and heroes. But peace and vengeance make poor companions. And first, Xavir must make his escape."}]