[{"id": "1494488833", "genre": "Science Fiction & Fantasy", "title": "1: Elias of Elderberry: Sons of Elderberry Series (Volume 1)", "description": "Elias Rey, a fifteen year old student at Penquis Valley High School, is skinny, has a chipped tooth, and a bad case of acne. His favorite pastime is drawing dragons, and his room is plastered with his renditions. Tested out as a genius, he should be in college instead of high school, but he chooses to be with the only family he has ever known, his foster sister Lizzie, and his best friend Jaron. Life is good, except for one thing - Brute, the meanest student at PVHS. Elias considers moving to be rid of Brute's constant bullying, until one fated day, when a strange boy pushes a leather pouch into his hands, and then mysteriously disappears, leaving Elias to wonder who he is. Shortly thereafter, Elias discovers that the pouch contains Ilesar, an ancient papyrus that can give him anything his heart desires. He isn't going to be pushed around. Ever. Again. At least, not by the school bully."}, {"id": "B073R6B99G", "genre": "Science Fiction & Fantasy", "title": "Garden of the Wolf #1: Werewolf Shifter Romance", "description": "Abby Lee and her friend Susie Baker leave their boring, stressful office jobs for two weeks of fun and relaxation at the Gardens, a mountain resort that advertises itself as the next Fountain of Youth. Sparks fly when Abby gets her first look at the handsome manager and owner of the Gardens and he insists the promise of youth is true, but doubts nag her and howls haunt her nights. She finds herself falling for the sexy manager, but what secrets does he hide behind those beautiful blue eyes?"}, {"id": "1101910402", "genre": "Science Fiction & Fantasy", "title": "Smoke: A Novel", "description": "Readers of The Night Circus by Erin Morgenstern and Arcadia by Iain Pears are sure to be mesmerized by Dan Vyleta’s thrilling blend of Dickensian historical fiction and fantasy, as three young friends scratch the surface of the grown-up world to discover startling wonders—and dangerous secrets.  In an alternate Victorian England those who are wicked are marked by the smoke that pours out of their bodies. The aristocracy are clean, proof of their virtue and right to rule, while the lower classes are drenched in sin and soot.  Thomas Argyle is the only son of a wayward aristocrat. Charlie Cooper is his best friend. When Thomas finds himself under the boot heel of a sadistic headboy in the treacherous halls of their elite boarding school, he and Charlie begin to question the rules of their society. Then the boys meet Livia, the daughter of a wealthy and powerful family. She leads them to a secret laboratory where they learn that smoke may not be as it seems, and together they set out to uncover the truth about their world."}, {"id": "0307388670", "genre": "Science Fiction & Fantasy", "title": "The Gargoyle", "description": "A New York Times BestsellerThe Gargoyle: the mesmerizing story of one man's descent into personal hell and his quest for salvation.On a dark road in the middle of the night, a car plunges into a ravine. The driver survives the crash, but his injuries confine him to a hospital burn unit. There the mysterious Marianne Engel, a sculptress of grotesques, enters his life. She insists they were lovers in medieval Germany, when he was a mercenary and she was a scribe in the monastery of Engelthal. As she spins the story of their past lives together, the man's disbelief falters; soon, even the impossible can no longer be dismissed."}, {"id": "076536509X", "genre": "Science Fiction & Fantasy", "title": "Wild Cards III: Jokers Wild", "description": "Now in development for TV: Rights to develop Wild Cards for TV have been acquired by Universal Cable Productions, the team that brought you The Magicians and Mr. Robot, with the co-editor ofWild Cards, Melinda Snodgrass as executive producer.On September 15, 1946, the Wild Card virus was released, spreading a wave of mutations around the globe. \"Aces\" were endowed with extraordinary powers, while \"Jokers\" were cursed with bizarre mental or physical disabilities. September 15th is now Wild Card Day. With each passing year, the festivities become larger and more fevered. And 1986--the fortieth anniversary--promises to be the biggest Wild Card Day ever. But in New York City not everyone is celebrating: The Astronomer, a twisted, powerful genius, has been planning his own special festivities for Wild Card Day...a day of revenge against those who have opposed him...."}]