[{"id": "0473416395", "genre": "Children's Books", "title": "Not another Zebra: Narra & Boccy Adventure", "description": "Narra and Boccy are best of friends and love taking photos of animals in their natural habitat. They enter a competition to take photos of the Big Five on safari (Lion, Buffalo, Elephant, Rhino and the Leopard) but something keeps photo-bombing their photos."}, {"id": "1599613069", "genre": "Children's Books", "title": "East of the Sun, West of the Moon (Rabbit Ears Set 4)", "description": "Hidden deep in the blue forest of Norway, there lived a peasant farmer and his family. In a fierce storm, a mysterious white bear arrives with a strange proposal to make them rich if their youngest daughter will go to live with him in his golden cavern. They agree, and for a time all goes well, but when the girl ignores the kindly bear's advice, she must travel to the castle that lies East of the Sun and West of the Moon to face the horrible Troll Queen. This touching Scandinavian tale will transport your family to the faraway land of the midnight sun."}, {"id": "1680487213", "genre": "Children's Books", "title": "What Are Community Rules and Laws? (Let's Find Out! Communities)", "description": "Laws are a part of every community and government. This thought-provoking volume provides an accessible guide to these rules for readers who havent been involved in civic engagement or arent aware of how the law functions. Readers will learn about both the history of laws and legislatures as well as modern civil and criminal laws. Interest-provoking sidebars enhance the text, adding to essential vocabulary as well as posing questions that promote critical thinking about the rules and laws of society. Meanwhile, carefully selected photographs serve to support reading comprehension and add to the appeal of the book design."}, {"id": "0060280905", "genre": "Children's Books", "title": "The Old Woman and Her Pig: An Appalachian Folktale", "description": "\"Goin' to town,gonna buy a little pig.Jig jog jig jogjiggety-jig!\"But when the old woman tries to take that little pig home to her little boy, the pig won't cross the bridge—this little piggy is afraid of the water! The old woman pushes and pulls, cries and cajoles, with no luck. Until she sees a dog, a rat, and a cat—can the old woman convince them to help her get the piggy back home?Acclaimed storyteller Margaret Read MacDonald and illustrator John Kanzler bring new life to this classic tale."}, {"id": "1941026605", "genre": "Children's Books", "title": "This Thing Called the Future", "description": "Kirkus Best Teen Books 2011ALA Best Fiction for Young Adults 2012\"[An] intimate glimpse into the challenges of being a contemporary teenage girl in South Africa.\"—Chicago Tribune\"[A] loving, clear-eyed look at the clash of old and new. . . . A compassionate and moving window on a harsh world.\"—Kirkus Reviews"}]