[{"id": "0756935849", "genre": "Children's Books", "title": "Wilma Rudolph: Olympic Runner (Childhood of Famous Americans (Paperback))", "description": "The inspiring story of American track-and-field athlete Wilma Rudolph, who overcame childhood polio to win three Olympic gold medals, is told. Illustrations."}, {"id": "0525464662", "genre": "Children's Books", "title": "Feathers, Flaps, & Flops: Fabulous Early Fliers", "description": "Highlights the people who attempted to defy gravity by using imagination, dedication, and daring, from \"Wrong Way Corrigan\" who was supposed to fly to California but ended up in Ireland and Beryl Markham, who was the first woman in Africa to receive a commercial pilot's license to Bessie Coleman, a notorious African-American stunt pilot."}, {"id": "0545935202", "genre": "Children's Books", "title": "Dog Man Unleashed: From the Creator of Captain Underpants (Dog Man #2)", "description": "Dog Man, the newest hero from the creator of Captain Underpants, is still learning a few tricks of the trade. Petey the cat is out of the bag, and his criminal curiosity is taking the city by storm. Something fishy is going on! Can Dog Man unleash justice on this ruffian in time to save the city, or will Petey get away with the purr-fect crime?"}, {"id": "1538421720", "genre": "Children's Books", "title": "Animal Tales from Many Lands: Traditional Tales (*read by celebrities)", "description": "[*Read by Harvey Fierstein, Melissa Manchester, Elliot Gould, Carol Channing, Terry Bradshaw]A collection of stories featuring animals includes works by such authors as Beatrix Potter, the Brothers Grimm, and Hans Christian Andersen."}, {"id": "1467745472", "genre": "Children's Books", "title": "Ross Lynch: Actor, Singer, Dancer, Superstar (Pop Culture Bios)", "description": "You may know that Ross Lynch rose to fame after starring in the hit Disney TV show Austin & Ally. But did you know that he: • had a close encounter with a shark while snorkeling? • acted in about twenty national commercials? • is the front man in the band R5, in which he plays with three of his siblings and his best friend? Want to know more about this talented star? Read on to learn all about Ross's life before stardom, breakthrough performances, passions, upcoming projects, and more!"}]