[{"id": "1548937371", "genre": "Children's Books", "title": "Jason Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "006027056X", "genre": "Children's Books", "title": "Archaeologists Dig for Clues (Let's Read-And-Find Out Science. Stage 2)", "description": "Decribes how scientists can learn about the past and how ancient peoples lived by excavating rocks and other clues"}, {"id": "0898001579", "genre": "Children's Books", "title": "Great Gift and the Wish-Fulfilling Gem (Jataka Tales)", "description": "Great Gift, a good-hearted child of India, seeks a wish-fulfilling gem to correct all the ills of the poor."}, {"id": "0061124958", "genre": "Children's Books", "title": "Charlotte's Web", "description": "This beloved book by E. B. White, author of Stuart Little and The Trumpet of the Swan, is a classic of children's literature that is \"just about perfect.\" This paper-over-board edition includes a foreword by two-time Newbery winning author Kate DiCamillo. Some Pig. Humble. Radiant. These are the words in Charlotte's Web, high up in Zuckerman's barn. Charlotte's spiderweb tells of her feelings for a little pig named Wilbur, who simply wants a friend. They also express the love of a girl named Fern, who saved Wilbur's life when he was born the runt of his litter.E. B. White's Newbery Honor Book is a tender novel of friendship, love, life, and death that will continue to be enjoyed by generations to come. It contains illustrations by Garth Williams, the acclaimed illustrator of E. B. White's Stuart Little and Laura Ingalls Wilder's Little House series, among many other books."}, {"id": "0763696730", "genre": "Children's Books", "title": "Sweep Up the Sun", "description": "Illuminated by exquisite photographs of eleven species of birds, a spareand elegantpoem inspires readers to open their wings and soar.Baby robins, open-beaked in their nest. Mallards winging to a new clime. Whether chickadees or cardinals, sparrows or starlings, here are commonly seen birds in their natural settings, captured in photographs of rare beauty and grace. In perfect synchrony, a lyrical narrative evokes images of play and flight, perseverance and trust.At the end, readers will find profiles of the featured species. This stunning book is an ideal gift for bird lovers of all ages, graduates, or anyone embarking on an adventure."}]