[{"id": "0863159133", "genre": "Children's Books", "title": "Hay for My Ox and Other Stories: A First Reading Book for Waldorf Schools", "description": "This classic early reading book for Waldorf schools is now available again in a newly edited edition. The stories and poems range in style and content from the fairy-tale elements of Class 1 (ages 6 to 7) to the legends and animal fables introduced in Class 2 (ages 7 to 8).  Rhythmical repetition of words, sounds, and phrases is used throughout the book but especially widely in the tales for younger children.  Includes: “The Prince Who Kept Pigs”; “The Tree of Three Cries”; “The Giant and the Child”; “The Fork Tail and the Rams”; and “The Monkey and the Pea.”"}, {"id": "B06XB7CSZ3", "genre": "Children's Books", "title": "Diary Of A Farting Noob 1: High School (Noob's Diary)", "description": "Noob's stomach causes a scene during his first day at Roblox High School. He gets a strange gassy outburst and pisses off none other than the psycho-murderer, Jason from Murder Mystery. Of course, Noob immediately knows that this means trouble... Take a peek at what is really going on in this Roblox Noob's life and how he overcomes trouble at school. Can Roblox Noob turn his fart into a deadly weapon or his butt will say otherwise?Ready to laugh your butt off?Get your Copy for FREE with Kindle Unlimited!"}, {"id": "B015W1878S", "genre": "Children's Books", "title": "Books for Kids: Princess Alice and The Witch: (Kids Books, Children's Books, Fantasy&Magic Stories, Bedtime Stories for Kids Ages 4-8, 9-12), Beginners and Early Readers", "description": "Alice is a very cute Princess who lives in a castle near the forest. She loves the adventure traveling. Do you think what about the Witch? Is she good or bad or mad? This fun and excited story is going to tell you what will happen. This is an excellent read for beginner readers until teens."}, {"id": "0552546666", "genre": "Children's Books", "title": "Baby Knows Best", "description": "Baby's got toys that rattle and squeak; books with rhymes and books that float; there's food to suck and slurp and crunch; she's got a cot and a car seat and a back pack and even a bouncer. She's got everything a baby could possibly need - but Baby has ideas of her own! Ages 0-5."}, {"id": "B005ENBBGK", "genre": "Children's Books", "title": "Heaven is for Real for Kids: A Little Boy's Astounding Story of His Trip to Heaven and Back", "description": "Heaven is for real, and you are going to like it! Colton Burpo came back from his trip to heaven with a very important message: Jesus really, really loves children. In an effort to reach even more families with this eternally significant story, this runaway bestseller is now told from Colton—kid to kids! Children will receive the same comfort and assurance that so many adults have received from the trade book. Beautifully illustrated under Colton's direction, he shares his experiences in first person and comments on things that will be important to kids. A letter to parents is included to guide them as they talk to their children about heaven. Scripture along with a Q&A section with answers from the Bible are also included in the book."}]