[{"id": "0060213493", "genre": "Children's Books", "title": "The Josefina Story Quilt (I Can Read Book 3)", "description": "Animated pictures capture the drama and warmth of this historically based, affectionate story of good and bad times on a nineteenth-century wagon-train journey. ‘Coerr packs strong emotions into the story, which is detailed and eventful enough to create vivid historical setting within the confines of a beginning-to-read format.\" —BL.   Children's Editors' Choices for 1986 (BL)Notable 1986 Children's Trade Books in Social Studies (NCSS/CBC)The USA Through Children's Books 1985 (ALA)"}, {"id": "0746023405", "genre": "Children's Books", "title": "Complete Book of Windows: With an Introduction to Windows 95 (Computer Guides)", "description": "Explains how to select and save a file, draw a picture with Paintbrush, organize the desktop, and print a document using Microsoft Windows 3.1, and suggests other activities"}, {"id": "0237511975", "genre": "Children's Books", "title": "1910s (Take Ten Years)", "description": "Part of the Take Ten Years series examining the dramatic events, important changes, and major figures in world history in ten-year periods. The book contains year-by-year accounts of world affairs, eye witness reports, developments in science and technology, style and fashion, and discoveries."}, {"id": "0761187162", "genre": "Children's Books", "title": "Train: A Journey Through the Pages Book", "description": "***A 2016 National Parenting Product Awards (NAPPA) winner You’ve never seen a book like this before! It’s the story of a train moving across the American landscape—but with an actual three-dimensional miniature train that loops up and down and across each spread, traveling along an interior track from front to back without ever leaving the pages. Move the red steam engine out of the depot and to the front of the book, where the sun is just coming up over a bay, and then take a journey across wide plains, up mountains and down hills, into a city at night with its beacons of light—and finally, back to the rail yard. The panoramic landscapes are filled with marvelous details that young children will delight in discovering, and the sweet, simple rhyming language pulls the story along and will be happily repeated when it’s time to start the journey all over again. All aboard!  "}, {"id": "144905482X", "genre": "Children's Books", "title": "It's Okay to Fall", "description": "To learn the basics of ice skating, pick up a copy of It's Okay to Fall. This uplifting story follows the first ice skating lesson of a young girl with her coach. After Kayla's first timid steps onto the ice, not only does she get to howl like a wolf and stomp on the ice but she learns that falling is the most important lesson of learning to skate. Written by a former competitive ice skater and coach, the technical aspects of the book give the story a duality -- that of a \"how to\" piece as well as a beautiful picture book. The reading level is intended for ages 3-8 but appeals to \"skaters\" of all ages."}]