[{"id": "0516295632", "genre": "Children's Books", "title": "Great Soccer : Team Offense (Sports Clinic)", "description": "Instructions and photographs show how to execute various moves in soccer, discussing game plans, footwork, what the different positions on the team do, and drills for practice."}, {"id": "0805065709", "genre": "Children's Books", "title": "Head, Body, Legs: A Story from Liberia", "description": "A magical retelling of a creation story from Liberia.\"Long ago, Head was all by himself. He had no legs, no arms, no body.He rolled everywhere.\"Head is all alone. Body bounces along, Arms swing about, and Legs stand around. They can't do much by themselves, so they try to join together. But how? Should Head attach to the belly button? Should Legs stand on Arms? If only they can work together, everything will be perfect.This vibrant, joyous retelling of a traditional Liberian creation story shows how much can be accomplished with a little cooperation."}, {"id": "0807553077", "genre": "Children's Books", "title": "Muslim Child: Understanding Islam Through Stories and Poems", "description": "This insightful collection of stories and poems is a child-centered introduction to Islam. In one story, a boy feels guilty when he short-changes his prayer. In another story, a girl buys candy she can't eat because it contains pork by-products."}, {"id": "1554536960", "genre": "Children's Books", "title": "Look at That Building: A First Book of Structures", "description": "Learning about buildings and how they are constructed has never been so much fun. This gem of a book introduces young readers to basic construction concepts through the eyes of five friends keen on building a doghouse for their pet pooch, Max. To find out more about the task, Yulee, Martin, Nick, Sally and Pedro head to the library, where they learn about foundations, beams, frames and other building fundamentals. Fun facts, bright illustrations and comic-book-style discussions among the characters add to the mix. An activity at the end of the book invites readers to make their own mini doghouse out of marshmallows, paper, glue and craft sticks."}, {"id": "0802853641", "genre": "Children's Books", "title": "The Fantastic Jungles of Henri Rousseau", "description": "Henri Rousseau wanted to be an artist. But he had no formal training. Instead, he taught himself to paint. He painted until the jungles and animals and distant lands in his head came alive on the space of his canvases. Henri Rousseau endured the harsh critics of his day and created the brilliant paintings that now hang in museums around the world. Michelle Markel's vivid text, complemented by the vibrant illustrations of Amanda Hall, artfully introduces young readers to the beloved painter and encourages all readers to persevere despite all odds.Watch the trailer: "}]