[{"id": "076366748X", "genre": "Children's Books", "title": "A New Year's Reunion: A Chinese Story", "description": "\"Celebrations and traditions might differ, but the story of missing distant family is universal.\" — School Library Journal (starred review)This poignant, vibrantly illustrated tale, which won the prestigious Feng Zikai Chinese Children's Picture Book Award in 2009, is sure to resonate with every child who misses relatives when they are away — and shows how a family's love is strong enough to endure over time and distance."}, {"id": "1623239656", "genre": "Children's Books", "title": "Cranes (Big Machines at Work)", "description": "From hoisting construction materials to swinging wrecking balls, cranes are very important. Get the basics on these cool machines in this interesting book."}, {"id": "0766085678", "genre": "Children's Books", "title": "Limiting Federal Powers: The Tenth Amendment (Bill of Rights)", "description": "The Tenth Amendment says that the powers not delegated to the federal government by the Constitution belong to the individual states and their residents and can not be taken away from them. Like the Ninth Amendment, the Tenth Amendments wording is vague and abstract and often debated, especially when applied to such important contemporary issues as the drinking age, gun ownership, health care, environmental standards, and controlled substances. Through full-color and black-and-white photos, engaging text, and primary sources, students will learn why this amendment was created, how notions of states' versus federal rights have changed throughout history, and how this ongoing conflict between state and federal government affects their lives."}, {"id": "0756605652", "genre": "Children's Books", "title": "Ultimate Sticker Book: Dangerous Dinosaurs (Ultimate Sticker Books)", "description": "DK presents exciting new covers for 13 of your favorite Ultimate Sticker Books: Animal, Baby Animal, Ballet, Bug, Bulldozer, Dangerous Dinosaurs, Dinosaur, Ancient Egypt, Farm, Pony, Shark and Whale, Space, and Truck. Annotated with factual information, each book contains more than 60 full-color, reusable stickers so children can create their own fun scenes."}, {"id": "0152002235", "genre": "Children's Books", "title": "Mouse Count", "description": "In this charming companion to Mouse Paint, Ellen Stoll Walsh introduces the concept of counting forward and backward in a suspenseful story that will keep young readers guessing. “The rhythm follows the illustrations in a glissando; one can almost hear the background music.”--The Horn Book"}]