[{"id": "1614794936", "genre": "Children's Books", "title": "Ghostbusters 3: Haunted America", "description": "Shipped to Detroit, Michigan, by Walter Peck, the Ghostbusters deal with Major General Anthony Wayne, the ghost of a Civil War soldier."}, {"id": "1590361628", "genre": "Children's Books", "title": "Mauna Loa: The Largest Volcano in the United States (Natural Wonders of the U.s.a.)", "description": "Provides information on the environment, plants and animals, and native people of Mauna Loa."}, {"id": "0786955023", "genre": "Children's Books", "title": "Nocturne", "description": "A romantic tale of vampires and magic from award-winning author L.D. HarkraderFlanders Lane is tired of being protected by her Uncle Anatole. After years of studying magic in the back of his bookshop, she's ready for an adventure of her own. Then one day, strange things start happening. A burglar breaks into the butcher's shop, stealing nothing, but leaving the floors sparkling clean. Soon the seamstress's apprentice vanishes on her way home, leaving behind only a shoe still laced at the top. And then worst of all, Uncle Anatole disappears. That night, a young vampire hunter named Pascoe knocks urgently on the bookshop door. Pascoe insists there is a vampire lurking in nearby Blakely Hall. Flanders looks deep into Pascoe's gorgeous eyes and finds herself agreeing to help him. As Flanders tracks the vampire, her feelings for Pascoe grow until she stumbles upon a secret that turns everything she thought she knew about Pascoe--and herself--upside down."}, {"id": "B004LP2GRU", "genre": "Children's Books", "title": "Clever Little Mouse (A Children's Picture eBook)", "description": "If your child loves books by Mo Willems, Laura Numeroff, Felicia Bond, P.D. Eastman, and Sandra Boynton, your child will fall in love with Clever Little Mouse, the bestselling children's picture book by Paul Ramage.***CLEVER LITTLE MOUSE 2: The Chocolate Chip Cookie Adventure is now also available!***Using bright, playful illustrations, Clever Little Mouse tells the story of a fun-loving mouse. This picture book is perfect for children in preschool who are just learning to read, as well as early elementary school kids who are mastering new vocabulary. The adorable and funny story encourages reading, drawing, and critical thinking skills.Age Range: Infant to Preschool to Early Elementary Readers (6 months - 7 years old)***Note: Newly formatted for Kindle Fire and Kindle Fire HD!***More picture ebooks by Paul Ramage:CLEVER LITTLE MOUSE 2: The Chocolate Chip Cookie AdventureTHE SUNSHINE PRINCESS AND THE STINKY DOGTHE SUNSHINE PRINCESS AND THE STINKY DOG GO TO TOWN"}, {"id": "1338159151", "genre": "Children's Books", "title": "The Chocolate Chase (Geronimo Stilton #67)", "description": "It was spring in New Mouse City! I love to celebrate the season with my fellow mice by exchanging chocolate eggs and competing in a confectionary challenge. This year, there was also a special exhibition of priceless jeweled Mousebergé eggs in town. Then one of the Mousebergé eggs was stolen... and it was up to me to find it! Squeak! Could I chase it down?"}]