[{"id": "1911287087", "genre": "Children's Books", "title": "The Official Liverpool Annual 2017", "description": "The Official Liverpool Annual 2017 is jam-packed with everything you need to know about the Reds. From player profiles and an in-depth review of the past season. There's also a vast array of stats and facts, plenty of puzzles to test your knowledge and much more. It really is a must-have book for all young Liverpudlians."}, {"id": "1617724408", "genre": "Children's Books", "title": "Kevin Durant (Basketball Heroes Making a Difference)", "description": "Kevin Durant is one of the NBA's brightest young stars. In 2010, when he was just 21 years old, he became the youngest player ever to win the NBA scoring title, and in 2011 he led the Oklahoma City Thunder to the Western Conference finals. Even though Kevin has experienced incredible success at a very young age, he has never lost sight of the importance of giving back to his community and helping others. That's why he spends his time making a difference in people's lives whenever he can. In Kevin Durant, readers will follow this NBA superstar's amazing basketball career and discover how he has made a difference in people's lives both on and off the court. Large, full-color action photos and engaging text will keep readers turning the pages for more."}, {"id": "1432776142", "genre": "Children's Books", "title": "The Choice That Changed Her Life", "description": "One choice can change everything.  Sadie Walker, vibrant, beautiful and well-loved Southside High School's Homecoming Queen has found true love in MVP basketball player Brian Dickens.  The fact that that she's white and he's black makes them no difference-if only it were that simple for those closest to them.  When Sadie receives the unexpected news that she's pregnant, their love is tested to the breaking point and she's forced to make the hardest decision any woman could ever make. Just when she thinks she has it all figured out, she stumbles upon a secret Brian never intended for her to uncover. Betrayed and confused, she makes a tragic and deadly choice she'll live to regret forever, leaving the picturesque town of Spring Beach in shock. Will Sadie finally find peace and healing from her mistakes or will it all end with The Choice That Changed Her Life?"}, {"id": "B00H3V7GMY", "genre": "Children's Books", "title": "It's Cool to Learn About Countries: Democratic Republic of Congo (Explorer Library: Social Studies Explorer)", "description": "Learn about the history, culture, and geography of the Democratic Republic of the Congo."}, {"id": "1481448870", "genre": "Children's Books", "title": "Attack of the 50-Foot Fluffy", "description": "From the author and illustrator of A Tiger’s Tale comes a fun and silly picture book about one larger-than-life—and quite plush—tantrum.Claire and Fluffy are best friends. When Claire is happy, Fluffy is happy. When Claire is sad, Fluffy is too. When Claire is mad? Well, we don’t want to go there with Fluffy… But as the day progresses, everything that can go wrong, DOES. Claire has tried to keep it all together. But now, her anger has got the best of her! And Fluffy is unleashed. Join Mike Boldt on a humorous, larger-than-life story of one of the tenets of being a kid: the TANTRUM."}]