[{"id": "1548938963", "genre": "Children's Books", "title": "Zachary Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "B007F7QXDY", "genre": "Children's Books", "title": "Torn (The Missing, Book 4)", "description": "Still reeling from their experiences in Roanoke in 1600, Jonah and Katherine arrive in 1611 only moments before a mutiny on Henry Hudson’s ship in the icy waters of James Bay. But things are messed up: They’ve lost the real John Hudson, and they find what seems to be the fabled Northwest Passage—even though they are pretty sure that route doesn’t actually exist. Will this new version of history replace everything they’ve ever known? Is this the end of time as we know it? With more at stake than ever before, Jonah and Katherine struggle to unravel the mysteries of 1611 and the Hudson Passage...before everything they know is lost."}, {"id": "0615718310", "genre": "Children's Books", "title": "The Adventures of Papa Roo and Little Roo: The Deep Blue Forest", "description": "Jump, dance and sing with Papa Roo and Little Roo in their first adventure to protect the environment! In the Deep Blue Forest, a hundred years of rain has made the trees so sad that they have forgotten their true color and turned blue. It is up to Papa Roo and Little Roo to help the trees become happy again and return to their true color! Filled with the love a father has for his child, lessons in problem solving, sharing emotions and the joy that comes from helping others and caring for the environment, The Deep Blue Forest is the first of many adventures for Papa Roo and Little Roo. Hop in the Roo mobile, put on your Roo hat and glasses and come along on a journey to make the world a happier place!"}, {"id": "B06XPVPDMS", "genre": "Children's Books", "title": "65 Development-Promoting and Fun Activities for 12-18 Month Olds (Kids activities)", "description": "I am a mother to an 18-month-old toddler. I researched a lot of activities for my child that would help her develop and that would also be fun. I combined activities that I found in different resources into one bundle, added some of our own activities and I'm sharing these activities with other moms that don't have time to do extensive research. All the activities in the book have been tested on our toddler, and I only included those that she liked. The target group for these activities is 12 to 18-month-old toddlers, but I think 18 to 24 month olds would enjoy them as well. All kids are different though, and if your child is not interested in some activities, try them again later. Kids develop and change their interests so fast! "}, {"id": "B00F4N6QAQ", "genre": "Children's Books", "title": "Star Discovers The White House", "description": "A perfect introduction for early readers to many fascinating facts about the President of the United States and the Executive Branch of the government. Beautifully illustrated, this book follows a young girl into the White House to learn what a President does and many of the interesting and unusual facts about presidents past and present."}]