[{"id": "B077SNNV54", "genre": "Science Fiction & Fantasy", "title": "Ascension (Facets of Feyrie Book 2)", "description": "Ever get a job that sucks? My name is Iza Black and my life IS the sucky job.I mean yeah, there are perks. Live-in maid service, free food and I get this purple, sparkly aura thing. But there are way more bad parts.So many people, so much pain. Sleep has divorced me completely and I'm living their nightmares now too.I'm not sure I'm strong enough for this, that I can do what needs to be done. But I have to. Because it's my job...because someone needs to. These people need violence to meet violence. Hugs don't always fix things in our world.Then there's Phobe. Frustrating, Phobe-the-jerk.How does he fit into this, you may ask? Keep reading and you'll find out.Please be advised: **This book contains violence and other content which may be triggering to readers.**"}, {"id": "0008239061", "genre": "Science Fiction & Fantasy", "title": "The Seven (The Vagrant Trilogy)", "description": "‘An exciting new writer – sharp, compelling and original’ Mark LawrenceYears have passed since the Vagrant journeyed to the Shining City, Vesper in arm and Gamma’s sword in hand.Since then the world has changed. Vesper, following the footsteps of her father, journeyed to the breach and closed the tear between worlds, protecting the last of humanity, but also trapping the infernal horde and all those that fell to its corruptions: willing or otherwise.In this new age it is Vesper who leads the charge towards unity and peace, with seemingly nothing standing between the world and a bright new future.That is until eyes open.And The Seven awaken."}, {"id": "0786951079", "genre": "Science Fiction & Fantasy", "title": "The Spine of the World: The Legend of Drizzt, Book XII", "description": "Join the world's most famous drow elf in the penultimate chapter of the Legend of Drizzt series!Spending time in the unimaginable torture chambers of the Abyss for even a day would be enough to break even the heartiest soul, and the barbarian Wulfgar was there for years. When he returns, his friends find him a changed man, and not changed for the better. But Wulfgar's road to redemption is one he must travel on his own, even if it leads to the bottle."}, {"id": "B00UI3XKJ2", "genre": "Science Fiction & Fantasy", "title": "Alpha Rescue (BBW Paranormal Shape Shifter Pregnancy Romance)", "description": "\"Wolves only ever choose their mate once you know,” he said, his voice low as his breath brushed my ear... Mindy knows that heading into the wilderness on a camping trip won't erase the memory of her fiance leaving her for her best friend, but maybe the hike will help heal her heart. What she doesn't expect to find in the little town of Sweet Valley is Jasper Louis, the owner of the outdoors shop where she stops in for supplies. He's handsome, strong, and everything her ex was not... and Mindy finds herself mesmerized by the golden flash of his eyes.Jasper can't understand why anyone would want to hurt Mindy. With her cute little dimple and luscious curves, he knows that she's the mate for him. But when she's threatened by three men who take her for easy prey, he knows that he's going to have to show her that he's more than human. Will Mindy open up her heart and let him claim her for his mate? Or will it be too much for a woman who's already had her heart broken once? "}, {"id": "1250037751", "genre": "Science Fiction & Fantasy", "title": "Mr. Penumbra's 24-Hour Bookstore: A Novel", "description": "The New York Times BestsellerA Winner of the Alex Award, a finalist for the Los Angeles Times Book Prize for First Fiction, named a Best Book of the Year by NPR, Los Angeles Times, and San Francisco ChronicleThe Great Recession has shuffled Clay Jannon away from life as a San Francisco web-design drone and into the aisles of Mr. Penumbra's 24-Hour Bookstore. But after a few days on the job, Clay discovers that the store is more curious than either its name or its gnomic owner might suggest. The customers are few, and they never seem to buy anything―instead, they \"check out\" large, obscure volumes from strange corners of the store. Suspicious, Clay engineers an analysis of the clientele's behavior, seeking help from his variously talented friends. But when they bring their findings to Mr. Penumbra, they discover the bookstore's secrets extend far beyond its walls. Rendered with irresistible brio and dazzling intelligence, Robin Sloan's Mr. Penumbra's 24-Hour Bookstore is exactly what it sounds like: an establishment you have to enter and will never want to leave."}]