[{"id": "1426307772", "genre": "Children's Books", "title": "National Geographic Readers: Trains", "description": "Choo Choo! Kids love trains! Especially the old-timey steam engines found in amusement parks and zoos. But what about a super-speeder in Japan that zooms on the track at 361 miles per hour? Or the world's longest freight train, stretching on for a whopping 4.6 miles? Or futuristic railways in the sky? In this level 1 reader, young readers will discover a whole new way of looking at trains!National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "0749737379", "genre": "Children's Books", "title": "All About Michael Owen: Your Unofficial Guide to England's Hottest Footballer!", "description": "At only 18 years old, Michael Owen has made the most astonishing professional debut of any young player since Ronaldo. This guide to Michael's rise to fame covers his childhood and family, his Liverpool debut, striking skills and his performance in the 1998 World Cup."}, {"id": "0985793902", "genre": "Children's Books", "title": "If You Love Me So Much: Part of the Award-Winning Under The Tree Series (revised)", "description": "Honored for Excellence by the Mom's Choice Awards, First Place Winner from the Royal Dragonfly Awards for best children's book for Six and Under, First Place Winner for Best Children's Book for Growing Pains from Purple Dragonfly Awards, and Sliver Award Winner for Best Children's Concept book from Reader's Favorite. Why can parents make their children brush their teeth, comb their hair, take a bath, go to school, share their toys, do homework-and then call it love? A boy tries to figure this out in \"If You Love Me So Much. This lyrical and relatable tale is about a boy who believes his parents couldn't possibly love him. If they did love him, they wouldn't make him do so many things he does not want to do! Find out in a colorful way, how the boy learns he is loved by his parents after all.This is a revised edition."}, {"id": "1772031976", "genre": "Children's Books", "title": "Birding for Kids: A Guide to Finding, Identifying, and Photographing Birds in Your Area", "description": "Birding for Kids encourages children to get up close and personal with nature while respecting the habitats of birds in the wild. This book teaches children to identify birds in backyards, city parks and rural areas; take pictures of birds and record information in a logbook; support endangered or at-risk species; help hurt birds or abandoned nests and much more. This informative guide also includes a list of species, a glossary of birding terms, and all the basic equipment needed to become an avid birder."}, {"id": "1474845975", "genre": "Children's Books", "title": "Mommy and Me", "description": "Wiggle the cute elephant puppet and enjoy a beautiful story with Mommy! Little Learners Mommy and Me is an adorable board book featuring a fun finger puppet elephant built into the story, encouraging interactive play, hand-eye coordination and language development in your little one."}]