[{"id": "B01MAW4MRP", "genre": "Children's Books", "title": "Musical Tot Picture Book: Early Learning Vocabulary Development (Modern Baby Fundamentals Series Book 5)", "description": "The Modern Baby Fundamentals Series is a series of picture books for children ages 1-7 years-old.  The books are a great object recognition learning resource for parents focusing on advancing vocabulary development for their child.Visit www.Tattle-Tell-Me-All.com"}, {"id": "B00BRSZFOK", "genre": "Children's Books", "title": "Amazing Trains: a picture book of trains", "description": "Borrow for FREE with Amazon Prime! 50 Full Color ImagesIs your child fascinated with trains and other big trucks and machines?  If so than this is the perfect book for you.  With 50! full color pictures of trains and other locomotives this is a fun book for children and adults who are lovers of trains to set back and enjoy.  This book includes interior photos of trains including cabins, dining cars, and more.  Photos also include images of some of the worlds most popular tracks like the Orient Express and Transiberian Railway.  Incredible pictures bring trains to live for the enthusiast. Many children love all kinds of transportation including; trucks, machines, tractors, trains, cars, and any other fast moving, loud mode of transportation.  This book takes some of the best photographs of trains and puts them in a beautiful Kindle ebook format for kids and adults alike.  Maybe your children love to ride the subway or the monorail at theme parks.  If they look each time a coal train or a bullet train passes they will enjoy viewing the pictures in here. Downloading this book will give you and your child fun pictures of trains to enjoy at any time."}, {"id": "0756519527", "genre": "Children's Books", "title": "The Aztecs (Ancient Civilizations series)", "description": "This book introduces the reader to the fascinating world of the Aztecs. This book looks at how the Aztecs ruled their empire and prayed to their gods. It also explores the many aspects of daily life, from food and farming to Aztec arts and crafts. Did you know? The Aztecs worshipped hundreds of gods and goddesses. The clothing the Aztecs wore represented their status in society. The Aztecs played a sport called ulama, a mix of basketball, volleyball, and soccer. The Ancient Civilizations series tells the stories of the greatest cultures in human history and explains the lives of ancient people with amazing facts and stories."}, {"id": "1338117564", "genre": "Children's Books", "title": "Tenney in the Key of Friendship (American Girl: Tenney Grant, Book 2)", "description": "Tenney Grant is a star on the rise. She knows that building a music career takes time and dedication. So does being a good friend. In this second story about the aspiring singer-songwriter, Tenney and her best friend, Jaya, learn that a storm has ravaged the Bengali town where Jaya's cousin lives, and they spring into action to raise money to rebuild her school. Meanwhile, Tenney begins rehearsing with a talented-and stubborn--young drummer named Logan. When their manager books the duo to play at Nashville's City Music Festival, it's a dream come true for Tenney--until she finds out that the performance is on the same day as Jaya's fund-raiser. It feels as if music is tearing these two friends apart. Unless, Tenney realizes, there's a way music can bring them back together . . ."}, {"id": "B01JM2TLBK", "genre": "Children's Books", "title": "The Moorehead Manor Series (2 Book Series)", "description": "From Book 1: A young adult horror series at its best! Three teenagers stumble into a haunted mansion that traps them in a deadly nightmare. In order to escape alive, they must uncover the house's dark secrets of murder and prejudice. *** and, just arrived, the sequel to Moorehead Manor - In the House of the Vodouisant"}]