[{"id": "076131749X", "genre": "Children's Books", "title": "Latino Baseball's Finest Fielders/Los Mas Destacados Guantes Del Beisbol Latino", "description": "A history of Latino baseball players in the United States, along with individual biographies of current star players, concentrating on fielders."}, {"id": "1512413690", "genre": "Children's Books", "title": "Serena Williams (Amazing Athletes)", "description": "Describes Serena Williams's life and career accomplishments, including her childhood with sister Venus in Compton, California, and her numerous U.S. Open and Wimbledon victories."}, {"id": "0635076497", "genre": "Children's Books", "title": "Civil War Trivia", "description": "Civil War Trivia includes facts, tall tales, fascinating folklore, stories, songs, journals and more! This book provides an accurate, fast-paced, fascinating (even flabbergasting!) look at how facts can tell a story of not just war, but human nature, invention, coincidence, the farfetched, the big, the small, the impossible, the \"who'd a thunk it?!\" Yet another creative Gallopade way to tell the story that needs to be told, but with a constant flow of clever \"hooks\" and \"gotchas\" that keep kids reading and caring. This book will help students gain perspective, appreciation, and the understanding of how wars happen and how they might be avoided. This timely book will help to educate kids about the civil war plus get them excited so that they read them and learn! Perfect for the upcoming 150th Anniversary of the Civil War from 2011 to 2015. Click HERE to view four sample pages. Click HERE to view a book review.Lexile Measure: 1100"}, {"id": "B01EE4IVIA", "genre": "Children's Books", "title": "Farmer Kobi's Hanukkah Match", "description": "Come join Farmer Kobi and his animals for a hilarious Hanukkah dinner. Kobi's well-mannered goats, donkey, and sheep know just how to play host, and they give Polly, Kobi's Hanukkah guest, a gracious welcome. But when Polly isn't sure animals belong in a house, what will happen next? Find out with laugh-out-loud pictures and puns that are sure to entertain all readers. As donkey says: Hee-Haw-Yahoo!"}, {"id": "0316779288", "genre": "Children's Books", "title": "Passover Magic", "description": "Passover is always a magical time, but this Passover is extra-special since Molly’s uncle Harry brings his latest magic tricks and new bride, Aunt Eda. When Uncle Harry hides the afikoman, Molly and her siblings must think carefully about the importance of Passover while they search for it. Will they discover the whereabouts of the matzoh and win the prize for finding it?"}]