[{"id": "0766013960", "genre": "Children's Books", "title": "Pizarro and the Conquest of the Incan Empire in World History", "description": "Traces the history of the Spanish conquest of the Incas in Peru, showing how they explored and then took over native cultures, creating Spanish colonies in the New World."}, {"id": "1592982670", "genre": "Children's Books", "title": "The Tale of the Scorpion and the Caterpillar", "description": "A scorpion named Daev, who is the ruler's son, and a caterpillar named Gili, who is a princess, set out to investigate the strange metal monster chewing up the earth, only to be tossed into an unforgettable adventure. Will they manage to escape?They will soon learn valuable life lessons as they journey through the treacherous desert. This wise and enchanting fable unfolds the secret of love, acceptance, and transformation, and the importance of living each moment in our lives like it was our last. This story will capture the hearts of readers of all ages."}, {"id": "0060522089", "genre": "Children's Books", "title": "I, Jack", "description": "Hi! Hi there!I am Jack! Big dog Jack. WAG TAIL. I live with a big Pack. This is my Packleader. I love him HUGE amounts! More than steak, even. YUMYUM. My Packleader has a Pack Lady and three children. I love them BIG amounts, too. And this is Petra; she lives next door. Isn't she Gorgeous? This is my story. It's SO EXCITING! Find out how I become friends with Petra, brave the FIERCE garage dog, and save Packleader from Huge Scary Metal Monsters. ARROOOF ARROOOF!"}, {"id": "0375806237", "genre": "Children's Books", "title": "Me and My Amazing Body", "description": "Now in paperback! A super-simple introduction to the human body from the author and illustrator of Me on the Map.What is under your skin? Why do you have bones? What do your muscles do? Where does the food that you eat go?Me and My Amazing Body can show you! From your head to your toes and everything in between, this playful introduction to anatomy explains all the important parts of your body. Easy to read and easy to understand, Me and My Amazing Body helps children appreciate everything their amazing bodies can do."}, {"id": "B077GT6GPB", "genre": "Children's Books", "title": "Earthcore: Initiation", "description": "In this fast-paced introduction to the Earthcore series, you'll get to meet a unique gang of New Zealand superheroes as they come face to face with the most powerful creature they've ever encountered - and it has a gift for them."}]