[{"id": "B00HNXBPN8", "genre": "Children's Books", "title": "#2 Ninjas and Knock Outs! (Tao, the Little Samurai)", "description": "Tao dreams of becoming a martial arts master, but his wandering mind always gets him into trouble. Especially when he starts having lovey-dovey thoughts about his friend Kat! Tao starts pulling bigger, sillier pranks. Will Kat notice him? Well, his angry teachers might!"}, {"id": "0375842799", "genre": "Children's Books", "title": "The Ear Book (Bright & Early Board Books(TM))", "description": "Illus. in full color. A boy and his dog listen to the world around them. \"Illustrations are big and simple; the text is in verse form.\"--School Library Journal.  From the Hardcover edition."}, {"id": "1565070623", "genre": "Children's Books", "title": "Awesome Good Clean Jokes for Kids", "description": "Bob Phillips’ original GOOD CLEAN JOKES FOR KIDS was such a hit that the master jokester has scoured the earth (well, not quite) for even more crazy riddles, puns, knock-knocks, wisecracks, and tongue twisters. Enjoy them alone or try them out on unsuspecting friends, parents, and youth leaders:Q. What do you call a ship that lies on the bottom of the ocean and shakes?A. A nervous wreck.Q. What is an astronaut’s favorite meal?A. LaunchKnock, knock.Who’s there?Diesel.Diesel who?Diesel all make you laugh if you aren’t very bright.Totally awesome fun! For kids of all ages."}, {"id": "B075CVBK7B", "genre": "Children's Books", "title": "Over 100 Amazing Riddles And Jokes For Families: Buy It Now (The Winker Mouse Series)", "description": "Have you been searching everywhere for a perfect riddle and joke book you could happily enjoy with your family? Well wait no more for you have shot the target! \"100 Amazing Riddles and Jokes For Families\" has found you! Or have you found it? Well, what are you waiting for?! Enjoy this master piece Evan and Camden Chen have brought to this world on your couch with your family!!!!!!! =)"}, {"id": "1786239663", "genre": "Children's Books", "title": "Witchy Travel Tales 1: The Seven Sisters", "description": "The series “Witchy Travel Tales” tells the story of a witch called Miranda who has seven beautiful daughters. Miranda and her daughters cross seven seas in search of a better home. One stormy night they land on the Seven Sisters Cliffs, south of England. This book is the first in a series of books that tells the travel tales of the witch and her seven daughters, who explore the beautiful land they have arrived in and visit ancient sites throughout England and the World in search of magic. "}]