[{"id": "1547088389", "genre": "Children's Books", "title": "Happy 6th Birthday: Birthday Books For Children, Birthday Journal Notebook For 6 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B00DB4SYV4", "genre": "Children's Books", "title": "101 Amazing Book Title Jokes", "description": "This pant-wettingly funny collection of 101 of the best book titles (and their authors) that you have ever heard is dangerously amusing! Jack Goldstein loads his hilarity rifle and aims its laser sight right at your funnybone. Organised into categories so you have a hilarious book title for every occasion, this is an ideal addition to any budding comedian’s bookshelf. Have you ever read Explosives in Chemistry by Stan Wellback, or French Overpopulation by Francis Crowded? You’ll want to after this!"}, {"id": "B00R1FPRTG", "genre": "Children's Books", "title": "The Dragon's Mountain, Book One: Attacked by the Griefers (An Unofficial Minecraft Book for Kids Age 9-12)", "description": "GENRE: Children’s AdventureBook One: Attacked by the Griefers Mike, is living a peaceful life on his newly built farm, after defeating the evil Herobrine and saving the world of Minecraft from falling under his dark reign.But Mike’s peaceful existence is shaken up by two of his friends that up until that moment, he thought he had lost. Jerry, Mike’s best friend and his former enemy, turned ally, Micah, bring Mike news of a far away mountain that holds an unimaginable treasure.It doesn’t take long until Mike is convinced to embark on an adventure alongside his two buddies.What awaits our three young Minecraft questers in their new journey? Find out in “The Dragon’s Mountain, Book One: Attacked by the Griefers.Author's Note: This short story is for your reading pleasure. The characters in this \"Minecraft Adventure Series\" such as Steve, Endermen or Herobrine...etc are based on the Minecraft Game coming from Minecraft ®/TM & © 2009-2013 Mojang / Notch"}, {"id": "0385737491", "genre": "Children's Books", "title": "China: Land of Dragons and Emperors: The Fascinating Culture and History of China", "description": "A fascinating book about the history and culture of China.The history of China spans thousands of years. Journey through China in this fascinating and absorbing book: discover the land of dragons and emperors, and learn about the significance of its ancient dynasties. Countless tools and materials that people have used every day for centuries—paper, gunpowder, cast iron, matches, and silk, to name just a few—were first made in China. Chinese society has progressed through major changes, but lucky numbers, festivals, beliefs about colors, the practic of footbinding, the building of the Great Wall, and the larger-than-life people of China are all integral parts of this ancient civilization and still have an impact on life today.Bestselling author Adeline Yen Mah explores an extraordinary view of the great story of China over the last two millennia in this nonfiction work, which also includes black-and-white photographs.From the Hardcover edition."}, {"id": "0761423311", "genre": "Children's Books", "title": "Mozambique (Cultures of the World)", "description": "\"Provides comprehensive information on the geography, history, governmental structure, economy, cultural diversity, peoples, religion, and culture of Mozambique\"--Provided by publisher."}]