[{"id": "0763696056", "genre": "Children's Books", "title": "Judy Moody and Friends: Not-So-Lucky Lefty", "description": "Mighty righty Judy Moody is out of her element in this righty-to-lefty switcheroo just right for newly independent readers.Left-handers are creative. Left-handers are geniuses. Half of all cats are lefties! (Or so says Stink.) But Judy is a righty . . . and Judy is feeling left out. Tomorrow is Left Handers Day, and Stink and Dad, the southpaws in the Moody family, are celebrating at the pretzel factory. Judy is allowed to come along on one condition: she has to be left-handed — the whole entire day. It's on!"}, {"id": "B00FD4FHBU", "genre": "Children's Books", "title": "Who'll Pick Me? (Adventures at Bell Buckle Inn Book 1)", "description": "Peri is afraid no one will pick her as a friend in her new town Bell Buckle, where she and her father move into a dilapidated house they are turning into an inn. To make matters worse, she’s always losing or forgetting things. By caring for a litter of puppies, Peri hopes to earn back her father’s trust; unfortunately all she gains is trouble when things she is responsible for start to disappear. With the help of Lynn Ann, the girl who lives across the street, and Squirt, an eight-week Labrador, Peri conducts her own investigation to track down the stolen items. Could there be a burglar among the residents of Bell Buckle? More important, why is he stealing her things? During her probing into the mystery, Peri finds more than just the stolen items. She discovers the love of the people in Bell Buckle, and she finds a renewed faith in God’s ability to answer seemingly impossible prayers."}, {"id": "B005OL9GDW", "genre": "Children's Books", "title": "Scary Stories 3: More Tales to Chill Your Bones", "description": "Storytellers know -- just as they have for hundreds and hundreds of years -- that everyone enjoys a good, scary story!Alvin Schwartz's Scary Stories 3 joins his other popular collections of scary folklore, Scary Stories To Tell In The Dark and More Scary Stories To Tell In The Dark, to give readers spooky, funny and fantastic tales guaranteed to raise goose bumps.Who is the Wolf girl? Why is a hearse filled with men with yellow glowing eyes? Can a nightmare become reality? How do you avoid an appointment with Death?Stephen Gammell's splendidly creepy drawings perfectly capture the mood of more than two dozens scary stories -- and even a scary song -- all just right for reading along or for telling aloud in the dark.."}, {"id": "1448849586", "genre": "Children's Books", "title": "Garbage Trucks (City Machines)", "description": "Garbage trucks roll through neighborhoods, compacting trash and whisking it away to landfills. In this volume, bright photographs show garbage trucks picking up and removing trash from city streets. Easy-to-follow text explains how garbage trucks perform their jobs and how important these everyday machines are."}, {"id": "1402789556", "genre": "Children's Books", "title": "Do Crocs Kiss? (A Lift-the-Flap Book)", "description": "Do crocs cry? Do crocs clap? All I know is crocs go . . . SNAP! This novelty board book, with fun text and colorful illustrations, features adorable lions, tigers, and bears, as well as the snappy title reptile and other favorite creatures. Kids will happily lift the flap on each big animal “mouth” to discover what sound it makes. For a grand finale, all the animals appear together peering out from behind two gatefolds, so children can sneak a peek and say all the sounds again!"}]