[{"id": "1547114053", "genre": "Children's Books", "title": "Happy Birthday 40: Birthday Gifts For Men, Birthday Journal Notebook For 40 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B0747T3TF9", "genre": "Children's Books", "title": "Merlin and The Demon of the North (MERLIN AND THE LAND OF MISTS Book 6)", "description": "The Elder gods have left the World of Men, all that is now left of the Old Magic is Merlin, the son of the most powerful and cruellest of the Elder gods, Mithras Invictus. A Lord of the Dark, the Great Demon Belial, is building his Kingdom beyond the Wall of the Romans and fully intends to kill Merlin to prevent the birth of the Once and Future King. Gilead the White travels from the Future to join with Arathen, daughter of Archer, to fight for Merlin. In this Great Battle of Castle Dark, Merlin is joined by the Old Ones of the Silent Forest, the Dwarves of Arandor and the Painted People, together with the Mythical Beasts of Avalon that are Stormrider and the Unicorns, Firewing and the Griffins, Draago the Last of the Dragon Kind and Kraak King of the Raven Kind. Merlin - the original boy wizard."}, {"id": "1403479054", "genre": "Children's Books", "title": "Stadiums (Building Amazing Structures)", "description": "Explores amazing structures from around the world, looking at their development, techniques and materials used. This work offers information, charts and facts, covering various aspects of the design and construction of structures. It features photographs, and includes experiments to help understanding."}, {"id": "0199129037", "genre": "Children's Books", "title": "Oxford GCSE Maths for AQA: Interactive Oxbox CD-ROM", "description": "Two OxBox CD-ROMs, Interactive and Assessment, are available with the new Oxford GCSE Maths for AQA course.  This Interactive OxBox contains all you need to deliver engaging GCSE lessons, bringing the new GCSE curriculum to life with a wide range of fully interactive resources. There are also customisable schemes of work and lesson plans, all linked to Oxford GCSE Maths for AQA, to make your planning much easier, and you can also easily add your own resources."}, {"id": "1773210122", "genre": "Children's Books", "title": "Mighty Mission Machines: From Rockets to Rovers", "description": "Check out the amazing machines that make space travel possible.From the spaceship itself to the wrench needed to make in-flight repairs, machines of every kind are the backbone of space travel. In this, the third book in the Dr. Dave Astronaut series, the former NASA astronaut takes readers on a tour of the incredible equipment that allows humans to travel, live, and work in space:Kids will be fascinated to find out:• How spacecraft have evolved from the 1960s to today• How rockets power the spacecraft for liftoff―and enable it to re-enter Earth’s atmosphere • All the equipment a spacesuit contains―including a TV camera • How Robonaut, the on-board robot on the ISS, works and contributes to missions With its focus on technology and engineering, this book is a must-have addition to any STEM studies. Lots of photos and humorous illustrations make this an entertaining way to get kids interested in the nuts and bolts of space travel today and into the future."}]