[{"id": "030793103X", "genre": "Children's Books", "title": "Batman! (DC Super Friends) (Little Golden Book)", "description": "Boys and girls 2-5 will feel like they are part of the action as Batman, Superman and the other Super Friends save the day! This Little Golden Book is the perfect way to introduce young readers to Batman and the world's greatest super heroes."}, {"id": "B00J4N2ST0", "genre": "Children's Books", "title": "The Council's Conspiracy (Jim and Simon Book 2)", "description": "Six weeks ago, Jim and Simon barely escaped with their lives when the psychopath Marvin Nolan seized a chance for retribution.Nolan failed, but his alleged ties to Councillor Andrew Grady have severely derailed Grady’s campaign to become Mayor of Editon.Desperate to redeem himself as the election looms closer, Grady reveals a secret bloodline in order to win back the public’s trust.In doing so however, Jim and Simon find themselves once again pitted against overwhelming odds as not only the council but the public themselves rise up against them."}, {"id": "1981450343", "genre": "Children's Books", "title": "Beavers: Fun and Fascinating Facts and Photos about These Amazing & Unique Animals for Kids", "description": "Beavers: Fun and Fascinating Facts and Photos about These Amazing & Unique Animals for Kids"}, {"id": "1633222799", "genre": "Children's Books", "title": "Sticker Pictures: Animals: Stick, color & create one sticker at a time! (Sticker & Color-by-Number)", "description": "Take coloring to the next level with these bright, geometric color-by-number templates of your favorite animals. Sticker Pictures: Animals is filled with 14 simple polygonal images to color. Use the included stickers along with crayons, colored pencils, and markers to fill in each image, and watch your inner artist grow!"}, {"id": "147655191X", "genre": "Children's Books", "title": "Hockey Legends in the Making", "description": "Wayne Gretzke, Bobby Orr, Mark Messier, Mario Lemieux. These hockey legends rule the record books. But who will fans still be talking about years from now? Find out which of your favorite hockey players are legends in the making.   Produced in partnership with Sports Illustrated KIDS."}]