[{"id": "006246776X", "genre": "Children's Books", "title": "The Bad Seed", "description": "★ An Amazon Best Children's Book of the Year selectionFrom the New York Times bestselling author of the Goodnight Already! seriesThis is a book about a bad seed. A baaaaaaaaaad seed. How bad? Do you really want to know? He has a bad temper, bad manners, and a bad attitude. He's been bad since he can remember! With Jory John's charming and endearing text and bold expressive illustrations by Pete Oswald, here is The Bad Seed: a funny yet touching tale that reminds us of the remarkably transformative power of will, acceptance, and just being you. Perfect for young readers, as well as anyone navigating their current world, The Bad Seed proves that positive change is possible for each and every one of us."}, {"id": "0976280019", "genre": "Children's Books", "title": "Mike and The Bike", "description": "\"This is a boy whose name is Mike. This is Mike's pride and joy- his bike.\" So begins this adventurous tale about a boy, his bike and their travels! Written to inspire riders of all ages, Mike and The Bike is a new children's storybook classic that invokes a love of childhood adventure and independence where a whole new world is just two wheels and a bike helmet away! Mike and The Bike is a beautifully, retro styled illustrated storybook intent on introducing young children to cycling. Perfect for girls and boys who are first learning how to ride their bike, Mike and The Bike is simple and charming story that will keep children riding for years to come."}, {"id": "1478711639", "genre": "Children's Books", "title": "The Frog That Never Smiled", "description": "THE FROG THAT NEVER SMILED: A little green frog that was unhappy being a frog. A small, green frog named Nimbicol Newton Frog lives with his mother and father near Lily Pad Pond in Whispering Valley. Nimbi is unhappy with his life and believe all his problems are because he is a frog. He desires to be anything but what he was born to be. When Nimbi's cousin tells him about a fairy in Evergreen Forest, by the name of Ferngalisa Fairy, Nimbi decides to make the long journey to find her. Discovering the home of Fern, the beautiful fairy leads Nimbi to be transformed into a majestic butterfly. However, Nimbi soon discover that the life of a butterfly is not all he thought it would be. He calls again and again for Fern to change him into other animals, searching for the one that will give him a happy life. Along his journeys, Nimbi meets a very wise old mouse named Mouscanid Mouse, that he calls Gramps. Fern and Gramps hatch a plan to help Nimbi find true happiness. Through love, patience, and understanding, they help Nimbi learn that what he is on the inside is more important than his outward appearances."}, {"id": "1429662662", "genre": "Children's Books", "title": "ELVIS: A Graphic Novel (American Graphic)", "description": "Elvis Presley was the King of Rock n Roll. But his career was not all glitter and glory. The hip-shaking stardom of the 1950s sank into an embarrassing string of bad movies in the 1960s. Could Elvis kick-start his career and reconnect with his audience? Join him on his 68 Comeback Special and witness the King rise again."}, {"id": "1599616165", "genre": "Children's Books", "title": "Star Wars: Episode Iii: Revenge of the Sith/ Episode Iv: a New Hope", "description": "Spotlight proudly presents the library editions of Dark Horse Comics' adaptation of the long-awaited Episodes of the Star Wars saga. These volumes unlock some of the history and events that laid the foundation for the Rebel Alliance's epic struggle against the Empire. Make sure you catch this legendary series that's sure to please Star Wars fans of all ages."}]