[{"id": "B0779LY878", "genre": "Children's Books", "title": "Rexy the Dinosaur and a New Bike: (Children's book about a Dinosaur Who Learns that Sharing is Caring, Bedtime Story, Picture Books, Ages 3-5, Preschool Books, Kids Books, Dinosaur Books)", "description": "In this delightfully enchanting bedtime story for 3 to 5-year-olds, we meet Rexy, who’s a friendly dinosaur with a brand new shiny bike. He loves it very much because it was a gift from his mom and dad. He enjoys riding it around their yard. Rexy soon meets his new neighbor Trixie, a little girl dinosaur. Trixie wants to ride Rexy’s new bike but Rexy doesn’t want her to. Rexy’s parents guide him and teach him how satisfying it is to be generous. The main moral of this charming story is about how good it feels to share and be generousA beautifully illustrated picture book with wonderful watercolor images throughoutA perfect way to introduce your child to the idea that sharing is caringAs an extra bonus, we offer coloring sheets of the characters, too  Little Rexy learns that it’s fun to share, and he and Trixie become best friends sharing their toys together. A beautifully-told bedtime story that will capture the hearts of the young and old, alike!"}, {"id": "1632351307", "genre": "Children's Books", "title": "12 Incredible Facts About the First Moon Landing (Turning Points in US History)", "description": "Examines the 12 most amazing facts about the first moon landing. Full-color spreads provide information about the events critical moments, key players, and lasting effects paired with interesting sidebars, questions to consider, and a timeline."}, {"id": "0698115910", "genre": "Children's Books", "title": "The Tomten", "description": "This classic story of the Tomten’s nocturnal visits to all of the residents of wintry farm has been reminding children of the promise of spring for decades.   “The friendly troll Tomten will be a welcome visitor. . . . Highly recommended.”—School Library Journal (starred review)   “Wiberg’s lovely, full-color paintings convey the hushed atmosphere of night in the Swedish countryside and also the sweet charms of the Tomten. . . . The gentle story with its eye-filling scenes is an apt choice for a bedtime read-aloud.”—Publishers Weekly   “A picture book of rare distinction.”—The Chicago Tribune   An ALA Notable Book A Parents’ Choice Paperback Award Winner"}, {"id": "B00GKP6H06", "genre": "Children's Books", "title": "The Big Bad Wolf My Side of the Story", "description": "A short, fun chapter book for children age 5 up to 8. Good for readers from grades 1-4.You all know the story of the three little pigs and the big, bad wolf. You probably felt sorry for the three little pigs.Mr Wolf is now here to tell his side of the story. He wants everyone to know that he is the innocent victim!Read the story and help spread the word. The truth must get out!"}, {"id": "B00T83EO9S", "genre": "Children's Books", "title": "Solitude's Revenge", "description": "How much would you risk for freedom?Conceived during a brutal assault on a slave ship, Solitude inherited a deep desire to free her people. In a time when having mixed ancestry afforded many privileges, Solitude chose to honor her mother’s bloodline no matter the cost. She defied all odds. Solitude became a fierce leader in the struggle for Afrikan liberation in Guadeloupe. She fearlessly led her troops in war against the ruthless french enslavers. Even pregnancy couldn’t keep her away from the battlefield. Was Solitude successful in avenging her mother’s enslavement?As with all Angela Freeman Books, this is for adults and children to read together. Doing so strengthens dialogue between the generations. Children tend to ask many questions during and after reading this book. Capitalize on that thirst for knowledge. Encourage them to think critically and find answers. Encourage them to win."}]