[{"id": "B00UVSACK4", "genre": "Children's Books", "title": "1001 Amazing Facts about The Best Bands - Volume 1: 5SOS, 1D, The Vamps, Fifth Harmony, The Saturdays, Arctic Monkeys, Busted, McFly, Little Mix and Union J (Amazing Bands)", "description": "Are you a fan of 5 Seconds of Summer, One Direction, The Vamps and other similar bands? Do you want to know all the inside info on your favourite music acts, from how they first got together to their relationships, likes, dislikes and interesting facts previously known only to those closest to the bands themselves? If so, then this is the book for you. Containing one hundred facts on each band (plus one final bonus fact on 5SOS) this book will make you the master of all rock and pop knowledge! So whether it’s Harry Styles and his mates, Luke Hemmings & co, Brad Simpson and friends or any of the other seven groups featured, this is the perfect book for you!"}, {"id": "B0076O2WAY", "genre": "Children's Books", "title": "Young Samurai: The Way of Fire (short story)", "description": "A short story for the Young Samurai series!Japan, 1612. Shipwrecked and his father murdered by ninjas, Jack Fletcher is rescued by the legendary swordmaster Masamoto Takeshi and taken to his samurai school in Kyoto. Hunted by the ninja Dragon Eye, Jack's only hope is to become a samurai warrior. And so his training begins . . .In order to perfect his fighting skills, Jack goes on a gasshuku. But nothing can prepare him for the punishment of warrior camp - the climax of which is to enter the Way of Fire, a terrifying ritual that burns away evil. Can Jack overcome his fear and walk the Way of Fire? Part of the award-winning Young Samurai series by Chris Bradford. Visit www.youngsamurai.com for competitions and to find out more about the books.Previously published for World Book Day. 'A fantastic adventure that floors the reader on page one and keeps them there until the end' - Eoin Colfer'Addictive' - Evening Standard"}, {"id": "1584722150", "genre": "Children's Books", "title": "Black Beauty (Adventure Classics)", "description": "New, Unabridged on 5 Cd’s; Shrinkwrapped. Narrated by Kate Redding. The adventures of Black Beauty is a story that few of us will forget and one that deserves the popularity it has known through many generations. Black Beauty is the story of a courageous horse who was often badly mistreated. When first published, it was an immediate success. Anna Sewell died knowing that her book had indeed encouraged people to treat animals less cruelly."}, {"id": "B00JPEWNGQ", "genre": "Children's Books", "title": "Drawing Sea Animals With Numbers", "description": "Draw sea animals with incredible ease using numbers 2 through 20. Learn how to draw killer whales, sharks, sea lions and lobsters in easy to follow steps. Start with the number 5, add eyes, fins, and a tail and a drawing of a whale appears on the paper. You re going to have a splash when you dive into Drawing Sea Animals With Numbers."}, {"id": "1443455423", "genre": "Children's Books", "title": "5-Minute Stories for Fearless Girls", "description": "Meet smart, fearless and inspiring women from around the world.5-Minute Stories for Fearless Girls features women who have pursued their dreams, changed our world, and shown everyone what women can do. From aviation pioneers to leading scientists and gold-medal athletes to princesses, these incredible stories are perfect for bedtimes and on the go! "}]