[{"id": "1974093573", "genre": "Children's Books", "title": "8: Baseball Joe Around the World: Pitching on a Grand Tour (Volume 8)", "description": "Baseball Joe is the fictional hero of a number of children's books written by Howard R. Garis under the name of \"Lester Chadwick\". The series follows the main character, a star baseball player named Joe Matson, from high school to college (at Yale University) and then to success as a professional. In the Baseball Joe series, Chadwick chronicles the adventures of Joe Matson from the sandlots to prep school, the Ivy League, the minors, the majors, and on to a world tour and other adventures."}, {"id": "1467793213", "genre": "Children's Books", "title": "Potatoes at Turtle Rock", "description": "Annie leads her family on a nighttime journey around their farm to celebrate the first night of Hanukkah. At each stop along the way--the Old Log, Squeezy Cave, and Billy Goat's Bridge--Annie uses riddles (and potatoes) to mark old traditions and start new ones. They end up at Turtle Rock Creek, where they give thanks for the light and warmth (and potatoes) in their lives."}, {"id": "1508140510", "genre": "Children's Books", "title": "Anti-semitism: Jewish Immigrants Seek Safety in America (1881-1914) (Spotlight on Immigration and Migration)", "description": "This book takes readers from Russia to America as it covers the wave of Jewish immigration that occurred from 1881 to 1914. Readers will gain a deep understanding of the injustices the Jews faced in Russia, from unfair laws to pogroms. They’ll follow Russian Jews on their journey to the United States, a land that promised freedom of religion and prosperity. The book also highlights the many challenges Russian Jews faced once they arrived, and the ways they invested in their future. Engaging text is paired with stunning photographs and primary sources to enhance the reader’s learning experience. This is a great addition to any social studies program involving immigration and migration."}, {"id": "1887169210", "genre": "Children's Books", "title": "Are There Ants In Your Pants?", "description": "This book focuses on words within words. Crows wearing crowns and hairy chairs are just some of the fanciful illustrations to help children lean how to find smaller words inside bigger words."}, {"id": "1416999604", "genre": "Children's Books", "title": "Bedtime Bugs: A Pop-up Good Night Book by David A. Carter (David Carter's Bugs)", "description": "David A. Carter's zany bugs are here to help guide children through their nightly routines. The Bubbly Bugs are taking their baths, the Lullabug is reading a bedtime story, and the Twinkle Bug is shinging bright to grant the wish you wish tonight! This interactive Bugs mini is sure to become a bedtime favorite."}]