[{"id": "B071NPL6R7", "genre": "Children's Books", "title": "10 Unconventional Diet Tips How to lose 50 pounds in three months", "description": "10 Unconventional Diet Tips How to lose 50 pounds in three months"}, {"id": "B008TVM6HC", "genre": "Children's Books", "title": "Adventures of Huckleberry Finn (Dover Thrift Editions)", "description": "Referring to Adventures of Huckleberry Finn, H. L. Mencken noted that his discovery of this classic American novel was \"the most stupendous event of my whole life\"; Ernest Hemingway declared that \"all modern American literature stems from this one book,\" while T. S. Eliot called Huck \"one of the permanent symbolic figures of fiction, not unworthy to take a place with Ulysses, Faust, Don Quixote, Don Juan, Hamlet.\"The novel's preeminence derives from its wonderfully imaginative re-creation of boyhood adventures along the Mississippi River, its inspired characterization, the author's remarkable ear for dialogue, and the book's understated development of serious underlying themes: \"natural\" man versus \"civilized\" society, the evils of slavery, the innate value and dignity of human beings, and other topics. Most of all, Huckleberry Finn is a wonderful story, filled with high adventure and unforgettable characters."}, {"id": "0822596644", "genre": "Children's Books", "title": "Chris Mullin: Sure Shot (Achievers)", "description": "Traces the life and career of Golden State Warrior Chris Mullin, looks at his college years at St. Johns, and describes how he has overcome alcoholism to reinvigorate his game"}, {"id": "0753460408", "genre": "Children's Books", "title": "Racing: The Ultimate Motorsports Encyclopedia", "description": "With more than seventy million fans, NASCAR is the number-one sport in the United States, and with interest in all aspects of motor racing reaching an all-time high, here is the perfect companion for all of those racing fans. Packed with spectacular action photography, with features on legendary drivers, circuits, and cars, Racing is a gleaming and action-packed look at motor sports all over the world. With wide-ranging, in-depth coverage of every major category of motor sports, including Formula One, stock car racing, Indy car, MotoGP bikes, rallying, European touring car racing, A1 Grand Prix, and special spreads focusing on the incredible surge in popularity of Formula One and NASCAR, this book brings the race for the checkered flag to life in all of its heart-stopping glory. For the grease monkeys, \"Pit Stop\" panels illuminate the techniques, technology, and innovation that underpin this cutting-edge sport. This book is the perfect gift for racing fans of any age!"}, {"id": "0856602620", "genre": "Children's Books", "title": "Armed Forces (Questions & Answers)", "description": "A title in a series, set out in a question-and-answer format, designed to provide information on various careers. Each book covers: educational requirements; career prospects; training prospects; overseas work or travel opportunities; recent developments; and useful addresses. This book focuses on the armed forces. These guides are aimed at pupils aged 13+, school and college leavers, graduates, career advisors or anyone considering a career change."}]