[{"id": "B004E3XEKM", "genre": "Children's Books", "title": "I Am Sacajawea, I Am York: Our Journey West with Lewis and Clark", "description": "When Lewis and Clark's Corps of Discovery set out in the spring of 1804, they had chosen to go on an unprecedented, extremely dangerous journey. It would be the adventure of a lifetime.Unlike others in the group, two key members did not choose to join the hazardous expedition: York, Clark's slave, and Sacajawea, considered to be the property of Charbonneau, the expedition's translator.The unique knowledge and skills Sacajawea and York had were essential to the success of the trip. The dual stories of these two outsiders, who earned their way into the inner core of the Lewis and Clark Expedition, shed new light on one of the most exciting and important undertakings in American history."}, {"id": "1416935401", "genre": "Children's Books", "title": "My People (Coretta Scott King Award - Illustrator Winner Title(s))", "description": "Langston Hughes's spare yet eloquent tribue to his people has been cherished for generations. Now, acclaimed photographer Charles R. Smith Jr. interprets this beloved poem in vivid sepia photographs that capture the glory, the beauty, and the soul of being a black American today."}, {"id": "0635015242", "genre": "Children's Books", "title": "John Brown: Madman or Martyr? (55) (1000 Readers)", "description": "John Brown was a radical abolitionist whose attempt to free the slaves cost a number of lives (including two of his own sons) and helped indirectly to start the American Civil War.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "1897142323", "genre": "Children's Books", "title": "Rocky Mountain Kids (Courageous Kids)", "description": "This is a book of true stories about some of the bravest mountain climbers, explorers and wilderness adventurers who have ever hiked through the Canadian Rockies-a crowd of unforgettable children. Too often the youngest Canadians are erased from our historical memory. Rocky Mountain Kids provides firstperson creative non-fiction narratives from the region's children, many of whom went on to be influential adults. In the style of its successful predecessor, Kidmonton, these are lively and entertaining stories, but they don't flinch in their description of hardship and heroism. Balanced and well-researched, Goyette writes of First Nations, M?tis, immigrant and settler children as well as contemporary kids of the Rockies, with informative postscript to help readers distinguish between the fact and the fiction. Against the timeless backdrop of the Rockies, we can all embrace a sense of childhood wonder."}, {"id": "1474734006", "genre": "Children's Books", "title": "Into the Storm: A Mermaid's Journey (Dark Waters: Dark Waters)", "description": "When a hurricane threatens to harm the underwater homes of the merpeople, it is up to India Finch, a part-human/part-mermaid teenager, to warn her ocean friends. The mer decide to seek calmer waters, and as they travel, they are attacked by a giant squid, with India at the centre of harm's way. Gravely injured, India depends on the merfolks' willingness to risk their own safety to get her ashore where her injuries can be treated. Will the prejudice many mer hold against humans leave India at the end of her journey? Reader tools include a glossary and discussion questions in this hi-lo novel for reluctant and struggling readers."}]