[{"id": "1981280243", "genre": "Children's Books", "title": "Children's Book: An Amazing Animal Picture Book about White Tiger for Kids", "description": "Children's Book: An Amazing Animal Picture Book about White Tiger for Kids"}, {"id": "0431119856", "genre": "Children's Books", "title": "20th Century Perspectives: Vietnam War Hardback", "description": "This series examines key events in the 20th century. Each title also outlines the lead-up and aftermath, explores the issues at stake and introduces the leaders and key figures. Fact boxes and source material, further reading suggestions, timelines, maps and useful websites are included. Ages 12-16."}, {"id": "1419704117", "genre": "Children's Books", "title": "Montessori: Letter Work", "description": "These unique board books bring the popular Montessori pedagogy to trade book form for the first time. Using materials and methods common to Montessori classrooms, these interactive board books immerse young children in an aesthetically rich learning experience, while providing parents and caregivers with carefully crafted language to encourage understanding.In Montessori classrooms, students learn to write before they learn to read, so the process is driven by their own words and thoughts before those of others. Letters are taught first as sounds (instead of names), and alphabet tiles encourage children to trace each letter with their fingers. This book honors that tradition by emulating the standard classroom material with touchable, traceable letters and beautiful colors that evoke the elegant simplicity of the Montessori aesthetic.Praise for Montessori: Letter Work\"The combination of phonetics and simple retro illustration makes for an excellent entree into pre-literacy.\"—The Wall Street Journal"}, {"id": "B005Q8BM9Y", "genre": "Children's Books", "title": "Discover Science: Whales and Dolphins", "description": "Whales and Dolphins introduces readers to some of the largest and most acrobatic mammals in oceans and seas. Young students will discover the many types of whales and dolphins and learn about their behavior and how they survive in their watery world. Projects include making a dolphin mobile and a whale bookmark."}, {"id": "1524769665", "genre": "Children's Books", "title": "Moon: A Peek-Through Picture Book", "description": "Next in the much-loved children’s series that began with Tree: A Peek-Through Picture Book is an elaborate book with peek-through holes that show the moon’s different phases with each turn of the page. Over deserts and forests, Arctic tundra and tropical beaches, the moon shines down on creatures around the world. Children will love discovering how it changes from day to day as the lunar cycle is shown through clever peek-through holes, each revealing the moon in a different size and shape.   It’s the perfect light nonfiction book for young stargazers—and an ideal bedtime book, ending with a giant moon hovering over a sleepy town hunkered down for bed.   Look for all the books in the Peek-Through Picture Book series: Tree, Bee, and The Twelve Days of Christmas.\"young readers will delight in finding the many creatures on every page. . . . A lovely addition, perfect for bedtime and one-on-one sharing.\"—School Library Journal\"The author's rhyming text includes well-chosen language that delights the ear.\"—Kirkus Reviews"}]