[{"id": "1620141558", "genre": "Children's Books", "title": "Ira's Shakespeare Dream", "description": "Ira Aldridge dreamed of being on stage one day performing the great works of William Shakespeare. He spent every chance he got at the local theaters, memorizing each actor s lines for all of Shakespeare s plays. Ira just knew he could be a great Shakespearean actor if only given the chance. But in the early 1800s, only white actors were allowed to perform Shakespeare. Ira s only option was to perform musical numbers at the all-black theater in New York city. Despite being discouraged by his teacher and father, Ira determinedly pursued his dream and set off to England, the land of Shakespeare. There, Ira honed his acting skills and eventually performed at the acclaimed Theatre Royal Haymarket. Through perseverance and determination, Ira became one of the most celebrated Shakespearean actors throughout Europe. Illustrated by award-winning artist Floyd Cooper, Ira s Shakespeare Dream is a captivating tribute to the inspiring life of Ira Aldridge, and to the renowned works of William Shakespeare."}, {"id": "B01J8Z35OA", "genre": "Children's Books", "title": "The Yellow Star: Shines Like A Candle In The Dark", "description": "What is life worth, when nothing is left?Young Aharon, no more than twelve, tells us his struggles during the Holocaust.  Despite the atmosphere and religious differences, he was able to relive the Passover Seder with a gentile friend. How can a young boy subsist when he lost almost everyone he loved? Did he find solace through his friend’s words? Even though, the days were long and harsh Aharon gave strength when he had none left. Even though, the nights were dark and scary.Aharon gave hope when he had none left. Even though the days and nights turned into years of tears,Aharon gave courage when all else fails."}, {"id": "0753474190", "genre": "Children's Books", "title": "Marvelous Motorcycles (Amazing Machines)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. With lively, informative rhyming text, bold illustrations, and a visual dictionary, this introduction to all types of motorcycles makes learning about motorcycles exciting and fun."}, {"id": "0448483092", "genre": "Children's Books", "title": "Who Was Seabiscuit?", "description": "In the middle of the worst depression in U.S. history, one young racehorse lifted a nation's spirits. Seabiscuit was born in 1933 on a farm in Kentucky. Though bred for racing, he was weak and undersized. He slept too long and ate too much. Against the odds, he began to win local races. He was given a new coach who trained him to race in larger circuits. Soon enough, this scrappy horse began beating the best racehorses in the country. He became a media darling and won national competitions. In 1938 he was voted U.S. Horse of the Year. Seabiscuit's undying spirit and come-from-behind story made him a celebrity and hero for millions."}, {"id": "1546383921", "genre": "Children's Books", "title": "Thora: A Half-Mermaid Tale", "description": "Thora’s no ordinary girl. She’s got scales on her legs, purple feet, and a blowhole that squirts water from the top of her head. Thora’s a half-mermaid, and as mermaid law commands, Thora must spend ten years at sea and ten years on land. In a houseboat called the Loki, Thora sails the seas with her mermaid mother, Halla, and her guardian, Mr. Walters. But when Thora returns to the seaside town of Grimli, where her father grew up, she encounters fat-cat tycoon Frooty de Mare, who will stop at nothing to expand his Tooty Frooty enterprises. With the help of new friends and her pet peacock, Cosmo, Thora has her work cut out thwarting Tooty’s evil plans – not to mention doing a bit of exploring into her own Grimli roots. But, despite being half mermaid, this exceptional young heroine somehow always manages to land on her feet..."}]