[{"id": "B074SBQL6Q", "genre": "Science Fiction & Fantasy", "title": "SHOW ME MERCY (The 100 Deaths of Lucas Graves Book 2)", "description": "Lucas Graves is not a big fan of dying. He just can’t become accustomed to it, even though he’s been through it five times…so far. Despite a promise that he’s made, he makes every effort to avoid trouble wherever possible—so trouble somehow always seems to find him instead. When an accident lands him in the hospital, he’s determined to recover, even though best friends, Duncan and Harmony, suggest that he should just succumb and get yet another death over with. While convalescing, an Angel of Mercy killer smothers Lucas, compelling him to go on the hunt for the murderous hospital volunteer, before the tortured soul can strike again. In the midst of this latest challenge, he meets a young woman named Mercy, a recovering drug addict who may finally help Lucas discover his intended purpose."}, {"id": "B006M3XL4Q", "genre": "Science Fiction & Fantasy", "title": "The Accord", "description": "The Accord, a virtual utopia where the soul lives on after death and your perceptions are bound only by your imagination. This is the setting for a tale of love, murder and revenge that crosses the boundaries between the real world and this virtual reality. When Noah and Priscilla escape into the Accord to flee Priscilla’s murderous husband, he plots to destroy the whole Accord and them with it. How can they hope to escape their stalker when he can become anything or anyone he desires and where does the pursuit of revenge stop for immortals in an eternal world?\"One of the finest novels of virtual reality yet written... a novel that combines elements of love story, thriller, and work of ideas, yet gains its impact from being more than the sum of these. And it all works. It works brilliantly. In The Accord, Keith Brooke has created a dazzling work of the imagination.\" SF Site \"The emotion-driven love triangle neatly complements the tech- and philosophy-heavy nature of the Accord, making this rumination on posthumous, posthuman love a rare treat.\" Publishers Weekly 5* review  \"Brooke's fifth science-fiction novel is an intelligent examination of the technological possibilities of VR and a brilliant dissection of how individuals and society will change when freed from material bounds. The Accord is not only Brooke's best novel to date, but one of the finest to broach the subject of virtual reality.\" The Guardian \"A truly major sf work that should be considered for all eligible awards.\" SFF World  \"Keith Brooke's take on posthumanism is one of the best approaches of the subject I've ever seen.\" SF Signal"}, {"id": "075641119X", "genre": "Science Fiction & Fantasy", "title": "The Complete Arrows Trilogy", "description": "Available in a single volume for the first time, Mercedes Lackey’s debut trilogy of Valdemar!   The Complete Arrows Trilogy contains the three extraordinary novels that launched Mercedes Lackey’s remarkable career and sparked the imaginations of millions of readers across the world.   The Arrows trilogy tells the story of Talia, a daughter of the repres­sive Holderfolk, who is Chosen by the immortal Companion Rolan to become one of the legendary Heralds of Valdemar.    Companions like Rolan are mystical horse-like beings with powers beyond imagining—including the power to sense an awakening potential for special talents of the mind in certain young men and women, like Talia.    With Rolan’s help, Talia will learn to master her unique mental abilities of telepathy and empathy, and will grow from an uncertain and inexperienced Herald trainee to become the most important Herald of all: the Queen’s Own.    And together, Talia and Rolan will fight to protect the queen, the heir to the throne, and the entire kingdom—from dangerous conspiracies, looming unrest, vicious treachery, and even an evil and ancient sorcery beyond the magic of the Heralds themselves."}, {"id": "1934857807", "genre": "Science Fiction & Fantasy", "title": "Historical Operation Klondike (Battletech Sourcebooks)", "description": "This book is SOFTCOVER, not hardcover as indicated! In the wake of the Star LeagueÕs collapse, Aleksandr Kerensky led the bulk of the SLDF into deep space to escape the inevitable Succession Wars. But war soon came to the ÒStar League in ExileÓ anyway, prompting General KerenskyÕs son Nicholas to form a new society, based on the principles of honor and strength. Fifteen years later, the newborn Clans were unleashed against those who abandoned KerenskyÕs vision. Historical: Operation Klondike details the actions of the epic first campaign waged by Nicholas Kerensky's newborn Clans. Identifying all of the founding Clans and their warriors, this book provides a hard look at the nature of early Clan formation, with new units and campaign rules that enable players to replay these critical battles for the Pentagon Worlds."}, {"id": "B00N6REYRY", "genre": "Science Fiction & Fantasy", "title": "The Zombie Knight Saga - Volume One: Elegy for an Immortal", "description": "A young man dies, and a grim reaper offers to revive him in exchange for servitude. Responsibilities include saving other people’s lives and occasionally fighting unspeakable horrors. But this particular young man already has a few problems of his own, such as crippling shyness. No, seriously. He can barely even speak to people. It's really bad.Takes place in the modern fantasy world of Eleg. This book includes the first three story arcs of the ongoing serial novel. You can read the entire story (as much as has been written) for free at http://thezombieknight.blogspot.comWord count: ~88,000"}]