[{"id": "081672816X", "genre": "Children's Books", "title": "The Princess Who Lost Her Hair: An Akamba Legend (Legends of the World)", "description": "The efforts of a kind-hearted beggar boy bring an end to the drought that has plagued the kingdom of a haughty princess."}, {"id": "1403488835", "genre": "Children's Books", "title": "Columbus Day (Holiday Histories)", "description": "It is the second Monday in October and school is closed. But do you know why? It's Columbus Day of course! Turn the pages of this book to find out: how Columbus got lost but still became a hero, why native Americans are sometimes called Indians, how other countries celebrate Columbus Day. Each book in the Holiday Histories series describes one of America's holidays or special days. Explore the history of each day and learn the real reason why it is important. Discover what special meaning each day might have for you."}, {"id": "1771152184", "genre": "Children's Books", "title": "Coyote Boy: An Original Trickster Story", "description": "Coyote Boy: An Original Trickster Story is the contemporary tale of a young Mohawk boy who finds himself living away from the only home he has ever known, and what happens when he meets Coyote for the first time.  This Teacher Edition paperback also contains supplemental information for further discussion and includes the retelling of two traditional Mohawk stories; The Mohawk Creation Story and The Three Brave Hunters and the Great Bear. Further information can be found at www.BearSpiritPress.com"}, {"id": "1566867614", "genre": "Children's Books", "title": "CRASH BANDICOOT 2, TUG (Bradygames Strategy Guide)", "description": " The Crash Bandicoot 2 guide gives players complete walkthroughs for the entire game Boss strategies, all the puzzle pieces and tons of secrets! Crash 2 is much brighter and more colorful. New, higher-detailed bitmaps litter the game and provide each level with its own distinct look and personality Character animation is also much better including over ten times more frames of animation, offering a lot more moves like hanging, climbing, ducking and belly-flopping Gamers now have the ability to warp to each level whenever they choose, so if you're stuck on a certain area, you can just skip it and come back later "}, {"id": "B00S30K7P2", "genre": "Children's Books", "title": "The Fox and the Grapes An Sionnach agus an Fíonchaora : Children's Picture Book English-Irish (Bilingual Edition)", "description": "The fox is hungry and eyes some tasty grapes. The fox tries again and again to get the grapes in thisextended version of the fox and the grapes with the fox doing interesting thingsto try and get the grapes. Teaches days of the week. Is é an sionnach ocras agus súile áirithe fíonchaora blasta. Déanann an sionnach arís agus arís eile a fháil ar an fíonchaora saLeagan leathnaithe an sionnach agus na fíonchaora leis an sionnach ag déanamh rudaí suimiúlachun iarracht a dhéanamh agus a fháil ar na fíonchaora. Múineann laethanta na seachtaine."}]