[{"id": "0061885207", "genre": "Children's Books", "title": "Batman Classic: Dawn of the Dynamic Duo (I Can Read Level 2)", "description": "Kids who love DC Comics super heroes will be excited to see the ultimate team—Batman and Robin—in their first adventure as the Dynamic Duo!Batman and Robin work together to protect Gotham City. So when the twisted troublemaker Two-Face shows up in town, the Dynamic Duo has to stop him. Can these two heroes save the day?Full of super hero action, Batman Classic: Dawn of the Dynamic Duo, is a Level Two I Can Read book, geared for kids who read on their own but still need a little help."}, {"id": "0753459353", "genre": "Children's Books", "title": "The Best Book of Knights and Castles", "description": "The Best Book of Knights and Castles takes the reader on an amazing journey to explore medieval castles all over the world. From the earliest fortifications in Europe, like motte and bailey castles, to the stone castles of the Normans, Crusader castles, and German castles on the Rhine, this book looks at what it was like to be a knight in medieval times. Learn about chivalry, heraldry, and jousting, and some of the most famous castle battles in history."}, {"id": "067144901X", "genre": "Children's Books", "title": "Moo Baa La La La", "description": "This raucous story about the sounds animals make—including three pigs who say \"la la la!\"—is just right for reading aloud.Serious silliness for all ages. Artist Sandra Boynton is back and better than ever with completely redrawn versions of her multi-million selling board books. These whimsical and hilarious books, featuring nontraditional texts and her famous animal characters, have been printed on thick board pages, and are sure to educate and entertain children of all ages."}, {"id": "0440400597", "genre": "Children's Books", "title": "All-of-a-Kind Family", "description": "Meet the All-of-a-Kind  Family -- Ella, Henny, Sarah, Charlotte, and Gertie -- who live with their parents in New York City at the turn of the century.Together they share adventures that find them searching for hidden buttons while dusting Mama's front parlor and visiting with the peddlers in Papa's shop on rainy days. The girls enjoy doing everything together, especially when it involves holidays and surprises.But no one could have prepared them for the biggest surprise of all!"}, {"id": "B0096J6KOQ", "genre": "Children's Books", "title": "Servals! Learn About Servals and Enjoy Colorful Pictures - Look and Learn! (50+ Photos of Servals)", "description": "Are your kids interested in Servals? Awesome! You have found the right book. Help your children learn more about Servals today by reading this book. Here is what is included inside \"Servals! Learn About Servals and Enjoy Colorful Pictures – Look and Learn!\"... ServalsServal BreedsMammalsServal PicturesServal FactsBaby ServalsServals RunningServal FoodServals EatingFun Serval FactsAnd Lots More! Includes over 50 high quality photos of Servals! Other bonuses inside \"Servals! Learn About Servals and Enjoy Colorful Pictures – Look and Learn!\"...This book has photos of Servals.This book has info on Servals.This book has facts on Servals.This book will help you learn. Buy the \"Servals! Learn About Servals and Enjoy Colorful Pictures – Look and Learn!\" book right now!"}]