[{"id": "0711235724", "genre": "Children's Books", "title": "Jackie Morris Wildlife Notebook Set", "description": "A set of three 5 x 8 notebooks belly-banded together, this beautiful set makes a wonderful gift for animal lovers and fans of Jackie Morris’ enchanting illustrations. Each notebook features artwork depicting a different animal: a hare, an owl, and a fox. The inside covers are printed, and each 48-page notebook is lined and illustrated with a repeating image.  "}, {"id": "1502624966", "genre": "Children's Books", "title": "Zimbabwe (Exploring World Cultures)", "description": "Zimbabwe is an African country as unique as its traditions, customs, and people. This book explores the aspects that make up Zimbabwe, such as food, festivals, and leisure activities. Using simple language, this book presents a comprehensive view of this special country and is sure to engage young explorers."}, {"id": "1553697987", "genre": "Children's Books", "title": "How Anansi Learned Self-Esteem: 10 Original Stories for Building Self-Confidence and Self-Respect", "description": "We are all beautiful and full of potential and we have the right to be happy! Does every child know that is true? Do you? How Anansi Learned Self-Esteem is a collection of ten original stories written and illustrated in a delightful and entertaining way to make ideas about self-esteem available to young readers and listeners. Its purpose is to help those in its audience define themselves in ways that lead to lives full of possibilities motivated by joy rather than lives of limited choices motivated by fear. These stories are meant to provide a forum for children and adults to talk about self-esteem. In this collection, Anansi the Spider learns through conversations with others and himself while on his journey. We can do the same. This book is one tool that can be used to help us develop something that is necessary for living successful lives, positive self-esteem. Travel along with Anansi the Spider as he learns important lessons that help him to have confidence in and respect for himself. Perhaps those lessons will inspire you to have more confidence in and respect for yourself too! Our possibilities are endless when we believe in each other and ourselves."}, {"id": "1608878821", "genre": "Children's Books", "title": "Teenage Mutant Ninja Turtles: The Pop-Up Book", "description": "Everyone’s favorite heroes in a half-shell—Donatello, Leonardo, Michelangelo, and Raphael—spring to life in this one-of-a-kind pop-up book!Straight from the sewers, it’s Leonardo, Donatello, Raphael, and Michelangelo as you’ve never seen them before! Join the lean, green, shell-kicking brothers of the Teenage Mutant Ninja Turtles on a high-octane tour of their world as they fight to keep New York City safe. Based on Nickelodeon’s top-rated animated series, this  collectible volume contains five pop-up spreads featuring exciting scenes such as Leonardo training in the Turtle’s lair, Raphael fighting the Foot Clan in the Shredder’s hideout, and an all-out ninja battle featuring Casey, April, Splinter, and all four Turtles. It’s nonstop ninja action! © 2016 Viacom International Inc. and Viacom Overseas Holdings C.V.  All rights reserved.  Nickelodeon, Teenage Mutant Ninja Turtles, and all related titles, logos, and characters are trademarks of Viacom International Inc. and Viacom Overseas Holdings C.V. Based on the characters created by Peter Laird and Kevin Eastman."}, {"id": "1429613165", "genre": "Children's Books", "title": "Combat Rescue Helicopters: The MH-53 Pave Lows, Revised Edition (War Planes)", "description": "Discusses the design and equipment of the specialized Sikorsky helicopter known as the Pave Low, along with its use by the U.S. Air Force in military missions."}]