[{"id": "1547209259", "genre": "Children's Books", "title": "Happy 7th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 7 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1592701035", "genre": "Children's Books", "title": "The Big Book of Dummies, Rebels and other Geniuses", "description": "An entertaining and humorous introduction to 26 famous individuals from history, the arts, literature and the sciences, who were considered rebels or dunces during their childhood and teen years."}, {"id": "083685571X", "genre": "Children's Books", "title": "The Release of Nelson Mandela (Days That Changed the World)", "description": "A biography of the black South African leader who became a civil rights activist, political prisoner, and president of South Africa, told in the context of the history of his country."}, {"id": "0152058575", "genre": "Children's Books", "title": "Paul Bunyan", "description": "Paul Bunyan was never \"stumped,\" and no job was ever too big for him and his blue ox to handle. From Michigan to Minnesota, from North Dakota to the Pacific Northwest, wherever Paul went, he liked to do things in a big way.     In Esther Shepard's classic collection, originally published in 1924 and now available in this handsome new edition, the Paul Bunyan stories are superbly told in folksy narrative and robustly illustrated with Rockwell Kent's line drawings. These twenty-one tales about the super lumberjack are a unique American contribution to the world's folklore.      Includes an introduction by the author."}, {"id": "1432713086", "genre": "Children's Books", "title": "Hell for Honshu: An Army Air Corps Navigator Tells the Story of the World War II Bombing Raids on Japan", "description": "Inside the cabin of a B-29 on a 3,000 mile trip to bomb Japan!Larry Nelson, a farm boy from South Dakota, enlisted in the Army Air Corps to fulfill a romantic dream to become a pilot.  Romance turned to harsh reality when he failed an eye exam and became a navigator instead.  Harsh reality became terror inside the cabin of a B-29.  When high altitude bombing raids on Japan failed, they turned to devastating night fire raids on Japanese cities.  These raids resulted in the near total destruction of Tokyo-Yokohama, Kobe, Osaka and other smaller cities."}]