[{"id": "B077RV2PDS", "genre": "Children's Books", "title": "Echo and the White Howl", "description": "From the author of Uncle Flynn and Dr Gribbles and the Beast of Blackthorn Lodge...When a wolf pack discovers humans lurking near their territory, Echo senses dark times ahead.Despite the warnings and omens, Aatag, the pack Alpha, refuses to flee... leading to a cruel turn of events that forces Echo into exile, and a quest for revenge that will change the pack forever."}, {"id": "0736427996", "genre": "Children's Books", "title": "Monsters, Inc. Little Golden Book (Disney/Pixar Monsters, Inc.)", "description": "Mike, Sulley, and the rest of the workers at Monsters, Inc. are in for a big surprise when a little girl enters their world! Boys and girls ages 2-5 will love this full-color Little Golden Book which retells the hilarious, heartwarming story of the Disney/Pixar blockbuster Monsters, Inc. "}, {"id": "1510734899", "genre": "Children's Books", "title": "The Withers Awaken: Wither War Book Two: A Far Lands Adventure: An Unofficial Minecrafter’s Adventure", "description": "Krael, the Wither King, has been trapped deep underground, ending his reign of terror, and all the NPCs of the Far Lands have all put away their swords in peace except Watcher; the young archer still suspects Krael has bigger plans.  He’s right. In the darkness of the Cave of Slumber, Krael awakens the imprisoned wither horde, and with the help of creepers and endermen, the wither army is released from their rocky jail. They spread across the Far Lands, searching for the ancient Vault of Weapons which will make the army of withers indestructible. But one man alone holds the secret to the Vault’s whereabouts: the Far Land’s last living NPC wizard.  Watcher and his friends must race to find the wizard before Krael and his army of monsters. But if they fail, a wave of destruction, led by the King of the Withers, will sweep across the landscape, destroying everything―and everyone―they know."}, {"id": "054758671X", "genre": "Children's Books", "title": "Go Math!: Assessment Guide Grade K", "description": "Paperback ASSESSMENT GUIDE Go Math! Includes Prerequisite Skills Inventory, Beginning of Year, Middle of Year, and End of Year Benchmark Tests, Chapter Tests, Directions, etc."}, {"id": "0990337006", "genre": "Children's Books", "title": "My Yellow Balloon", "description": "It all started at the carnival. . . .That’s where Joey makes a new friend: a bright yellow balloon. Joey and his beloved balloon do everything together, until the balloon accidentally slips off Joey’s wrist and flies far, far away. What will Joey do without his special friend?Tiffany Papageorge has crafted a poignant tale of love, loss, and letting go that will serve as a comforting guide to children who are navigating the complicated emotions of grief. Rich, luminous illustrations by Erwin Madrid perfectly capture these timeless themes, making them accessible to even the youngest reader.Honest, unflinching, and ultimately reassuring, My Yellow Balloon will resonate with anyone who has endured the darkness of grief, while offering hope for brighter days ahead."}]