[{"id": "1635730074", "genre": "Science Fiction & Fantasy", "title": "SINthetic", "description": "\"Darkly engrossing, SINthetic shines a stark light on the age-old question, what does it mean to be human?\" -Julie Kagawa, New York Times bestselling author The Artificial Evolution  They look like us. Act like us. Burrt they are not human. Created to perform the menial tasks real humans detest, Synths were designed with only a basic intelligence and minimal emotional response. It stands to reason that they have no rights. Like any technology, they are designed for human convenience. Disposable.  In the city of New Lyons, Detective Jason Campbell is investigating a vicious crime: a female body found mutilated and left in the streets. Once the victim is identified as a Synth, the crime is designated no more than the destruction of property, and Campbell is pulled from the case.  But when a mysterious stranger approaches Campbell and asks him to continue his investigation in secret, Campbell is dragged into a dark world of unimaginable corruption. One that leaves him questioning the true nature of humanity.  And what he discovers is only the beginning . . ."}, {"id": "1594333777", "genre": "Science Fiction & Fantasy", "title": "A More Perfect Union", "description": "Society has collapsed and constitutional government is but a dim memory. Those in power reek of corruption and perversion. The world envisioned by Orwell took almost fifty more years to come to pass than he predicted and it is far worse than he ever imagined. A new third sex has emerged, physically powerful, beautiful in their own way and filled with lust. From behind the scenes they control the processes of the government to fulfill the desires of the Primecon and ensure that the continuum of control stays in power through the manipulation of the masses utilizing designed untruths called constructs. These are then forced onto the sheeple through the ComOrgs and the clean crews who ensure that nobody lasts who is in opposition as those that do are taken to labor camps. Is this what Jefferson and the rest of the Founding Fathers envisioned? How could the nation possibly be fixed?"}, {"id": "0765391473", "genre": "Science Fiction & Fantasy", "title": "Luna: Moon Rising", "description": "The continuing saga of the Five Dragons, Ian McDonald's fast-paced, intricately plotted space opera pitched as Game of Thrones meets The ExpanseA hundred years in the future, a war wages between the Five Dragons―five families that control the Moon’s leading industrial companies. Each clan does everything in their power to claw their way to the top of the food chain―marriages of convenience, corporate espionage, kidnapping, and mass assassinations. Through ingenious political manipulation and sheer force of will, Lucas Cortas rises from the ashes of corporate defeat and seizes control of the Moon. The only person who can stop him is a brilliant lunar lawyer, his sister, Ariel.Witness the Dragons' final battle for absolute sovereignty in Ian McDonald's heart-stopping finale to the Luna trilogy.Luna 1. Luna: New Moon2. Luna: Wolf Moon3. Luna: Moon Rising"}, {"id": "B075RF8L83", "genre": "Science Fiction & Fantasy", "title": "The Star Dragon: A Fantasy LitRPG (Dragon Kings of the New World Book 1)", "description": "When the real world is threatened, it’s up to the players in a virtual one to save it.Van Vanyushin doesn’t see the point in ever leaving the beautiful digital world of the game he loves—and for good reason. In the industrial wasteland he calls home, it is often the only way people can experience life’s simplest pleasures. But his allegiance to the game is tested when an ambitious CIA agent named Sang Ngo calls upon him to help as she goes undercover in the game to investigate Draco—the corporation responsible for creating the massively popular role-playing game Dragon Kings of the New World. Sang is a gifted hacker who feels nothing but contempt for those who waste their lives in what she sees as a false reality…but when people start dying in the game, she must find out why. Van, a talented gamer, is her guide to navigate the world, level up their newbie characters fast and get into some of the most dangerous areas of the game. He dreams of becoming a pro gamer sponsored by Draco one day, but his partnership with Sang threatens to expose secrets from his past that could jeopardize those plans. Now, they will have to put aside their differences to discover whatever—or whoever—is killing players, but the truth they find is darker than either of them imagined….Audiobook available now!"}, {"id": "1453815856", "genre": "Science Fiction & Fantasy", "title": "Galactic Collapse: Agents of ISIS, Book 10", "description": "Finally the evil conspiracy reveals itself in all its true power, bringing the Empire to its knees. Even the Imperial Special Investigation Service is helpless in the face of the unexpected, overwhelming attack. But the Empire strikes back with all the resources at its disposal--hoping against hope that will be enough to save humanity."}]