[{"id": "077874776X", "genre": "Children's Books", "title": "St. Patrick's Day (Celebrations in My World)", "description": "On March 17th of each year, millions of people all over the world celebrate St. Patrick's Day. Taste the foods, hear the music, and dance the dances that make up his celebration. The history of this celebration will captivate children and teach them about Irish culture and traditions."}, {"id": "1610809289", "genre": "Children's Books", "title": "We Celebrate Halloween in Fall (21st Century Basic Skills Library)", "description": "Level 1 guided reader that examines how people celebrate Halloween. Students will develop reading skills while learning about Halloween activities and foods."}, {"id": "0838806023", "genre": "Children's Books", "title": "Reading Comprehension in Varied Subject Matter: Book 3", "description": "This popular series offers nonfiction reading passages with comprehension questions on a variety of subjects for students in second grade through junior high school and beyond. Topics and questions pr"}, {"id": "0635023725", "genre": "Children's Books", "title": "Abigail Adams: Revolutionary First Lady (137) (1000 Readers)", "description": "Abigail Adams is known for being the wife of President John Adams and the mother of President John Quincy Adams. But she was more than just another first lady! She was an excellent writer, a smart businesswoman, and the mother of five children. Abigail is best remembered for writing many letters expressing her opinions about society at the time.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "1416961240", "genre": "Children's Books", "title": "A Knight's City: With Amazing Pop-Ups and an Interactive Tour of Life in a Medieval City!", "description": "Children and adults alike will be awestruck as a stunning three-dimensional medieval world unfolds before their eyes! The sliding castle gate on the front cover serves as an entrance into a world from long ago. Inside, vibrant art and amazingly intricate pops guide readers through life as it really was for Sir Hugo, a brave and noble knight! From pages and ladies, to castles and cathedrals, this book is certain to educate and entertain readers both young and old!This sturdy 8 1/2 x 11 paper-over-board book includes multi-level detailed pops and acetate windows. This book comes packaged in a resealable polybag."}]