[{"id": "B00ADX9QCW", "genre": "Children's Books", "title": "Little Critter: Just a Snowman", "description": "Join Mercer Mayer’s classic and beloved character, Little Critter®, on his snow day! Snow is piled high and school is cancelled. But before Little Critter can build his snowman, he must help his sister wear her snow boots, his dad shovel the sidewalk, and Gator build a fort. Will Little Critter ever get to build a snowman?This storybook about Little Critter’s fun-filled snow day is an exciting tale for fans old and new. "}, {"id": "1608188906", "genre": "Children's Books", "title": "Dump Trucks (Amazing Machines)", "description": "From the heavy blades of bulldozers to the hauling bodies of dump trucks, heavy machinery and equipment have long been used in construction and demolition alike. Appealing to future builders, mechanics, and engineers, this new series explores the continued use of six Amazing Machines. Detailed photos and STEM-appropriate text examine the featured machines parts, functions, variations, and worksites. Each book also includes a labeled pictorial diagram of variations of the machine. A basic exploration of the parts, variations, and worksites of excavators, the big digging machines. Also included is a pictorial diagram of variations of excavators."}, {"id": "0061779903", "genre": "Children's Books", "title": "Michelle Obama: Meet the First Lady", "description": "Michelle obama has been by her husband's side throughout his historic presidential campaign, a dynamic personality whether she is delivering speeches or hitting the dance floor on The Ellen DeGeneres Show.  Follow the story of a hardworking girl growing up on the South Side of Chicago and how she has inspired our nation to believe in the American Dream that her life exemplifies. In her own stirring words: America should be a place where you can make it if you try.  Written by David Bergen Brophy, this in-depth biography captures the heart and soul of the First Lady behind the campaign for change. "}, {"id": "0778715604", "genre": "Children's Books", "title": "Computer Networks (Get Connected to Digital Literacy)", "description": "\"Computer Networks looks at how computer technology has changed the way we work, communicate, learn, and have fun. The World Wide Web, search engines, email, and social media have all become part of our everyday lives. The bright and engaging design helps guide readers along, and easy-to-understand text explains websites and webpages, search engines, and email systems. Online security is a key area of focus, and advice is included on staying safe online. \"Stretch Yourself\" features give practical activities for readers to try to help reinforce learning and are not linked to specific software or operating systems. \"True Story\" features give real-world anecdotes from the world of information technology. \"Computer Hero\" features look at the groundbreaking scientists that paved the way for digital technology today.\"--"}, {"id": "0895776049", "genre": "Children's Books", "title": "Skeletons: An Inside Look at Animals", "description": "Meticulously detailed, full-color renderings of the skeletons of eighteen animals, accompanied by an informative text, answer questions about animal anatomy, characteristics, and adaptations to the environment."}]