[{"id": "0689857195", "genre": "Children's Books", "title": "Raggedy Ann's Lucky Pennies", "description": "Originally published in 1932, a colorfully illustrated adventure tells of Raggedy Ann's adventure to help a lost prince make his way out of the wood and back to his beautiful kingdom."}, {"id": "1547111070", "genre": "Children's Books", "title": "Happy 100th Birthday: Birthday Memory Book, Birthday Journal Notebook For 100 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1478771925", "genre": "Children's Books", "title": "The Spider and The Ant: An Illustrated Short Story For Children", "description": "Current New Jersey resident David M. Lujanac has not only authored this entertaining children's adventure but has also performed the story in a dinner theatre setting. Harrisburg, PA's Gallery Doshi, an intimate-but-fun dinner experience, has repeatedly sought the performances of Mr. Lujanac's stage persona, Blu Collar. In the mantle of humorist and raconteur he has performed this story while playing both roles of Spider and Ant. Known primarily for his adventure ballads, the Blu Collar side of Mr. Lujanac's duality was well-received in the area in the mid-eighties. Born in Waukegan, IL., the Waukegan Township High School graduate is the father of two, Jessie and Mick. They are to whom this book is dedicated."}, {"id": "0756951984", "genre": "Children's Books", "title": "Snowboard Champ (Matt Christopher Sports Series for Kids)", "description": "While his mother is working overseas, Matt Harper is living temporarily with his uncle in Dragon Valley, where he practices his snowboard technique and contends with a local bully."}, {"id": "B06VVG5HR3", "genre": "Children's Books", "title": "The Pirate King Of China: The Story Of Koxinga - in English & Chinese (Heroes Of China Book 8)", "description": "Cheng is clever and brave.He fights for China.But can he ever win?Children aged 2 to 5 will enjoy the story of Koxinga or Zheng Chenggong (國姓爺), who defeated the Dutch to rule the island of Taiwan.This bilingual book is part of the Heroes of China series in which Jillian Lin retells tales of famous Chinese figures so they are easy and fun to read. Beautiful illustrations make these books wonderful early readers or read-aloud stories in English and Chinese.Other titles in the series include:The First Emperor Of China (Qin Shihuang)The Wise Teacher Of China (Confucius)The Music Man Of China (Zhu Zaiyu) The Clever Doctor Of China (Hua Tuo)The Girl Emperor Of China (Wu Zetian)The Star Gazer Of China (Zhang Heng)The Happy Sailor Of China (Zheng He) Also available as e-books on www.amazon.com. For more information, visit www.jillianlin.com"}]