[{"id": "0531239225", "genre": "Children's Books", "title": "Cyberbullying (True Books)", "description": "With the rapid increase in internet access in recent years, cyberbullying has become a major problem for millions of young people. Readers will find out about the many different types of cyberbullying, from posting unflattering photos online to sending threatening text messages. They will also learn why it is important to avoid these activities and what they can do if they are victims of cyberbullying."}, {"id": "1619634074", "genre": "Children's Books", "title": "I Love You Night and Day", "description": "When you love someone, you want the whole world to know. Through good times and bad, rain or shine, love is unconditional.I love you wild, I love you loud,I shout it out and I feel proud. A lyrical text from Smriti Prasadam-Halls is beautifully paired with illustrations from an exciting new talent, Alison Brown. Share this beautiful book-perfect for story time, bedtime, or anytime-with someone you love!"}, {"id": "1423117522", "genre": "Children's Books", "title": "A Pot o' Gold: A Treasury of Irish Stories, Poetry, Folklore, and (of Course) Blarney", "description": "Though it may only be a small emerald isle in the middle of the sea, Ireland’s heritage is very large indeed.  Its rich history of literature and lore has inspired imaginations for hundreds of years.  In A Pot o’ Gold, noted writer Kathleen Krull and beloved illustrator David McPhail bring this legacy to life.  Created for families, this anthology compiles classic and rare examples of Irish culture, including stories, poems, songs, recipes, and even a little blarney.  From legends of leprechauns and fairies to the classic poetry of Yeats and Joyce, the treasures herein invite children and parents, brothers and sisters\u0097even grandparents and grandchildren\u0097to share the wonders of Ireland."}, {"id": "160060255X", "genre": "Children's Books", "title": "Sacred Mountain: Everest", "description": "Mount Everest - a place of mystery, majesty, and unparalleled beauty - rises into the sky higher than any other mountain on Earth. Many stories have been told about the dangers and triumphs of climbing to the summit; but few have been written about the Sherpa, the people who have lived on the mountain for centuries and consider it sacred. Known for their bravery, strength, and skill in navigating the mountain s treacherous slopes, Sherpas have played a crucial role in Mount Everest s exploration since the 1920s. In recent years, however, increasing tourism has threatened the mountain s fragile ecosystem. The Sherpa now face the challenge of restoring and protecting this sacred mountain for their future and for the world. With stunning photographs and engaging text, Scared Mountain presents a unique picture of Mount Everest its history, its ecology, and especially its people that will captivate readers of all ages."}, {"id": "0060278846", "genre": "Children's Books", "title": "The Story of Valentine's Day", "description": "Relates the history and describes the customs of this holiday from its beginning in Roman times to the present, and includes directions for making a paper valentine and sugar cookies"}]