[{"id": "B00PJ2JR62", "genre": "Children's Books", "title": "The Children's Book of Islam Part One", "description": "This book is a clear and lucid book that will provide children with a firm grounding in the basic principles of Islam. It covers the essentials of Islamic faith: belief in Allah, His Prophets, His Holy Books, Angels, life after death and the Five Pillars of Islam.A workbook setting out questions on elements of each chapter is also included."}, {"id": "B01J882AWU", "genre": "Children's Books", "title": "Diary of an Angry Alex: Book 14 [An Unofficial Minecraft Book] (Minecraft Tales 87)", "description": "The Big Cleanup and Herobrine's BeaconAlex and the rest have to clean up the mess from the previous book but when Herobrine and Steve leave Alex to do most of the work, she gets angry and decides to find out what Herobrine is up to. She discovers a mysterious beacon and just knows Herobrine is behind this. Alex doesn't trust it one bit. What is Herobrine planning to do with this beacon and will they ever finish cleaning? Find out what happens in the Diary of an Angry Alex 14!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books, minecraft story mode, minecraft gift."}, {"id": "B00AWF0MYC", "genre": "Children's Books", "title": "Lizzie and Pickles", "description": "Brilliant picture book.Lizzie and Pickles are two frogs who live on the same pond, they don't like each other at first.This is the tale of how they became friends.Little ones love this book."}, {"id": "0544610970", "genre": "Children's Books", "title": "Curious George Goes Fishing", "description": "Inspired by a vignette in the classic Curious George Flies a Kite, this amusing episode shows George at his curious best trying to catch a fish."}, {"id": "076609183X", "genre": "Children's Books", "title": "Investigating Cybercrime (Crime Scene Investigators)", "description": "Cybercriminals are criminals in the truest sense of the word. However, their techniques are highly specialized and technical. Their crimes are high-impact and often global, but, simultaneously, they are difficult to trace, often leading investigators on thrilling chases in an underworld society of coders and hackers. To combat the devastating work of cybercriminals, the need for cybercrime investigators has increased exponentially. This book will introduce readers to the dark world of cybercrime, the various disguises cybercrime can take, and the increased need to combat cybercrime, as well as highlight the fascinating world of cybercrime investigation, including training, education, real-world cases, and typical salary ranges."}]