[{"id": "0316258210", "genre": "Children's Books", "title": "Ever After High: Once Upon a Time: A Story Collection", "description": "Read these exclusive introductions to all your favorite characters to find out what their lives are like at home! A new chapter is about to begin at Ever After High, and all the students are preparing to start their Legacy Year. In just a few weeks it will be Legacy Day when they will sign the Storybook of Legends and commit to live out their fairy-tale destiny, repeating the famous stories of their parents.This volume collects together for the first time 12 short tales, including five BRAND-NEW stories. For the first time, find out what Dexter and Darling Charming, Cedar Wood, Lizzie Hearts and Kitty Cheshire were doing just before school started. This collection also includes the stories of Apple White, Raven Queen, Madeline Hatter, Briar Beauty, Ashlynn Ella and Hunter Huntsman, and the fairy tale The Tale of Two Sisters, which were previously only available online.Don't miss this Once Upon a Time special edition of enchanting stories by bestselling and Newbery honor-winning author Shannon Hale."}, {"id": "B0128MBGZU", "genre": "Children's Books", "title": "101 Dalmatians: Lucky's Busy Afternoon (Disney Short Story eBook)", "description": "Dalmatians Perdita and Pongo are going to a neighborhood party for a few hours with their human pets. Perdita is worried about leaving their fifteen puppies behind, but Pongo assures her they will be just fine with Nanny looking after them. But when Nanny takes the puppies to a playground, no one notices Lucky chase a butterfly over a wall and away from the playground! What sort of trouble will he get into? Don't miss this hilarious story as Lucky enjoys his busy day around town."}, {"id": "1684052475", "genre": "Children's Books", "title": "Powerpuff Girls: The Bureau of Bad", "description": "Sick and tired of the Powerpuff Girls always saving the day, baddies unite at the TOWNSVILLE HIGH VILLAINS COUNCIL, determined to take the girls down once and for all.Gather round the table and hear the tales of the times Townsville's worst ALMOST defeated the girls... starting with MOJO JOJO's tale of near-victory! Then it's the Fashionistas' turn as they weave a tale of the time they kidnapped the Professor and forced him to create the perfect, untearable fabric with which to capture those pesky Powerpuff Girls once and for all."}, {"id": "1974027244", "genre": "Children's Books", "title": "Ronaldo: A Boy Who Became A Star. Inspiring children book about Cristiano Ronaldo - one of the best soccer players in history. (Soccer Book For Kids)", "description": "Ronaldo: A Boy Who Became a Star This is the inspiring children story of Cristiano Ronaldo, a boy who would become a star.  Born in a poor family, the small boy decided to follow his dream, worked hard and overcame all obstacles to become one of the best soccer players in history. Perfect gift for all soccer fans. Perfect illustrated book to teach children to work hard to make their dreams come true. Learn about Ronaldo, and learn how to be successful doing what you love. Get This Book Now and Enjoy the story of Cristiano Ronaldo!"}, {"id": "0618240349", "genre": "Children's Books", "title": "Mosque", "description": "An author and artist who has continually stripped away the mystique of architectural structures that have long fascinated modern people, David Macaulay here reveals the methods and materials used to design and construct a mosque in late-sixteenth- century Turkey. Through the fictional story and Macaulay’s distinctive full-color illustrations, readers will learn not only how such monumental structures were built but also how they functioned in relation to the society they served. As always, Macaulay has given a great deal of attention to the relationship between pictures and text, creating another brilliant celebration of an architectural wonder."}]