[{"id": "B077SKW5LM", "genre": "Children's Books", "title": "The grey planet", "description": "Intoduction.The life of all mankind depends on the state of nature as a whole so we all have to pay a proper attention to this issue. Environmental pollution is one of the main problems of humanity which entails natural disasters to prevent which is simply impossible. The rivers are filled with waste from the production factories, forests are cut down, the exhaust gases pollute the air - all of these issues one way or another affect our nature. In order to get money and status people kill animals eliminating entire species. People forget that endangered species of animals can cause natural disbalance.Nowadays there are many organizations that promote environmental culture. Which campaign people to protect and care of the environment, organizing charity events to protect endangered animals. They even make websites where they state the problem properly, tell about the horrific consequences and suggest possible solutions to these problems."}, {"id": "1624310036", "genre": "Children's Books", "title": "Wind Turbine Service Technician (21st Century Skills Library: Cool Stem Careers)", "description": "A guide to what a wind turbine services technician does and how to become one."}, {"id": "0843121017", "genre": "Children's Books", "title": "Meet the Adelies (Happy Feet)", "description": "Mumble the Emperor penguin becomes friends with the Adelie penguins, who travel with him back to his own land to help him solve the mystery of what happened to the fish."}, {"id": "B06WWH3LFF", "genre": "Children's Books", "title": "Rutabaga: The Adventure Chef (Issues) (2 Book Series)", "description": "In a world where there are dragons, wyverns, and haunted squash, you'd figure someone would have recipes for them, right? Rutabaga and his magic cooking pot, Pot, join young adventurers Winnifred, Manny, and Beef on a quest to defeat a dragon, discover new ingredients, find monsters to have for and/or to dinner, and to save the day through cooking. Rutabaga will dare any danger to uncover new tastes, and there's a whole world full of food to try-from roasted mud leech to spider soup to peanut butter on crackers. His heroic recipes combine real ingredients, fantasy ingredients, and real ingredients that sound fantastical. Rutabaga the Adventure Chef is the perfect adventure for any kid grossed out when something weird shows up on the dinner table."}, {"id": "1524768448", "genre": "Children's Books", "title": "Birthday Cake Chase! (Blaze and the Monster Machines) (Pictureback(R))", "description": "It's a birthday celebration in this storybook featuring the characters from Nickelodeon's Blaze and the Monster Machines--plus party invitations and stickers!AJ, Blaze, Stripes, Starla, Zeg, and Gabby from Nickelodeon's Blaze and the Monster Machines celebrate Darington's birthday with a party and a huge cake! Boys and girls ages 3 to 7 will love this full-color storybook featuring a foil cover, birthday invitations, and stickers. It makes a great gift or fun party favor!"}]