[{"id": "1440501459", "genre": "Science Fiction & Fantasy", "title": "The Guide to Writing Fantasy and Science Fiction: 6 Steps to Writing and Publishing Your Bestseller!", "description": "Science fiction and fantasy is one of the most challenging--and rewarding!--genres in the bookstore. But with New York Times bestselling author Philip Athans and fantasy giant R. A. Salvatore at your side, you’ll create worlds that draw your readers in--and keep them reading! Just as important, you’ll learn how to prepare your work for today’s market. Drawing on his years of experience as one of the most acclaimed professionals in publishing, Wizards of the Coast editor Athans explains how to set your novel apart--and break into this lucrative field. From devising clever plots and building complex characters to inventing original technologies and crafting alien civilizations, Athans gives you the techniques you need to write strong, saleable narratives.Plus! Athans applies all of these critical lessons together in an unprecedented deconstruction of a never-before-published tale by the one and only R. A. Salvatore!There are books on writing science fiction and fantasy, and then there’s this book--the only one you need to create strange, wonderful worlds for your own universe of readers!"}, {"id": "B01NGZETQE", "genre": "Science Fiction & Fantasy", "title": "Chaacetime: The Origins - Book 2: A thrilling Hard Science Fiction Detective Trilogy (The Space Cycle - A Metaphysical & Hard Science Fiction Series)", "description": "How can you save your city when you can’t even trust reality?Baley and Paul make every effort to solve the \"Problem\", and prevent the tragic death of other children. Their investigation leads them from an underground sect to a hurricane come from nowhere, which seems to be the cause of suicides.Meanwhile Baley feverishly pursues all leads, harassing the children she considers \"at risk\" and their families. She even comes to take advice from her own daughter, who thinks the Machine has developed a Machiavellian plan to keep humanity under Its control. For Iris, It is necessarily responsible of the Problem.As Paul becomes more and more aloof since he saw a strange creature in the hurricane, Iris comes into contact with a half-man-machine-being, Baley is on the brink of madness, and the Machine is secretly working with Other. All spaces are connected ...Who will be able to prevent the advent of Nothingness, the end of all life?Chaacetime: The Origins - Book 2 is the gripping continuation of a series of metaphysical sci-fi trilogy that has already attracted more than 10,000 readers in a few months.Buy Chaacetime: The Origins, Book 2 to take a plunge into the impossible today!"}, {"id": "B077YHNXT1", "genre": "Science Fiction & Fantasy", "title": "A Lost Artifact (The Keeper Book 3)", "description": "In the sequel to Ruins In Italy, certain tough decisions made by Alexa may mean the end of her loyalty to the Guardian Institute.It's been two-and-a-half years since Alexa walked out of that correctional center and into the \"Grand Guardian's Insurance Bank,\" which later came to be known to her as the Homebase, a secure location for the rarest and most dangerous artifacts.No longer the lost teenager she once was, Alexa's life has gone through a complete one-eighty. For one, Matthew can no longer be by her side due to unseen circumstances. Secondly, she's no longer working for or with or at the Institute. In fact, one could say she completely severed her ties to the Institute. It's not that she's a rogue agent....Okay, maybe she is. But in the hunt to find her father and help Matthew, she's willing to do just about anything.Word count: approx. 25,500 words"}, {"id": "B076LCVWVG", "genre": "Science Fiction & Fantasy", "title": "Spirits Collide (The Kiche Chronicles Book 2)", "description": "The gates of the Netherworld have been opened and demons, once dead, are reborn. As the Misty Woods encroach on the Spirit Mount, a battle for control of the Mount will take place in The Valley of Blood. As Ayas prepares the valley for the coming war, Pamoon will have to convince enemies, old and new, to fight alongside her, if they have any chance in defeating the demons.In this second installment of the Kiche Chronicles, Pamoon must discover and control her power of fire if she has any chance of surviving. But with power comes consequences. She must come to grips with the demons from her past before she can battle the ones in her present, but most of all, she must believe in who she is to become: she must believe she is destined to become the Kiche—the Sky Spirit Goddess."}, {"id": "1250001404", "genre": "Science Fiction & Fantasy", "title": "Stormdancer (The Lotus War Book One)", "description": "The first in an epic new fantasy series, introducing an unforgettable new heroine and a stunningly original dystopian steampunk world with a flavor of feudal Japan.A DYING LAND The Shima Imperium verges on the brink of environmental collapse; an island nation once rich in tradition and myth, now decimated by clockwork industrialization and the machine-worshipers of the Lotus Guild. The skies are red as blood, the land is choked with toxic pollution, and the great spirit animals that once roamed its wilds have departed forever. AN IMPOSSIBLE QUEST The hunters of Shima's imperial court are charged by their Shogun to capture a thunder tiger – a legendary creature, half-eagle, half-tiger. But any fool knows the beasts have been extinct for more than a century, and the price of failing the Shogun is death. A HIDDEN GIFT Yukiko is a child of the Fox clan, possessed of a talent that if discovered, would see her executed by the Lotus Guild. Accompanying her father on the Shogun's hunt, she finds herself stranded: a young woman alone in Shima's last wilderness, with only a furious, crippled thunder tiger for company. Even though she can hear his thoughts, even though she saved his life, all she knows for certain is he'd rather see her dead than help her. But together, the pair will form an indomitable friendship, and rise to challenge the might of an empire."}]