[{"id": "B00EJWD31S", "genre": "Science Fiction & Fantasy", "title": "Black Knight Down (Stone Soldiers #5)", "description": "When a coven of witches conspire to bring down a prehistoric satellite orbiting the earth for millennia, the Stone Soldiers spring into action, encountering a mysterious, superhuman priest spouting dire warnings that the Black Knight must not be opened.  Defying his orders to leave the satellite in the hands of the Air Force, Colonel Mark Kenslir launches his own investigation into the satellite's origins and finally discovers the dark forces it contains.To combat the supernatural, the U.S. Military relies on a Joint Forces Unit of psychics and supersoldiers. Based in Miami, Florida, Detachment 1039 responds to threats conventional forces cannot handle. Stone Soldiers- men turned to living stone- work alongside a werewolf, a cryokinetic, a vampire and their enigmatic leader: Colonel Mark Kenslir- a man kept immortal by a series of curses and possessing an innate resistance to magic. Together, they are America's first line of defense from the magical and the mythical."}, {"id": "1601256566", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Map Pack: Cave Chambers", "description": " Pathfinder Map Pack: Cave Chambers contains 18 full-color, 5 x 8-inch map tiles, stunningly crafted by cartographer Jason A. Engle, that combine to form a modular, customizable underground complex filled with stalagmite-lined halls, deadly ravines, monster lairs, and more."}, {"id": "1607012154", "genre": "Science Fiction & Fantasy", "title": "The Alchemy of Stone", "description": " Mattie, an intelligent automaton skilled in the use of alchemy, finds herself caught in the middle of a conflict between gargoyles, the Mechanics, and the Alchemists. With the old order quickly giving way to the new, Mattie discovers powerful and dangerous secrets — secrets that can completely alter the balance of power in the city of Ayona. This doesn't sit well with Loharri, the Mechanic who created Mattie and still has the key to her heart — literally."}, {"id": "1785651870", "genre": "Science Fiction & Fantasy", "title": "Originators (Netherspace #2)", "description": "Contact with an alien race, the Gliese, has been made, but communication is impossible. There is trade, but on seemingly inexplicable terms; anti-gravity technology was traded for a bicycle tyre. As we begin to colonize the stars, we're still dependant on the mysterious aliens who we still do not understand. It falls upon the unlikely team of a conceptual artist, Marc, and assassin, Kara, to embark on a mission that will unearth the mystery of the Gliese."}, {"id": "0345391810", "genre": "Science Fiction & Fantasy", "title": "The Restaurant at the End of the Universe", "description": "\"DOUGLAS ADAMS IS A TERRIFIC SATIRIST.\"--The Washington Post Book WorldFacing annihilation at the hands of the warlike Vogons is a curious time to have a craving for tea. It could only happen to the cosmically displaced Arthur Dent and his curious comrades in arms as they hurtle across space powered by pure improbability--and desperately in search of a place to eat.Among Arthur's motley shipmates are Ford Prefect, a longtime friend and expert contributor to the Hitchhiker's Guide to the Galaxy; Zaphod Beeblebrox, the three-armed, two-headed ex-president of the galaxy; Tricia McMillan, a fellow Earth refugee who's gone native (her name is Trillian now); and Marvin, the moody android who suffers nothing and no one very gladly. Their destination? The ultimate hot spot for an evening of apocalyptic entertainment and fine dining, where the food (literally) speaks for itself.Will they make it? The answer: hard to say. But bear in mind that the Hitchhiker's Guide deleted the term \"Future Perfect\" from its pages, since it was discovered not to be!\"What's such fun is how amusing the galaxy looks through Adams' sardonically silly eyes.\"--Detroit Free Press"}]