[{"id": "0789424789", "genre": "Children's Books", "title": "Annie Ate Apples", "description": "A delightful pop-up book features witty activities and charming artwork to accompany Annie and her friends as they do amusing things, from Dawn dining with dogs to Peter parading as a parsnip."}, {"id": "1553655338", "genre": "Children's Books", "title": "The Little Hummingbird", "description": "This inspiring children’s book is based on a South American indigenous story about a courageous hummingbird who defies fear and expectations in her attempt to save the forest from fire. The illustrated story is supplemented by a natural and cultural history of hummingbirds, as well as an inspiring message from Nobel Peace Prize winner Wangari Maathai. The evocative artwork by internationally renowned Haida artist Michael Nicoll Yahgulanaas complements this optimistic tale that encourages everyone to take responsibility for their home and the planet."}, {"id": "1406344869", "genre": "Children's Books", "title": "The Skeleton Pirate", "description": "Shiver me timbers and swash me buckles - it's time for an adventure with the Skeleton Pirate!The Skeleton Pirate is the Terror of the Seas and he'll never be beaten! Until, that is, he gets beaten by an unruly bunch of pirates and thrown overboard. Down in the depths of the sea he embarks on an adventure with a beautiful mermaid, a whale with tummy ache and a golden ship full of treasure... Full of humour and irrepressible energy this is the perfect picture book for all would-be little pirates!"}, {"id": "0996215247", "genre": "Children's Books", "title": "Bonnie, Our Backyard Bunny", "description": "Bonnie, Our Backyard Bunny is a based-on-truth tale about a rabbit, her world, and her gratitude for it. The tale conveys a sense of place in the natural world to children, as well as sense of safety and \"rightness.\" Bonnie was born from an oral storytelling by an environmental educator and storyteller. The story then engaged one of Cuba's most well-known and best-loved artists, who offered to illustrate the book because his work shares the same mission: to convey that everything in the world has a place, and everything fits together. The work is a collaboration across cultures. It is also published in Spanish as Bonita, La Conejita de Mi Patio."}, {"id": "1454922001", "genre": "Children's Books", "title": "Diva Delores and the Opera House Mouse", "description": "Tra la la la! Can an opera house mouse and a disrespectful diva make beautiful music together? Maybe . . . if she learns some manners! Fernando loves Mozart, Puccini, and Strauss, and lending a paw at the old opera house. Unfortunately, diva Delores wants no help from a mouse. She craves glamour and spotlights and praise—and she’s getting her chance to take center stage. But it’s all going wrong; she’s missing her entrance and flubbing her song. Fernando can save her—but only if Delores behaves. Will Delores hit a sour note? Or will she team up with Fernando . . . and bring down the house?  "}]