[{"id": "0789206978", "genre": "Children's Books", "title": "Women Writers (Women in the Arts)", "description": "Professional writing has traditionally been a male occupation, but despite restrictions exceptional women produced important and influential poetry, stories, novels, and plays. From ancient Sumerian priestess Enheduanna's poetic praises for her patron goddess, Inanna, to 19th-century English novelist Jane Austen's witty romances that quietly challenged social convention, and from Beatrix Potter's whimsical and timelessly popular animal tales to Harlem Renaissance writer Zora Neale Hurston's vivid and powerful portrayals of the African-American experience, the written word has been an effective way for women to express their own perspective on such universal themes as love, relationships, faith, death, and the meaning of life."}, {"id": "0486227456", "genre": "Children's Books", "title": "The Illuminated Alphabet (Dover Coloring Book)", "description": "In the Middle Ages, the alphabet was a popular vehicle for amusement and instruction, as well as beauty. Precisely rendered from treasured medieval manuscripts by one of New York's foremost designers, this ready-to-color collection features 50 initial letters aglow with fanciful devices, symbolic elements, floral interlacements, biblical scenes, grotesque animals, portraits of war and play, and other fascinating embellishments.Use crayons, paints, markers, and other creative media to breathe colorful new life into each ancient letter. These royalty-free medieval designs will also inspire ideas for stained glass, mosaics, textiles, and a wide variety of graphics projects!"}, {"id": "1543506070", "genre": "Children's Books", "title": "Hockey Is a Numbers Game: A Fan's Guide to Stats (Know the Stats)", "description": "What does “true plus/minus” have to do with hockey greatness? More than you think. In this fun and smart look at basketball, you will discover stories and uncover facts that will help you better understand and enjoy every pass, dribble, and shot all the more."}, {"id": "1499806205", "genre": "Children's Books", "title": "Pearl Harbor (Blast Back!)", "description": "Blast back to the past and learn all about the attack on Pearl Harbor.When people think about Pearl Harbor, things like WWII and Japan may come to mind. But why did the attack occur, and what happened as a result? This engaging nonfiction book, complete with black-and-white interior illustrations, will make readers feel like they've traveled back in time. It covers everything from the history of WWII to the details of the attack, and more. Find out interesting, little-known facts such as how the U.S. aircraft carriers that the Japanese had planned to attack weren't on base at the time, and how the surviving structure of one of the U.S. ships still leaks fuel to this day. The unique details, along with the clever interior illustrations, make this series stand out from the competition. "}, {"id": "1943645035", "genre": "Children's Books", "title": "Am I Like You?", "description": "Join mom and her son on one of their regular nature walks, as they play their favorite outdoor game, 'Am I like you?' As they happen upon and observe different birds along the trail, each with their own unique personality traits and behaviors, they consider which one they feel most like on that day\u0097a journey not just of trail and terrain, but also of exploration into self-discovery, affinity and identity. As the story unfolds, young children will have the opportunity to see parts of themselves in the wonderfully-illustrated feathered friends, and ultimately be able to take a little quiz on a special dedicated title website, to see which birds they are most like.From renowned birding author, Laura Erickson and the Cornell Lab Publishing Group's very own President and author, Brian Scott Sockin, Am I Like You? is a wonderful new picture book that empowers parents and children to explore the world of birds together.As with all Cornell Lab Publishing Group books, 35% of the net proceeds from the sale of Am I Like You? goes directly to the Cornell Lab to support projects such as children’s educational and community programs."}]