[{"id": "1910512583", "genre": "Children's Books", "title": "Chinese New Year (Festivals Around the World)", "description": "Learn about the diverse and vibrant festivals that are celebrated around the world. This series encourages children to consider religious beliefs and cultural practices via easy to read text and informative, full color images."}, {"id": "143393969X", "genre": "Children's Books", "title": "Tony Stewart (Superstars of NASCAR)", "description": "Tony Stewart began winning races when he was just 16 years old. At 24, he was the first driver to win three championships in one season. Today, Tony runs for successful sprint car teams that have won several championships. Tony even owns a racetrack. In this book, readers will find out even more fascinating facts about this NASCAR superstar."}, {"id": "1481432540", "genre": "Children's Books", "title": "Love & Gelato (Teen's Top 10 (Awards))", "description": "A New York Times bestseller A summer in Italy turns into a road trip across Tuscany in this sweeping debut novel filled with romance, mystery, and adventure.Lina is spending the summer in Tuscany, but she isn’t in the mood for Italy’s famous sunshine and fairy-tale landscape. She’s only there because it was her mother’s dying wish that she get to know her father. But what kind of father isn’t around for sixteen years? All Lina wants to do is get back home. But then Lina is given a journal that her mom had kept when she lived in Italy. Suddenly Lina’s uncovering a magical world of secret romances, art, and hidden bakeries. A world that inspires Lina, along with the ever-so-charming Ren, to follow in her mother’s footsteps and unearth a secret that has been kept from Lina for far too long. It’s a secret that will change everything she knew about her mother, her father—and even herself. People come to Italy for love and gelato, someone tells her, but sometimes they discover much more."}, {"id": "160886782X", "genre": "Children's Books", "title": "Munchkin Vol. 1", "description": "Kill the monsters. Steal the treasure. Stab your buddy.Based on the immensely popular Steve Jackson card game, Munchkin comes to comics! Munchkin takes place in a mashup of genres. Originally a satire of fantasy roleplaying, it has since then taken on non-fantasy and non-gaming elements. Characters in Munchkin change constantly but never permanently. What do Munchkins do? They play for the win. They are rules lawyers. They backstab. They gloat. They whine when someone else backstabs or gloats. Munchkins are emotional. Munchkins may be clever, but they are never wise. Munchkins have short attention spans. Munchkins may be brave in the face of awful odds, but they are even braver when beating up crippled goblins for their lunch money. If a Munchkin seems to show mercy, it's because he was bored or distracted. After all, even stomping an ant helps you level up.  Welcome to the world of Munchkin. It’s a laugh a minute, pal. "}, {"id": "0395292034", "genre": "Children's Books", "title": "Paddle-to-the-Sea (Sandpiper Books)", "description": "A young Indian boy carves a little canoe with a figure inside and names him Paddle-to-the-Sea. Paddle's journey, in text and pictures, through the Great Lakes to the Atlantic Ocean provides an excellent geographic and historical picture of the region."}]