[{"id": "B00EBBQTPE", "genre": "Children's Books", "title": "Cardboard Rocket (Kids from the Sound Book 2)", "description": "When Mike, Melissa and Hector find out that their old robot friend, R22-B, is in trouble they take off on a rocket ride into the past to save him. The only problem is that somebody has been tinkering with time and they find their future, as well as that of the planet Earth, may be gone..."}, {"id": "0983274002", "genre": "Children's Books", "title": "Ferdinand Frog's Flight", "description": "Everyone has a dream: Something he wishes he could do.   Ferdinand Frog dreamed of flying, but things that flew had wings. Frogs don't.   Did Ferdinand's dream remain just that, an unfulfilled dream?"}, {"id": "0985957735", "genre": "Children's Books", "title": "Gramps Has A Ponytail (English and Spanish Edition)", "description": "Gramps Has A Ponytail  This is a fun adventure of Sam spending the day with her Gramps, who happens to be the notorious bassist Harvey Brooks. Harvey has accompanied the likes of Bob Dylan, Jimi Hendrix, The Doors, Seals and Croft, Miles Davis, Judy Collins, Richie Havens, Janis Joplin and Cass Elliot to name a few.  This enduring story takes place in New York is fully illustrated and includes English and Spanish in one book."}, {"id": "B01MSTH4XO", "genre": "Children's Books", "title": "The Story of Saint Patrick (Ireland's Best Known Stories In A Nutshell Book 3)", "description": "Kidnapped as a boy and sold into slavery in Ireland, Patrick spent many brutal years away from his family and friends and should have hated the Irish people.Yet having escaped, he was drawn back to challenge the High King, his warriors and the great druids who fought against him with all their magic powers.This was a battle Patrick had to win and it changed a way of life forever.“The ‘In a Nutshell’ series is a wonderful way to introduce children to some of Ireland’s best-loved myths and legends – it’s a history lesson, yes, but a fun, colorful one, and the witty tone means it will appeal to mums and dads too. Highly recommended’ Irish Independent"}, {"id": "1925422054", "genre": "Children's Books", "title": "Fleurella's Broken Wing: The Fairy who fell from the sky", "description": "\"In the late afternoon, as the sunset approached, all of the Fairies started to fly up from the fields and gardens, and headed back to Fairyland. To the people below, they looked like a glittering cloud of dragonflies skimming on the breeze.\" The magic of fairies has always excited and charmed children of all ages. In Niki Palmer’s The Fairy Who Fell from The Sky: Fleurella's Broken Wing, we are introduced to the Flower Fairy Fleurella and her rich and fabled world. Fairy stories are a wonderful way to inspire and educate children, a Fairy story is one of the most popular children’s books for younger readers. In this first instalment of The Fairy Who Series, readers will be enchanted as they find themselves adventuring on with Fleurella as she seeks the help of woodland creatures to mend her injured wing. Each page will transport the reader to the land of the fairies through delightful prose and breath-taking illustrations. Fleurella's Broken Wing is a beautiful Fairytale book."}]