[{"id": "1492659835", "genre": "Children's Books", "title": "I Love My Ohio Valentine", "description": "It's Valentine's Day in Ohio, and I just want to say that I love you SO MUCH, and in SO MANY ways! Experience boundless and unconditional love as you travel around your home state in this sweet and colorful story.  Based on Marianne Richmond's bestselling book \"I Love You So...,\" I Love My Ohio Valentine celebrates a parent's love for their child by comparing their love to special characteristics of where they live! This heartwarming book puts into words the often indescribable quality of boundless, steady and unconditional love while using familiar landmarks around them. I Love My Ohio Valentine is the perfect way to share your love with a treasured child this Valentine's Day!"}, {"id": "0439478901", "genre": "Children's Books", "title": "Goldie Locks has chicken pox", "description": "Goldie Locks has chicken pox;  from head to toe were polka dots....  When Goldie Locks spies her first spot, her mother knows it must be chicken pox. She immediately calls the Three Bears, apologizing for the chair, to see if Baby Bear has chicken pox, too. Soon, a steady stream of storybook favorites -- from Little Bo Peep to Henny Penny -- stop by to visit the bedridden child. All the while, Goldie Locks tries to ignore her brother's relentless teasing about her spotted exterior. But as more visitors arrive, her pox-free brother, in a fit of jealousy at the attention his sister is getting, intensifies his teasing, until suddenly all eyes are on him, but not for the reason he thinks..."}, {"id": "0307205002", "genre": "Children's Books", "title": "20,000 Leagues Under The Sea (Crayola Kids Adventures)", "description": "Trapped aboard a fantastic submarine with a mad sea captain, a French professor and his companions come face to face with exotic ocean creatures and strange, forbidden sights hidden from the world above. This is the classic deep sea adventure from the world's first and best science-fiction author."}, {"id": "B00GTR8NKM", "genre": "Children's Books", "title": "Children's book: Abbie Goes To The Zoo", "description": "Meet Abbie as she goes to the zoo. She has so much fun looking at all the animals. She also gets to pet and feed some of them. It is a great picture book for preschool age children! It is packed with visually stimulating pictures! They will enjoy looking at pictures of all the animals Abbie sees while she is at the zoo! It is also very educational! There are fun facts on every page that teach children a little bit about the animals in the pictures!"}, {"id": "1681521318", "genre": "Children's Books", "title": "The Car Race (Let's Race)", "description": "A perfectly age-appropriate introduction to reading informational text, the Let's Race series brings the excitement of vehicles and racing to kids just learning to read. Up-close action photographs, carefully leveled text, and controlled vocabulary provide reading practice about \"real stuff\" for emergent readers. A photo-illustrated book for beginning readers that tells the story of a NASCAR race. Who will win? Includes a photo diagram."}]