[{"id": "B00C5R75EK", "genre": "Children's Books", "title": "Ocean Monsters (Penguin Young Readers, Level 4)", "description": "Did you know that the giant squid can grow to over forty feet long? Or that the anglerfish dangles a glowing lure above its jaws like a fishing pole to attract its prey? Learn all about some of Earth's weirdest creatures: the giant squid, the torpedo ray, the vampire squid, the electric stargazer, and more! WARNING: DO NOT READ IF YOU ARE SCARED OF FISH GUTS. "}, {"id": "B077L8MV32", "genre": "Children's Books", "title": "Ant and ElephAnt", "description": "Ant and ElephAnt  -- Mini is tiny ant. She goes to school every day. One day she was coming from school and suddenly her boat was drowned. She started swimming in the river. A Elephant was taking bath in the river. His name is Hati pati. He took water in his trunk and Mini, who was in the river entred in his trunk.What will happen to Mini? Will Mini Become large like Hati pati? Can Mini and Hati pati become Friends?Lets read....."}, {"id": "076364742X", "genre": "Children's Books", "title": "God's Dream", "description": "Now in a board book edition! With warmth and humor, Archbishop Tutu distills his philosophy of unity and forgiveness for the very young. (Ages 1-3)Archbishop Desmond Tutu has a vision of God's dream, which he shares here with the youngest of listeners. It involves people who reach out and hold each other's hands, but sometimes get angry and hurt each other -- and say they're sorry and forgive. It's a wish that everyone will see they are brothers and sisters, no matter their way of speaking to God, no matter the size of their nose or the shade of their skin. Aided by vibrant artwork evoking such images as a rainbow and a sharing circle, Tutu offers the essence of his ubuntu philosophy, a wisdom so clear and crystalline that even the smallest child can understand."}, {"id": "1429670959", "genre": "Children's Books", "title": "Baby Sea Otter Story (Baby Animals)", "description": "Use a rock to open shells. Tap, crack! Keep on trying. What's it like for sea otter pups to grow up?"}, {"id": "B00RQXS1IC", "genre": "Children's Books", "title": "P is For Penguins Happy Flappy Feet: Penguins Childrens Books", "description": "Picture books featuring wild animals help develop a child's imagination in a plethora of meaningful ways. First, the shapes and colors featured in the books will spark the child's creative spirit and potentially generate a desire to draw similar figures. Second, the picture books featuring wild creatures will likely spark questions regarding the personal preferences and proclivities of the animals. Once these questions formulate in the child's mind, she or he will likely begin to extrapolate about the answers and/or have lively conversations with his or her parent regarding the animals."}]