[{"id": "1538323427", "genre": "Children's Books", "title": "Life As a Somali American (One Nation for All: Immigrants in the United States)", "description": "In 2017, Ilhan Omar began her term in the Minnesota House of Representatives and became the first Somali-American, Muslim woman legislator in the United States. This timely book celebrates groundbreaking accomplishments of Somali Americans such as Omar, introduces readers to key points in Somalia's modern history, and provides context for current events in the United States and around the world. Readers will develop greater cultural awareness and sensitivity as they learn about complex issues that affect many Somali Americans today. They'll also explore the unique, vivid, and enriching ways Somali immigrants bring their culture to the United States. Fact boxes highlight interesting topics, while illuminating photographs bring issues into focus, ensuring this book is engaging and accessible."}, {"id": "0448462761", "genre": "Children's Books", "title": "The Small Potatoes Rock Spudstock", "description": "Small Potatoes is a hit on Disney Junior introducing pre-schoolers to music and art through their catchy music videos! This adorable 8x8 is the perfect introduction to the Small Potatoes and all of their quirky personalities! The Small Potatoes have a big gig at Spudstock and need to write a new opening number! When Ruby and Nate both come up with different songs, the Small Potatoes learn the value of teamwork to put on a great show!"}, {"id": "0750220236", "genre": "Children's Books", "title": "Living With The Weather: Rain, Wind And Storm", "description": "Zip up your raincoat, step outside and come face to face with the elements!. Follow the catastrophic trail of a tornado, find out why some homes are built on stilts, and why it's faster to fly one way across the Atlantic than the other. Also read about how people survive bad weather."}, {"id": "1600962564", "genre": "Children's Books", "title": "Anne of Avonlea, Large-Print Edition", "description": "Anne Shirley, now a schoolteacher, has begun writing stories and collecting rejection slips. She meets a rich, handsome bachelor, chases a cow, and wins a writing contest. Refusing Gilbert Blythe's marriage proposal, she begins teaching at Kingsport Ladies' College, an exclusive girls' school, where she runs into trouble with another teacher, Miss Brooke, and the Pringle clan (who turn out to be the family of the rich, handsome bachelor). Anne enjoys her adventures and makes many new friends, but eventually she decides to return to Avonlea. Newly designed and typeset in a modern 6-by-9-inch format by Waking Lion Press."}, {"id": "1615332545", "genre": "Children's Books", "title": "Sharks (I Love Animals)", "description": "Even if you don’t love sharks, it’s hard not to be impressed by their incredible strength, speed, and hunting ability. This book dives into the deep and introduces some of the most amazing species of these marine predators. Beautifully designed with detailed illustrations, this gripping book contains plenty of fascinating facts and fun activities."}]