[{"id": "0986101826", "genre": "Children's Books", "title": "The Warrior and Princess of Dreams: A Tale from Africa", "description": "You've heard of all the other princesses right, Cinderella. Rapunzel. Belle. Tiana. Pocahontas. Mulan. Ariel. Snow White. ... Now it's time to meet ONAI, princess all the way from Southern Africa. An original story about The Warrior and Princess of Dreams. So what is it all about? First issue is...........................   The Stone Palace needs a hero....   In the Mutopa Kingdom, Princess Onai is getting ready for her marriage to Prince Gomo when she is cursed by a jealous trickster and falls into an endless sleep. Trapped in the land of dreams, Onai cannot return, unless someone is brave enough to search for her and bring her back. Who will this brave warrior be? Will he get to her in time?   A phenomenal adventure from ancient lands of Zimbabwe that can be enjoyed by the whole family.    "}, {"id": "0843122390", "genre": "Children's Books", "title": "Camp Daze Mad Libs", "description": "Complete page after page of camp theme stories by supplying the parts of speech indicated, then read the entirely silly story back and roar with laughter! Remember--prepare yourself for--the funny (and not so funny) moments at camp spent with friends and counselors. Here's your chance to retell that campfire story the way you think it should really be told."}, {"id": "0761302964", "genre": "Children's Books", "title": "Troy Aikman (Millbrook Sports World)", "description": "A biography of the star quarterback, from his childhood in California through his college days at the University of Oklahoma to his professional career with the Dallas Cowboys"}, {"id": "9251094403", "genre": "Children's Books", "title": "Forest for Kids: Teaching Guide: Age 8-13", "description": "This teaching guide aims to introduce students aged 8–13 to the many aspects and roles of forests, while allowing teachers to meet curricular objectives within the fields of science, geography and citizenship, among others. The teaching modules focus on defining forests, investigating their role in the water cycle, exploring some of their products and introducing students to sustainable forest management. Drawing inspiration from the internationally recognized enquiry method, the modules promote “learning by doing”, in classrooms or under the trees, although reading and writing exercises are also included. The teaching guide is complemented by a richly illustrated learning guide for pupils."}, {"id": "B0776JJ33R", "genre": "Children's Books", "title": "Up & Down: The Adventures of John Jeffries, First American to Fly", "description": "The incomparable Don Brown chronicles the ballooning misadventures of John Jeffries, scientist and aviation pioneer.Swept up by the European ballooning craze of the 1780s, Dr. John Jeffries longed to become the first person to fly across the English Channel. But first he had to outwit a rascally copilot, keep the balloon from bursting, and avoid crashing into the sea. The good doctor's quick-thinking solutions will surprise young readers--and keep them giggling. Orbis Pictus and Sibert Honor winner Don Brown tells this quirky true story with his usual accuracy and heart."}]