[{"id": "1684012279", "genre": "Children's Books", "title": "Orbit's First Day of School", "description": "It's Houston Astros mascot Orbit's first day of school and he is SO excited to learn about new things here on Earth! But new places can be a little bit scary, too. Join Orbit as he learns how to make new friends, love his new home, and embrace what makes him different because it is also what makes him special!"}, {"id": "0060530944", "genre": "Children's Books", "title": "The Graveyard Book", "description": "The original paperback edition of a perennial favorite, The Graveyard Book by Neil Gaiman, which has sold more than one million copies and is the only novel to win both the Newbery Medal and the Carnegie Medal. Bod is an unusual boy who inhabits an unusual place—he's the only living resident of a graveyard. Raised from infancy by the ghosts, werewolves, and other cemetery denizens, Bod has learned the antiquated customs of his guardians' time as well as their ghostly teachings—such as the ability to Fade so mere mortals cannot see him.Can a boy raised by ghosts face the wonders and terrors of the worlds of both the living and the dead? The Graveyard Book is the winner of the Newbery Medal, the Carnegie Medal, the Hugo Award for best novel, the Locus Award for Young Adult novel, the American Bookseller Association’s “Best Indie Young Adult Buzz Book,” a Horn Book Honor, and Audio Book of the Year."}, {"id": "B00C2IC0CO", "genre": "Children's Books", "title": "Islamic Mosques (Let's Find Out about)", "description": "This work introduces places of worship found around the world. The books explain the general features of the buildings and look at how and why the building is used by the community. Examples from around the world are featured from famous buildings to smaller everyday buildings. It includes case studies from around the world looking at how people worship in the relevant building, and features a wide range of stunning photographs depicting the buildings, key objects and worshippers. It contains a world map showing areas in which the religion is practised."}, {"id": "0688102565", "genre": "Children's Books", "title": "African Beginnings", "description": "From the ancient kingdom of Kush, whose black pharaohs ruled Egypt for nearly a century, to the sixteenth-century empire of the Kongo, whose emperor was so powerful he was able to halt the trade in slaves for a number of years, the African continent rang with a series of glorious civilizations that have had a lasting impact on the world's history, and on American culture. James Haskins and Floyd Cooper have won numerous awards for their books for young people, including several Coretta Scott King Honor awards. This groundbreaking book is their first collaboration. Index. Bibliography. All ages.Consultants on this book were Dr. John Henrik Clarke, noted scholar of black history, and Dr. Enid Schildkrout, curator of anthropology, The American Museum of Natural History."}, {"id": "B00AALA9ZU", "genre": "Children's Books", "title": "Holiday Short Stories (For Pre-Teen Boys)", "description": "This book has two short stories, one that happens at Thanksgiving, and one that happens the night before Christmas. The first story has Derek, a 12 year old boy that lives on a farm. He is told by his father that he must watch the Thanksgiving Turkey be killed. It will make him \"grow up\". Derek was given this turkey in March of the year, and he grew to call him Tom, and think of him as his best friend. As his father goes out to the barn to get things ready, Derek's father is hit by a horse shoe, and is knocked out. He wakes up into a nightmare, where the turkey comes after him. (everything works out), they have pizza for thanksgiving.The Christmas story takes place the night before, Jimmy a 12 year old that lost his father in the war, is selfish and only thinks about himself. A small Asian boy is on his doorstep as he gets home from the Christmas Eve service with his mom. He learns that there are some worse off than him. There is a snow storm and the phones are dead. The boy gets worse, and in the end Jimmy learns that the boy is not who he seems. It ends with a verse about what you do to the least of these... you do to God."}]