[{"id": "0316355844", "genre": "Children's Books", "title": "Bob the Builder: The Concrete Shake-Up", "description": "Bob the Builder and his crew are putting in a parking lot at the new Milkshake Bar. Scoop decides to experiment with the concrete mixture, but his experiment goes terribly wrong. Can Bob and the team help fix this big mix-up?© 2016 Hit Entertainment Limited and Keith Chapman. The Bob the Builder name and character, related characters and logo are trademarks of Hit Entertainment Limited. "}, {"id": "B01LVXPQT6", "genre": "Children's Books", "title": "The Blue Angels For Kids! (The Kidsbooks Leadership for Kids Navy Aviator Series Book 2)", "description": "OBLITERATE THE LEADERSHIP GAP!This is a book about the United States Blue Angels for Kids.With lots of big pics and just the right amount of text, just right for kids between 5 and 10 years old.There is a lot of emphasis on discipline in this book.•Tons of fabulous full color photos in this book to get your kids motivated. •Help your kid learn to read – he or she will WANT to read this if they like the Blue Angels. Children need role models today, additionally READING -instead of playing video games- should be more encouraged. This book motivates by linking cool pics for kids to cool content - WORDS New! Now includes WORD WISE - a great reading help for kids!Scroll up and grab a copy today!See more at www.thekidsbooks.blogspot.com"}, {"id": "0553533940", "genre": "Children's Books", "title": "Basketball's Greatest Players (Step into Reading)", "description": "From Larry Bird and Michael Jordan to the hottest new legends such as LeBron James, this Step 5 Step into Reading early reader offers tons of facts about the best players in the game, what they were best known for, and how they got their start!   Step 5 Readers tell stories in chapters using longer paragraphs, for children who want to take the plunge into chapter books but still like colorful illustrations and photography."}, {"id": "158925628X", "genre": "Children's Books", "title": "Bedtime in the Meadow (Padded Board Books)", "description": "It's time for the animals in the meadow to find their way back home to sleep. Butterfly rests on a cattail, dragonflies settle on leaves, and bees gather in their hive. Families of foxes, ducks, and rabbits cuddle close for slumber. Rhyming text and soft, inviting illustrations make this an ideal bedtime read."}, {"id": "1634722981", "genre": "Children's Books", "title": "Stadiums (21st Century Junior Library: Extraordinary Engineering)", "description": "The 21st Century Junior Library Extraordinary Engineering series explains how important feats of engineering are accomplished. Stadiums examines the engineering concepts that make these structures a fun and safe space for large gatherings. Sidebars encourage readers to engage in the material by asking deeper questions or conducting individual research. An activity, full color photos, a glossary, and a listing of additional resources all enhance the learning experience."}]