[{"id": "B076CP93HW", "genre": "Children's Books", "title": "INSPIRATIONAL ASSORTMENT OF SHORT KIDS STORIES: 14 Stories in 1 (KIDS BOOK, PICTURES BOOK, CHILDREN'S BOOK, PRE-SCHOOL, FAIRLY TALE, EARLY LEARNING)", "description": "14 Different Short Stories for early learning and helping teach lessonsBundle Includes:\"Charlie's Lesson\"\"Ms. Crow's Big Move\"\"The Forbidden Planet\"\"Hani and Grettie's Pizza Paradox\"\"The Incident at Chestnut Elementary\"\"The Memory Thief\"\"Ms Crow's Picnic\"\"Lessons From Our Household Objects\"\"Push at the Pool\"\"Santa's Boots\"\"The Taste of Shapes\"\"Sugar Twin\"\"Toby's Do Over\"\"A Walk with Dad\"These books tell the story of silly little animal characters, other characters who are eager to learn and grow. You will love reading these to your young ones and watching them learn to read in the process.Parents will love the lessons their children learn from the ending!Kids love the friendly characters!Grandparents will definitely enjoy reading this book to their grandchildren!Check it out today and see for yourself.** Read it FREE as part of your PRIME or Kindle Unlimited membership **"}, {"id": "0736436642", "genre": "Children's Books", "title": "Happy Birthday, Princess! (Disney Princess) (Step into Reading)", "description": "It's a royal celebration for Belle, Tiana, Jasmine, and the other Disney princesses as they celebrate their birthdays! This Step 1 Deluxe Step into Reading leveled reader is perfect for children ages 4 to 6 and it comes with more than 30 sparkly stickers! Step 1 Readers feature big type and easy words. Rhymes and rhythmic text paired with picture clues help children decode the story. For children who know the alphabet and are eager to begin reading."}, {"id": "0764164112", "genre": "Children's Books", "title": "My Favorite Fire Truck (My Favorite Vehicles)", "description": "At first, toddlers will recognize this fire truck as a toy, but when they pick it up they'll discover that it's also a book! It's thick and sturdy enough to stand on a flat surface when the pages are closed. When standing, it becomes a toy vehicle for kids to push around. But open it up, and the fire truck becomes a storybook with brightly colored illustrations. Each page is constructed of a stiff and sturdy foam plastic material with a glued paper surface for the illustrations and story. The story is short, simple, and certain to appeal to very young children."}, {"id": "B01N06H68Z", "genre": "Children's Books", "title": "Eumundi and Friends: Thanksgiving With Friends: The Turkey, the Feast, the Pilgrims and the Mayflower", "description": "Thanksgiving takes on new dimensions when Eumundi mouse organizes the day’s activities for Dakota, the American black-footed ferret, who is visiting Down Under. Having no idea what to do, Eumundi’s research brings the friends to the brink of disaster, as they set sail on the high seas, as pilgrims on the Mayflower! Just as well the turkey is well prepared for the feast! Get ready for your Thanksgiving by joining the friends on this amazing adventure! Bonus offer - Delicious, simple Thanksgiving recipes for kids, prepared by a chef! "}, {"id": "1628324554", "genre": "Children's Books", "title": "The NBA: A History of Hoops: Minnesota Timberwolves", "description": "This high-interest title summarizes the history of the Minnesota Timberwolves professional basketball team, highlighting memorable events and noteworthy players such as Kevin Garnett."}]