[{"id": "1844763102", "genre": "Children's Books", "title": "300 Science and History Projects", "description": "This extensive collection of projects and experiments will provide young scientists and historians with hours of fun and creative learning. Each project includes step-by-step instructions and photographs and artworks: in the science section these explain a scientific theory or show how something works; and in the history section they provide a practical insight into how our ancestors lived centuries ago."}, {"id": "0615778259", "genre": "Children's Books", "title": "Juventud! Growing up on the Border: Stories and Poems", "description": "Borders are magical places, and growing up on a border, crossing and recrossing that space where this becomes that, creates a very special sort of person, one in whom multiple cultures, languages, identities and truths mingle in powerful ways. In these eight stories and sixteen poems, a wide range of authors explore issues that confront young people along the US-Mexico border, helping their unique voices to be heard and never ignored. Featuring the work of David Rice, Xavier Garza, Texas Poet Laureate Jan Seale, Guadalupe García McCall, Diana Gonzales Bertrand, Daniel García Ordaz, Edward Vidaurre, and many others."}, {"id": "080693946X", "genre": "Children's Books", "title": "Shocking Science: Fun & Fascinating Electrical Experiments", "description": "Children will be \"shocked\" to learn that with just a few wires, batteries, bulbs, and buzzers they can unlock the mysteries and magic of electricity! These simple, safe experiments will prove enlightening on everything from electrons to circuits to wattage. Bend paper with a comb that's \"charged up\" with static electricity. Find out what lemons, potatoes, and coins have to do with electricity by using them to discover how a battery works, and then get right down to the \"nuts and volts\" of the matter by making one of your own. Also see why \"opposites attract,\" construct a circuit board, send a coded message with a buzzer, and do lots of other great experiments. Cartoons throughout add to the fun. The authors both live in Vancouver, British Columbia. 80 pages (all in color), 8 1/2 x 10. "}, {"id": "B00KOYQUY2", "genre": "Children's Books", "title": "Twenty-Four Vincent van Gogh's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Vincent van Gogh's Paintings. Twenty-Four Vincent van Gogh's Paintings for Kids There are colorful, youthful, and inspirational."}, {"id": "0547807430", "genre": "Children's Books", "title": "The Lightning Dreamer: Cuba's Greatest Abolitionist", "description": "“I find it so easy to forget / that I’m just a girl who is expected / to live / without thoughts.” Opposing slavery in Cuba in the nineteenth century was dangerous. The most daring abolitionists were poets who veiled their work in metaphor. Of these, the boldest was Gertrudis Gómez de Avellaneda, nicknamed Tula. In passionate, accessible verses of her own, Engle evokes the voice of this book-loving feminist and abolitionist who bravely resisted an arranged marriage at the age of fourteen, and was ultimately courageous enough to fight against injustice. Historical notes, excerpts, and source notes round out this exceptional tribute."}]