[{"id": "0780753917", "genre": "Children's Books", "title": "The Royal Kingdoms of Ghana, Mali, and Songhay", "description": "For more than a thousand years, from A.D. 500 to 1700, the medieval kingdoms of Ghana, Mali, and Songhay grew rich on the gold, salt, and slave trade that stretched across Africa. Scraping away hundreds of years of ignorance, prejudice, and mythology, award-winnnig authors Patricia and Fredrick McKissack reveal the glory of these forgotten empires while inviting us to share in the inspiring process of historical recovery that is taking place today."}, {"id": "1520755155", "genre": "Children's Books", "title": "2017 Short Story Collection for Kids: Family Friendly Short Stories for Bed-Time and Other Occassions", "description": "A wonderful collection of family-friendly short stories for the family. Perfect for bed time stories or other family occasions when it's nice to cuddle up with the kids for story-time. ***Some stories do contain Biblical references."}, {"id": "0316210412", "genre": "Children's Books", "title": "Nighty Night, Little Green Monster", "description": "Children will love this monsterously fun story, featuring die-cuts on every spread. With each turn of the page, readers reveal Little Green Monster's little yellow eyes, his little red mouth, and even a cute, tiny white monster tooth. Then, when the stars begin to appear, it's time for bed... so, nighty night, little yellow eyes. Nighty night, little red mouth. Nighty night, cute little white tooth. Sweet dreams!"}, {"id": "0761126449", "genre": "Children's Books", "title": "Supercat", "description": " Hooo-ray! Meowie Wowie! Glug Glug Glug and Glig Glig Glig! Introducing the first superhero for babies and toddlers! Marrying comic book with board book into a format just the right size to fill a lap, Supercat chronicles the super adventures of Supercat, who flies from his home in the Milky Way to make the world safe for blankies.With sidekick Super Mouse, Super Phone, Super Milk, and the Cow Who Jumps Over the Moon, Supercat is all set to rescue babies everywhere. Blanket lost? Baby refuses to put on pajamas?? Too many tears to go to bed??? No problem-Supercat knows just what to do. Funny, fast-moving, thoroughly charming, and adorable, Supercat is high entertainment for the youngest audience, and just as much fun for the parents who will be doing the reading. Kate McMullan's sweet story is full of comic-book style, of \"Super!\" this and \"Super!\" that, \"Oof!\" and \"Zooooop-zip!\" And Pascal Lemaitre's illustration, is inventive, expressive, energetic, and colorful. The collaboration has everything to catch a baby's or toddler's imagination and get parents to fall in love with bedtime reading all over again."}, {"id": "B00BL7JGCE", "genre": "Children's Books", "title": "Morris Mouse Learns a Lesson: Book 5 Stories for Kids in the Morris Mouse Series for Ages 4-8", "description": "Morris Mouse learns a lesson THE HARD WAY! In Book 5 of the five stories in the Morris Mouse series, Morris learns a very important lesson. Read about how he thinks it would be fun to pretend to be something he was not designed to beWatch how he ends up being chased through a barnyardFind out what happens when he gets back homeEnjoy his \"ah-ha\" moment!Introduce a new generation of early readers to Morris Mouse and all his adventures as you share these delightful poetic verses with them. Acquaint your children with a little boy's love for family, his exciting adventures, and important lessons he learns that will allow you some \"teachable moments\" of your own in a loving and gentle way.Morris Mouse is truly unforgettable and will become a storybook character your children will cherish for many years to come!"}]