[{"id": "B0758R3LYZ", "genre": "Children's Books", "title": "Video Game Memes And Jokes: Gaming Memes Part 2", "description": "Video Game Memes And Jokes, by Conrad Rhodes.Here is part 2 of my video game memes series, including a tonne of your favourite video game memes like; Roblox, Mario, Metal Gear Solid, League of Legends and many more.You'll love this collection."}, {"id": "152015738X", "genre": "Children's Books", "title": "101 Manatee Jokes!", "description": "Love jokes? What about manatees? What about jokes ABOUT manatees? Then this is the book for you! \"101 Manatee Jokes!\" is a laugh riot for the whole family. You'll be swimming in good times."}, {"id": "B077YCXNR6", "genre": "Children's Books", "title": "Through the Snow (A Christian Fairytale Book 3)", "description": "Why can't anyone else see the dragon on the roof?Or hear the meow of the white kitten in Lily's pocket?Maybe they're both a part of her amazing imagination... or maybe not.As imaginative as Lilianne Carrillo is, when she steps out into the snow one day after school, she never could've guessed that another dragon would lift her into the sky by his talons to carry her away... nor where he would take her or what would happen to her once she got there. Come along with Lily on an adventure where nothing is as it seems and life becomes abundantly more than anyone could ever hope for or imagine.\"Through the Snow\" is the third in the Christian Fairytales series, books with a theme meant to draw even the youngest reader closer to God. This is a stand-alone read, but if you would like to discover more about Numeira, also read \"Across the Ocean\" and \"Down the Stairway\"."}, {"id": "0613066308", "genre": "Children's Books", "title": "The Kid Coach (Turtleback School & Library Binding Edition) (Accelerated Readers)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When they lose their coach, Scott and his teammates decide that he should try his hand at coaching, but it takes teamwork and the efforts of a player they call \"\"Brain\"\" to produce a winning season."}, {"id": "1856975479", "genre": "Children's Books", "title": "Castles (Single Subject References)", "description": "Intricate and meticulous illustrations bring history to life in this wide-ranging castle tour that covers both the majestic splendour of the great halls and the hardships of living in a feudal society - from the building of a castle to shopping in a medieval marketplace. A magnificent 8-page gatefold opens up to a cutaway view of the castle -- both inside and out -- and lets viewers get an up-close view of all the rooms and people going about their everyday tasks.  Includes an illustrated glossary and index."}]