[{"id": "0375808523", "genre": "Children's Books", "title": "Ice Mummy, the Discovery of a 5,000 Year-Old Man (Step Into Reading Level 3)", "description": "Step Into Reading with Ice Mummy. Two people are hiking high in the mountains. They see something odd sticking out of the snow. At first it looks like a doll's head. But it's not. It's a man! Who is he? How did he get there? Find out in this exciting true story!"}, {"id": "1886069085", "genre": "Children's Books", "title": "Enchanted Tales: An ABC Fantasy", "description": "Reproduced in gorgeous pastels, these images are so mesmerizing that adults will enjoy them as much as their intended audience-ages three and above. Tongue-teasing rhyme spins fantasy stories around each letter. With very subtle undertones of Eastern spirituality, this is a work in which imagination and education coexist in harmony."}, {"id": "1548953571", "genre": "Children's Books", "title": "Victoria Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Girls", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "1524627003", "genre": "Children's Books", "title": "The Adventures of Scarlett the Cat: The Arrival", "description": "The Adventures of Scarlett the Cat is a fun tale, with the story narrated by an extraordinary and whimsical cat named Scarlett. Scarlett tells the tale of being the adored \"child\" in the family, only to have her world turned upside down by the arrival of a baby. Sawyer, the new baby, and Scarlett learn to love and adore each other in this tale that will touch the hearts of anyone who's ever had to make room for one more in the family."}, {"id": "0449814823", "genre": "Children's Books", "title": "Thomas & Friends Little Golden Book Library (Thomas & Friends)", "description": "Five Thomas & Friends Little Golden Book movie retellings are collected in a beautiful slipcase: Thomas and the Great Discovery, Hero of the Rails, Misty Island Rescue, Day of the Diesels, and Blue Mountain Mystery. This nifty little library will please train-obsessed boys and girls ages 3–7."}]