[{"id": "1448879221", "genre": "Children's Books", "title": "Independence Day Origami (Holiday Origami)", "description": "\"Full-color step-by-step instructions teach children how to fold Independence Day-themed origami decorations\"--"}, {"id": "158196059X", "genre": "Children's Books", "title": "Mysteries of the Mummy Kids", "description": "Learn about child mummies from the Incas and other ancient civilizations around the world, plus a Civil War-era mummy from the United States."}, {"id": "0375856609", "genre": "Children's Books", "title": "Stone Rabbit #2: Pirate Palooza", "description": "When his coffee table’s leg breaks, Stone Rabbit replaces it with the cursed peg leg of a long-dead pirate—and inadvertently unleashes the ghostly fury of Captain Barnacle Bob! Suddenly, our hero finds himself clashing cutlasses with salty specters and fleeing from scary sea beasts. Will Stone Rabbit escape with both of his long ears intact? Or will he end up as a squid’s snack?Pirate Palooza is the second book in a full-color series of riotous, riproaring graphic novels that chronicles the zany of adventures of a quicktempered and quick-witted young rabbit.Erik Craddock grew up during the ’80s and ’90s on a steady diet of comics, video games, and pop culture. It was during histime as a student at New York City’s School of Visual Arts that Stone Rabbit was born. He lives in Babylon, New York."}, {"id": "0230736122", "genre": "Children's Books", "title": "Cinderella (Lift-the-Flap Fairy Tales)", "description": "Cinderella's sisters Were such a rotten pair, She did all the housework, They never did their share.Children will enjoy opening the royal invitation, looking behind the pull of purple smoke to see Fairy Godmother, and the final fun pop-up spread of Cinderella and the prince getting married."}, {"id": "1442493577", "genre": "Children's Books", "title": "A Galactic Easter! (Galaxy Zack)", "description": "Galaxy Zack has some “sweet” competition in this Easter-themed chapter book adventure!Zack and Drake venture to Gluco, the candy planet, for some Easter fun. Once there, the two friends decide to compete in activities, including an egg toss and a three-legged race. Zack remembers how he used to win all the Easter competitions on Earth, and he is determined to win them on Gluco, too. With the contest so close, Zack begins to wonder if he should cheat to ensure victory. Will Zack have to choose between playing fair or coming out on top? With easy-to-read language and illustrations on almost every page, the Galaxy Zack chapter books are perfect for beginning readers."}]