[{"id": "B06XQYKJX3", "genre": "Children's Books", "title": "Timmy, the Flying Mouse", "description": "Timmy is not an ordinary mouse. He has big dreams and one of them is being able to fly high up in the sky like a bird. Little Timmy has no wings, so how can he fly? But he is not a mouse to give up although his friends laugh at him. So he tries to do several things to make him fly, but none of these work until he gets help from an unexpected friend who helps him make his dream come true."}, {"id": "0778739104", "genre": "Children's Books", "title": "Explore with Gertrude Bell (Travel with the Great Explorers)", "description": "This fascinating book takes readers through the life story of influential English archaeologist and traveler Gertrude Bell. Bell explored what is now the Middle East and played a significant role in the creation of modern Iraq. Historical facts, images, and high-interest information are presented in a tabloid-style to engage readers in an accessible way. Topics include Bells work in archaeology, her mountain summits, and her role in World War One."}, {"id": "1501100343", "genre": "Children's Books", "title": "Girl Online: On Tour: The Second Novel by Zoella (Girl Online Book)", "description": "Penny joins her rock-star boyfriend on the road in Europe in this entertaining sequel to the instant New York Times bestseller, Girl Online, “a compelling and satisfying coming-of-age tale in the digital age” (Booklist) by the award-winning YouTube vlogger popularly known as Zoella.When Noah invites Penny on his first-ever European tour, she can’t wait to spend the summer with her rock-god-tastic boyfriend.  But, between Noah’s jam-packed schedule, less-than-welcoming band mates, and threatening messages from jealous fans, Penny wonders whether she’s really cut out for life on tour. She can’t help but miss her family, her best friend Elliot, and her blog, “Girl Online.”  Can Penny learn to balance life and love on the road, or will she lose everything in pursuit of the perfect summer?"}, {"id": "0516042033", "genre": "Children's Books", "title": "Pocahontas: Daughter of a Chief (Rookie Biographies)", "description": "A brief biography of the American Indian princess who as a young girl befriended John Smith, saving him from death at the hands of her father, and later was very helpful to the colonists at Jamestown."}, {"id": "0316770949", "genre": "Children's Books", "title": "Rose Red and Snow White: A Grimms Fairy Tale", "description": "Snow White and her sister, Red Rose, let a cold bear into their home to rest one night, but as he leaves, he warns them of the dangers of a little man, so when a evil dwarf shows up on the doorstep, the girls begin to get very worried."}]