[{"id": "0316438960", "genre": "Science Fiction & Fantasy", "title": "The Last Wish: Introducing the Witcher", "description": "The New York Times bestselling introduction to the Witcher series that inspired the Witcher video games. Geralt is a witcher.Yet he is no ordinary killer-for-hire.His sole purpose: to destroy the monsters that plague the world. But not everything monstrous-looking is evil and not everything fair is good. . . and in every fairy tale there is a grain of truth. Witcher collectionsThe Last WishSword of DestinyWitcher novelsBlood of Elves The Time of ContemptBaptism of Fire The Tower of SwallowsLady of the LakeThe Malady and Other Stories: An Andrzej Sapkowski Sampler (e-only)Translated from original Polish by Danusia Stok "}, {"id": "1934857610", "genre": "Science Fiction & Fantasy", "title": "Shadowrun Dawn ofArtifacts Darkest 3 *OP (Shadowrun (Catalyst))", "description": "Compatibility: Requires Shadowun, Fourth Edition; offers the character statistics, setting information, and plot points needed for gamemasters to take players on an international journey chasing a stolen artifact. Selling Points: • Puts players in the middle of a fast-paced plot to recover an artifact that had been stolen and get their hands on an item that has drawn the attention of some of the most powerful people in the Sixth World. • Works with the other Dawn of the Artifacts adventures in gradually uncovering some of the secret history of Shadowrun’s setting. The Dawn of the Artifacts series can be bought and ran in any order! • Takes players on an international journey to cities that have been featured in previous Shadowrun publications, including Hamburg, Europort, and Sarajevo. • Can be played alone or as the third part of the Dawn in the Artifacts series, which will build to a dramatic conclusion in 2010. • Provides complete non-player character statistics, player handouts, and all other information needed to let players dive into the adventure immediately."}, {"id": "1428511202", "genre": "Science Fiction & Fantasy", "title": "Sorceress, Interrupted", "description": " Though Megalopolis has many superheroes, none of them is quite like Fantazia. That's no surprise, given her parentage. Forced to watch loved ones age and die, she would rather live in a pocket universe tending bar. It's safer to remain cold and aloof, to not get attached to anything or anyone. So helping the Elite Hands of Justice defeat the Dragon was a mistake. Hanging around her her father's band on do-gooders have given her a taste of camaraderie, but have birthed a new threat, something worse than the evil plot of the city's newest supervillan. The true peril is Cyrus...for he threatens Fantazia's heart."}, {"id": "1786155540", "genre": "Science Fiction & Fantasy", "title": "Oversleeper", "description": "What do you do when you wake up one morning and find that everything you know has changed? On Monday morning Ignatius Inuus finds himself on the run in a New York he barely recognises. Helped by a mysterious young woman, he starts to learn about the new regime. And, the brutal society - in which people survive at the expense of their humanity - seems to be more nightmare than dream. In his quest to force change, he discovers that when you possess the power of life or death over people, choosing life is not as simple as it seems."}, {"id": "B077BYMFSQ", "genre": "Science Fiction & Fantasy", "title": "1000 Years of Tennin and Muriel: A 12 Blackened Petals Story", "description": "THIS IS A SIDE STORY FOR 12 BLACKENED PETALS. READ THIS BEFORE BOOK 2 The birth of an angel is a violent process, but the life of an angel is an epic adventure. 1000 Years of Tennin & Muriel is a story that takes you on an adventure like no other. Follow a pair of angels as they seek to bring down Apophis, the tyrannical god that is enslaving an entire galaxy. The gift they receive from the god Ismael gives them the tools they need to take on beings of incredible power. This thousand-year trek across the cosmos will leave you thirsting for more. 12 Blackened Petals is a breath-stealing thrill ride that catapults the reader into a fantasy world of gods, angels, and demons. Strap in and get ready to continue your journey with 1000 Years of Tennin & Muriel."}]