[{"id": "B076PSSW2T", "genre": "Children's Books", "title": "Short Stories For Early Readers 6: 16 Stories Included!  Inspiring Characters, Children's Book,  Kids Bundle, Adventure, Animal stories, Teaching Values, Fantasy, Education", "description": "Huge Collection Includes 16 Engaging Short StoriesThese engaging stories, with lovable characters who are eager to learn and grow, make these easy to read short stories perfect for beginners or anyone looking to bring back memories of their youth.   It's a fun series for youngsters, with a simple vocabulary, colorful illustrations, and a length that's just right for a bedtime story.Parents will love the lessons their children learn from these stories!Kids love the funny and lovable characters!Grandparents will enjoy reading this book to their grandchildren!Check it out today and see for yourself.**Smash that \"Buy Now with 1 Click\" button above to reserve your copy **"}, {"id": "0375830081", "genre": "Children's Books", "title": "Unicorns (A Stepping Stone Book)", "description": "Persian unicorns are fierce fighters. Japanese unicorns are just. European unicorns are peaceful. But all unicorns have one thing in common. They are magic! Learn all about unicorn legends, including why people truly believed in them, in this fascinating companion to Dragons.Beautiful full-color illustrations accompany the easy-to-read text."}, {"id": "0736437479", "genre": "Children's Books", "title": "Ariel and the Big Baby/Rapunzel Finds a Friend (Disney Princess) (Pictureback(R))", "description": "Two Disney princess stories in one 2-in-1 pictureback with a glittery cover! Ariel from Disney The Little Mermaid and Rapunzel from Disney Tangled celebrate the joy of friendship in the Disney Princess Fairy-Tale Friendships series! Perfect for children ages 3 to 7, this book features two magical friendship tales in one.   Disney’s Dream Big, Princess! campaign focuses on the amazing stories and leadership qualities of each Disney Princess, and shows how they relate to today’s girl."}, {"id": "149946519X", "genre": "Children's Books", "title": "Internet Surveillance and How to Protect Your Privacy (Digital and Information Literacy)", "description": "Today, whether it’s banks, governments, schools, or businesses, they all store data digitally. Keeping our personal details off the internet is nearly impossible. While it’s difficult to avoid having some personal information online, readers can take steps to secure it from prying eyes. This guide provides common-sense tips about how to avoid online theft and the mining of data by advertisers and others. In easy-to-follow steps, readers will also learn how to safeguard their computers and other digital devices. With this guide, readers can keep their private info private."}, {"id": "0963799169", "genre": "Children's Books", "title": "Gymnastics Journal", "description": "The Gymnastics Journal is the perfect holiday or special occasion gift for the gymnastics enthusiast in your life. Eighty journal pages with a different gymnastics illustration on each page depicting all the fun and excitement of this Olympic sport. Every young gymnast whether recreational or competitive will be able to record the excitement of their first back handspring, glide kip, or back somersault. The 2008 Olympics are just around the corner promising loads of excitement from the U.S. Olympic Gymnastics team. Get the young gymnastics enthusiast in your life a copy of the Gymnastics Journal today."}]