[{"id": "1406205680", "genre": "Children's Books", "title": "Tank (Raintree: Why Things Don't Work) (Raintree: Why Things Don't Work)", "description": "Jessica and Jed are hoping to ride in Uncle Sam's tank. But when they go to visit him, they discover it doesn't work. In fact, it's in pieces! Luckily, Uncle Sam knows how to repair the tank. Join them in their quest to rebuild the tank, and along the "}, {"id": "086505813X", "genre": "Children's Books", "title": "Great African Americans in Entertainment (Outstanding African Americans)", "description": "Examines the lives of more than ten African American entertainers, including Josephine Baker, Sammi Davis, Jr., Susan Taylor, and Spike Lee, with the obstacles they each overcame."}, {"id": "0756505186", "genre": "Children's Books", "title": "Parts of a Plant (Compass Point Phonics Readers-Level C)", "description": "Shows the parts of a plant including the roots, stem, and leaves, using an easy-to-read text that incorporates phonics instruction."}, {"id": "B06XMXML44", "genre": "Children's Books", "title": "The Little Book of Little Activists", "description": "A celebration of political activism by America's youngest citizens--our children.You're never too young to care about your community or to stand up for your beliefs. That's the empowering message of this book, which is all about how real kids exercise their first amendment rights.Filled with inspiring photos of children at recent demonstrations and rallies, The Little Book of Little Activists also includes inspirational quotes from kids themselves on topics of equality, diversity, and feminism, as well as an introduction by Bob Bland, co-chair of the Women's March on Washington, and an afterword by civil rights activist Lynda Blackmon Lowery, author of Turning 15 on the Road to Freedom: My Story of the 1965 Selma Voting Rights March. Five percent of gross proceeds go to benefit the Children's Defense Fund.The Little Book of Little Activists is a child's very first introduction to political activism, presented at a level that they can understand and relate to. Perfect for parents who want to raise their kids to become participatory members of a democracy."}, {"id": "1633626830", "genre": "Children's Books", "title": "Praying Mantis (21st Century Junior Library: Creepy Crawly Critters)", "description": "Bugs and insects have always fascinated children. This book in the Creepy Crawly Critters series introduces young readers to the praying mantis. Readers can discover physical characteristics, habitat, diet, and more."}]