[{"id": "B00AY38J6K", "genre": "Children's Books", "title": "Squat The Robot?", "description": "Squat was cleaning Glistening Glow when hair began to show. She had no idea why until remembering that Creepy Cupid guy. It seems she was under his curse and to make things worse, he had captured her love, making him and his band sing like a dove.Follow Squat as she begins her quest to put everything back to normal and stop that Creepy Cupid pest. But will it come due? That can be found out by you. Just add this book to your mat from none other than Pat Hatt."}, {"id": "1584301775", "genre": "Children's Books", "title": "Coming to America: A Muslim Family's Story", "description": "After four years of hard work and frugal living in New York, Hassan Mahmoud can afford to bring his family from Egypt to live with him. This close-knit family adapts to American life while staying true to their Muslim beliefs and Egyptian customs. Intimate and charming scenes of daily life are recounted -- preparing family meals, visiting a mosque in Manhattan, discovering the joys of snow. Through captivating color photographs and engaging text, this thoughtful book helps young readers understand Muslims as individuals and families."}, {"id": "1974035050", "genre": "Children's Books", "title": "200 Pages Wide Ruled 8.5X11", "description": "It's time to go back to school! Which means no more monkeying around! But no worries because you got this!Do you need a notebook for all your classes?ScienceMathHistory/Social StudiesEnglishAll your classesDetails 200 pages Wide Rule 8.5X11"}, {"id": "0340848782", "genre": "Children's Books", "title": "Livewire Real Lives: Linford Christie", "description": "Written by experienced special needs teachers, and fully assessed by The Basic Skills Agency to ensure accessibility in both layout and content, the \"Livewire: Real Lives\" series features personalities from sport, film and music, politics and history. The Livewire Real Lives series provides stimulating reading materials with a teenage/adult interest level for those with reading ages below ten or for adult students learning English as a foreign language. Facts and photographs sustain the interest of the beginner reader. The books are subtly colour-coded for the appropriate 'reading age' and have superb photographs throughout. Linford Christie is one of the finest athletes in the world. Find out about his best achievements and his rise to fame."}, {"id": "B01MYBOA70", "genre": "Children's Books", "title": "Bermuda Triangle (Urban Legends: Don't Read Alone!)", "description": "This book in the Urban Legends: Don't Read Alone! series explores the creepy history of the Bermuda Triangle. Are you brave enough to read it alone? Written with a high interest level to appeal to a more mature audience and a lower level of complexity with clear visuals to help struggling readers along. Considerate text includes tons of fascinating information and wild facts that will hold the readers' interest, allowing for successful mastery and comprehension. A table of contents, glossary with simplified pronunciations, and index all enhance comprehension."}]