[{"id": "0984525165", "genre": "Children's Books", "title": "ABC's of the Wild Turkey", "description": "Your child will love the beautiful pictures as they learn about the ABC’s of the Wild Turkey. From beards to gobbles, this fun book will teach your child the letters of the ABC’s while introducing and teaching them about the wild turkey. As one of the ABC Books for Hunting Heritage and Habitat, this book highlights the conservation organization, the National Wild Turkey Federation or NWTF. The NWTF is dedicated to protecting habitat and preserving our hunting heritage. By purchasing this book, you will be helping to support conservation of habitat and our hunting heritage. Proceeds of each book purchased will be donated back to the National Wild Turkey Federation to allow the organization to continue its mission of preserving habitat and supporting youth initiatives."}, {"id": "074966360X", "genre": "Children's Books", "title": "Under Occupation (World War Two)", "description": "A detailed examination of one of the most disastrous wars in history; Packed with information and photographs; Timelines and quotes put events in context and help to personalise them."}, {"id": "038536993X", "genre": "Children's Books", "title": "The Nutcracker (Little Golden Book)", "description": "A Christmas classic returns to Little Golden Books, with beautiful new artwork by a beloved Golden Books illustrator!   The Nutcracker is back in print as a Little Golden Book, with all-new illustrations by Sheilah Beckett, who started illustrating Golden Books in the 1950s. This lovely retelling of the famous ballet will be a perfect holiday gift for any child who loves the ballet, Christmas stories, and fairy tales!"}, {"id": "1629914592", "genre": "Children's Books", "title": "Dennis the Menace #2", "description": "One of the greatest comicbook series ever created for children was DENNIS THE MENACE. But possibly because of the success of the comic strip, television series, and feature films, the DENNIS THE MENACE comicbooks were never taken seriously by comic art critics. But all that changed when a DENNIS THE MENACE story was included in The Toon Treasury of Classic Children's Comics, edited by Art Spiegelman and Francoise Mouly. Only the finest kid's comics were included in that critically acclaimed collection, and now Papercutz continues to bring those great DENNIS THE MENACE comics back into print. This volume features the work of artist OWEN FITZGERALD whose work with writer FRED TOOLE is considered a high point of the series."}, {"id": "141765113X", "genre": "Children's Books", "title": "Tokyo Mew Mew, Volume 1 (Tokyo Mew Mew (Prebound))", "description": "An accident at a museum endows 11-year old Ichigo Momomiya with the DNA of wildcats. Her new powers are put to the test when she is asked to join a secret group and is given the task of protecting the Earth from an unseen enemy."}]