[{"id": "B00WSB9W8K", "genre": "Children's Books", "title": "The Collar and the Cavvarach (Krillonian Chronicles Book 1)", "description": "Bensin, a teenage slave and martial artist, is desperate to see his little sister freed. But only victory in the Krillonian Empire's most prestigious tournament will allow him to secretly arrange for Ellie's escape. Dangerous people are closing in on her, however, and Bensin is running out of time.  With his one hope fading quickly away, how can Bensin save Ellie from a life of slavery and abuse?"}, {"id": "1499438761", "genre": "Children's Books", "title": "Becoming a Member of a Robotics Club (Hands-on Robotics)", "description": "Robots are destined to be a major part of human society and will transform education, business, and everyday life. Learning how to build robots is a popular pastime that brings to bear many different skills. This book introduces readers to robotics clubs and instructs them on how to join one of the hundreds available across the United States and the globe. It also serves as a guidebook on how someone can even start and lead or manage one of their own clubs and serves as a technologically current update to the previous volume on such clubs."}, {"id": "B00QZEHWVU", "genre": "Children's Books", "title": "Kids Book: The Adventures of Todd the Turtle: A Little Blue Turtle's Christmas in New York City", "description": " The Adventures of Todd the Turtle A Little Blue Turtle’s Christmas in New York City!  Todd receives an invite to travel to New York City to join his friends for a Christmas party and enjoy the holiday season in one of the world's greatest cities. Come and join in the Christmas spirit with Todd on his adventures as he explores a new place and makes new friends along the way! ON SALE LIMITED TIME ONLYScroll up to get your copy today!"}, {"id": "0516243519", "genre": "Children's Books", "title": "Let's Get Ready for Martin Luther King Jr. Day (Welcome Books: Celebrations)", "description": "A young boy and his class learn about and prepare for Martin Luther King, Jr. Day."}, {"id": "0764153099", "genre": "Children's Books", "title": "Castle (Fast Forward Books)", "description": "Provides a look at the changes to a site in Europe that begins as a farming camp and evolves over thousands of years into a huge castle that is destroyed and rebuilt several times."}]