[{"id": "0545621259", "genre": "Children's Books", "title": "Star Wars: Jedi Academy, Return of the Padawan (Book 2)", "description": "Author/illustrator Jeffrey Brown returns in the highly anticipated sequel to the NY Times Bestseller Star Wars: Jedi Academy! It's time to return to middle school in a galaxy far, far away. . . . After surviving his first year at Jedi Academy, Roan Novachez thought his second year would be a breeze. He couldn't have been more wrong. Roan feels like he's drifting apart from his friends, and it's only made worse when Roan discovers he's not the amazing pilot he thought he'd be. When the school bullies take him under their wing, he decides they aren't so bad after all--or are they? This year, Roan will have to face alien poetry tests, menacing robots, food fights, flight simulation class, online bullies, more lightsaber duels, and worst of all . . . a girl who is mad at him. This incredible, original story captures all of the humor, awkwardness, fun, and frustrations of middle school--all told through one boy's comics, journal entries, letters, sketches, e-mails, and more.  "}, {"id": "0141339713", "genre": "Children's Books", "title": "The Ring of Wind (Young Samurai, Book 7)", "description": "Jack Fletcher is battling the high seas. Ambushed by the Shogun's samurai, Jack and his friends have only one hope of escape—the Seto Sea. But with ferocious storms, man-eating sharks, and ninja pirates at every turn, their chosen route is fraught with danger. A treacherous crew only adds to their problems as they flee south from a ruthless samurai sea lord. Unless Jack can harness the Ring of Wind, he and his friends are destined for a watery grave."}, {"id": "0999175823", "genre": "Children's Books", "title": "The Wild Chicks: Class Trip: Wild Chicks Book 2", "description": "The second book in Cornelia Funke’s popular THE WILD CHICKS series, THE WILD CHICKS: CLASS TRIP follows our favorite rival gangs as they go on an overnight school adventure. The Wild Chicks and the Pygmies have had a truce since the end of the first book, but at the beginning of CLASS TRIP, the Pygmies declare their truce invalid outside their hometown, and the mischief begins again! In addition to its merry mischief, CLASS TRIP touches on issues that are still as relevant for middle-grades readers as they were when the books were first published in Germany: a new girl wants to join their tightly knit group, one of the Wild Chicks deals with divorcing parents, and others begin to have their first real crushes. Other relevant themes include conservation, ecology, and learning rudimentary scientific theory―the art of asking questions, and discovering provable truths."}, {"id": "8186211195", "genre": "Children's Books", "title": "Hen-sparrow Turns Purple", "description": "Designed as a scroll, and silk-screened by hand on handmade paper, this is a cheerful adaptation of a traditional folk tale. Hen-sparrow falls into a vat of dye and turns quite purple. Her strange new color turns the entire kingdom upside down, but Hen-sparrow quite likes herself purple . . .Inspired by medieval Indian art and narrative traditions, this visual and tactile treat has a clever feminist twist. The form of the book and the cumulative rhyme re-create the age-old magical experience of storytelling with pictures.Winner of the Grand Prix at the prestigious Biennale of Illustrations, Bratislava.\"Beguiling and a wonderful introduction to the appreciation of a more global culture of the picture book.\"—Mike Simkin, Carousel Magazine, United Kingdom"}, {"id": "0545873363", "genre": "Children's Books", "title": "Clover the Bunny (Dr. KittyCat #2)", "description": "Clover the bunny and his friends are on their first camping trip. But when itchy spots appear on Clover's paws, only Dr. KittyCat knows how to make him better.Clover has two-color art inside! Supercute photographs of real puppies and kittens combine with hand-drawn green line art for a completely unique look."}]