[{"id": "1540705838", "genre": "Children's Books", "title": "1: The Never-ending Story: First Volume (Volume 1)", "description": "What’s the most important trait you’d like to develop in your child? If you’re like most parents, intelligence is probably at the top of your list. We all want bright, smart children, which is why we spend so much time choosing the right schools and making sure teachers are exceeding expectations. But remember: as a parent, you have the power to boost your children's learning potential simply by making books an integral part of their lives."}, {"id": "0766042030", "genre": "Children's Books", "title": "The Woman Who Invented Windshield Wipers: Mary Anderson and Her Wonderful Invention (Inventors at Work!)", "description": "Most people can't imagine a car without windshield wipers. How would you possibly see during a snow storm or downpour? But there was a time when drivers had to wipe the windshield themselves to clear it of snow and rain. And boy did they get wet! Find out how Mary Anderson's smart thinking helped her get a patent for the Windshield Cleaning Device."}, {"id": "0766089517", "genre": "Children's Books", "title": "Cesar Chavez: Fighting for Migrant Farm Workers (Rebels With a Cause)", "description": "Csar Chvez is best known for uniting Mexican American farmworkers and for his efforts to obtain civil rights for his people. He followed the nonviolent methods of Mahatma Gandhi and Martin Luther King Jr. A dedicated, stubborn religious leader, Chvez stuck to his cause in spite of tremendous obstacles. With numerous documented quotes from Chvez, union members, and even Pope Paul VI, the Chvez story recounts his difficult early life and how he inspired countless people to advocate for farmworker justice. Students will be guided through their reading with a glossary of important words, a timeline, and references for further reading on the topic."}, {"id": "0021170681", "genre": "Children's Books", "title": "1 & 2: McGraw-Hill My Math, Grade K, Student Edition Package (volumes 1 and 2) (ELEMENTARY MATH CONNECTS)", "description": "This set provides the consumable Student Editions, Volumes 1 and 2, which contain everything students need to build conceptual understanding, application, and procedural skill and fluency with math content organized to address CCSS. Students engage in learning with write-in text on vocabulary support and homework pages, and real-world problem-solving investigations."}, {"id": "B072N3SC1F", "genre": "Children's Books", "title": "Thomas' 123 Book (Thomas & Friends) (Pictureback(R))", "description": "Count along with Thomas the Tank Engine as he chugs around the Island of Sodor. This companion to the perennial classic Thomas' ABC Book teaches numbers to train-obsessed little boys and girls ages 3-7 as only Thomas & Friends can."}]