[{"id": "B00N5AKJTO", "genre": "Science Fiction & Fantasy", "title": "99 Gods: Odysseia", "description": "“Odysseia” is the final book in the 99 Gods trilogy.Dana Ravencraft, Nessa Binglehauser, Ken Bolnick, Dave Estrada and John Lorenzi continue their seemingly futile struggles against the 99 Gods and the hidden supernatural powers of Earth.The City of God consolidates its power in the Americas and Europe, opposed by the Tradition Gods of Asia.  Humanity struggles amid the ongoing Troubles, the worldwide economic calamity created by the Gods.  Dubuque’s City of God forces are hunting down the last independent Gods in North America, including Orlando, the territorial God of Florida and the Caribbean, Bob, the child God who holds the territory of the southeastern United States, and Dana Ravencraft, Bob’s mortal but powerful regent and foster mother.  Down to their final options, Orlando proposes a solution to Dana that will combine their territories and attract the interest of other last powerful independents, Nessa Binglehauser and Ken Bolnick’s group of Telepaths and associates, which includes Elorie Portath and Dave Estrada (of the completed Ecumenist quest), the Angel-doubting actress Goddess Persona, the former magician-hunter John Lorenzi and his former nemesis and ancient Telepath Satan.  Betrayer, the God responsible for betraying the Recruiter’s band of Telepaths to Dubuque, cackles in the background, ready to use up everyone and everything in her secret mission.All the while the armies of the City of God gather, waiting to strike…"}, {"id": "B01MRYFU5G", "genre": "Science Fiction & Fantasy", "title": "Hunger Season (Siege of New Hampshire Book 3)", "description": "Book Three: Dissent and division grow among the people of New Hampshire as they endure greater grid-down hardship. A few food sources are found, but the prospects of everyone surviving the winter are getting slim. A scheme by ‘free’ states to get aid to New Hampshire is blocked by federal forces. Susan holds the key to running the blockade, but she must leave Cheshire to help. While she is away, looters steal town supplies and take hostages. Many face a future of starvation, some face a quicker and more terrible end.Feedback from some pre-release readers:“(Mic) has become one of my favorite survival authors. I love survival stories that are realistic to where I can imagine it really happening. The war lords, zombies, aliens and earth evacuation stuff don’t do much for me, but this kind of great material that (he) is putting out is fantastic.” — IL“Your writing is logical and practical; realistic and possible. Thank you!” — MNH“As good or better than many books I have purchased from Amazon” — CB"}, {"id": "1497398126", "genre": "Science Fiction & Fantasy", "title": "Retrograde: (pre-release for editing purposes only) (The Airship Pirate Chronicals) (Volume 2)", "description": "In this sequel to The Wrath of Fate, the Airship Ophelia lists, burnt and broken, in a tropical sea. Her crew has been scattered across the face of a ruined world, or lost in time, and now it is my job to pick up the pieces. What’s to become of my wife and children, whom I left in the aerial city of Isla Aether? This was one of the last of the free cities, held aloft over a world given back to the beasts. I fear this city will be a target now that the Emperor’s life, and mercy, is at an end. What would become of Kristina if she was taken back to a life of servitude in the walled cities? What would become of the children if they were left wandering alone in wastelands filled with nomadic tribes and prehistoric predators? What is to become of young Lilith Tess, who jumped ship in the 1930’s only to be lost in time? I saw her again, here at the end of days, and she was a queen. What journey did she take that led her to this fate? And perhaps least important of all, what is to become of me and the last of our crew? I stand here on the deck of this ship that has held me through all my misguided attempts to make the world a better place. This ship, and her captain and crew, are beaten. Do I have the strength to pull everything together again? Do I still have the strength to get this ship flying? What other choice do I have?"}, {"id": "B071LQYL9L", "genre": "Science Fiction & Fantasy", "title": "Divided (The Orphans Book 6)", "description": "The Divided Book 6 of The Orphans Series picks up directly where Civil War Book 5 left off. The action and speed of this will leave your heart pounding. Questions of who will survive?What happened with Shaun?What will Ellie and the others do with so many removed in such a short time?Oh, and do not forget about The Turned because they are vicious and will make your heart hurt from fear! The series just gets better and at over a 100k is as long as Origins Book 1. Read The Divided today to see why there are over 370 reviews on the series as well as why it won Zombie Book of The Month Club!"}, {"id": "1540831981", "genre": "Science Fiction & Fantasy", "title": "1: The Demon & the Angel", "description": "In the virtual reality world of Aurora, events began unfolding in the background, just out of sight from the masses.When the God of Evolution woke from his slumber, he only brought misfortune to some by unconsciously cursing them. Though unfortunate those cursed, nevertheless, they hold fate in their hands soon becoming the greatest powers in the three realms.Returned to their most primal form, follow along as a young imp and fallen angel fight to grow and regain what they lost; their rightful place - the Prince of Demons and Princess of the Gods. Will they prevail before a new great celestial war that stretches towards them hunting for their lives, baring its fangs at the chance to destroy the world their very existence is creating? Volume 1 is the beginning of the journey. Come along and observe their self-discovery and so much more."}]