[{"id": "1515798526", "genre": "Children's Books", "title": "The Invention of the Television (World-Changing Inventions)", "description": "Explore the history and development of the television and find out how a television works. Learn about the inventors who helped influence the invention of the television."}, {"id": "1900702827", "genre": "Children's Books", "title": "100% Espanol - A aprender gramatica! - Nivel medio / Photocopiable (100% Espagnol)", "description": "The \"100%\" provides complete immersion in the target language for students studying a foreign language at secondary school level. \"100% Espanol: Apprender gramatica!\" combines fun activities with comprehensive Spanish grammar guides."}, {"id": "0152015310", "genre": "Children's Books", "title": "Novio Boy: A Play", "description": "Ninth-grade Rudy has asked eleventh-grade Patricia out on a date, and to his amazement she has agreed. Now Rudy has to come up with the money, the poise, and the conversation to carry it off. This one-act play, by turns heartwarming and heart-wrenching, follows Rudy from his desperate search for guidance from family and friends through the hilarities of the date itself, all the way to its successful conclusion. â\u0080\u009cTo present a new kind of coming-of-age story, a play is the way.â\u0080\u009d--American Bookseller"}, {"id": "1570915342", "genre": "Children's Books", "title": "Ralph Masiello's Ancient Egypt Drawing Book (Ralph Masiello's Drawing Book)", "description": "Emerging on the fertile banks of the Nile River over five thousand years ago, ancient Egypt was a place of mummies and pharaohs, pyramids and temples--a place that sparks the imagination. Young artists can dive into the underworld with Anubis, jackal god of the dead; creep past a sentinel sphinx with the body of a lion and the head of a falcon; bow down to the beautiful Queen Nefertiti; or give praise to the murdered god Osiris, all while learning to draw the symbols of the mysterious and ancient civilization of Egypt. Step-by-step instructions help young artists create their own representations of this incredible culture, and annotations throughout the book provide a glimpse into the history and mythology of ancient Egypt. Bonus steps provide ways to customize drawings with historically accurate symbols and other details."}, {"id": "0970739923", "genre": "Children's Books", "title": "Andrew Henry's Meadow", "description": "Andrew Henry's Meadow by Doris Burn is a children's classic. This 40th Anniversary Edition will entertain children and adults alike. The creative antics of Andrew Henry Thatcher and his friends will inspire your imagination."}]