[{"id": "1583415491", "genre": "Children's Books", "title": "The 9/11 Terror Attacks (Days of Change)", "description": "Discusses the events leading up to the terrost attacks of September 11, describing foreign relations with the Middle East, the global response after the attack, and how these attacks changed the world."}, {"id": "152484313X", "genre": "Children's Books", "title": "Today Emilee Will Be a Princess", "description": "Everybody wants to be a princess! What could be better? In \"Today Emilee Will Be a Princess,\" one little heroine craves the royal treatment until she learns that princesses don't get to play in the mud. It's no contest--the tiara is abandoned in favor of playtime outside. Parents and children will happily follow along in this sweet book, personalized throughout just for Emilee and decorated with pretty illustrations. It's perfect for imaginative minds just learning to read!"}, {"id": "1542359384", "genre": "Children's Books", "title": "The Temple Of Unity: What makes us human? Can a robot learn to love? Come to the future to find out. (Inspirational Fantasy Books for Kids) (Children's Books by MeditativeStories.com)", "description": "In a beautiful city, far in the future, ordinary human beings live peacefully together with robots that look and behave like humans. On the mountains that surround the city stands a special temple, golden and glowing, named \"The Temple of Unity\". This is the story of a boy and a robot girl who are best friends. They spend a lot of time together, and the thing they both like the most is going up the hill at sundown to gaze at the magical, colorful rays coming from the mysterious shrine.  The story changes when one day the boy invites his friend to enter the temple with him. Shocked by the idea, the robot girl refuses because the temple is inaccessible to those who are incapable of emotions, and therefore it is forbidden to robots. After this event their friendship cools down. The boy's attempts to show his friend that she already has human feelings are in vain. As time passes, and as the distance between the two friends is felt more and more, we, the readers, and the little robot girl will discover the unpredictable miracles of the magical and transforming power of love..."}, {"id": "B0762H4S4G", "genre": "Children's Books", "title": "The Binding Witch and the Fortune Taker: The Kate Roark Magic Series #1", "description": "The Binding Witch and the Fortune Taker is the first in a series and a 17,500 word novelette.Growing up homeschooled on the Renaissance Festival circuit is weird enough, but when you're the daughter of a powerful binding witch who makes a living as a fortune teller, and your best friend is a middle-aged sari vendor, weird is relative.Fifteen-year-old Kate Roark desperately wants to be a witch but isn't - yet. It's not likely at her age until she meets the Fortune Taker and gets a taste of unimaginable power - but at what cost?Forced to choose between keeping stolen power or making her magic dreams come true, her ultimate decision throws her entire world into question.Described as \"book candy\", and \"compulsively readable,\" The Binding with and the Fortune Taker is the first in the Kate Roark Magic Series from emerging YA fantasy writer, Laura Rich."}, {"id": "0142403407", "genre": "Children's Books", "title": "101 Ways to Bug Your Parents", "description": "Steve \"Sneeze\" Wyatt was born to invent things, and his latest gadget— the Nice Alarm, which wakes you up with a gentle tap on the shoulder—promises to make him rich and famous! All Sneeze needs to do is attend the Invention Convention, and he will be catapulted into stardom. So, when Sneeze’s convention plans are nixed by his parents, who have enrolled him in a creative writing class instead, he is appalled. For his first writing project, Sneeze starts a list of ways to bug his parents. It keeps growing until he hits upon a brilliant plan—a plan that will enable him to attend the convention with or without his parents. . . ."}]