[{"id": "1973107171", "genre": "Children's Books", "title": "Samurai Parenting Secrets: 7 Steps to Give Your Child More Focus, Discipline and Confidence from a Martial Arts Expert", "description": "Are you frustrated and tired of not knowing how to help your child make better decisions? Having spent over 12000 hours working on the mats with kids, Scot has seen it all. In this book he shares with you the first steps you need to take to solve these common parenting dilemmas: Dishonesty Complaining/Whining Bullying Bad Temper Poor Impulse Control Lack of Focus and more....\""}, {"id": "1978144687", "genre": "Children's Books", "title": "Those Smith Boys on the Diamond: Or, Nip and Tuck for Victory", "description": "Thrilling tale of young men and baseball, teaching fair play and exciting competition. This is a Green Bird Publication of a quality soft cover, suitable for libraries, home libraries, gift giving, and personal keepsakes."}, {"id": "0763673897", "genre": "Children's Books", "title": "Dinosaur Kisses", "description": "WHOMP! An energetic young dinosaur figures out her own way to give a kiss in the latest from the creator of the Caldecott Honor–winning Interrupting Chicken.For newly hatched dinosaur Dinah, the world is an exciting place. There is so much to see and do. She tries this — STOMP! And she tries that — CHOMP! Then she sees a kiss and knows just what she wants to try next. Who can she kiss? And after a few disastrous attempts, can she figure out how to give someone a kiss without whomping, chomping, or stomping them first? Young children will chuckle and cheer when Dinah finds just the right creature for her dinosaur kisses in this funny new picture book from David Ezra Stein."}, {"id": "0750234768", "genre": "Children's Books", "title": "Plant Life (Cycles in Nature)", "description": "What do plants need to grow? Why do plants depend on creatures for survival? How do humans disrupt plant cycles and what can be done to protect them? Follow the plant cycle from seed to germination, growth, reproduction, and back to seed again. Try some of the activities inside to see the amazing processes for yourself."}, {"id": "1938591224", "genre": "Children's Books", "title": "The Wild Soccer Bunch, Book 1, Kevin the Star Striker", "description": "When the last of the snow has finally melted, soccer season starts! Kevin the Star Striker and The Wild Bunch rush to their field. They have found that Mickey the bulldozer and his gang, the Unbeatables, have taken over. Kevin and his friends challenge the Unbeatables to the biggest game of their lives. Can the Wild Bunch defeat the Unbeatables, or lose their field of dreams forever? Can they do what no team has done before?"}]