[{"id": "0692945644", "genre": "Children's Books", "title": "Elephants", "description": "Follow baby elephant through his day as he swims, splashes, and trumpets. A charming picture book for elephant lovers of all ages. A portion of the proceeds from the book benefit Amboseli Trust for Elephants, a non-profit organization that aims to ensure the long-term conservation and welfare of Africa's elephants."}, {"id": "054503423X", "genre": "Children's Books", "title": "Littlest Pet Shop: Teacher's Pet (rdr)", "description": "How big is your Littlest Pet Shop bookshelf? Be sure to add this Level 2 reader to your collection!Find out what happens when the Littlest Pet Shop pets go to school in this Level 2 reader!"}, {"id": "B002N2XF5A", "genre": "Children's Books", "title": "Young Pele: Soccer's First Star", "description": "HOW DID A POOR BOY named Edson - who kicked rocks down roads and dribbled balls made from rags - go on to become the greatest soccer player of all time? While other kids memorized letters, Edson memorized the scores of soccer matches. And when Edson finally played in a youth soccer tournament in the town of Bauru, Brazil, he focused on only one thing from the moment the whistle blew: the goal. Here is the story of the boy who overcame tremendous odds to become the world champion soccer star Pelé."}, {"id": "B00V02GXEY", "genre": "Children's Books", "title": "Grand Canyon Vacation Trip: What To See – Picture Book for Children", "description": "The Grand Vacation Trip is a short illustrated picture guide for kids 6 to 12 of what to see when planning their visit. The Grand Canyon is one of the Seven Natural Wonders of the World and this 2015 vacation trip captures the many memories of this awesome destination for other families. This picture book is a great help for young people learning how to use their Kindle and e-reader devices."}, {"id": "1626171386", "genre": "Children's Books", "title": "United States Tennis Association (Major League Sports)", "description": "\"Engaging images accompany information about the United States Tennis Association. The combination of high-interest subject matter and light text is intended for students in grades 2 through 7\"--"}]