[{"id": "1616204516", "genre": "Science Fiction & Fantasy", "title": "The Storied Life of A. J. Fikry: A Novel", "description": "\"Funny, tender, and moving, The Storied Life of A. J. Fikry reminds us all exactly why we read and why we love.\"*   A. J. Fikry’s life is not at all what he expected it to be. He lives alone, his bookstore is experiencing the worst sales in its history, and now his prized possession, a rare collection of Poe poems, has been stolen. But when a mysterious package appears at the bookstore, its unexpected arrival gives Fikry the chance to make his life over--and see everything anew.   “This novel has humor, romance, a touch of suspense, but most of all love--love of books and bookish people and, really, all of humanity in its imperfect glory.” -- Eowyn Ivey, author of The Snow Child   “Marvelously optimistic about the future of books and bookstores and the people who love both.” -- The Washington Post   “You won’t want it to end.” -- Family Circle   “A natural for book groups.” -- Richmond Times-Dispatch   “A reader’s paradise of the first order.” -- The Buffalo News   “A fun, page-turning delight.” -- Minneapolis Star Tribune   “Captures the joy of connecting people and books . . . Irresistible.” -- Booklist   “A wonderful, moving, endearing story of redemption and transformation that will sing in your heart for a very, very long time.” -- Garth Stein, author of The Art of Racing in the Rain   “Readers who delighted in The Guernsey Literary and Potato Peel Pie Society, The Unlikely Pilgrimage of Harold Fry, and Letters from Skye will be equally captivated by this novel.” —*Library Journal, starred review"}, {"id": "0345538994", "genre": "Science Fiction & Fantasy", "title": "The Lost World: A Novel (Jurassic Park)", "description": "From the author of Timeline, Sphere, and Congo comes the sequel to the smash-hit Jurassic Park, a thriller that’s been millions of years in the making.   #1 NEW YORK TIMES BESTSELLER   “Fast and gripping.”—The Washington Post Book World   It is now six years since the secret disaster at Jurassic Park, six years since the extraordinary dream of science and imagination came to a crashing end—the dinosaurs destroyed, the park dismantled, and the island indefinitely closed to the public.   There are rumors that something has survived. . . .   “Harrowing thrills . . . fast-paced and engaging.”—People  “A very scary read.”—Entertainment Weekly   “Action-packed.”—New York Daily News   “An edge-of-the-seat tale.”—St. Petersburg Times"}, {"id": "1496201868", "genre": "Science Fiction & Fantasy", "title": "Black Jesus and Other Superheroes: Stories (Prairie Schooner Book Prize in Fiction)", "description": "Winner of the Prairie Schooner Book Prize in Fiction, Black Jesus and Other Superheroes chronicles ordinary people achieving vivid extrasensory perception while under extreme pain. The stories tumble into a universe of the jaded and the hopeful, in which men and women burdened with unwieldy and undesirable superhuman abilities are nonetheless resilient in subtle and startling ways. Venita Blackburn's characters hurl themselves toward the inevitable fates they might rather wish away. Their stories play with magic without the sparkle, glaring at the internal machinations of the human spirit. Fragile symbols for things such as race, sexuality, and love are lifted, decorated, and exposed to scrutiny and awe like so many ruins of our imagination. Through it all Blackburn’s characters stumble along currents of language both thoughtful and hilarious.   "}, {"id": "0312944225", "genre": "Science Fiction & Fantasy", "title": "The Dark Storm (A Dark Storm Novel)", "description": "Gabriel is a New York City college kid who loves to bury his nose in books, looking up stories of long-dead cultures, lost languages, and forgotten legends. He never imagined one of those legends would come looking for him—until a tough-talking girl named De Mona Sanchez thrusts an ancient weapon into his hands...and recruits Gabriel in a dark epic war he was born to fight.Banished centuries ago by warrior knights, a demonic army is storming through a dimensional rift into our world. Stalkers are prowling the streets. Corpses are rising up to fight. And Gabriel—a descendant of one of the original warriors—has no choice but to drop his textbooks and start kicking demon butt alongside his new friend De Mona…who has a few secrets of her own. If Gabriel fails, humanity loses. If war is hell, this is hell on earth…"}, {"id": "099559421X", "genre": "Science Fiction & Fantasy", "title": "Pebble in the Dark", "description": "A sci-fi, espionage thriller and the first in a new series of books by Antony Botting. The discovery of a hidden extraterrestrial craft on Earth attracts attention from those who would seek to possess and learn from it. As the casualties mount, nobody is safe in this action packed story of deception and violence. The Pebble lay lost and undisturbed for millennia, harbouring answers to eternal questions. Five sealed auction invitations, sent to heads of state to ensure that the Pebble does not fall into the hands of a clandestine organisation by the name of Onyx, trigger an unforeseen sequence of events. The residence of Ambassador Francis Sunderland is the venue for a celebration in honour of Wasyl Bohdanov, which takes a turn for the sinister. The Ambassador is contacted by an old friend, but it isn’t a social call. A young woman will stop at nothing to deliver the Pebble to Onyx. The organisation which took her in and protected her from a terrible past. The stage is set for humanity’s ultimate struggle for knowledge and power."}]