[{"id": "1425914101", "genre": "Science Fiction & Fantasy", "title": "ICTIS", "description": "ICTIS is an historical fantasy fiction set in a 12th Century Benedictine priory in Cornwall, at a time when anti-Semitism was rife. Filled with conundrums, clues and codes, the reader is kept in suspense throughout. ICTIS is also a murder mystery, challenging the reader to find the identity of the psychopathic killer and escape from the time zone. Incorporating the philosophy and theology of the day, the novel touches on the three major religions and reveals historical facts that have rarely been examined. ICTIS is written on a variety of levels to be enjoyed by both academics and non academics. Filled with intrigue, ICTIS delves into the deepest, darkest recesses within the human mind, uncovering the basic nature of man; right down to his very soul. Can you the reader discover the way out of the maze, before it's too late?"}, {"id": "B071JZ1D5G", "genre": "Science Fiction & Fantasy", "title": "DC Comics Legends Unofficial Game Guide", "description": "Unofficial advanced tips and strategy guide. This is the most comprehensive and only detailed guide you will find online. With the success of my hundreds of other written guides and strategies, I have written another advanced professional guide for new and veteran players. This gives specific strategies and tips on how to progress in the game, beat your opponents, acquire more coins and currency, and much more! \n\n\n Professional tips and strategies \n Cheats and hacks \n Heroes setup \n Team setup \n Secrets, tips, cheats, unlockables, and tricks used by pro players \n How to get tons of cash/coins \n Plus much more! \n\nThere is no other guide that is as comprehensive and advanced as this one. Disclaimer: This product is not associated, affiliated, endorsed, certified, or sponsored by the original copyright owner. \n"}, {"id": "1504049330", "genre": "Science Fiction & Fantasy", "title": "The Mirror", "description": "In this twisting time-travel thriller, a woman faints on the eve of her wedding and awakens at the turn of the century in her grandmother’s body  The night before her wedding, Shay Garrett has no idea that a glimpse into her grandmother’s antique Chinese mirror will completely transform her seemingly ordinary life. But after a bizarre blackout, she wakes up to find herself in the same house—in the year 1900. Even stranger, she realizes she is now living in the body of her grandmother, Brandy McCabe, as a young woman. Meanwhile, Brandy, having looked into the same mirror, awakens in Shay’s body in the present day to discover herself pregnant. Did Shay die and get reincarnated as young Brandy, who is about to get married herself? The answer is far more complex and bizarre than either woman can imagine.   Shay’s mother, Rachael, weaves back and forth between the two time periods in this riveting story of three headstrong women grappling with identity, love, and family drama. From courageous, compassionate Shay, who suddenly finds herself fighting against the confines of a society decades away from women’s liberation, to Brandy, struggling to adapt to a more modern world, Millhiser’s strong characters are up to the task presented by this imaginative yet humorous adventure.   This extraordinary novel is both a fascination tale of time-travel suspense and a journey to the heart of the bond shared by three generations of women. It is a tribute to survival, and to the triumph of the female spirit in the face of seemingly insurmountable obstacles."}, {"id": "1492869627", "genre": "Science Fiction & Fantasy", "title": "1: The adventures of Oloorin and Co: Volume I", "description": "Following a group of rookie adventures led by the male barbarian Oloorin, they set out to find quests to undertake, monsters to slay and treasure to loot. In the hunt for quests to complete and for fame and riches, the party stumbles upon several quests that they undertake. This volume contains five of their first adventures which are... The Werewolves of Dalruan, The Burning plague, An Icy Grave, Bloodbath and The Keep"}, {"id": "B072KFKJ32", "genre": "Science Fiction & Fantasy", "title": "Realm of Night (Mina Murray Book 3): A Dracula Retelling", "description": "Mina and her allies have destroyed Vlad Draculesti, but the human world is still in danger from his vampire allies. From Berlin to Paris, major European cities have begun to fall to their followers. To spare humanity from the grip of looming darkness, Mina must defeat one of the most powerful vampires in the world...A thrilling retelling of a classic tale, REALM OF NIGHT is the third book of the Mina Murray series."}]