[{"id": "0375871683", "genre": "Children's Books", "title": "Rush for the Gold: Mystery at the Olympics (The Sports Beat, 6)", "description": "New York Times bestselling sportswriter John Feinstein dives headfirst into a scandal of Olympic proportions in this exciting sports mystery.   Teen sports reporter Susan Carol is competing as a swimmer at her first-ever Olympic games. It’s the opportunity of a lifetime, and her best friend Stevie is both amazed and envious. Usually they cover sporting events together, now he’s covering her. But Stevie can’t shake the feeling that something’s not right. Everyone wants a piece of Susan Carol’s success—agents, sponsors, the media. Just how far will they go to ensure that America’s newest Olympic darling wins gold?   John Feinstein has been praised as “the best writer of sports books in America today” (The Boston Globe), and he proves it again in this fast-paced novel.From the Hardcover edition."}, {"id": "B00Q9KC15M", "genre": "Children's Books", "title": "Under The Stairs", "description": "What lives in the small room under the stairs?  A little boy and his dog go in search of answers. As each family member is brought into the mystery, imagination begins to take over. Will they ever discover the truth?"}, {"id": "1543508340", "genre": "Children's Books", "title": "Dogs and Their Puppies: A 4D Book (Animal Offspring)", "description": "Easy-to-follow text and photos introduce readers to dogs and their puppies. Plus each title includes bonus augmented reality video to help readers learn more."}, {"id": "B01MZ1W3IE", "genre": "Children's Books", "title": "DLee's Snow Day: The Snow Kids & Curious Cat Bilingual Story", "description": "A winter tale featuring the character DLee, her brother Angel, and her curious cat, Mr. Mustache. Published as a bilingual story, in both English and Spanish, this story captures the beauty and magic of a child's first snowfall.    "}, {"id": "1974094197", "genre": "Children's Books", "title": "4: The Winning Touchdown: A Story of College Football (College Sports) (Volume 4)", "description": "Howard Roger Garis (April 25, 1873 – November 6, 1962) was an American author, possibly the most prolific children's authors of the early 20th century. Garis wrote many books for the Stratemeyer Syndicate under various pseudonyms. As Victor Appleton, he wrote about the enterprising Tom Swift; as Laura Lee Hope, he is generally credited with writing volumes 4–28 and 41 of the Bobbsey Twins; as Clarence Young, the Motor Boys series; as Lester Chadwick, the Baseball Joe series."}]