[{"id": "B01675A8JE", "genre": "Children's Books", "title": "So, You Want to Be a Coder?: The Ultimate Guide to a Career in Programming, Video Game Creation, Robotics, and More! (Be What You Want)", "description": "Love coding? Make your passion your profession with this comprehensive guide that reveals a whole host of careers working with code.Behind the screen of your phone, tablet, computer, or game console lies a secret language that allows it all to work. Computer code has become as integral to our daily lives as reading and writing, even if you didn’t know it! Now it’s time to plug in and start creating the same technology you’re using every day. Covering everything from navigating the maze of computer languages to writing code for games to cyber security and artificial intelligence, So, You Want to Be a Coder? debugs the secrets behind a career in the diverse and state-of-the-art industry. In addition to tips and interviews from industry professionals, So, You Want to Be a Coder? includes inspiring stories from kids who are working with code right now, plus activities, a glossary, and helpful resources to put you on the path to a fun and rewarding career with computer code today!"}, {"id": "B00AA4TS7M", "genre": "Children's Books", "title": "T Is For Turkey( An Illustrated Alphabet Book + Free Games)", "description": "An illustrated alphabet book. As adults we often forget the awe of learning something for the first time. For a child everything is a learning experience . The better we learn how to clearly describe something , with as few words as necessary , the faster the child will be able to visualize the scene in his or her mind.As we get better to fleshing out this ideas and thoughts on the paper , children will become able  faster  to describe bigger ideas.Ask yourself : how is it , what does it look like , is it sweet or sour , is it rough or smooth?All of this things can be described with words , and as the words are spoken , you will stir the imagination of the child listener.Active links for easy navigation and bonus games."}, {"id": "1432900234", "genre": "Children's Books", "title": "My First Internet Guide (My First Computer Guides)", "description": "What is a web site? How does a search engine help us? How can we keep in touch using the Internet? The Internet can help us in so many ways. Read 'My First Internet Guide' to find out how you can have fun using the Internet safely."}, {"id": "1524719587", "genre": "Children's Books", "title": "Thomas and the Snowy Tracks (Thomas & Friends) (Pictureback(R))", "description": "An all-new Thomas & Friends winter story! Thomas the Tank Engine and his friend Gordon face a gigantic snowfall and a monster-size snowball on the Island of Sodor in a glitter-sprinkled story about two determined steam engines that think they can overcome adversity—and do! Train-loving boys and girls ages 3 to 7 won’t be able to resist this sparkly paperback storybook with its glittery cover, glitter-sprinkled pages, and big glitter-covered poster of Thomas inside!"}, {"id": "0142415723", "genre": "Children's Books", "title": "Keena Ford and the Field Trip Mix-Up", "description": "Keena Ford is so excited to go on a field trip to the United States Capitol with her second-grade class! At school, she is running for a spot on the student council, and on the field trip she's going to meet a real live U.S. representative. The only trouble is, mean Tiffany Harris keeps teasing Keena and taking the best place in line. Keena doesn't mean to get into trouble, but trouble seems to find her anyway!"}]