[{"id": "1436451159", "genre": "Children's Books", "title": "Monster Fish Frenzy (Turtleback School & Library Binding Edition) (Wiley & Grampa's Creature Features)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. While Grampa and Wiley try to capture the legendary Moby Fizz, the \"\"biggest, bloated, deformed bass\"\" in Lake Putrid, they encounter a school of man-eating piranhas and many other surprises."}, {"id": "1426329792", "genre": "Children's Books", "title": "Just Joking Sports", "description": "The newest book in the popular Just Joking series delivers 300 sports-themed laugh-out-loud knock-knocks, question-and-answer jokes, tongue twisters, and more! Another surefire winner and a great intro for newcomers to the series, sports fans, or avid Just Joking fans.Calling all sports fans! This collectible little book is packed with hundreds of silly, kid-friendly sports jokes paired with photos of laughing animals and funny people. It's a hilarious party-starter or quiet time entertainer, perfect to read alone or aloud with friends and family. It's also a great book to toss into a backpack to share at school or camp."}, {"id": "1981279393", "genre": "Children's Books", "title": "Children's Book: An Amazing Animal Picture Book about Vervet Monkey for Kids", "description": "Children's Book: An Amazing Animal Picture Book about Vervet Monkey for Kids"}, {"id": "B00ZUY7FXG", "genre": "Children's Books", "title": "July 4th - Independence Day Lapbook: Plus FREE Printable Ebook", "description": "July 4th is about so much more than cookouts, fireworks, and celebrations.  Take a journey with us, and find out about the history of this important holiday.  All templates, instructions, and a Study Guide are included.  Perfect for K-5th grade students, but also easily adaptable to the older students as well.Use the coupon on the last page to download a free PDF version of the lapbook in order to print pages."}, {"id": "1623540860", "genre": "Children's Books", "title": "Presidential Pets: The Weird, Wacky, Little, Big, Scary, Strange Animals That Have Lived In The White House", "description": "Remember Socks? Who didn’t love Barney? We’ll sure miss Bo. Who will the next Presidential Pet be?   New in paperback! Did you know that John Quincy Adams kept an alligator in the bathtub, while Thomas Jefferson's pride and joy was his pair of bear cubs? Andrew Jackson had a potty-mouthed parrot, and Martin Van Buren got into a fight with Congress over his two baby tigers. Find out all about the weird, wacky, little, big, scary, strange animals that have lived in the White House. Perfect for election year collections and displays. Pair with White House Kids for double the White House shenanigans."}]