[{"id": "B00E3BZ4YY", "genre": "Children's Books", "title": "Jellybeans Morning, Noon And Night", "description": "“Jellybeans Morning, Noon and Night,” is about two brothers who share a love of jellybeans! No matter what the flavor, those boys just love jellybeans—all of them. If they had it their way, they would eat jellybeans for breakfast, jellybeans for lunch, and jellybeans for dinner. And that’s exactly what they plan to do! It is a brilliant plan, isn’t it?Written by Maggie Pajak and illustrated by Marni Backer, “Jellybeans Morning Noon & Night” is a delicious story filled with a sweet lesson of moderation and a savory message to parents to let your kids (sometimes) figure things out on their own. But more importantly—it is sprinkled with a few giggle-filled moments that both you and your kids will enjoy."}, {"id": "1432911880", "genre": "Children's Books", "title": "Doctors (People in the Community)", "description": "How do doctors help us? Read this book to find out - and learn all about doctors! The books in the 'People in the Community' series use attractive photographs and simple text to introduce children to the work of people they may meet. In 'Doctors', children can read about doctors in communities around the world, including what they do, the tools they use, where they work, the people they work with, and how doctors help us."}, {"id": "1481471384", "genre": "Children's Books", "title": "The Complete Missing Collection: Found; Sent; Sabotaged; Torn; Caught; Risked; Revealed; Redeemed (The Missing)", "description": "Plunge into the past—and change the course of history—with all eight books in the New York Times bestselling The Missing series, now available in a collectible boxed set.Thirteen-year-old Jonah has always known that he was adopted, and he’s never thought it was a big deal. Then he and a neighbor, Chip, who finds out he’s also adopted, begin receiving mysterious letters. Jonah, Chip, and Jonah’s little sister Katherine are plunged into a mystery that involves the FBI, a vast smuggling operation, an airplane that appeared out of nowhere—and people who seem to disappear and reappear at will...until they make a staggering discovery: Jonah and Chip, and other kids are actually missing children from throughout history, stolen for profit by time travelers. Now, they are caught in a battle between two opposing forces that want very different things for them—and their choices will determine the course of their own lives, and the lives of their friends. Ideal for newcomers to the series and loyal fans alike, this collection includes Found, Sent, Sabotaged, Torn, Caught, Risked, Revealed, and Redeemed."}, {"id": "078077017X", "genre": "Children's Books", "title": "Ramona la Chinche = Ramona the Pest (Spanish Edition)", "description": "Por fin llega el tan esperado primer dia de clases de Ramona. Ahora podrA hacer las mismas cosas que su hermana Beezus y sus amigos. Los lectores la acompaNaran en sus alegrias y tristezas, en sus occurrencias y sus travesuras, sus miedos y sus fantasIas. CompartirAn la caIda del primer diente, la primera vergUenza, las primeras letras..."}, {"id": "B075R1X3JH", "genre": "Children's Books", "title": "Football Fun Day (Sammy the Bird Book)", "description": "Children's Book: Football Fun DayBedtime Stories for KidsIt's that time of year again—it's football season! Sammy loves the sport but this little bird needs your help. So read along as you'll be asked to participate in football practice with Sammy.  This is a read aloud kids book and is easy to read. The target age range audience is for toddlers, preschool and young children. This is a book that any child will love, especially at bedtime. It is suitable for parents to read to their children. Grandparents will definitely enjoy reading this book to their grandchildren. Read this children's book FREE as part of your PRIME or Kindle Unlimited membership!"}]