[{"id": "B0099SEKX2", "genre": "Children's Books", "title": "More Jammin' with the Jonas Brothers: An Unauthorized Biography", "description": "This follow-up to Jammin? with the Jonas Brothers has the latest info on the mega-talented pop-rock sensations! The brothers have released three successful albums, starred in Disney?s hit made-fortelevision movie Camp Rock, toured extensively, and have their own Disney Channel TV series set for spring 2009. Their latest album, A Little Bit Longer, sold over 672,000 copies in its two first weeks on the market! Get the latest info on these heartthrobs in an extended biography with 8 pages of color photos!"}, {"id": "1550028464", "genre": "Children's Books", "title": "The Young City: The Unwritten Books", "description": "Rosemary Watson and Peter McAllister think their future is clear: they’re finally heading off for university. They’re thinking about finding apartments, picking courses, living like adults.But what happens when the future becomes the past? While helping Rosemary’s brother move into an apartment in Toronto, Peter and Rosemary fall into an underground river and are swept back in time, to Toronto in 1884. It’s a struggle to survive and adapt to the alien culture of the late nineteenth century. Peter and Rosemary are forced to work together, to live together, and to become the adults they’ve only been pretending to be.As the days stranded turn to weeks, then months, Rosemary and Peter begin to wonder if they’re really ready for a future together - and what they will do if they can’t get back.Then someone brings them a watch, powered by a battery, made in Taiwan."}, {"id": "0844291145", "genre": "Children's Books", "title": "Let's Learn English Picture Dictionary (Children's English)", "description": "More than 1,500 pictures are paired with the corresponding words in such categories as the classroom, the four seasons, human history, and the family tree."}, {"id": "1433988224", "genre": "Children's Books", "title": "BMX (Incredibly Insane Sports)", "description": "Bicycles are a great way to get from place to place, but BMX riders are all about style. Readers will discover the high-flying world of BMX through exciting text. The history of the sport is on full display, along with its most exciting riders. Full-color photographs show the gravity-defying feats of BMX while educating readers on the science the sport. Interactive challenges, to encourage the exercise of both body and mind, are also provided."}, {"id": "0751345962", "genre": "Children's Books", "title": "DK Readers 1:First Day at Gymnastics Paper (DK Readers Level 1)", "description": "Jump into your leotard and join Jenny as she wobbles her way through her first gymnastics class. This book is part of the range of graded readers that aim to capture children's attention while developing their reading skills and general knowledge. Level one is for beginner readers."}]