[{"id": "0394839102", "genre": "Children's Books", "title": "The Berenstain Bears and the Spooky Old Tree", "description": "Illus. in full color. Three brave little bears explore the inside of a mysterious old tree and go into, up, through, over, down, and out. "}, {"id": "1930353642", "genre": "Children's Books", "title": "14: Fire, Smoke, and Secrets (Sammy and Brian Mystery Ser)", "description": "This children's historical fiction story (ages 9-15) based at Wheatland, Lancaster, Pa. home of President James Buchanan (fifteenth U.S. President), follows three fifteen-year-old super sleuths as they discover why a letter written to President Buchanan in 1868 was never delivered. When artifacts disappear from the Wheatland mansion, the amateur detectives are invited to investigate the thefts. Is there a connection between the missing items and James Buchanan's letter? Secret doors and ghostly noises are usually not part of the Wheatland tours. Why now? (120pp. Gaslight Pub., 2002.)"}, {"id": "0792269381", "genre": "Children's Books", "title": "Secrets Of The Pyramids: National Geographic Maze Adventures", "description": "In an ancient Egyptian town, a friend’s father is trapped inside the Great Pyramid. To reach him, readers have to make their way through secret tunnels and chambers, deciphering hieroglyphics, uncovering buried treasures, and learning a lot about pyramid construction and life in the age of pharaohs."}, {"id": "1508142637", "genre": "Children's Books", "title": "4: Watch Out for Rattlesnakes! (Wild Backyard Animals)", "description": "What’s that rattling sound? Readers will learn all about this backyard beast—the poisonous rattlesnake—and how they can keep themselves safe. This book explores the rattlesnake’s habitat, anatomy, behavior, and diet, as well as its telltale rattle and hunting techniques. Color photographs and high-interest text will bring readers up close and personal with this predator of the American Southwest. Fact boxes round out the learning experience, and readers are sure to walk away with great understanding of this animal and the desire to explore other backyard beasts. This exciting book is sure to bring life sciences curricula to life."}, {"id": "3791371134", "genre": "Children's Books", "title": "From Mud Huts to Skyscrapers", "description": "Children will be utterly absorbed by this journey through the history of architecture, from the earliest mud huts to today’s soaring towers. Chronologically arranged, this large-format book gives each iconic building its own double-page spread featuring an exquisite watercolor illustration and clearly written descriptions, facts, and features. These vibrantly detailed pages are filled with people, animals, and other objects that help bring the buildings to life. A detailed appendix includes a timeline, a world map that points out where each building can be found, and an extensive glossary. Children will enjoy poring over this book—and will come away with a fundamental understanding of not only the most common architectural terms, but also of how the built world has evolved marvelously over time."}]