[{"id": "1532888902", "genre": "Science Fiction & Fantasy", "title": "The Ghost Rebellion (The Ministry of Peculiar Occurrences) (Volume 5)", "description": "From authors Pip Ballantine and Tee Morris, the award winning steampunk series continues.  The chase is on!  After rescuing Queen Victoria from the clutches of the Maestro, Agents Eliza D Braun and Wellington Books are in hot pursuit of Dr Henry Jekyll. While he continues his experiments on the aristocracy of Europe, he leaves a trail of chaos and despair in his wake. However when Eliza and Wellington run him to ground in India, they are forced to come face to face with ghosts from the past and the realities of the British Empire.  Meanwhile Ministry agents Brandon Hill and Bruce Campbell travel deep into Russia hunting down a rare ingredient to save Queen Victoria's life. Within the darkness and bitter cold, they uncover a threat from a revitalized House of Usher that comes directly from their new Chairman. A threat that promises to plunge the world into chaos!"}, {"id": "B0731FNXBD", "genre": "Science Fiction & Fantasy", "title": "Dime Novel Cover (15 Book Series)", "description": "From Book 1: Denver Doll and Yankee Eisler are a likely pair, both pursuing the scoundrel road-agent John McParland. One is a legendary scrapper and lover, the other is all business. Together they unravel the mystery of an orphan child and her murdered mother. Along the way we encounter Doll's three stooges Walt, Yakie and Chug; femme-fatale the mysterious Mademoiselle Zoe, bumbling reporter Charles Pygmalion Jones, righteous merchant Crystal Carrol and the slimy Valentine Verner. The very existence of the mining town Shining Bar is at risk if Doll and Yankee fail. This volume reprints the original 1882 novel plus a new version updated for modern audiences."}, {"id": "1785654446", "genre": "Science Fiction & Fantasy", "title": "Aliens: Bug Hunt", "description": "When the Colonial Marines set out after their deadliest prey, the Xenomorphs, it’s what Corporal Hicks calls a bug hunt—kill or be killed. Here are fifteen all-new stories of such “close encounters,” written by many of today’s most extraordinary authors.Set during the events of all four Alien™ films, sending the Marines to alien worlds, to derelict space settlements, and into the nests of the universe’s most dangerous monsters, these adventures are guaranteed to send the blood racing—One way or another."}, {"id": "1940095433", "genre": "Science Fiction & Fantasy", "title": "The Balance Omnibus", "description": "The entire saga of Alan Baxter's dark urban fantasy series, The Balance, in one volume. This collection includes two novels and two short stories.   RealmShift  Isiah is having a bad day. Samuel Harrigan used ancient blood magic to escape a deal with the Devil and now Lucifer wants Sam’s soul more than ever. But Isiah has to protect the blood mage for a greater destiny, with the fate of humanity itself in the balance.   MageSign  In an effort to track down the evil Sorcerer, Samuel Harrigan’s mentor, Isiah uncovers a blood cult bigger than he ever imagined, with a plan more dangerous than anyone could have dreamed. Only Isiah stands between the cult and a world-shattering disaster.   Running Wild From The Hunt  A schoolboy is plagued by nightmares of being hunted until a strangely powerful man offers him assistance.   Stand-Off  A young man finds himself caught in a supernatural tug-of-war between two powerful beings."}, {"id": "0761521488", "genre": "Science Fiction & Fantasy", "title": "Star Wars: Episode I--The Phantom Menace (Prima's Official Strategy Guide)", "description": "Covers PlayStation and PC versions! Detailed walkthroughs of every level Every optional side quest exposed Secret areas and items revealed Solutions to every puzzle Maps to guide you through difficult areas"}]