[{"id": "B077CXQCGR", "genre": "Children's Books", "title": "The Beginner's Bible People of the Bible", "description": "The beloved The Beginner’s Bible® brand is the bestselling Bible storybook of our time, with more than 25 million products sold.Dig deeper with The Beginner’s Bible People of the Bible, the perfect way to introduce young readers to key Bible characters. Children will learn about over 30 men, women, and children from the Old and New Testaments, including Noah, David, Esther, Jesus, and more. With interesting facts, cool stories, and text written for new readers, this book is packed with learning and fun! The book also features a padded cover, vibrant, 3-D art, and tons of great takeaways for children learning about the Bible. Little ones will love the bright art and timeless stories, and parents will love helping their children grow closer to God."}, {"id": "0679887598", "genre": "Children's Books", "title": "Snow White", "description": "Santore's rich watercolors capture the moods and emotions of the Grimm Brother's tale from its awe-inspiring landscapes to the subtle majesty of the changing hours of th eday. This Snow White will surely stand the test of time and become a classic in its own right.  "}, {"id": "0763683264", "genre": "Children's Books", "title": "The Christmas Story", "description": "Hope and joy radiate from the pages of Robert Sabuda's new pop-up book celebrating the Nativity.Long ago in the town of Bethlehem, on a bright and starry night, a baby was born, a child who was called the son of God. Announced by an angel, born in a humble manger, laid in a bed of straw, visited by shepherds and wise men—the age-old, awe-inspiring story of the birth of Jesus is lovingly brought to life by master pop-up artist Robert Sabuda in six gorgeously imagined scenes, culminating in a 3-D manger sheltering humans and beasts, guarded by an angel above. Glinting with touches of gold and pearlescent foil, The Christmas Story is a visual feast, a holiday treasure to be shared with the whole family."}, {"id": "1416985786", "genre": "Children's Books", "title": "The American Muslim Teenager's Handbook", "description": "How do you reconcile being a teenager in America with being a Muslim? It’s not as difficult as you think! The American Muslim Teenager’s Handbook is a positive, fun, informative guide to being a Muslim teenager in America today. Covering everything from basic Islamic history and reading the Quran to drinking and dating, and filled with thoughts and opinions from Muslim teenagers across the country, this is an indispensable primer, for Muslims and non-Muslims alike, to learning about and finding one’s place in American Islamic culture."}, {"id": "B013PJRYOC", "genre": "Children's Books", "title": "Insects", "description": "Award-winning science writer Seymour Simon explores the wonderful world of insects, with fascinating facts and stunning full-color photographs, in his latest nonfiction picture book. Readers will learn all about insects’ life stages, senses, bodies, and the many different kinds, including beetles, ladybugs, bees, butterflies, and more!This updated edition includes:Stunning full-color photographsGlossaryIndexWebsite and additional reading sourcesSupports the Common Core Learning Standards, Next Generation Science Standards, and the Science, Technology, Engineering, and Math (STEM) standards"}]