[{"id": "1426330219", "genre": "Children's Books", "title": "National Geographic Kids Extreme Records (Fun Facts)", "description": "The biggest, wackiest, wildest, and weirdest of all the world record facts are jam-packed into this informative and superexciting fact book.From the awesome to the weird to the downright gross, get ready to meet the world's record setters! You'll find fantastic firsts, awesome extremes, and weird wonders in achievements made by animals, humans, and Mother Nature. Paired with eye-popping design and unforgettable photographs, this book blows the record-book competition away and takes first place as the zaniest, most eye-catching, unbelievable, and best of the best record books you can find!"}, {"id": "0991150309", "genre": "Children's Books", "title": "Are You A Frog?", "description": "\"Are You A Frog?\"  You may be surprised by the answer in this engaging and clever conversation with some of Nature's most resilient and lovable (and persuasive!) creatures.  Brought to life through stunning illustration, these expressive amphibians LEAP at the chance to convince the child on your lap that FROGS ARE PEOPLE TOO!  A joyful experience for the nature lover inside you both."}, {"id": "0448481405", "genre": "Children's Books", "title": "The Night Before Hanukkah", "description": "The newest title in the bestselling Night Before series is the perfect gift for every girl and boy who celebrates Hanukkah!It's the night before the eight-day celebration of Hanukkah begins, and everyone is excited! Each evening, the family gathers to light the candles and share holiday traditions such as playing dreidel, eating latkes, and exchanging gifts. The seventeenth title in Natasha Wing's bestselling series, The Night Before Hanukkah captures all the joy and love in one of the most wonderful times of the year!"}, {"id": "0192750143", "genre": "Children's Books", "title": "Fairy Tales from England (Oxford Story Collections)", "description": "Many popular stories-- \"Dick Whittington and his Cat,\" \"The Story of Tom Thumb\", \"Jack and the Beanstalk\"--join equally good but not so well-known stories. Like the tale of the tailor who slew two giants. Or the maid who had to travel to the well at the World's End. Or the old, poor soldier who cheats the foolish farmer. Or, finally, Tattercoats, the ragamuffin who became a princess. Greedy giants, handsome princes, wicked queeens, and a lot of magic all help to ensure that this collection of traditional fairy tales has something for everyone in the family.  (paperback reissue of English Fables and Fairy Stories, ISBN 0-19-274137-3)"}, {"id": "0749603704", "genre": "Children's Books", "title": "New Energy Sources (Facts on)", "description": "This study of how energy can be generated from many different sources such as methane gas from waste products, also contains a fact file and addresses to contact for further information."}]