[{"id": "B015JRVJZS", "genre": "Science Fiction & Fantasy", "title": "Battlemage", "description": "\"I can command storms, summon fire and unmake stone,\" Balfruss growled. \"It's dangerous to meddle with things you don't understand.\" Balfruss is a battlemage, sworn to fight and die for a country that fears and despises his kind. Vargus is a common soldier - while mages shoot lightning from the walls of the city, he's down in the front lines getting blood on his blade. Talandra is a princess and spymaster, but the war may force her to risk everything and make the greatest sacrifice of all. Magic and mayhem collide in this explosive epic fantasy from a major new talent.  "}, {"id": "1481476874", "genre": "Science Fiction & Fantasy", "title": "Barbary Station", "description": "Two engineers hijack a spaceship to join some space pirates—only to discover the pirates are hiding from a malevolent AI. Now they have to outwit the AI if they want to join the pirate crew—and survive long enough to enjoy it.Adda and Iridian are newly minted engineers, but aren’t able to find any work in a solar system ruined by economic collapse after an interplanetary war. Desperate for employment, they hijack a colony ship and plan to join a famed pirate crew living in luxury at Barbary Station, an abandoned shipbreaking station in deep space. But when they arrive there, nothing is as expected. The pirates aren’t living in luxury—they’re hiding in a makeshift base welded onto the station’s exterior hull. The artificial intelligence controlling the station’s security system has gone mad, trying to kill all station residents and shooting down any ship that attempts to leave—so there’s no way out. Adda and Iridian have one chance to earn a place on the pirate crew: destroy the artificial intelligence. The last engineer who went up against the AI met an untimely end, and the pirates are taking bets on how the newcomers will die. But Adda and Iridian plan to beat the odds. There’s a glorious future in piracy…if only they can survive long enough."}, {"id": "1543642802", "genre": "Science Fiction & Fantasy", "title": "Victory's Defeat (Indian Hill)", "description": "Beth, forever fanning the flames of tension and dissension, has the Stryvers, the Progerians, and the entire human race on the brink of annihilation. It is up to Michael Talbot, BT, Drababan, and the United Earth Marine Corps to stave off this extinction event, along with General Ginson aboard the outgunned, outmanned, and nearly crippled USS Guardian. Is it too late, or can it all still be saved? "}, {"id": "0062571338", "genre": "Science Fiction & Fantasy", "title": "The Art of the Film: Fantastic Beasts and Where to Find Them", "description": "Step inside the world of the talented art departments who, led by Academy Award®-winning production designer Stuart Craig, were responsible for the creation of the unforgettable characters, locations and beasts from the eagerly anticipated new adventure in J.K. Rowling’s Wizarding World.The Art of Fantastic Beasts and Where to Find Them, edited by Dermot Power, concept artist on the film, takes you on a magical journey through a design process every bit as wonderful as that encountered by Newt Scamander in the wizarding world: from the earliest gatherings of the artists, designers and filmmakers to the magical time of the film’s production itself at Leavesden Studios.Bursting with hundreds of production paintings, concept sketches, storyboards, blueprints and matte paintings, and filled with unique insights about the filmmaking journey from Stuart Craig and the artists themselves, this superb book – officially licensed by Warner Bros. Consumer Products – presents a visual feast for readers, and will welcome fans of Harry Potter films into the world of Fantastic Beasts and Where to Find Them."}, {"id": "0877900930", "genre": "Science Fiction & Fantasy", "title": "Build Powerful Nerve Force: Cure for the Dull Dragged-Out Hopeless, Helpless Life", "description": "Millions of healthy, happy followers have learned to control their Vital Nerve Force-The Bragg Healthy Way. This book provides prevention, health, maintenance-All in one book! You NEED this book if you have: stress overload, chronic fatigue, insomnia, depression, nervous indigestion, anxiety attacks, mood swings and general health burnout."}]