[{"id": "B00B9VWISG", "genre": "Children's Books", "title": "Beginning Again: Further Adventures of a Loyalist Family", "description": "Beginning Again is a sequel to Escape: Adventures of a Loyalist Family, Mary Beacock Fryer's historical novel for ten to fourteen-year-olds. This new work chronicles the lives of the Seamans as they make a new start in Canada."}, {"id": "1433900181", "genre": "Children's Books", "title": "Danica Patrick (People We Should Know)", "description": "Gives readers a close-up look at key figures from a variety of arenas--from sports to politics--offering insight into each person's early life, inspirations, and the struggles they faced on their rise to greatness."}, {"id": "0995577056", "genre": "Children's Books", "title": "DINOSAURS!: Explorer", "description": "Dig deep with our explorer to uncover the fascinating world of dinosaurs. Our six-foot-long timeline features over 100 dinosaurs from their first appearance about 230 million years-ago through to their living descendants, the birds, today. Then join our eagle-eyed explorer on his quest to find out as much as possible about these amazing creatures in his fascinating journal. Find out why the dinosaurs were so successful, who discovered the first one, what killed off the land-based dinosaurs 65 million years ago and where you can find the best dinosaur remains today!"}, {"id": "0761177426", "genre": "Children's Books", "title": "My Granny's Purse", "description": "Small is beautiful! Introducing the Mini Edition of My Granny’s Purse, which brings all the interactive features and fun of the original book to a cleverly designed format that’s affordably priced and just the right size for kids to carry anywhere and everywhere they go. The book opens up to eight sturdy, individually die-cut leaves that lift, slide, unfold, and pull out for hours of play.My Granny’s Purse reveals a delightful story told through Granny’s treasures. Kids can look through all the stamps in her passport and try on her sunglasses and rings. New are a banana with a joke, and a smartphone―this granny likes to keep up with the times.The Mini Edition is jam-packed with objects to discover and explore."}, {"id": "0778713784", "genre": "Children's Books", "title": "Women and Girls in the Middle Ages (Medieval World)", "description": "Describes the roles and duties of women and girls of all social classes during the Middle Ages, looking at such areas as medieval dress and beauty, women's rights, and women of power in Europe and other lands."}]