[{"id": "1929132395", "genre": "Children's Books", "title": "The Absent-Minded Toad", "description": "A rhyming tale about a toad who travels to the outdoor market, only to discover upon his return home that he has neglected to pick up the items on his grocery list. He does manage, however, to have a spectacularly wonderful time perusing the venue and mingling with fellow customers."}, {"id": "143424203X", "genre": "Children's Books", "title": "Running Scared (Jake Maddox Girl Sports Stories)", "description": "Olivia likes running - when she's doing it for fun, that is. But when her friend convinces her to join the track team, Olivia panics. She's convinced she'll come in last place, and people will make fun of her. So Olivia starts dropping out in the middle of her races. When her aunt realizes what she's doing, Olivia has to face her fears and quit running scared."}, {"id": "1580892590", "genre": "Children's Books", "title": "Lola Loves Stories", "description": "Lovable Lola is back in this imaginative sequel to the best-selling LOLA AT THE LIBRARY.Lola loves to go to the library with her daddy. Every night she reads a new story, and the next day, she acts it out. One day she's a fairy princess, the next day she goes on a trip to Lagos! She becomes a tiger, a farmer, a pilot. . . . what will Lola be next?Children and adults will love following along with Lola's adventures. LOLA LOVES STORIES celebrates imaginative thinking and the importance of books as a way to inspire young minds."}, {"id": "1420502069", "genre": "Children's Books", "title": "Barack Obama (People in the News)", "description": "Highlights the life and accomplishments of the Harvard Law School graduate, legislator, and civil rights lawyer who became the forty-fourth president of the United States."}, {"id": "156686657X", "genre": "Children's Books", "title": "Titanic: Adventure Out of Time (Brady Games Strategy Guides)", "description": " With this fascinating guide, you get just some hints and tips or the whole solution to the puzzle, giving you a chance to alter the course of history...by saving the Titanic from the greatest maritime disaster of all time! Get all this, plus character profiles, equipment descriptions, navigation specs, and a glossary of nautical terms Discover an enlightening history of the Titanic's last voyage with documented factual accounts and fascinating theories "}]