[{"id": "B002SR2PKQ", "genre": "Children's Books", "title": "97 Ways to Train a Dragon #9 (Dragon Slayers' Academy)", "description": "Wiglaf's supposed to be a dragon slayer, but he's more like a dragon babysitter when he finds a baby dragon and decides to keep it! Back in his first new adventure in four years, Wiglaf is as funny and appealing as ever. In keeping with the reissue of the original books in the series, the ninth book is 112 pages long and includes a hilarious bonus yearbook section that will have kids laughing out loud."}, {"id": "1410415279", "genre": "Children's Books", "title": "The Tale of Despereaux: Being the Story of a Mouse, a Princess, Some Soup, and a Spool of Thread (Thorndike Literacy Bridge)", "description": "This offers high interest award-winning or bestselling titles perfect for struggling readers, young adult ESL patrons and those with visual impairments. For interest levels grades 7-12, reading levels vary from 3rd-10th grades. 3 titles shipped every month."}, {"id": "1841489360", "genre": "Children's Books", "title": "The Story of Divaali", "description": "The Story of Divaali is a wonderful rendition of the \"Ramayana,\" an age-old Hindu epic filled with magic, miracles and adventure. The compelling story tells of a young prince Rama who overcomes Ravana the Demon King. Out of his triumph, Divaali, the Indian festival of lights, is born.The powerful narrative is perfectly complemented by the jewel-like illustrations of Nilesh Mistry. Drawing on the versions told to him in childhood by his parents, Jatinder Verma brings the essence of this great Indian epic to life for a new generation."}, {"id": "0003013146", "genre": "Children's Books", "title": "On Your Bike (Collins Pathways)", "description": "This manual of cycling makes use of a wide range of text types and is organized carefully to make the location of specific information easy."}, {"id": "0062430610", "genre": "Children's Books", "title": "Pete the Cat's Groovy Guide to Love", "description": "Love is in the air! Pete the Cat shares some groovy words from the heart in this fun collection of all his favorite famous quotes about living an awesome life filled with love.This cool cat adds his heartfelt take on well-known classics, from Vincent van Gogh to Virgil to Ovid to Charles Dickens, because after all, the best advice is \"Love conquers all.\"Fans of the bestselling Pete the Cat series will delight in this fun take on quotes, which are accompanied by Pete's witty responses and illustrations by New York Times bestselling artist James Dean."}]