[{"id": "0769641636", "genre": "Children's Books", "title": "Learn About the Zoo (Learn About…Coloring Books)", "description": "     Children will have fun coloring as they learn about the zoo! Learn About the Zoo Coloring Book features fun illustrations that children will love to color. Plus, each illustration will help them learn about the zoo as well as build hand-eye coordination.     Features:   • Amusing illustrations   • Introduces fascinating facts   • Helps develop hand-eye coordination   • Helps develop vocabulary     Collect all 8 titles including Alphabet, Dinosaurs, Farm, Forest, Going to School, Home, Ocean, and Zoo!   "}, {"id": "1633624099", "genre": "Children's Books", "title": "Brachiosaurus (21st Century Junior Library: Dinosaurs and Prehistoric Creatures)", "description": "In this book, simple, age-appropriate text introduces readers to Brachiosaurus, from what it looked like to how it lived. Large, exciting images fill the pages, while sidebars encourage students to ask questions and think critically about information presented in the text. Additional tools, including a glossary and index, help students build new vocabulary and locate information."}, {"id": "B003T0GAKM", "genre": "Children's Books", "title": "123 Yippie", "description": "Two small children invite you to one great big party in a miniature yellow house on a tiny green hill. Tumbling turtles and dancing penguins, monsters munching cake and mischievous monkeys make counting a frisky affair of full-sized fun! Little ones can count on this little book, packed with exuberant gouache paintings that nearly jump from the pages. Yippie!"}, {"id": "1591473144", "genre": "Children's Books", "title": "What to Do When You Worry Too Much: A Kid's Guide to Overcoming Anxiety (What to Do Guides for Kids)", "description": "\"What to Do When You Worry Too Much\" is an interactive self-help book designed to guide 6-12 year olds and their parents through the cognitive-behavioral techniques most often used in the treatment of generalized anxiety. Engaging, encouraging, and easy to follow, this book educates, motivates, and empowers children to work towards change. It includes a note to parents by psychologist and author Dawn Huebner, PhD."}, {"id": "B01MTYIPTZ", "genre": "Children's Books", "title": "BMX Vert (Extreme Summer Sports Zone)", "description": "Did you know that the top BMX vert riders can race up and down ramps to show off awesome stunts like no-handed 900° aerial spins? They can rotate their bikes two and a half times while airborne. They do moves such as cliffhangers and tailwhips, wowing fans and judges alike."}]