[{"id": "0613434676", "genre": "Children's Books", "title": "Polar Lands (Life in The...)", "description": "Describes how humans, plants, and animals survive at the North and South Poles, the effect of human industrial activity on the polar landscapes, and how changes in the world's weather patterns affect the Poles."}, {"id": "B07819R23S", "genre": "Children's Books", "title": "God Made My Heart - The Creation Story for Children", "description": "This beautifully designed children's book lets a child know that the God of all creation also made him or her!  God formed our hearts and made us as the crowning achievement of His creation.  This poetic book walks through each day of the creation story with your child, and is filled with colorful illustrations.  Let your child know that he or she is wonderfully made by God."}, {"id": "0986243701", "genre": "Children's Books", "title": "Lee Lee the Surfing Monkey: Goes to Australia", "description": "Lee Lee is a monkey who LOVES to surf! Join him on his first adventure as he travels to Bondi Beach, Australia. There, he makes new friends, survives a scary run-in with some dingoes, and shows he can surf like a local! Colorful, hand drawn illustrations paired with the writing of newcomer Krissy Mach Atchison, will inspire yound readers and artists everywhere."}, {"id": "B00GZFUF86", "genre": "Children's Books", "title": "Children's Book: Peter Puppy Wants To Play - The Tales of Peter Puppy (funny bedtime story collection)", "description": "Peter Puppy has the whole day to himself. Through this rhyming story and some funny images, he tells us about everything his friends like to do for fun. With so many friends and so many choices of games to play, it’s difficult for him to decide which game to choose. Should he go diving? Should he go to the beach? Should he learn to play piano? Or should he go for a motorcycle ride? They all sound like fun - maybe you can help him decide?This story for doggy-loving children aged 3 to 9 years old, is a great way for children to learn more about the numerous activities and hobbies that they can take part in, if not now then perhaps when they’re a little older. It’s a wonderful life, and hobbies keep children active and happy. Have fun reading this rhyme story to your child, laugh at the humorous images, and watch how excited your child gets about each activity!"}, {"id": "B076BTM2SL", "genre": "Children's Books", "title": "The $100 Prize Essay on the Cultivation of the Potato; and How to Cook the Potato", "description": "The characteristics of a potato, such as quality, productiveness, healthfulness, uniformity of size, etc., depend much on the nature of the soil on which it originated. These characteristics, some or all, imbibed by the minute potato from the ingredients of the soil, at its first growth from the seed of the potato-ball, adhere with great tenacity to it through all its generations. A seedling may, in size, color, and form resemble its parent; but its constitution and quality are in a great degree dependent on the nature of the soil, climatic influences, and other accidental causes.True crosses are generally more vigorous and healthy than others; and it is probably to accidental crosses we are indebted for many varieties that differ so widely from their parents. A cross is most apparent to the eye when the parents are of different colors, in which case the offspring will be striped or marked with the colors of each parent."}]