[{"id": "154350650X", "genre": "Children's Books", "title": "Madam C.J. Walker: Inventor and Businesswoman (STEM Scientists and Inventors)", "description": "Madam C.J. Walker wasn't just an inventor. She was also a political activist and businesswoman.Young readers will discover that she was not only fought for civil rights, but became one of the most successful African-American business owners ever."}, {"id": "1547112581", "genre": "Children's Books", "title": "Happy Birthday 7: Birthday Books For Boys, Birthday Journal Notebook For 7 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B01NAY67EI", "genre": "Children's Books", "title": "1,2,3 Grapes For Me", "description": "A children's Christian nursery rhyme book with humorous and inspirational expressions! Your kids will learn to count to ten, and learn to love Jesus."}, {"id": "0823436578", "genre": "Children's Books", "title": "27 Magic Words", "description": "Although ten-year-old Kobi’s parents sailed into a storm at sea five years ago, she knows they are alive. If she says “Avanti!” she can see them. Now that her life is being turned upside down again, she will need the magic words her mother left behind more than ever. Instead of living with wealthy Grandmamma in Paris, Kobi and her sister will temporarily stay in Des Moines, Iowa. There, the girls will, as Uncle Wim puts it, “live like normal kids for a change.” To fit in at her new school Kobi tells lies that soon catch up with her. In a heart-wrenching climax, she must confront not only the untruths she has told others but the stories she has made herself believe. Only then will she be able to grieve for her parents and move on with her life."}, {"id": "0375847103", "genre": "Children's Books", "title": "Winter Pony (A Stepping Stone Book(TM))", "description": "GINNY FINALLY HAS the pony she has always dreamed of, and now she and Mokey are looking forward to a winter full of new adventures. Together, they explore the snow-filled woods and even learn to drive a sleigh. As usual, Mokey has plenty of surprises in store, including one that Ginny can’t believe: Mokey is expecting a foal!This classic Jean Slaughter Doty tale—now with all-new illustrations by Ruth Sanderson—is back in print after more than 20 years for yet another generation of riders to enjoy."}]