[{"id": "1627797343", "genre": "Children's Books", "title": "Poppy the Pony: Fairy Animals of Misty Wood", "description": "Enter an enchanted world of fairy animal friends!Poppy the Pony is very shy. She loves soaring through Misty Wood, but she's too scared to talk to any of the other fairy animals. One day a thunderstorm comes, and Poppy discovers she is braver than she ever knew."}, {"id": "0399250603", "genre": "Children's Books", "title": "Dimity Duck", "description": "Dimity Duck waddles, she toddles and she sings. Giggle-gaggle goes her tail and whoosh! go her wings. So begins the day for Dimity Duck, full of brushing feathers and playtime with her friend, Frumity Frog. Worldrenowned author Jane Yolen and Sebastien Braun have created a delightful character full of childlike curiosity and adorable whimsy in Dimity Duck, now in board book format, ideal for the youngest of readers."}, {"id": "0763625663", "genre": "Children's Books", "title": "Down in the Woods at Sleepytime", "description": "\"Author and illustrator make bedtime about as appealing as it gets.\" -- PUBLISHERS WEEKLY (starred review)It's sleepytime down in the woods, but not one of the baby animals is ready to go to bed. The bear cubs want to play, the little hedgehogs are hungry, the bunnies are peek-a-booing, and their mamas are at their wits' end! Welcome to a delightful woodland world full of tots of all types eluding bedtime -- until wise Grandma Owl affirms with a story that the time is just right to say good night."}, {"id": "B075FGC55B", "genre": "Children's Books", "title": "Dinosaur Memes", "description": "Dinosaur Memes, by Conrad Rhodes.Everybody loves dinosaurs and I'm sure even they would see the funny side to these dinosaur memes and jokes.So get ready to have a laugh at T-Rex's expense and enjoy the fun.Also included are lots of bonuses."}, {"id": "0753462516", "genre": "Children's Books", "title": "Charles Darwin", "description": "Ten-year-old Henry has just gotten the job of his life―assistant to Charles Darwin on a voyage of the HMS Beagle. He will help Darwin collect all the creatures that fly, scuttle, and leap on this expedition to faraway lands. Little does he know that it will be one of the greatest scientific expeditions of all time! As the trip gets under way, Henry records everything he sees and does in his diary, providing readers with a firsthand account of the famous adventure. Fictionally told but based on facts, Charles Darwin puts an innovative spin on the story and accomplishments of the most famous naturalist in history, just in time for Darwin's 200th birthday."}]