[{"id": "0345508017", "genre": "Science Fiction & Fantasy", "title": "The Elder Scrolls: The Infernal City", "description": "Four decades after the Oblivion Crisis, Tamriel is threatened anew by an ancient and all-consuming evil. It is Umbriel, a floating city that casts a terrifying shadow–for wherever it falls, people die and rise again. And it is in Umbriel’s shadow that a great adventure begins, and a group of unlikely heroes meet. A legendary prince with a secret. A spy on the trail of a vast conspiracy. A mage obsessed with his desire for revenge. And Annaig, a young girl in whose hands the fate of Tamriel may rest . . . .Based on the award-winning The Elder Scrolls, The Infernal City is the first of two exhilarating novels following events that continue the story from The Elder Scrolls IV: Oblivion, named 2006 Game of the Year."}, {"id": "B00JCZKI1K", "genre": "Science Fiction & Fantasy", "title": "AWAKENING POWERS: Book One in the Trilogy of Power (World of Drejon)", "description": "Power and Prophecy!Seventeen-year-old Regnaryn grew up in an idyllic land among mythical beings. She believes that she is the last surviving human. Her world begins to shatter when Evil invades her dreams, demanding that she relinquish unknown powers foretold by her long-deceased mother. When Graeden, a young human male, arrives, he further disrupts her once-orderly life. Her emotions in chaos, Regnaryn flees the only home she's ever known, only to be captured by the servants of Evil from her dreams. Now she must take a stand, confronting her late mother’s prophecy while also attempting to survive and protect those she loves.\"AWAKENING POWERS, Book 1 in the Trilogy of Power, from Dot Caffrey is a must-read addition to the fantasy genre. Readers will delight in the characters, both good and evil, and the world-building skills of the author.  A 5-star achievement by this talented debut author!\" Laura Taylor6-Time Romantic Times Award Winner,  2-Time MAGGIE Award Winner, & RWA RITA Finalist "}, {"id": "B000VYCSBY", "genre": "Science Fiction & Fantasy", "title": "3 x T (Baen Mega Books)", "description": "Hugo Award winner Harry Turtledove has garnered high praise for his best - selling alternate history science fiction, and he's equally a master of science fiction adventure, as he proves in this new Baen Mega Book containing two complete novels and a baker's dozen of brilliant shorter works. Earthgrip - young Jennifer Logan just wanted to teach Middle English, but ended up on an interstellar trading ship headed for the adventure of a lifetime. Non-Interference - the Survey Service was supposed to observe alien worlds, without any interference. Then, an expedition broke the rule and an entire planet was at risk! Kaleidoscope - suppose a vampire was sent to catch Jack the Ripper? Suppose all the galaxy has star ships, but hasn't developed Earth's military technology: And much more."}, {"id": "B007OL72J0", "genre": "Science Fiction & Fantasy", "title": "Daywalker ~ The Beginning: A Dark Fantasy Short Story (Nightwalker Book 1)", "description": "From the bestselling author of the Blood Curse Series, comes a NEW ADULT URBAN FANTASY TALE: Daywalker ~ The Beginning. Every one-hundred years a Daywalker is born. During that time, immortal Nightwalkers search the earth, hunting for that rare chosen soul, hoping to find the one special human who can give them the ability to walk in the sun. Or kill them. Lacy Logan thought she had a normal life. She was healthy, happy, and about to start her own paranormal-investigations business…until she met the man in black.In a matter of days, she was fighting for her life, questioning her sanity, and hoping to uncover a secret from her past that would allow her to slay a demon.  "}, {"id": "B004HW7N7A", "genre": "Science Fiction & Fantasy", "title": "Beyond the Hedge", "description": "Eleven-year-old Sandy Henderson lives a carefree life with her family in a quiet port on Scotland's south-west coast, unaware that the parallel world of Sylvania lies beyond a huge hedge at the bottom of their overgrown garden. When her beloved cat, Leo, tumbles headlong into this enchanted land while they're exploring an unfamiliar part of the orchard, Sandy embarks on a dangerous journey to bring him home again.Accompanied by Jock, a handsome, swaggering crow, and Jamie, the Hendersons' haughty Siamese cat, Sandy encounters a host of colourful characters including Pongo, the hairiest dog imaginable, Lorimer, an outrageous lobster, and Captain Pestilence Grimshaw who joins forces with Maligna the Harpie, whose sole preoccupation is the destruction of everything Sylvanians hold dear. Sandy discovers that Scottish fairy folk are witty, resourceful and tenacious when faced with evil on an unprecedented scale. Will she be in time to save Leo? And will Sandy ever see Scotland again?"}]