[{"id": "0823944646", "genre": "Children's Books", "title": "Anwar Sadat (Middle East Leaders)", "description": "Examines the life and leadership skills of Egyptian president Anwar Sadat, who won a Nobel Peace Prize for his role in the peace process after the 1973 war with Israel."}, {"id": "1932133720", "genre": "Children's Books", "title": "Little Wolf's Christmas (Little Wolf and Friends)", "description": "Little Wolf's Christmas is the classic retelling of the Christmas story from the from a Mexican Gray Wolf pup's perspective. Travel back to a time in the White Mountains when the wolf and Native American lived in harmony. Little Wolf learns about life from other members of the wolf pack. Full water color illustrations by children's book illustrator, Jill Taylor."}, {"id": "1479251097", "genre": "Children's Books", "title": "Island Child", "description": "As a multi-generational book for third-graders through senior citizens, this story presents the first ten years of the life of Barack Obama. In that time, he experienced: (1) Growing up without his father in the Hawai`ian island culture with his maternal grandparents and his mother; (2) moving with his mother to Indonesia as a kindergartner to live with his step-father; (3) experiencing a culture with a new language, new foods, new ways of living, and (4) returning to Honolulu to enter 5th grade at the prestigious Punahou School, where he did not fit in because his life in Indonesia taught him sports and school and lifestyle that didn't match what was enjoyed by the American kids. As one retired university professor put it: \"Everyone ought to read this book, regardless of political persuasion. I'm a Republican, so I know what Republicans should read.\""}, {"id": "1771274247", "genre": "Children's Books", "title": "Julius Caesar Brown and the Green Gas Mystery", "description": "When a mysterious green gas crisis breaks wind, the Global Air Group (GAG) offers a million-dollar prize to the first person to discover the cause. Julius Caesar Brown dreams of winning the cash so he can pay off Jake the Snake, the blackmailing bully who threatens to ruin his chances with the cutest girl in fifth grade. But Julius can barely pass a math test, let alone solve an international scientific mystery. What he needs is money. Fast. His mom volunteers him to help the Zombie Lady. Yeah. The crazy woman down the street who every kid knows eats boys' brains. But Miss Crabtree's no zombie. And winning the million-dollar prize may not be as far-fetched as Julius once thought."}, {"id": "0761307826", "genre": "Children's Books", "title": "Best Of The Best In Soccer (Women of Sports)", "description": "Featuring profiles of Michelle Akers, Joy Fawcett, Carin Gabarra, Mia Hamm, Kristine Luly, and others, this book also covers the evolution of women's soccer, providing a brief history, stats, and more. Photos, many in color."}]