[{"id": "0615990703", "genre": "Science Fiction & Fantasy", "title": "Redemption (Alchemy) (Volume 4)", "description": "Redemption, Alchemy Series Book Four Up until now, I've done everything wrong. Deserted and feeling more alone than ever, I need to lead my people in this new barbaric world. I've got to defend them against the power hungry senator and shield them from even themselves. All this while my heart is being ripped to shreds.Sometimes, redemption is found in your darkest moments. Reading Order:The Keepers (Free on Kindle)Keepers and Killers Shattered Redemption              "}, {"id": "1932564640", "genre": "Science Fiction & Fantasy", "title": "Shadowrun Gamemaster's Screen Fourth Edition (FPR26002)", "description": "SR4 Gamemaster's Screen with Contacts and Adventures book. This 4-panel GM Screen provides handy and useful charts for playing Shadowrun, Fourth Edition. Comes with a 32-page gamemaster aide for creating short scenarios, including a selection of ready-to-run plot hooks. The booklet also contains SR3 to SR4 conversion guidelines and two additional pages of charts that couldn't get squeezed onto the screen!"}, {"id": "1101904240", "genre": "Science Fiction & Fantasy", "title": "Dark Matter: A Novel", "description": "A mindbending, relentlessly surprising thriller from the author of the bestselling Wayward Pines trilogy.“Are you happy with your life?”  Those are the last words Jason Dessen hears before the masked abductor knocks him unconscious.  Before he awakens to find himself strapped to a gurney, surrounded by strangers in hazmat suits.  Before a man Jason’s never met smiles down at him and says, “Welcome back, my friend.”   In this world he’s woken up to, Jason’s life is not the one he knows. His wife is not his wife. His son was never born. And Jason is not an ordinary college physics professor, but a celebrated genius who has achieved something remarkable. Something impossible. Is it this world or the other that’s the dream? And even if the home he remembers is real, how can Jason possibly make it back to the family he loves? The answers lie in a journey more wondrous and horrifying than anything he could’ve imagined—one that will force him to confront the darkest parts of himself even as he battles a terrifying, seemingly unbeatable foe. Dark Matter is a brilliantly plotted tale that is at once sweeping and intimate, mind-bendingly strange and profoundly human—a relentlessly surprising science-fiction thriller about choices, paths not taken, and how far we’ll go to claim the lives we dream of."}, {"id": "B01KZQN47E", "genre": "Science Fiction & Fantasy", "title": "Survive (Cascade Book 1)", "description": "Being locked in a military cell was Zach’s world, until the world ended.A group of ex-military try to survive and make sense of a post-apocalyptic world destroyed by unimaginable creatures, while dealing with their own dark pasts.(Newly edited! 06/16/17)"}, {"id": "1623782848", "genre": "Science Fiction & Fantasy", "title": "2011 Non-Series Titles (2011-2016)", "description": "Collector's edition available for a limited time in celebration of the five year anniversary of the launch of Lizzyland. Includes all three non-series titles released in 2011: \"The Warlord's Secret,\" \"Maddy's Oasis,\" \"A Demon's Desire.\"   The Warlord's Secret A queen with a secret ... Rissa, the tormented Warlord of Tiyan, struggles to protect her people and Tiyan's magical springs against enemies and traitors within her own walls. She must also safeguard the secret of Tiyan's magic and the source her ultimate doom: the parasitic demon lurking within her, which has awoken to kill her as is tradition every generation of ruler. Maddy's Oasis With an ill mother in need of expensive surgery, Madeleine flies from NYC to the west Texas desert to take on the doomed Desert Oasis resort project in hopes of earning the bonus attached to finishing it on schedule. She soon finds there's only one thing hotter than the desert sun: Jake, the infuriating Texan whose dislike of the fast-paced city puts them at odds at everything. A Demon's Desire Emma crossed paths with a black witch in an ill-fated love triangle that ended in Emma fleeing and the death of the man they both loved. Two years later, the witch is seeking revenge. Emma turns to the only person who can help her: a man rumored to be half-demon with the power to control the shadows. Tristan agrees to help her lift the curse on her family but isn't prepared for what he uncovers. "}]