[{"id": "159036080X", "genre": "Children's Books", "title": "Native-American Life (Real Life Stories)", "description": "Briefly explores the history and culture of Native Americans, including first-hand accounts about family life, ceremonies, crafts, and hunting."}, {"id": "1933122013", "genre": "Children's Books", "title": "Greeks, Romans, Countrymen! (Chester the Crab) (Chest the Crab's Comix With Content)", "description": "America was founded on the ideas practiced by the ancient Greeks and Romans. Follow Chester the Crab as he helps a runner in the Olympics, visits a theater with Poseidon, goes to war with Alexander the Great, enlists in the Roman legion, builds an arch for an aqueduct and outraces the lava flowing from Mount Vesuvius! This funny, colorful graphic novel will excite reluctant readers, prepare students for standardized tests in history and help homeschooling parents!"}, {"id": "1526361221", "genre": "Children's Books", "title": "The Revolution Handbook: Get disruptive with this creative activism journal", "description": "If you've ever surveyed the world and thought 'Ew', this is the book for you. The Revolution Handbook is a journal to help you kickstart revolutionary campaigns and log your activism memories. Through a series of tongue-in-cheek prompts, activist-illustrator Alice Skinner encourages you to create your best campaign slogans, troll-stamping tweets and protest signs - and helps you fulfil that longstanding dream to sew Donald Trump's mouth shut. With a blend of practical suggestions and whimsical challenges, this is the essential handbook for anyone who dreams of a better world - and wants to help make it a reality.Through Alice's art, you'll find checklists for going on marches, tips for self-care when you find the world is just getting too depressing, and the confidence you'll need to stick two fingers up at the system."}, {"id": "024131206X", "genre": "Children's Books", "title": "In A Minute", "description": "What can you do in a minute? Take the 60-second challenge! Clever, witty and beautifully designed, this book will inspire and entertain young children everywhere.What can you do in a minute? Blink 20 times? Do 77 star jumps? Or hoover up 24 ants, if you're a hungry anteater! In a Minute is a clever way to think about time. With engaging contemporary illustrations, revealing flaps and irresistable challenges for inquisitive minds, this book encourages children to think about the world around them and ask Why? and How?"}, {"id": "B00H9LP50S", "genre": "Children's Books", "title": "Rescue Pups: The Adventures of Maxwell and Kota", "description": "When Kota tries to make friends in his new neighborhood, he is rejected because he isn't a champion dog, he isn't a fancy dog, and he isn't a pure breed. In fact, he doesn't know where he comes from at all. But through an unexpected friendship with his neighbor Maxwell, he discovers a new meaning of the word rescue."}]