[{"id": "0964418940", "genre": "Children's Books", "title": "Turkey and Giant", "description": "In this Navajo folktale, Turkey is captured by Gray Giant and carried to the top of a high cliff. Though Turkey cries with grief, Gray Giant cruelly commands Turkey to gather wood to build the fire he will cook her on. Turkey has no chance of escape ... unless the horned toad she meets truly does know the one thing Gray Giant fears."}, {"id": "0613027663", "genre": "Children's Books", "title": "King Arthur and His Knights of the Round Table (Puffin Classics)", "description": "A collection of the tales of King Arthur and the members of his court as edited from Sir Malory's Le morte d'Arthur"}, {"id": "0312377487", "genre": "Children's Books", "title": "Bright Path: Young Jim Thorpe", "description": "A Sac and Fox Indian, Jim Thorpe was born Wa-tho-huck (\"Bright Path\") in Oklahoma in 1888. His childhood was a mix of hard work on his family’s ranch, wild days hunting and living rough in the outdoors, and a succession of dreary, military-strict \"Indian Schools\" that sought to impose white culture on Indian children. Jim hated them and frequently ran away, but it was at one such school, in Carlisle, Pennsylvania, that his life would change. Watching some student athletes practicing the high jump, Jim asked if he might try. Wearing overalls and a work shirt, he effortlessly cleared the bar on his first attempt—breaking the school’s high jump record. He was drafted onto the track and football teams by the school’s coach, Pop Warner, and went on to lead Carlisle to victories over the best college teams of the time. At the 1912 Stockholm Olympics, Thorpe won the five-event Pentathlon with a score that would never be beaten, and the even more grueling Decathlon with a score that stood for 20 years."}, {"id": "0316308552", "genre": "Children's Books", "title": "How Night Came from the Sea: A Story from Brazil", "description": "A beautifully illustrated retelling of a Brazilian tale linking Brazil's African heritage with a history of slavery recounts how an African goddess brings the gift of night to the hardworking people of Brazil."}, {"id": "1635175240", "genre": "Children's Books", "title": "The Debate about Playing Video Games", "description": "Provides a thorough overview of the major pros and cons of playing video games. Readable text, interesting sidebars, and illuminating infographics invite readers to jump in and join the debate."}]