[{"id": "1426301316", "genre": "Children's Books", "title": "National Geographic Investigates Ancient Pueblo: Archaeology Unlocks the Secrets of America's Past", "description": "At prehistoric sites in the \"Four Corners\" states (Colorado, Utah, Arizona, New Mexico) of the American Southwest, archaeologists have searched for years, looking for clues to the history of the Pueblo people. Learn what we know about these cliff dwellers. Study the thousands of rock carvings—petroglyphs—they left behind. Discover how modern scientists use ancient artifacts to learn about the lives of these early Americans.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "0544568125", "genre": "Children's Books", "title": "Little Blue Truck's Beep-Along Book", "description": "If you're happy and you know it, beep along!  With this new take on the classic sing-along song, kids can interact with their favorite Little Blue Truck and beep his horn while they visit with all his farm animal friends. Colorful illustrations, bouncy rhyme, and a cuddly truck with built-in squeaker make this a perfect interactive choice for play time and story time.  "}, {"id": "039591809X", "genre": "Children's Books", "title": "Subira Subira", "description": "When Tatu finds she can do nothing to improve her little brother's hateful behavior and make him happy again, she goes to an old spirit woman for help. The spirit woman tells Tatu that to cure Maulidi, she must pluck three whiskers from a lion! Armed only with a song, Tatu steals out into the moonlit night to undertake her impossible task. Acclaimed storyteller Tololwa M. Mollel sets his satisfying retelling of a traditional folktale in contemporary Tanzania, beautifully depicted in Linda Saport's lush illustrations. An author's note and the music for Tatu's song follow the story."}, {"id": "B006CDPK86", "genre": "Children's Books", "title": "Indonesian Tales of Treasures and Brides (Asian Folktales Retold)", "description": " Indonesian Tales of Treasures and Brides offers an inspiring folktale about a poor man wooing a princess, a young man tricking a goddess, and two stepsisters, one spoiled, one diligent.   Kuniko Sugiura lived in Indonesia, where she collected folklore. She has written and edited several books on folktales and storytelling.   Koji Honda has a degree in sculpture and designs monuments and other installations."}, {"id": "0789431645", "genre": "Children's Books", "title": "Vehicle Stickers: Race Cars, Bikes and Boats", "description": "Kids can stick a tractor on their back-pack, a bus on their toy chest, or a fire truck on the refrigerator. Vehicle Sticker Books make learning fun."}]