[{"id": "0544422821", "genre": "Children's Books", "title": "Celebrating Ohio: 50 States to Celebrate (Green Light Readers Level 3)", "description": "Say hello to Mr. Geo, everybody's favorite geography teacher! Today he's visiting Ohio, the Buckeye State. His first stop is the fun-filled Ohio State Fair. He'll visit the Rock and Roll Hall of Fame, the Wright Brothers bike shop and workshop, mysterious mounds built by Native Americans, sites on the Underground Railroad, and much more. Together, you will discover what makes this a state to celebrate. Includes maps and learning activities. Colorful, you-are-there illustrations and easy-to-read text are great for beginning and newly independent readers! "}, {"id": "0761421432", "genre": "Children's Books", "title": "U.s. V. Amistad: Slave Ship Mutiny (Supreme Court Milestones)", "description": "Discusses one of the first \"civil rights\" cases heard by the Supreme Court--based around a Spanish ship carrying African slaves, who revolted and petitioned for their freedom--whose ruling dealt a blow to the slave trade."}, {"id": "1530643260", "genre": "Children's Books", "title": "1: I Like to Read Books (Adventures in Everyday Life)", "description": "\"I Like to Read Books\" chronicles the adventures of a man who enjoys reading. All he does is read! Sometimes his reading gets him into trouble, but he continues reading! \"I Like to Read Books\" is the first volume in the \"Adventures in Everyday Life\" series. Be sure to look for the other volumes for more wacky adventures!"}, {"id": "0791045919", "genre": "Children's Books", "title": "Superstars of Men's Track and Field (Male Sports Stars)", "description": "A brief overview of track and field competitions precedes profiles of six champions: Bob Mathias, Roger Bannister, Al Oerter, Edwin Moses, Carl Lewis, and Michael Johnson"}, {"id": "1477701273", "genre": "Children's Books", "title": "Henry Hudson (Jr. Graphic Famous Explorers)", "description": "In graphic novel format, outlines the life of Henry Hudson who made four expeditions to North America in search of a Northwest Passage to the Pacific, and discovered the river in the United States and the bay in Canada that carry his name."}]