[{"id": "159017965X", "genre": "Science Fiction & Fantasy", "title": "The Glory of the Empire: A Novel, a History (New York Review Books)", "description": "The Glory of the Empire is the rich and absorbing history of an extraordinary empire, at one point a rival to Rome. Rulers such as Basil the Great of Onessa, who founded the Empire but whose treacherous ways made him a byword for infamy, and the romantic Alexis the bastard, who dallied in the fleshpots of Egypt, studied Taoism and Buddhism, returned to save the Empire from civil war, and then retired “to learn to die,” come alive in The Glory of the Empire, along with generals, politicians, prophets, scoundrels, and others. Jean d’Ormesson also goes into the daily life of the Empire, its popular customs, and its contribution to the arts and the sciences, which, as he demonstrates, exercised an influence on the world as a whole, from the East to the West, and whose repercussions are still felt today. But it is all fiction, a thought experiment worthy of Jorge Luis Borges, and in the end The Glory of the Empire emerges as a great shimmering mirage, filling us with wonder even as it makes us wonder at the fugitive nature of power and the meaning of history itself."}, {"id": "B01IAA3A76", "genre": "Science Fiction & Fantasy", "title": "Adrift (The Final Colony Trilogy Book 1)", "description": "100 years ago, the USS Nomad returned from a legendary lost planet without its crew.Today, the Nomad goes back. During the evacuation of their sole surviving colony, humanity's entire fleet of starships is annihilated by their enemies. Only a desperate FTL jump saves the USS Nomad - an ancient scout class vessel, built when Earth still stood - from a similar fate.But the jump results in catastrophic damage to the aging ship: its fusion cores have overloaded. Life support will soon fail. The ship's data logs and navigational charts from the previous journey have been corrupted, leaving them adrift. And someone, amidst the chaotic escape, executed the mission's leader. Wandering the unforgiving expanses, a relentless enemy in pursuit, the Nomad's disgraced captain must find a way to pilot the vessel to the lost paradise at the edge of the universe. But with dissent and distrust threatening to rip the USS Nomad asunder, humanity's last hope of survival might be lost forever."}, {"id": "0982053681", "genre": "Science Fiction & Fantasy", "title": "Writing Fantasy Heroes: Powerful Advice from the Pros (Rogue Blades Presents)", "description": "Fantasy heroes endure. They are embedded in our cultural fabric, dwarfing other literary figures and the mere men and women of history. Achilles and Odysseus, Gilgamesh and Beowulf. King Arthur and Robin Hood, Macbeth and Sherlock Holmes, Conan and Luke Skywalker. They dominate our legends, and tower over popular culture.  The stories we tell each other begin and end with fantasy heroes, and the 21st Century is as thoroughly captivated with them as ever. From Batman to Gandalf, Harry Potter to Tyrion Lannister, the heroes of fantasy speak to-and for-whole generations.  But what makes a fantasy hero? How do the best writers create them, and bring them to life on the page? In WRITING FANTASY HEROES some of the most successful fantasy writers of our time-including Steven Erikson, Brandon Sanderson, Janet Morris, Cecelia Holland, Orson Scott Card, and Glen Cook-pull back the curtain to reveal the secrets of creating heroes that live and breathe, and steal readers' hearts.  Whether you're an aspiring writer or simply a reader who loves great fantasy and strong characters, this book is for you."}, {"id": "B06XXC19P8", "genre": "Science Fiction & Fantasy", "title": "An Arrow Against the Wind (The Bow of Hart Saga Book 2)", "description": "\"We have read more than a couple great books this year, and An Arrow Against the Wind is surely among them.\" - Fantasia Reviews\"You will not be disappointed reading this series.\" - Stephen\"Non-stop Action keeps you turning pages wondering what happens next.\" - ErnieHaunted by his past. Hunted in the present. Buffeted like an arrow in the wind.This unique epic fantasy will keep you turning pages as Athson and company are drawn deeper into the intrigues surrounding the Bow of Hart.The hunt for the Bow of Hart continues for Athson and his companions. They have escaped the clutches of Magdronu and Corgren, the mage, but they are still pursued. In need of answers to deep mysteries revealed in Chokkra, Athson must gain possession of the mythic bow to face both his enemies and his tragic past. But Magdronu's reach stretches among Athson's companions, endangering Limbreth and even Hastra in schemes to entrap them all.With each turn of the search for the Bow of Hart, long hidden secrets surface that threaten to destroy Athson. Will he falter like an arrow against the wind?Pick up the second book of The Bow of Hart Saga because the adventure spins like an arrow in flight."}, {"id": "B00FUPXAE8", "genre": "Science Fiction & Fantasy", "title": "Danse Macabre", "description": "Fans have been waiting to sink their fangs into an all-new Anita Blake hardcover in the New York Times bestselling series.  These days, Anita Blake is less interested in vampire politics than in an ancient, ordinary dread she shares with women down the ages: she may be pregnant. And, if she is, whether the father is a vampire, a werewolf, or someone else entirely, he knows perfectly well that being a Federal Marshal known for raising the dead and being a vampire executioner, is no way to bring up a baby."}]