[{"id": "1859675247", "genre": "Children's Books", "title": "Sharks (Nature Watch)", "description": "Investigates the lives and lifestyles of the ocean's most extraordinary predators and powerful swimmers. Discover how hammerheads detect and track their prey and how the weird-looking wobbergong become invisible."}, {"id": "0999170635", "genre": "Children's Books", "title": "Adventurous Lady: Margaret Brent of Maryland", "description": "This is the story of the brilliant and tempestuous Margaret Brent who played a leading role in Maryland colonial affairs. In 1633 she invested in the undertaking of her kinsman Cecilius Calvert, Lord Baltimore, when he sought settlers for Maryland--a colony founded as a refuge for the persecuted Catholics of England, and a place where religious freedom would be granted to all. Once in Maryland, Margaret and her brothers and sister found themselves in the midst of turbulent happenings as the young settlement struggled against incursions from Virginia and eventually from the difficulties of the Propietor Lord Baltimore, in England as the governement fell into the hands of Cromwell's men. In ther face of the troubles, Margaret's true colors bloomed. She took charge of family affairs, protected an Indian princess, quelled a mutiny single-handed, and was appointed executrix for the estate of Governor Leonard Calvert. She is known as one of the most fascinating wormen in early American History."}, {"id": "1945280026", "genre": "Children's Books", "title": "Curse of the Golden Eye (The Color Chronicles) (Volume 1)", "description": "When David discovers a rubber blob in 7th grade social studies, he has no idea why his hand is now imprinted with a mystical eye. Hours later, a bump on his head triggers the ‘Curse of the Golden Eye’ and turns his left eye to gold. The golden eye gives David powers that he can’t control, like freezing people and influencing them to obey him.  Anxious to break the curse, David and his best friend, a girl named Jessie, follow clues to the local university. But, the professor who can help them is missing, kidnapped by a crazed millionaire who’s in league with an evil Egyptian god.   Finding the truth about the curse leads David and Jessie into increasing danger when they, too, are kidnapped. Escaping is just one of the many challenges they face. Can David and Jessie solve the mystery of the curse? More important, can David learn to control the powers of his eye in time to save himself and his friends?"}, {"id": "197429241X", "genre": "Children's Books", "title": "Hello 2nd Grade: Composition Notebooks Second Grade Girls (Back To School Composition Notebooks)(8.5 x 11)", "description": "Emoji Composition Notebooks For KidsThis awesome emoji school journal for kids has 120 lined pages measuring 8.5 x 11 that people will be jealous of. Stop buying those boring composition books and grab one of these fun and exciting school notebooks.Great gift ideas for teachers and students. Perfect for back to school supplies, birthday gifts and Christmas gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksSongwriting JournalStock up for the back to school rush or just because you need a good looking lined journal notebook today!"}, {"id": "0340801468", "genre": "Children's Books", "title": "A2 Business Studies", "description": "A resource for students studying A2 Business Studies from September 2001. The book covers: marketing and accounts; operations management; people and organizations; external influences; and objectives and strategy. It also includes suggested schemes of work and answers to all questions posed."}]