[{"id": "B0721KX843", "genre": "Children's Books", "title": "Diary of a Chicken Jockey [An Unofficial Minecraft Book] (Minecraft Tales Book 98)", "description": "Read about the amazing story of how a baby zombie becomes a chicken jockey!GET THIS BOOK FOR FREE WITH KINDLE UNLIMITEDThis is an unofficial book that takes place in the world of Minecraft. - - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books, minecraft story mode, minecraft gift."}, {"id": "161641913X", "genre": "Children's Books", "title": "The Haunted Sleepover (Abby and the Book Bunch)", "description": "Abby Spencer and the Book Bunch love the annual Holiday Sleepover at Evergreen Library. But flickering lights and strange noises have the library staff spooked. Can a librarian spirit really be haunting the library? When ghostly happenings and a newspaper report threaten to cancel the annual sleepover, Abby and the Book Bunch jump into action! Can they solve the mystery in time to save their favorite holiday program? Calico Chapter Books is an imprint of Magic Wagon, a division of ABDO Group. Grades 2-5."}, {"id": "0943706297", "genre": "Children's Books", "title": "The Essential Jewish Trivia Book for Kids", "description": "This book was written by kids for kids. Nine different categories, ranging from Jewish History to Jewish Geography, from Customs and Laws to Arts and Literature, combine to make learning about Judaism fun and interesting. With hundreds of essential jewish questions and answers, and an equal number of trivia challenges, this book is ideal for home, synagogue, youth groups, and Hebrew School."}, {"id": "B074KWV38M", "genre": "Children's Books", "title": "I Want to Go Fishing with Mr. Fish (Fishing Basics Book 1)", "description": "Let Mr. Fish get you and your child hooked as this book will quickly become his/her favorite story to read day or night! Teaching a child to fish is a special experience and the thrill of catching a fish for the first time is a memory that can last a lifetime. This informative book contains photos of many common freshwater fish and step-by-step instructions to get you and your child excited about getting outdoors to enjoy a memorable fishing experience."}, {"id": "0865058148", "genre": "Children's Books", "title": "Great African Americans in Music (Outstanding African Americans)", "description": "Profiles notable African Americans in the field of music, including Ray Charles, Nat King Cole, and Ella Fitzgerald"}]