[{"id": "1933390190", "genre": "Children's Books", "title": "Forecast From Stonehenge (Choose Your Own Adventure #19)", "description": "Forecast From Stonehenge by R. A. Montgomery takes YOU on a fantasy adventure as you explore the magical undercurrents of English lore. 9-12 year old readers will travel to the English countryside to meet a mysterious man claiming he has secret information about the missing heelstone - one of the famous Arthurian myths associated with the ancient site of Stonehenge.   Choose Your Own Adventure Forecast From Stonehenge is an interactive adventure book in which YOU decide what happens next.   You are an explorer and a junior detective and you've just returned to your home in London, England. The solstice is approaching and you follow a tip to Stonehenge in search of the missing heelstone. Is this mysterious contact tied to a dangerous vision of the future? Will you be tricked by the fairies? Can you entice the magical tree sprite and outwit the scary giant?   For readers who enjoyed other titles from the Choose Your Own Adventure series, including: Space and Beyond by R. A. Montgomery, Secret of the Ninja by Jay Leibold, and Mystery of the Maya by R. A. Montgomery."}, {"id": "B00IJJPQ44", "genre": "Children's Books", "title": "3D Book of Aircraft Vol I Aeroplanes. Stereoscopic anaglyph images of   commerical, military, classic and stunt planes.", "description": "3D Book of Aircraft Vol I Aeroplanes. Stereoscopic anaglyph images of commerical, military, classic and stunt planes.ContentsClassic / vintage planesInside the CockpitCommercial PlanesMilitary PlanesStunt PlanesMore Books"}, {"id": "1681859939", "genre": "Children's Books", "title": "Thanksgiving Coloring Book: Big Coloring Book of Animals", "description": "You don't have to wait for Thanksgiving to show your gratitude to others because with this themed coloring book, even your children will understand what it truly means. Coloring is a wonderful and very effective learning experience. It makes it easy to absorb information and build necessary life skills like confidence, patience, focus and determination to succeed. Secure a copy today!"}, {"id": "B0058M7AG2", "genre": "Children's Books", "title": "The Lincolns: A Scrapbook Look at Abraham and Mary", "description": "The award-winning author of Ben Franklin’s Almanac and Our Eleanor has created an enthralling joint biography of our greatest president and his complex wife—a scrapbook history that uses photographs, letters, engravings, and even cartoons, along with a fascinating text, to form an enthralling museum on the page. Here are the extraordinary lives of Abraham and Mary, from their disparate childhoods and tumultuous courtship, through the agony of the Civil War, to the loss of three of their children, and finally their own tragic deaths. Readers can find Mary’s recipe for Abraham’s favorite cake—and bake it themselves; hear what Abraham looked like as a toddler; see a photo of the Lincolns’ dog; discover that the Lincoln children kept goats at the White House; see the Emancipation Proclamation written in Lincoln’ s own hand. Perfect for reluctant readers as well as history lovers, The Lincolns provides a living breathing portrait of a man, a woman, and a country."}, {"id": "0896100421", "genre": "Children's Books", "title": "Issunboshi", "description": "Armed with a needle for a sword, Issunboshi, the one-inch boy, becomes bodyguard to the Prime Minister's beautiful daughter, Miyuki. On the day she asks him to journey to the Shrine of Ise, where she will pray for a husband, his heart shatters for he is in love. How can the one-inch warrior of this classic Japanese folktale prove his worth to the lovely princess? To this day, all over Japan, the story of Issunboshi is famous: the inch-boy who had within himself the bravery, the determination, and the love that are the mark of every full-sized man."}]