[{"id": "B00W22PV2Q", "genre": "Children's Books", "title": "Minecraft: Diary of a Brave Minecraft Wolf (Minecraft Village Series Book 5)", "description": "Explore Minecraft as a Wolf in this Exciting Fun Filled Adventure.  Two Brave Wolves go searching to find Steve after hearing rumors of his arrival.  In this short story, explore dimly lit mines and cross paths with a few zombies and skeletons as the two wolves go on a quest to figure out if Steve is friend or foe.KINDLE UNLIMITED & AMAZON PRIME members can read this book for FREE!"}, {"id": "1426319037", "genre": "Children's Books", "title": "Dirtmeister's Nitty Gritty Planet Earth: All About Rocks, Minerals, Fossils, Earthquakes, Volcanoes, & Even Dirt! (National Geographic Kids)", "description": "Come and explore the world under your feet with the Dirtmeister and friends! Part graphic novel, part fun guidebook, this very cool, rocky journey introduces both eager and reluctant readers to the basic geologic processes that shape our Earth. Clear and concise explanations of the various geologic processes reveal the comprehensive science behind each fascinating topic. Fun facts and simple DIY experiments reinforce the concepts while short biographies of important scientists inspire future geo-scientists."}, {"id": "1542753295", "genre": "Children's Books", "title": "The Three Little Pigs Gone Halloween", "description": "The Three Little Pigs Gone Halloween is an up-to-date adaption of a well-known story. The author's grandson Christopher describes this delightful book as a story within a story. This book is full of surprises and fun! The materials the pigs use to make their houses of are unanticipated and entertaining! This version even includes a beautiful princess with magical powers!This is an amusing shared book for the entire family. All ages have enjoyed hearing the author tell this story for years!"}, {"id": "1479268828", "genre": "Children's Books", "title": "The Adventures Of Tulip The Grey Tree Frog", "description": "An engaging story about Tulip the grey tree frog who wakes one morning to a song and has many adventures when she goes to investigate. Readers are treated to full-color watercolor illustrations, will learn about grey tree frogs, and additional resources/exercises are provided at the end of the book."}, {"id": "1602707359", "genre": "Children's Books", "title": "The Adventures of Marshall & Art Set 2", "description": "Join the black belt brothers, Marshall and Art, as they encounter bullies, learn about stranger safety, and deal with poor sports. Their martial art training helps them resolve problems as a team, without using karate to intimidate others. Their heart-pounding adventures are perfect supplements to your library's character education resources!"}]