[{"id": "B009QP9Q6E", "genre": "Children's Books", "title": "Electricity! (Discover Your World Series)", "description": "A fun, illustrated guide through a mysterious subject- Electricity! Children and adults alike will enjoy this straight-forward explanation of electricity basics: how it's made, how it's used, and how it affects everything we do! Parents and teachers will find this book helpful in making a sometimes difficult subject easy to understand.Beautiful, full-color illustrations on nearly all fifty pages!"}, {"id": "0310761433", "genre": "Children's Books", "title": "Go Wild! Prayers for Little Ones", "description": "Get little ones excited about saying their prayers with the Go Wild! Prayers for Little Ones. This new board book is filled with bright illustrations, simple text, and interactive takeaways for parent and child to do together. Kids will love reading the fifteen prayers about God’s creation that feature playful animals on every page. Each prayer also includes a Scripture verse and fun activity encouraging readers to hoot like an owl or growl like a grizzly bear.The perfect companion to the Go Wild! Bible Stories for Little Ones, this padded board book will make prayer time fun and memorable!"}, {"id": "0823425959", "genre": "Children's Books", "title": "Irena Sendler and the Children of the Warsaw Ghetto", "description": "IIrena Sendler, a Polish social worker, helped nearly four hundred Jewish children out of the Warsaw Ghetto and into hiding during World War II."}, {"id": "1579129277", "genre": "Children's Books", "title": "365 Simple Science Experiments With Everyday Materials", "description": "Now in paperback, Black Dog's classic collection of science experiments. With 365 easy-to-follow, hands-on projects, kids 9-12 can be excited about science every day of the year. One of the best ways to learn the fundamentals of science is through hands-on experimentation with familiar, every-day objects. Through the hundreds of activities in 365 Simple Science Experiments kids gather an understanding of important scientific principals while at the same time enjoying making things fizzle, bounce, and ooze using basic objects and ingredients they can find around the house.Projects include a bubble blower, a bottle barometer, an undersea water fountain, invisible ink, a directional compass, rock candy, and a rainbow. Through these engaging experiments kids learn about gravity, electricity, magnification, magnetism, oxidation, and more.365 Simple Science Experiments is perfect for kids who like to explore the wonders of the natural world. It's also a great activity book for any kid, any time."}, {"id": "0998202614", "genre": "Children's Books", "title": "The Adventures of Mick and Mook: Let's Dance", "description": "Mick and Mook are back with a brand new adventure! While out and about Mick and Mook really want to dance. Unfortunately, wherever they go everyone tells them to stop! What are they to do? Join Mick and Mook as they search for just the right place to boogie their hearts out!"}]