[{"id": "0823422453", "genre": "Children's Books", "title": "Corn", "description": "Perennial nonfiction favourite Gail Gibbons turns her spotlight on corn. Popcorn, corn on the cob, corn dogs, cornflakes--corn is used in many children's favorite foods. This book offers a cornucopia of information about the history of corn as well as details concerning planting, cultivation, harvesting, and its many uses."}, {"id": "B00HE82NLK", "genre": "Children's Books", "title": "Respecting the Name of Allah: The Story of Bishr al-Hafi RA (True Stories of the Friends of Almighty Allah Book 1)", "description": "This is the story of the famous Shakyh Bishr al-Hafi R.A. He respected the Name of Allah and it brought him success in this world and the next. IECRC (http://www.iecrcna.org) has a series of childrens books on different topics of Islam. All proceeds 100% go to supporting IECRC, a US 501c(3) registered non-profit organization."}, {"id": "1433685353", "genre": "Children's Books", "title": "VeggieTales SuperComics: Vol 2", "description": "VeggieTales SuperComics brings all the zaniest and fun you've come to expect in a popular new format.   Each SuperComic includes three VeggieTales stories, features hundreds of full-color illustrations and fun bonus features.  Stories in Volume 2 include Josh and the Big Wall, The League of Incredible Vegetables, and an all new Larry Boyand the Reckless Ruckus. Lessons include Obedience, Handling Fear and Saying Your Sorry. "}, {"id": "1442441682", "genre": "Children's Books", "title": "Heidi Heckelbeck in Disguise", "description": "Heidi Heckelbeck is already a witch—so what will she be for Halloween? Find out in this chapter book that’s perfect for beginning readers.It’s Halloween in Brewster, and everyone is excited—except for Heidi Heckelbeck. Heidi hates seeing people dress up as witches, as if they know what life as a witch is truly like. When Melanie Maplethorpe decides to be a witch for Halloween, Heidi decides to dress up as Melanie to get back at her. But Heidi takes her Melanie act a little too far, saying and doing things that upset her friends. Will they ever forgive her?     The Heidi Heckelbeck series is perfect for readers who want a “grown-up” format but are not quite ready for lengthy chapter books. With easy-to-read language and illustrations on almost every page, the Heidi Heckelbeck chapter books are perfect for beginning readers."}, {"id": "1510732152", "genre": "Children's Books", "title": "Food Fight Fiesta: A Tale About La Tomatina", "description": "\"Off to the hills of Espana we go.Grab a tomato . . . get ready . . . now THROW!\"Every year, the town of Bu?ol in Spain holds La Tomatina, a grand fiesta featuring the world?s BIGGEST food fight! Join in the fun!Afer putting on goggles and grabbing some squishy tomates, it's time to toss fruit like there's no tomorrow.\"WHOOSH! Tomatoes are filling the air!\"\"SPLAT! Tomatoes are stuck in my hair!\"Soon, the entire town is flowing in crimson. Juice flows down ears, drips off noses, runs down ankles, and spreads through toes. And the tomatoes are still flying until . . .BOOM! The cannon is fired, and it's time to stop for the day, clean up, and go to bed, to dream of all of the fun next year.A silly, sensory celebration of tradition and gold old-fashioned food fight fun, Take Me to La Tomatina! is sure to delight."}]