[{"id": "1524766984", "genre": "Children's Books", "title": "Roar: A Dinosaur Tour", "description": "Discover the different types of dinosaurs that once roamed the Earth in this nonfiction picture book with simple text and illustrations.A long, long time ago, dinosaurs roamed the earth.Some were big, and some were little. Some were fast, and some were slow. Some lived alone, and some lived together. They are gone now, but you can still see their bones at museums all around the world.Simple text and bold illustrations take young explorers on a tour through the time of the dinosaurs."}, {"id": "B01DN5PCDI", "genre": "Children's Books", "title": "Snuggle Time Prayers", "description": "Snuggle Time Prayers, written by Glenys Nellist and illustrated by Cee Biscoe, is a perfect bedtime collection of sixteen prayers. This padded cover board book will help children settle down at bedtime and remind them of their blessings as they draw closer to God."}, {"id": "0753417308", "genre": "Children's Books", "title": "10 Kings and Queens Who Changed The World", "description": "This title in the series includes ten riveting, in-depth biographies of legendary monarchs, including Alexander the Great, Henry VIII and Louis XIV. Fast-paced text is enhanced by punchy, all-action artworks to create the look and feel of a graphic novel that will hook the most reluctant of readers. These are gripping stories, innovatively told."}, {"id": "1782504834", "genre": "Children's Books", "title": "Artie Conan Doyle and the Vanishing Dragon (Kelpies)", "description": "One day Arthur Conan Doyle will create the greatest detective of all -- Sherlock Holmes. But right now Artie Conan Doyle is a twelve-year-old Edinburgh schoolboy with a mystery of his own to solve. Artie and his friend Ham are hired to investigate a series of suspicious accidents that have befallen world-famous magician, the Great Wizard of the North. It seems someone is determined to sabotage his spectacular new illusion. When the huge mechanical dragon created for the show vanishes, the theft appears to be completely impossible. Artie must reveal the trick and unmask the villain or face the deadly consequences. The cards have been dealt, the spell has been cast, and the game is afoot once more! Robert J. Harris, author of The World's Gone Loki series and Will Shakespeare and the Pirate's Fire, brings the young Conan Doyle to life in the second book of this ingenious new detective series."}, {"id": "0794440576", "genre": "Children's Books", "title": "Sesame Street: Elmo at the Zoo (Open Door Book)", "description": "Explore the zoo with Elmo and his friends! In this unique new format, each page turn brings the reader deeper into the environment and the story!Who is at the zoo? Elmo and his friends! The penguins are Elmo’s favorite, but he doesn’t know where to find them. Kids will love helping Elmo look while learning about the animals he finds along the way. As each page is opened, a smaller page is revealed in this unique book."}]