[{"id": "0966853016", "genre": "Children's Books", "title": "Simon's Hook; A Story About Teases and Put-downs", "description": "Simon is having a bad day because his sister gives him a strange hair cut and his friends tease him, but he runs into Grandma Rose who teaches him how to handle teases and put-downs."}, {"id": "084311827X", "genre": "Children's Books", "title": "Letters from Camp Mad Libs", "description": "Here are Mad Libs to fill in and send. This fabulous format makes mailing letters from sleepaway camp as easy as filling in the blanks! Letters from Camp features 21 original letters—illustrated with fullcolor spot art—that children can fill in with their friends and then mail off to their parents! Letters perf-out and can be sealed with the special stickers."}, {"id": "0635021404", "genre": "Children's Books", "title": "Roberto Clemente: Baseball Hero and Humanitarian (116) (1000 Readers)", "description": "Roberto Clemente was more than just an amazing baseball player. His humanitarian efforts helped many people to overcome obstacles in their lives. Roberto even built a sports center in his native country of Puerto Rico for poor kids to learn to play sports! Roberto decided to use his fame and position to achieve good for others.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "B00QO0SXGI", "genre": "Children's Books", "title": "Books for Kids: PETER'S GHOST (Children's Ghost Story, Ages 9-12)", "description": "Young  Peter  Muller  lives  on  a  farm  with  his  strict,  overpowering  stepfather,  during  the  second  world  war.  His  sad,  loveless  childhood  is  about  to  be  changed  forever  by  the  strong  hand  of  fate. As  he  discovers  that  real  love  -  never  dies.  A  heart-warming  story,  with  a  ghostly  twist.(A  great  read  for  all  ages  over  nine  years.)"}, {"id": "0789479648", "genre": "Children's Books", "title": "The Coolest Cross-Sections Ever!", "description": "A unique collection of amazing views of the world by Stephen Biesty. Machines, ships, buildings, and the human body as you've never seen. This unique collection of extraordinary illustrations by artist Stephen Biesty explores machines, building, ships, and even the human body from the inside out. From the Grand Canyon to the Space Shuttle, Biesty's amazingly detailed cross-section views take you right inside to reveal how things work or how things are made. See how a 14th-century castle holds up against a siege, and what life would have been like inside a World War II submarine. Learn how 18th-century warships battled on the high seas and what life is like on a space station. Discover how everyday things are made, from false teeth to Formula 1 racing cars and what holds up to the Empire State Building. Author and illustrator team Richard Platt and Stephen Biesty's first collaboration Incredible Cross-Sections went straight to the top of the best-seller list."}]