[{"id": "1556346417", "genre": "Science Fiction & Fantasy", "title": "GURPS WW II Grim Legions", "description": "Join the brave, proud, and doomed men carrying Mussolini's \"8 million bayonets\" into battle in GURPS WWII: Grim Legions, a sourcebook on the Italian armed forces.  This 48-page book includes a summary of the war as seen, and endured, through Italian eyes; descriptions of Italian military organization and tactics with a roster of Italian land, naval, and air units during the war; distinctly Italian character concepts, including the elite and cutting-edge underwater commandos; Italian small arms and fighting vehicles from the reliable Beretta to their hopelessly outdated armor; campaign seeds and suggestions, and much more!  Written by Italian WWII enthusiast Michele Armellini, this small book provides a wealth of detail rarely found in English-language references. Rally under the banner of Il Duce and explore the quixotic Italian war today!"}, {"id": "B072F2K8R3", "genre": "Science Fiction & Fantasy", "title": "A NYC Werewolf: James and Lucy (The NYC Werewolf Book 1)", "description": "\"When my mother was very sick my father left her and moved in with another woman who he was having an affair with. I will never forgive him for what he did. I did my best to help my mother when she was sick and alone.                                     Before she died she somehow left me with the magical ability to shift into an enormous and powerful wolf with very large teeth and sharp claws when I face danger or a threat. I can run faster and have better hearing then any man alive when I become the wolf.                                                    I feel very lucky that Lucy, the beautiful young woman I am dating at the college, accepts that I am part wolf and is willing to embrace the passionate, but dangerous love that I offer her. She has arranged for me to see a psychic on the Upper East Side to help me better understand my supernatural powers so that my wolf side doesn't get out of control.\" - James Hatton, The NYC Werewolf***This is part one of a four part werewolf paranormal serial.All four books in this series are now available on Amazon:A NYC Werewolf: James and LucyA NYC Werewolf Book Two: The Unforgettable SummerA NYC Werewolf Book Three: Ocean WolfA NYC Werewolf Book Four: Heroic Wolf"}, {"id": "B012IUE14U", "genre": "Science Fiction & Fantasy", "title": "Hell Holes: What Lurks Below", "description": "It’s August in Alaska, and geology professor Jack Oswald prepares for the new school year. But when hundreds of huge holes mysteriously appear overnight in the frozen tundra north of the Arctic Circle, Jack receives an unexpected phone call. An oil company exec hires Jack to investigate, and he picks his climatologist wife and two of their graduate students as his team. Uncharacteristically, Jack also lets Aileen O’Shannon, a bewitchingly beautiful young photojournalist, talk him into coming along as their photographer. When they arrive in the remote oil town of Deadhorse, the exec and a biologist to protect them from wild animals join the team. Their task: to assess the risk of more holes opening under the Trans-Alaska Pipeline and the wells and pipelines that feed it. But they discover a far worse danger lurks below. When it emerges, it threatens to shatter Jack’s unshakable faith in science. And destroy us all…"}, {"id": "B01M7TNTVW", "genre": "Science Fiction & Fantasy", "title": "MIND: The Reckoning (The MIND Series Book 3)", "description": "Baldwin Bates has only wanted one thing since joining MIND, to take care of his friends and keep them all safe. While the Meta-Alien Investigation and Neutralization Department is busy monitoring an emergence of human psychic and alien activity, Bates takes his first solo assignment searching for a woman who claims to see the future, only to botch it up and let her get away.  After helping to destroy an alien device called the Transcender, Lexa Quinn wakes from a two-week coma a very different person than she was before. While her abilities grow stronger, her feelings for Bates begin to interfere with the MIND team's mission, putting everyone at risk. Secrets from her past threaten the present and future, forcing Lexa to decide who she is and where she belongs. When a powerful, ancient enemy lays claim to the Earth and brings his judgment upon the population, Bates, Lexa, and the entire MIND team must do whatever it takes to save the human race before the reckoning is complete."}, {"id": "B00PPPI12Y", "genre": "Science Fiction & Fantasy", "title": "Liberty: Seeking Support for a Writ of Habeas Corpus for a Non-Human Being (Tales from the Labyrinth)", "description": "Ellen R lies imprisoned, gagged and blindfolded, her wrists and ankles shackled. On her behalf, a law firm launches a peer-sourced project to underpin their petition - for a robot to be given liberty.From award-winning author Samuel Peralta comes Liberty, a provocative short story that asks the question: What is it that makes us human?Liberty is one of a series of standalone stories about a labyrinthine world where time travel is just beginning to be realized, where pervasive surveillance by telepaths is a part of life, where non-human self-awareness has begun to make humanity face difficult questions about itself.Welcome to the Labyrinth. Welcome to Liberty."}]