[{"id": "1454914890", "genre": "Children's Books", "title": "My First Soccer Book (First Sports)", "description": "A child's first introduction to sports Game on! Perfect for parents to share with their toddlers, this simple board book introduces kids to very basic vocabulary associated with this popular sports. The contemporary design features one word per page, a nice big photo, and a diverse selection of children in the pictures. Plus, the covers are appealingly tactile, with deep embossing and eye-catching spot gloss. Kids will grab hold of it again and again.  Kick, pass, GOAL! From cleats to yellow cards, kids will learn all about the world's most popular game."}, {"id": "1608863247", "genre": "Children's Books", "title": "Adventure Time Vol. 1 Mathematical Edition", "description": "The ADVENTURE TIME phenomenon gets even better with this deluxe hardcover!Bigger! Bolder! More Mathematical! The all-ages hit of the year is now available in a deluxe, larger hardcover and totally mathematical edition! The adventures of Finn the human and Jake the dog in the Land of Ooo are available for the first time in this gorgeous over-sized presentation. What happens when Finn and Jake get a hold of Princess Bubblegum’s time machine and travel to go to the future? This first hardcover edition is a must-have!"}, {"id": "0689843356", "genre": "Children's Books", "title": "Science Magic in the Bedroom: Amazing Tricks with Ordinary Stuff", "description": "This fourth addition to the series offers easy-to-follow instructions for performing science-based magic tricks, complete with illustrations and clear explanations. Original."}, {"id": "B007OVDHW6", "genre": "Children's Books", "title": "1-2-3 Peas", "description": "The peas are back in this counting-themed follow-up to the New York Times bestselling LMNO Peas.Meet the peas—the 1-2-3 Peas! Come along as they count from one to one hundred in this pea-filled picture book that’s packed with bright, bold numbers and playful number-themed scenes. These tiny green mathematicians will have young readers everywhere calling for more peas, please!"}, {"id": "1545185077", "genre": "Children's Books", "title": "The Spirit at Christmas", "description": "A simple, colorful picture book designed to teach young children about the true meaning of Christmas.  A gentle reminder for children and adults alike to look for God in our daily lives, and to count our blessings as Christmas approaches.  The young girl in this story seeks the presence of God through imaginative play with the family nativity set.  She discovers the Holy Spirit while enjoying many of her favorite Christmas traditions."}]