[{"id": "0736438068", "genre": "Children's Books", "title": "Coco: The Junior Novelization (Disney/Pixar Coco)", "description": "This paperback novelization retells the whole story of Disney/Pixar’s Coco, in theaters November 22, 2017!   Coco: The Junior Novelization retells the whole exciting movie and features eight pages of full-color scenes in this paperback novel. Despite his family’s baffling generations-old ban on music, Miguel (voice of newcomer Anthony Gonzalez) dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz (voice of Benjamin Bratt). Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector (voice of Gael García Bernal), and together, they set off on an extraordinary journey to unlock the real story behind Miguel’s family history. Directed by Lee Unkrich (Toy Story 3), co-directed by Adrian Molina (story artist Monsters University), and produced by Darla K. Anderson (Toy Story 3), Disney/Pixar’s Coco opens in U.S. theaters on November 22, 2017."}, {"id": "1426330049", "genre": "Children's Books", "title": "Real or Fake? 3", "description": "Can you spot the truth from a lie? Kids can test their sleuth skills in this gut-bustingly funny follow-up title in the exciting Real or Fake series.Can you detect a hoax from the real deal? See right through photo trickery? Spot the phony logic in a story in seconds? Put your sleuthing skills to work in this riotously fun book! See if you can find the truth behind bizarre stories, faulty facts, iffy lists, news headlines, and more. Check the Fib-o-Meter to find out! Complete with incredible photos and quirky collage art, this is another Nat Geo Kids book you have to read to believe...or disbelieve!"}, {"id": "1538211971", "genre": "Children's Books", "title": "The Modern Nerd's Guide to Cosplay (Geek Out!)", "description": "The detailed craft of creating a unique costume, props, and makeup to bring both beloved and reviled characters to life has become a serious art form in the past decade. Today, cosplay is one of the hottest hobbies around, with huge international conventions and competitions making headlines around the world. In this volume, filled with insider info, helpful tips, spectacular color photographs, and dynamic graphics, readers learn not only how to enter the world of cosplay, but how to conquer it."}, {"id": "0863883001", "genre": "Children's Books", "title": "illy and the Wobbly House: Storybook (Storybooks for Troubled Children)", "description": "Part of a set, this children's book is written especially for those youngsters who are trapped in anxiety. The story reveals to the child that he or she need not put up with feeling anxious and presents simple strategies for dealing with anxiety."}, {"id": "B074PB71YL", "genre": "Children's Books", "title": "Cowgirls Don't Ride Zebras", "description": "How big is YOUR imagination? Penny has a huge imagination and loves to read books! She has just discovered a new book about cowgirls. With the help of her best friends, Cassandra and Jack, Penny wants to become the best cowgirl EVER. But Penny doesn't have one of the most important things she needs: a horse! So, she and her friends head to the zoo to find the perfect animal to help Penny become a cowgirl."}]