[{"id": "0307021408", "genre": "Children's Books", "title": "The Three Bears", "description": "This classic Little Golden Book edition of the famous folk tale has had many imitators, but none can measure up to the way illustrator Feodor Rojankovsky brought Goldilocks and the three bears to life. Originally published in 1948, The Three Bears is now back in print for a new generation of fans."}, {"id": "153832573X", "genre": "Children's Books", "title": "Be Aware of Stranger Danger (Keep Yourself Safe on the Internet)", "description": "From a young age, children are taught to steer clear of strangers on the street, but strangers on the Internet are just as much of a danger as those in public. This engaging book teaches readers the importance of avoiding strangers online, and what to do if a stranger does try to talk to them. Colorful photographs attract readers, while accessible text reinforces key Internet safety concepts. Promoting responsible online use, this book is a key resource for young Internet users."}, {"id": "099659373X", "genre": "Children's Books", "title": "Dad, Who Will I Be?", "description": "Dad, Who Will I Be? is written by G.Todd Taylor, a former educator and child mental health expert with over 20 years of experience. This book inspires, encourages and educates young readers to be great by introducing to them heroes of color from a number of different professions on an elementary level. Some real-life heroes in the book include Martin Luther King Jr., Muhammed Ali, Mansa Musa, Guion Bluford and Garrett Morgan, W.E.B. Duboise, Tiger Woods and many more. Dr. Jawanza Kunjufu says \"This is a fantastic book for children! Children need to have goals and a purpose in life. They need to have their career range expanded. Children need to hear it from their fathers. Garrett truly needs to be commended.\" "}, {"id": "1480848786", "genre": "Children's Books", "title": "The Adventures of Tommy the Texan and Captain Billy: Back to the Beginning", "description": "Tommy the Texan is an advanced training T-6 airplane who lives in an airport hangar in Danbury, Connecticut, and longs to fly again. When retired airplane pilot, Captain Billy, purchases him and begins rebuilding him, Tommy the Texan looks forward to Billy's visits when he and his friends put on coffee and tell stories of great adventures in the big blue sky.As a special connection builds between Tommy and Billy, the time arrives when Tommy is finally ready to fly. Not long after Billy climbs into the cockpit, starts Tommy's engine, and taxis to the runway, man and machine soar to the sky where they begin making memories and Tommy finally has the chance to experience his own great adventures once again.The Adventures of Tommy the Texan(c) and Captain Billy brings to life the warm relationship between a pilot and his plane as they experience the excitement and joys of flying together...\". Captain Billy and Tommy the Texan are the dynamic duo that will inspire future generations to fly.\"--Erika Armstrong, ATP, Author ofA Chick in the Cockpit"}, {"id": "1520194552", "genre": "Children's Books", "title": "Diary of a Minecraft Zombie Pigman: An Unofficial Minecraft Book", "description": "Ever heard the story of a Minecraft Zombie Pigman?     Experience the daily life of a very special Minecraft Zombie Pigman.  What kind of mischief will he get into?  Will he stay true to his roots after he transforms from Pig to Zombie Pigman?  This diary book is a great read or gift for a Minecraft lover of any age!"}]