[{"id": "1847803458", "genre": "Children's Books", "title": "William Shakespeare: Scenes from the life of the world's greatest writer", "description": "\"A perfect introduction to the real Shakespeare\" - Simon CallowThe life of William Shakespeare is vividly depicted, from his birth in Stratford-upon-Avon in 1564, childhood and schooldays, through apprenticeship at his father's glove-making shop, his marriage to Anne Hathaway, and then the move to London - where Will hones his skills as an actor-playwright for The Lord Chamberlain's Men. When the newly-built Globe Theatre opens in 1599, Will Shakespeare is a key member of the company, and many of Shakespeare's most famous plays are first performed here. By his death in 1616, William Shakespeare is acknowledged as the master playwright of his age - and ever since as one of the greatest writers of all time.With lively graphic-novel descriptions of many of Shakespeare's most famous plays, including A Midsummer Night's Dream, The Merchant of Venice, Romeo and Juliet, Twelfth Night, Henry V, Hamlet, Macbeth, Othello and The Tempest, and drawing on the latest biographical research, this is the perfect introduction for children to the life and works of William Shakespeare."}, {"id": "1541914562", "genre": "Children's Books", "title": "The Powerful Kings of Mesopotamia - Ancient History Books for Kids | Children's Ancient History", "description": "Mesopotamia saw many powerful kings in its long history of power. In this book, you will get to meet some of the most popular, influential and powerful kings in the kingdom. Who were they and what changes did they implement? After reading this book, who is your favorite Mesopotamian king?"}, {"id": "B00A7EEQV8", "genre": "Children's Books", "title": "My Garden of Stories - A Collection of Islamic Stories for Kids", "description": "My Garden Of Stories is a compilation of short stories for kids which proves to be not only thought-provoking and educational, but entertaining as well. A great book to be read on your own as well as story telling for the kids."}, {"id": "1499880863", "genre": "Children's Books", "title": "Jungle Idol", "description": "Hilda Hippo dreams of being a superstar, but does she have what it takes? Down in the jungle the animals are warming up for the big competition. Who will wow the judges and win Jungle Idol? Find out in this fabulous tale about friendship, working together, and following your dreams. "}, {"id": "0516262580", "genre": "Children's Books", "title": "It Could Still Be a Robot (Rookie Read-About Science)", "description": "A simple introduction to smart machines, most of which currently do not take human form, performing tasks too dangerous, too boring, or too difficult for people to do"}]