[{"id": "0792270746", "genre": "Children's Books", "title": "The Legend Of the White Buffalo Woman", "description": "Presents the legend of the White Buffalo Woman, who introduced the pipe that has been part of Lakota culture and who changed into a bear to remind her tribespeople of their ties to nature."}, {"id": "1510734090", "genre": "Children's Books", "title": "From Sunset Till Sunrise: Devin Dexter #2", "description": "Devin Dexter and his cousin Tommy just saved the city of Gravesend from the menace of magical, malicious Cuddle Bunnies brought to life by the warlock, Herb. But there’s no rest for the wicked, as a new mysterious neighbor moves in across the street. At night. With a coffin. Tommy immediately jumps to conclusions as he thinks this can only mean one thing: Vampires. Devin isn’t so quick to believe, as he is struck by the neighbor’s daughter, a girl his age. Even though Tommy points out that they have never seen her during the day. Yet when she invites him to a dance at her school—the Nosfer Academy of Talented Understudies—how can Devin say no? Tommy, though, realizes that this is an opportunity. After tackling a wizard last winter, surely they can protect Gravesend from some measly vampires, right?"}, {"id": "B00U51N3BM", "genre": "Children's Books", "title": "Fox and the Goat räv och geten Children's Picture Book English-Swedish (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump.Novell om en räv och en get. Berättelsen följer räven söker vatten och en get räven interagerar med.Baserat på fabeln från Aesop med ord användning av verb springa, gå, och hoppa."}, {"id": "0756627265", "genre": "Children's Books", "title": "Knights in Shining Armor (Cub Scout Activity Book)", "description": "\"This is the DK \"\"Knights in Shing Armor\"\" Activity Book from the Cub Scout® Activity Series FEATURES: Staple bound"}, {"id": "0763677027", "genre": "Children's Books", "title": "We're Going on a Bear Hunt: Sound Book", "description": "Join in the bear hunt with this fabulous interactive sound book!We're going on a bear hunt. We're going to catch a big one. Will you come along? For twenty-five years, readers have been swishy-swashing and splash-sploshing through this award-winning favorite. Follow and join in the family's excitement as they wade through the grass, splash through the river, and squelch through the mud in search of a bear. What a surprise awaits them in the cave on the other side of the dark forest! Now you can join in the fun with  this interactive sound book."}]