[{"id": "1631590715", "genre": "Children's Books", "title": "Barnyard Kids: A Family Guide for Raising Animals", "description": "Would you like to start your child on a journey of self-reliance and love of the outdoors? A sustainable source of ideas to help your children learn the ins and outs of animal husbandry, Barnyard Kids encourages children to get outside, enjoy nature, and reap the benefits of their hard work.This fun and creative book by Dina Rudick will guide your family through fun opportunities learning about keeping chickens, milking cows, and rearing sheeps.It's time to get your little farmhands dirty. Help them grow to be fruitful, self-sufficient, happy, and healthy!"}, {"id": "0881106542", "genre": "Children's Books", "title": "Science With Weather (Science Activities Series)", "description": "Presents experiments for weather watchers that reveal the properties of humidity, rain, snow, air pressure, wind, heat, shadow, and wind and solar power."}, {"id": "1786063808", "genre": "Children's Books", "title": "Andres Iniesta: The Illusionist (Heroes)", "description": "Although he was small, Iniesta always dreamed big. From a young age he excelled on the pitch, making his debut on the Barcelona first team aged only 18. From there his career grew exponentially. He was part of the Barcelona team that won a historic six trophies in 2009 and was named UEFA’s best player in Europe in 2012. Iniesta is the captain for Barcelona FC and has an astonishing 32 trophies to his name, making him the most decorated Spanish soccer player ever."}, {"id": "B0739WT8DL", "genre": "Children's Books", "title": "North America : The Third Largest Continent - Geography Facts Book | Children's Geography & Culture Books", "description": "What’s in North America? In this Geography Facts Book, we’re going to explore the places, people and cultures of North America. It’s an interesting read because the book paints a better picture of the world. Pictures and information presented in a child-friendly manner make this educational book a fitting addition to your child’s academic collection."}, {"id": "0544534336", "genre": "Children's Books", "title": "Gator Dad", "description": "From seemingly mundane tasks such as grocery shopping to more active pursuits like a romp at the park and fort-building, a loving and playful father alligator shows his gator kids that the simplest pleasures done together can make for an incredibly fun day.      Presented by New York Times bestselling author Brian Lies (Bats at the Beach), this heartwarming story demonstrates a series of very special ways children can connect with their fathers and should appeal to parents and little readers everywhere."}]