[{"id": "B077F5MD1Y", "genre": "Children's Books", "title": "Candy Canes & Fruitcake, Snowy Flake (Holidays Change Series #4)", "description": "Snowy Flake is on a mission to help, Mistletoe, a Christmas reindeer, save Christmas.*This is an illustrated children's book."}, {"id": "0198396279", "genre": "Children's Books", "title": "Rollercoasters: Romantics to the Present Day: An Anthology of Poetry", "description": "An inspiring collection of poetry from the Romantics period to present day, collated by trusted editors in literature, Seamus Perry and David Womersley. Including powerful themes of Youth and Age, Love and relationships, War and conflict and many more, this collection is ideal for both a captivating read and for early preparation for GCSE English Language and Literature requirements."}, {"id": "B0093LJR10", "genre": "Children's Books", "title": "Class Acts Kids' Ebook Sampler", "description": "Class Acts is your hall pass to great kids' books! In this sampler, New York Times bestselling authors Tim Green (Football Genius), Dan Gutman (The Genius Files), Gordon Korman (Ungifted), Adam Rex (The Cold Cereal Saga), and Jon Scieszka (Guys Read) are teaming up with other stellar middle-grade authors: Bryan Chick (The Secret Zoo), Adam Jay Epstein and Andrew Jacobson (The Familiars), Christopher Healy (The Hero's Guide to Saving Your Kingdom), Nils Johnson-Shelton (Otherworld Chronicles), Jeramey Kraatz (The Cloak Society), Christopher Krovatin (Gravediggers), and Maryrose Wood (The Incorrigible Children of Ashton Place). Preview twelve awesome books, get hooked on favorite series, and decide for yourself which author is \"best in class.\""}, {"id": "0761313923", "genre": "Children's Books", "title": "Best Of Best / Soccer Rev Ed (Women of Sports)", "description": "Discusses the past and future of women's soccer and presents biographies of eight of the sport's most famous players: Michelle Akers, Joy Fawcett, Julie Foudy, Mia Hamm, Kristine Lilly, Shannon MacMillan, Carla Overbeck, and Briana Scurry."}, {"id": "1591122597", "genre": "Children's Books", "title": "Potato from Planet X (Minnie and Moo)", "description": "C-R-A-S-H!Spud, a potato-shaped alien, crash-lands at Minnie and Moo's feet and begs for their help. He desperately needs to return to space or the planets will bump themselves into pieces! Can Minnie and Moo help Spud build a new spaceship in time to save the universe?"}]