[{"id": "B06XKFQFSN", "genre": "Children's Books", "title": "Clara Dillingham Pierson's Complete Among the People Series", "description": "'Clara Dillingham Pierson's Complete Among the People Series' features 99 charming tales about the everyday life of the forest, farmyard, meadow, pond and night creatures. The tales are told in such a manner that they seem realistic, and are not only entertaining, but educational."}, {"id": "1785088807", "genre": "Children's Books", "title": "My First Bilingual Book–Love (English–German)", "description": "Guaranteed to enrich a toddler's vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting more complex concepts that go beyond colors and numbers, titles in the series feature animals, fruit, home, and vegetables. This collection combines photographs, bright illustrations, and dual-language words in clear, bold text. Suitable for both individuals and groups, these books are a child's perfect introduction to exploring other cultures."}, {"id": "071662608X", "genre": "Children's Books", "title": "Celtic Myths & Legends (World Book Myths & Legends Series)", "description": "Retells traditional tales from Celtic regions, examining the cultures, geography, and religions from which they came."}, {"id": "1481432427", "genre": "Children's Books", "title": "ABCs on Wings", "description": "The alphabet takes flight in this vividly illustrated picture book of aviation from A to Z!From A is for ace to Z is for zeppelin, this high-flying alphabet book presents the ABCs through the amazing world of aviation. Get to know biplanes, carriers, gliders, jets, and many more vehicles of flight in this book filled with bold, graphic illustrations that soar off the pages!"}, {"id": "159953892X", "genre": "Children's Books", "title": "E-Sports Game Design (E-Sports: Game On!)", "description": "\"Explores professional electronic sports game design and what is involved in creating some of the best games available. Topics include the technology used and the importance of developing the game's story, characters, graphics, and sound. Includes glossary, index, and bibliography for further reading\"--"}]