[{"id": "1934547565", "genre": "Science Fiction & Fantasy", "title": "Freeport: The City of Adventure for the Pathfinder RPG", "description": "Freeport is one of the classic city settings of fantasy roleplaying and it’s back―bigger and better―in this monstrous new sourcebook for The Pathfinder Roleplaying Game. Clocking in at a massive 544 pages, Freeport: The City of Adventure lovingly details a metropolis that mixes fantasy tropes, piracy, and Lovecraftian horror into an action packed setting for your RPG campaign. The city is now more detailed than ever, with added locations, characters, hooks, and a brand new, full-length adventure. The book, featuring a cover by fan favorite artist Wayne Reynolds and a fold-out map of the city, also includes full rules support for the Pathfinder RPG: new classes, archetypes, feats, and magic items. As always you can use Freeport on its own or drop it into your campaign setting of choice. So set sail for Freeport, mateys! Come for the pirates, stay for the cosmic horror!"}, {"id": "B01HQ84ZNG", "genre": "Science Fiction & Fantasy", "title": "The Adventures of Clifford Croft (12 Book Series)", "description": "From Book 1: The Graftonites had incredible reflexes, making them superior bounty hunters and almost unstoppable gunmen.They could draw and fire a blaster in a blink of an eye. Grafton II had evolved into a planet with no government--a purely libertarian society where all services were privatized and civil disputes were mediated by one-on-one gunfights. But when the Graftonites banded together to take over the galaxy, only superspy Clifford Croft, aided by Red Sally the always angry firestarter, the Clapper, an eccentric telekinetic who liked to clap, and the legendary bounty hunter known as the Silencer could stop them."}, {"id": "0994163568", "genre": "Science Fiction & Fantasy", "title": "Avanaux: A Hickory Lace Adventure: Book 1 of the Prosperine Trilogy (Volume 1)", "description": "For sixty years, the Alien Corps has searched for the Second Son of God.When a native on the planet Prosperine is reported to be exorcising demons, curing blindness, and healing the sick, Hickory and her team are sent to investigate. If this “Teacher” proves to be the one in the prophecy, it will signal the beginning of the apocalypse.But Hickory and her superiors aren’t the only ones interested in Prosperine. A sinister galactic force is planning to seize the planet’s reserves of crynidium, the key to faster than light travel. If they succeed, their next stop will be Earth and its colonies.Hickory needs to stop the insurgents, discover what the Teacher is up to, and decide whether he is a fraud—or perhaps the very person the Alien Corps has been searching for.Fans of Star Trek and Dune will love this action packed scifi fantasy.Avanaux, book one of the Prosperine series, is also available in paperback.What Amazon readers are saying about this scifi fantasy adventure.“A Great read. Had me at the first chapter. I didn’t want to stop reading. Loved the plot, the story line, the action!!”“Avanaux is a fun read, perfect for the backyard hammock or a comfortable beach chair while on holiday.”“McDermott creates a very original and hopeful future world similar to the kind of sci-fi I grew up loving. His alien characters are delightful and believable. I couldn't wait to read the second book, Rise of the Erlachi, which is even better!”Scroll up, purchase your copy today, and see why readers are calling McDermott \"a contemporary Asimov\"."}, {"id": "1946105228", "genre": "Science Fiction & Fantasy", "title": "A Soldier's Crest (A Soldier's Crest, #1)", "description": "\"Fierce battles, unlikely heroes, and mythical creatures on a sinister, post-apocalyptic stage...\" THE YEAR IS 2256 and the inhabitants of Earth find themselves in a medieval age after geothermal and nuclear warfare have plunged the planet into a cataclysmic state. Dragons, demons, and magic are now a commonplace in this new world where swords and shields have taken the place of long-forgotten technology. To make matters worse, even strange new creatures and burgeoning magic brought about by the fallout usher are now in chaos - threatening the delicate existence of humanity. In this epic tale, A Soldier’s Crest, an elite group of warriors known as the Dragon Knights rally to end the threat of the Dragonkin, while kings, knights, and monsters vie for power. It's a tumultuous era for Vallick Halstar, the newest among the Dragon Knights, who must prove his place among his comrades as he fights for justice and survival only to discover his true calling on this dark new Earth."}, {"id": "B00D36KVBQ", "genre": "Science Fiction & Fantasy", "title": "Selected Short Stories Featuring New Corpse Smell", "description": "This collection includes fifteen action-packed short stories, mostly science fiction, horror, and military fiction.Shades of Cray: The story of the first transracial individual.Leaving Lost Atlantis: A man writes his ex-wife, after discovering what happened to Atlantis.An Iraqi Christmas Carol: A small group of soldiers and an Iraqi policeman mount a rescue for a kidnapped boy. Quarter: A military team designed for assassinations loses control over one of its members in the middle of a mission.Werehouse: A man trying to help his homeless cousin runs afoul of a society of murderers.Atlas Dug Up: Two philosophical equals have a love affair that continues after death.Blood Falls: An expedition to the Antarctic goes south, after a rock wall collapses.Murder Your Darlings: A writer finds himself convinced one of his characters is trying to kill him, after his loved ones start getting hurt.Mine: A doctor exacts revenge on a former-General.Failure Cascade: A ride on a space elevator goes horribly wrong.Euthenasia: A surgeon gets caught between his oath and his vengeful calling.Shrink: An executive ponders the consequences of modern business.Indian Gift: An ex-outlaw is drafted into convincing an Indian to sell his land.Parallel: A professor familiar with inter-dimensional travel tries convincing one of his students to kill another.New Corpse Smell: Observing decomposition."}]