[{"id": "0570075572", "genre": "Children's Books", "title": "10 Steps to Z-z-zing! - Arch Books", "description": "This book retells the story of Moses and the Ten Commandments (Exodus 20:1-17). The Arch(R) Book series tells popular Bible stories through fun-to-read rhymes and bright illustrations. This well-loved series captures the attention of children, telling scripturally sound stories that are enjoyable and easy to remember."}, {"id": "1592960855", "genre": "Children's Books", "title": "Bicycle Safety (Living Well, Safety)", "description": "Explains the importance of being safe on a bicycle, whether alone or in a group, on the street or in a park, and points out specific things one can do to remain safe while cycling."}, {"id": "1526301040", "genre": "Children's Books", "title": "Generation Code: I'm an HTML Web Page Builder", "description": "HTML is one of the most commonly used coding languages in the world - once you've grasped it, the incredible possibilities of the internet lie before you. In this book, learn how to build and customise your own web pages, complete with fancy fonts, funky icons and embedded videos and maps. Once you've mastered HTML, go further and discover how the style language CSS can make your pages look even better.The Generation Code series is a hands-on guide to computer coding, designed to train you in the coding languages used by real-world computer programmers. You'll discover how to code exciting programs, web pages, apps and games, and learn how the tools and functions you're using can be applied to other situations.Other books in the Generation Code series:I'm an Advanced Scratch CoderI'm a Python ProgrammerI'm an App DeveloperI'm a JavaScript Games Maker: The BasicsI'm a JavaScript Games Maker: Advanced Coding"}, {"id": "1514782588", "genre": "Children's Books", "title": "Wave-Full Waters: The Prophecy Continues... (Shifting Tides) (Volume 2)", "description": "The adventure continues... Rejoin the Thomas sisters Emily and Shelby as they and their friends go on a race-around-the-world rescue mission for one of their own. Along the way, meet lovable new characters, villains, and trials. Surely, the prophecy is far from over! This thrilling sequel to Lunix Star's \"Shifting Tides\" is a sure page-turner, with valuable lessons of survival, friendship, and family with magic and mystery around every corner that will have audiences on the edges of their seats."}, {"id": "0761345086", "genre": "Children's Books", "title": "Maccabee!: The Story of Hanukkah", "description": "Judah and the little army of Maccabees fight to free Jerusalem from the cruel King Antiochus in this vibrant and action-filled rhyming version of the famous Hanukkah story."}]