[{"id": "051620288X", "genre": "Children's Books", "title": "Going Back Home: An Artist Returns to the South", "description": "More than half a century after her family moved North to find a better life, African American artist Michele Wood returned to the South to see and feel the land where her ancestors lived. In her first book for children, Wood presents her paintings inspired by this personal journey. Igus interprets her visual images and family stories. Full color."}, {"id": "B00PP7IY88", "genre": "Children's Books", "title": "101 Amazing Facts About The Amazon: Amazon Rainforest Facts (Amazon Facts)", "description": "101 Amazing Facts About The AmazonThe  Amazing Amazon Rainforest is the largest and most incredible rainforest in the world, this fact book provides many interesting and thought provoking facts about the vast forest that spreads over a great proportion of South America. Do you know how many amazing facts there are about the Amazon?! In this book, written by non-fiction author Sam Paxinos, we look into all aspects of the amazing Amazon Rainforest, where you can discover so much more about the 'Lungs of the World'.- Historical Facts - Secret Facts - Deforestation Facts - Science Facts - Animal and Wildlife Facts- Weird Facts - Interesting Facts You'll be able to impress your family and friends with all your new found knowledge of Amazon facts, like how 20% of the worlds oxygen comes from this amazing forest! This is just one of the 101 amazing amazon facts that you will know after reading this book. The Ultimate Amazon Rainforest Fact BookSuitable for intermediate to advanced readers, and earlier readers with the assistance of an adult, Amazon Facts: 101 Amazing Facts About The Amazon is a fun and educational read for budding adventurers of all ages!"}, {"id": "1515780457", "genre": "Children's Books", "title": "Pro Hockey's Underdogs: Players and Teams Who Shocked the Hockey World (Sports Shockers!)", "description": "Hockey fans love to cheer for the underdog, and every winter they get reminded that anything can happen on the ice. An undrafted player can become and All-Star. A franchise known as a perennial loser can rise up and win the Stanley Cup. This book presents thrilling tales of players and teams who have shocked the hockey world."}, {"id": "0064467120", "genre": "Children's Books", "title": "Too Many Kangaroo Things to Do! (MathStart 3)", "description": "It’s Kangaroo’s birthday, but no one will play with him: not the emu, the platypuses, the koalas, or even the dingos. They all have too many things to do. What exactly are they doing? They’re using multiplication to figure out just how many things they have to do to plan a big surprise for Kangaroo!   Best Children’s Science Books 1997 (Science Books and Films)"}, {"id": "1454921579", "genre": "Children's Books", "title": "Javascript for Babies (Code Babies)", "description": "CODING FOR KIDS . . . Because it’s never too early to start developing!   Coding and web-design skills are becoming more and more important in our technological world. These concept books will familiarize young ones with the kind of shapes and colors that make up web-based programming language and give them the head start they need. You’re never too young to be standards compliant! Show your little ones how to add function to a web page with JavaScript and familiarize them with the variables and events that make up the essential building blocks of the web."}]