[{"id": "B071YC6L5H", "genre": "Children's Books", "title": "Driven to Win! (Disney/Pixar Cars 3) (Step into Reading)", "description": "A Step 3 Step into Reading leveled reader based on Disney/Pixar Cars 3—cruising into theaters June 16, 2017!Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen (voice of Owen Wilson) is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn’t through yet will test the heart of a champion on Piston Cup Racing’s biggest stage! Children ages 4 to 6 will love this Step 3 Step into Reading leveled reader based on the film. Step 3 readers feature engaging characters in easy-to-follow plots about popular topics. For children who are ready to read on their own."}, {"id": "B00QS9GZ2O", "genre": "Children's Books", "title": "A Smart Girl's Guide:  Staying Home Alone (Smart Girl's Guides)", "description": "This popular book is now updated with new illustrations and advice that will help you feel confident and in control when you're home alone. It includes boredom busters, fun-for-one ideas, quizzes, neighborhood know-how, snack recipes, safety tips, first-aid information, and sibling survival secrets. Plus, this girl-friendly guide features a handy tear-out booklet for keeping track of important information and house rules."}, {"id": "0316311367", "genre": "Children's Books", "title": "A Child's Introduction to Natural History: The Story of Our Living Earth–From Amazing Animals and Plants to Fascinating Fossils and Gems", "description": "In the tradition of Black Dog's best-selling Child's Introduction books, which include The Story of the Orchestra and A Child's Introduction to the Night Sky, A Child's Introduction to Natural History introduces readers ages 8 to 12 to the fascinating wonders of our natural world.Highlighting every kingdom of life--plants, bacteria, mammals, birds, amphibians, insects, rocks and minerals--the book is also full of charming and witty illustrations by Meredith Hamilton plus 30 photographs throughout. The book delves into topics like geology; prehistoric times, including fossils and dinosaurs; how animals move and fly; evolution; biomes; and more. Sidebars throughout offer biographies of naturalists like Charles Darwin, Mary Anning, and Charles Henry Turner. Also includes fun, hands-on projects for kids to do on their own or with adults and 5 origami patterns to create your own paper fox, whale, penguin, and more. Beautifully illustrated and designed, this is an entertaining and educational look at our natural history. "}, {"id": "1555466702", "genre": "Children's Books", "title": "Grandma Moses (Women of Achievement)", "description": "A biography of the American primitive painter who, at the age of seventy-six, without ever having had an art lesson, began painting realistic scenes of rural life which were critically acclaimed and made her famous"}, {"id": "0997890053", "genre": "Children's Books", "title": "The Complete Collection of Chee Chee's Adventures: Chee Chee's Adventure Series", "description": "Chee Chee the vervet monkey has been a delight to children all over the world since he first appeared in 2007 in the Caribbean Adventure Series. Here you will find five stories of his adventures and mischief in his unending quest for his paradise garden."}]