[{"id": "B00HNXBOXY", "genre": "Children's Books", "title": "#19 The Fifth Musketeer (Twisted Journeys ®)", "description": "Seventeenth-century France is crawling with bandits, werewolves, and angry swordsmen. You've got the heart, but do you have the courage and brains to survive these dangers and become a musketeer? Every Twisted Journeys® graphic novel lets YOU control the action by choosing which path to follow. Which twists and turns will your journey take?"}, {"id": "B004XWPQ8W", "genre": "Children's Books", "title": "Actress in Spite of Herself: The Life of Anna Cora Mowatt", "description": "Anna Cora Mowatt holds an important place in American theater history. At the age of fifteen she eloped with an older, wealthy man who provided her with a beautiful home and an excellent education. It was a happy marriage, but when her husband had to give up his law practice due to illness, she needed to find a way to support them. Although at first reluctant to appear on the stage, she became the first woman to give public readings; she wrote the first social satire for the stage; and without previous acting experience she become a star overnight. She was the first American to make the acting profession for women respectable—proving that a lady could be an actress and an actress a lady."}, {"id": "0544568192", "genre": "Children's Books", "title": "Out to Lunch (Green Light Readers Level 1)", "description": "\"Mind your manners well today, we're out to lunch, not out to play!\" When the babysitter calls at the last minute to cancel, Joe's parents take him out to lunch at a restaurant with neither crayons nor a play area. Mischievous Joe just can't stop wiggling and misbehaving. His amusing antics turn a quiet lunch at a fancy restaurant into a spectacle that ends with an unexpected treat!   "}, {"id": "1544250843", "genre": "Children's Books", "title": "Science Experiments For Kids: 40 + Cool Kids Science Experiments (A Fun & Safe Kids Science Experiment Book)", "description": "This science experiments for kids book is packed with 40+ fun, safe and cool kids science experiments! Guaranteed to keep any child entertained for hours the experiments in this book will astound the entire family. Filled with amazing fun, safe experiments that are suitable for all ages, even the adults will enjoy these epic experiments! Each experiment uses simple household objects, no special equipment required! Easy to follow illustrations allow any child to become a successful scientist!"}, {"id": "1680780522", "genre": "Children's Books", "title": "5 Seconds of Summer (Big Buddy Pop Biographies)", "description": "Introduces the Australian pop band, describes how they formed the band and their rise to success, and profiles its four members."}]