[{"id": "0331468646", "genre": "Science Fiction & Fantasy", "title": "King Arthur: Pendragon (Classic Reprint)", "description": "Excerpt from King Arthur: Pendragon Merlin. Who calleth Merlin P Here am And wearily, in seven-league boots, to boot, Leaping great salmon leaps, old as I am. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works."}, {"id": "1973551764", "genre": "Science Fiction & Fantasy", "title": "Resurrection Day: A New World novel", "description": "What if the post-apocalyptic world, rather than a dystopian mob of amoral survivors, was instead a society of individuals who truly want to work together to build a new world, who gradually transform the earth into a paradise and erase all signs of the old world? Now suppose that many of those who died in the old world began, in an orderly fashion, being transported into that new world. Meet Steve. A middle-aged man who died late in the old world, Steve is now alive, young, healthy, and just beginning to understand what life can really be like, what the earth's true potential is, as it is slowly being rebuilt into a paradise. This is the weirdest, best day of Steve's life. Follow Steve's first day as he gets answers to his questions: What happened at the conclusion of the old world? What constituted the cry of Peace and Security? How was Babylon destroyed? What was Armageddon like? Who survived, and who didn't? What new things will he see, hear, taste and smell? What will he experience? Resurrection Day presents a speculative, heartwarming answer those questions."}, {"id": "B074QV6T1G", "genre": "Science Fiction & Fantasy", "title": "Space Team (7 Book Series)", "description": "From Book 1: The galaxy just called for help. Unfortunately, it dialed the wrong number.  Small-time conman, Cal Carver, is having a bad day. Imprisoned and forced to share a cell with a cannibalistic serial killer, Cal thinks things can't possibly get any worse.  He is wrong.  It’s not until two-thirds of the human race is wiped out and Cal is mistakenly abducted by aliens that his day really starts to go downhill.  Whisked across the galaxy, Cal is thrown into a team of some of the sector's most notorious villains and scumbags. Their mission should be simple enough, but as one screw-up leads to another, they find themselves in a frantic battle to save an entire alien civilization - and its god - from total annihilation.  Featuring epic space battles, alien gangsters, and several thousand flying Tobey Maguires, Space Team is the first book in the internationally bestselling series by award-winning author, Barry J. Hutchison, and is perfect for fans of Hitchhiker's Guide and Guardians of the Galaxy."}, {"id": "B075W2313X", "genre": "Science Fiction & Fantasy", "title": "2121: The Redford Files", "description": "The Redford Institute for the Psychologically Impaired is just one among many such facilities these days, but it remains special in a rather peculiar way. The patients it houses are of a certain devious variety that, for one reason or another, have altogether missed being washed (and let me tell you, it isn't anything so pleasant as a bubble bath). But I digress! Redford is quite the exciting place. There's pants, toast, and curious happenings (a disturbingly delectable mix including bamfing trees, zombie fever, and body-swapping) that all clearly agree something is fundamentally and absolutely wrong. But if you walk through that door... Join the newly-arrived patients of Redford as they struggle to make some sort of sense out of a world that intends to do anything but. ...(There's cake.)"}, {"id": "1978161603", "genre": "Science Fiction & Fantasy", "title": "Valley of Dreams", "description": "\"Valley of Dreams\" is a science fiction short story by Stanley G. Weinbaum originally published in the November 1934 issue of Wonder Stories. Two weeks before the Ares is scheduled to leave Mars, Captain Harrison sends American chemist Dick Jarvis and French biologist \"Frenchy\" Leroy to retrieve the film Jarvis took before his auxiliary rocket crashed into the Thyle highlands the week before. Along the way, the Earthmen stop at the city of the cart creatures and the site of the pyramid building creature for Leroy to take some samples."}]