[{"id": "0060746998", "genre": "Children's Books", "title": "My Little Pony: Princess Party Paint Book", "description": "To make a light-switch cover: Ask a grown-up to help you cut out the light-switch cover. Don't forget to cut out the rectangle at the center.  Tape the cover over your light-switch so that the switch pokes through the rectangle."}, {"id": "0689851928", "genre": "Children's Books", "title": "America : A Patriotic Primer", "description": "America: A Patriotic Primer is a succinct history of the United States, an ABC of the principles on which this country was founded, and a book for children and families to pore over, discuss, and cherish.  A is for America,  the land that we love.  B is for the Birthday of this country of ours....  To choose the twenty-six people and ideas that comprise the book, Lynne Cheney has drawn on a lifetime of learning about the American past, and on the inspiration that comes from witnessing recent history firsthand. Illustrator Robin Preiss Glasser imbues Mrs. Cheney's words with childlike joy through her exuberant drawings. Together they have created a patriotic primer, a book that teaches history by celebrating the diversity, tenacity, and faith of the American people.  This A to Z of America frames the story -- and the miracle -- of our country."}, {"id": "B077Z3N2WB", "genre": "Children's Books", "title": "Red Boots", "description": "Old Joey’s lips fell open in astonishment as he examined a pair of boots. They were bright red, standing out like a forgotten apple on an autumn tree. He whistled, long and low. “Red boots!”A pair of shiny red boots bring unexpected Christmas joy to a shopkeeper and a little girl.A very short story. (Approximately 8 minutes reading time.)"}, {"id": "0307265145", "genre": "Children's Books", "title": "Capital Mysteries #2: Kidnapped at the Capital", "description": "From popular A to Z Mysteries author Ron Roy comes a red, white, and blue mystery perfect for President's Day! In the second book of the Capital Mysteries—an early chapter book mystery series featuring fun facts and famous sites from Washington, D.C.—KC and Marshall are going to the Cherry Blossom Festival. They have an invitation from the President of the United States! But while they are off getting ice cream, KC's mom and President Thornton are kidnapped - right under the bodyguards' noses. Who cares if the FBI is on the case? KC isn't giving up until she finds her mom! Each book highlights one of the famous museums, buildings, or monuments from the Washington area and includes a map and a two-page fun fact spread with photographs. Parents, teachers, and librarians agree that these highly collectible chapter books are perfect for emerging readers and any kid who love mysteries!"}, {"id": "0892392177", "genre": "Children's Books", "title": "The Upside Down Boy/El nino de cabeza (Rise and Shine)", "description": "The Upside Down Boy is award-winning poet Juan Felipe Herrera's engaging memoir of the year his migrant family settled down so that he could go to school for the first time. Juanito is bewildered by the new school, and he misses the warmth of country life. Everything he does feels upside down. He eats lunch when it's recess; he goes out to play when it's time for lunch; and his tongue feels like a rock when he tries to speak English. But a sensitive teacher and loving family help him to find his voice and make a place for himself in this new world through poetry, art, and music. Juan Felipe Herrera's playful language and the colorful, magical art of Elizabeth Gómez capture the universal experience of children entering a new school feeling like strangers in a world that seems upside down-at first."}]