[{"id": "0761316027", "genre": "Children's Books", "title": "The 1920s: Luck (Century Kids)", "description": "In 1927 the Dixons move from rural Georgia to Chicago, where African Americans have more opportunities, and there Lorraine meets a famous movie actress and her little brother Marcus finds that his artistic talents are useful."}, {"id": "1847808638", "genre": "Children's Books", "title": "The Hello Atlas: Download the free app to hear more than 100 different languages", "description": "Look into the lives of children all over the world with this book that celebrates one of humanity's greatest achievements: written and verbal language. Including fully illustrated word charts, featuring children depicted in their home country, doing ordinary things, this book features more than 100 languages, from well-known and lesser known indigenous languages that introduce us to some of the world's most remote communities. With foreword by ethnobotanist and explorer, Professor Wade Davis. Comes with a free, downloadable app for iOS and Android that allows you to hear the phrases in the book, each recorded by a native speaker."}, {"id": "1570915288", "genre": "Children's Books", "title": "Ralph Masiello's Dinosaur Drawing Book", "description": "Dinosaurs roamed the earth 65 million years ago. Now you can bring them back to life in your drawings. Illustrator Ralph Masiello shows you how to draw all things dinosaur, from hatching dinosaur eggs to the mighty Tyrannosaurus Rex. Just follow the steps shown in red to create your own Jurassic world. With a few simple lines, you can draw a stegosaurus from head to spiky tail. Then you can add ferns and other prehistoric plants for it to eat. Bonus challenge steps show you how to make your drawings even more realistic."}, {"id": "1936172518", "genre": "Children's Books", "title": "Where We Once Gathered, Lost Synagogues of Germany (English and German Edition)", "description": "The Lost Synagogues project entails a collection of vibrant paintings depicting synagogues that were eradicated before and during WWII. Andrea Strongwater has researched Jewish communities across Europe to connect archival photos with written records that together paint a picture of European Jewish life before the Holocaust. Strongwater brings this world back to life through her art. This book is dedicated to synagogues destroyed during the Third Reich throughout the region that was part of Germany in 1935. The paintings in this collection have been created by carefully scrutinizing historical black and white photos. Where decisions have been made about colors, the artist has chosen to enhance the beauty of the building, while staying true to the material of the original. The work is intended to draw you into this world of gorgeous and meaningful architecture, while preserving an important piece of Jewish cultural history. In educating future generations about Jewish history and the impact of the Holocaust, this book provides remarkable documentation of the rich cultural life that thrived throughout Europe prior to World War II."}, {"id": "B005SMVXOC", "genre": "Children's Books", "title": "I Could Do That!: Esther Morris Gets Women the Vote (Melanie Kroupa Books)", "description": "Full of humor and spunk – just like Esther! “I could do that,” says six-year-old Esther as she watches her mother making tea. Start her own business at the age of nineteen? Why, she could do that, too. But one thing Esther and other women could NOT do was vote. Only men could do that.With lively text and humorous illustrations as full of spirit as Esther herself, this striking picture book biography shows how one girl’s gumption propels her through a life filled with challenges until, in 1869, she wins the vote for women in Wyoming Territory – the first time ever in the United States!"}]