[{"id": "149097119X", "genre": "Children's Books", "title": "A Halloween Brew of Poems Just For You", "description": "Through witty rhymes with a twist of suspense and mystery, A Halloween Brew of Poems Just for You leads the reader on a Halloween journey they will long remember. There’s a No Entry sign on an oddly lit door, a mummy trapped in a poem, a mysterious empty house in a glen, a witch with a pointed tale to tell and a ghostly bell that rings from a church on a hill. All of these poems and more are combined with rich illustrations that stir the imagination. This book will surely become a family favorite for many Halloweens to come."}, {"id": "1547117249", "genre": "Children's Books", "title": "Happy 19th Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 19 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1581173210", "genre": "Children's Books", "title": "10 Christmas Lights", "description": "Count from one to ten as ten animal families decorate their homes with special holiday lights. Lights are activated by a push button in back cover."}, {"id": "0613792025", "genre": "Children's Books", "title": "The Return of Gabriel (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. In the summer of 1964, a thirteen-year-old white boy whose best friend is black is caught in the middle when civil rights workers and Ku Klux Klan members clash in a small town near Tupelo, Mississippi."}, {"id": "B00BQEPNQK", "genre": "Children's Books", "title": "Whale Port", "description": "Long before the invention of electricity or the discovery of underground reservoirs of fossil fuels, people depended on whale oil to keep their lamps lit. A few brave Colonial farmers left their fields and headed out to sea to chase whales and profits farther and farther off shore. When they did, towns sprung up around their harbors as demand grew for sailors, blacksmiths, ropewalkers, and the many other craftsmen needed to support the growing whaling industry. Through the fictional village of Tuckanucket, Whale Port explores the history of these towns. Detailed illustrations and an informative narrative reveal the way Tuckanucket’s citizens lived and worked by sharing the personal stories of people like Zachariah Taber, his family and neighbors, and the place they called home. Whale Port is also the story of America, and the important role whales played in its history and development as people worked together to build communities that not only survived, but prospered and grew into the flourishing cities of a new nation."}]