[{"id": "B00AVV1U84", "genre": "Science Fiction & Fantasy", "title": "Defiler of Tombs (Kormak Book Two) (The Kormak Saga 2)", "description": "\"The King of High Adventure,\" Starlog.\"Immediately convincing, classically brooding,\" Steve Tompkins, TheCimmerian.comTo the world at large, he is a mercenary and assassin, a brutal killer with a deadly blade. In reality Kormak is a Guardian, one of an ancient order sworn to protect humanity from the servants of the gathering darkness. DEFILER OF TOMBSAn open tomb, a dead child and an unleashed ancient horror send Kormak on a path of vengeance through the haunted northlands of Taurea. He seeks Morghael, a necromancer with a plan for resurrecting the dark empire of Kharon and the power to bring the dead swarming back to life. Defiler of Tombs is the second thrilling installment of the Kormak saga. Buy it now and join Kormak on his terrifying quest to stop the return of an ancient evil.ABOUT THE SERIESSo far the series consists of the following books.Stealer of FleshDefiler of TombsWeaver of ShadowCity of StrifeTaker of SkullsOcean of FearBorn of DarknessABOUT THE AUTHORWilliam King lives in Prague, Czech Republic with his lovely wife Radka and his sons Dan and William Karel. He has been a professional author and games developer for over a quarter of a century. He is the creator of Gotrek and Felix for Black Library. He is also the author of the World of Warcraft novel Illidan. Over a million of his books are in print in English.He has been nominated for the David Gemmell Legend Award. His short fiction has appeared in Year's Best SF and Best of Interzone. He has twice won the Origins Awards For Game Design. His hobbies include role-playing games and MMOs as well as travel.You can find out more at www.williamking.me"}, {"id": "B00BO1FGTY", "genre": "Science Fiction & Fantasy", "title": "Triorion: Abomination (Triorion: The Series Book 2)", "description": "\"Triorion: Abomination,\" the second book in the series, picks up at the end of the devastating war that has left millions of Sentients displaced and entire worlds obliterated. Torn between her duties as a military leader and fulfilling her promises to her siblings, seven-year-old Jetta finds herself succumbing to a dark voice that grows louder each day. The siblings, once inseparable, face new enemies as the true source of their talents emerge and threatens to tear them--and the galaxy--apart.“Not your standard Sci Fi, the Triorion series will transport you into the triplets’ gritty world as they make impossible decisions while learning who they really are—and try to save the galaxy while they’re at it.” J. A. Campbell, author of the Clanless series"}, {"id": "0062459368", "genre": "Science Fiction & Fantasy", "title": "The Ocean at the End of the Lane: A Novel", "description": "UK National Book Awards 2013 \"Book of the Year\"“Fantasy of the very best.” Wall Street JournalA middle-aged man returns to his childhood home to attend a funeral. Although the house he lived in is long gone, he is drawn to the farm at the end of the road, where, when he was seven, he encountered a most remarkable girl, Lettie Hempstock, and her mother and grandmother. He hasn’t thought of Lettie in decades, and yet as he sits by the pond (a pond that she’d claimed was an ocean) behind the ramshackle old farmhouse where she once lived, the unremembered past comes flooding back. And it is a past too strange, too frightening, too dangerous to have happened to anyone, let alone a small boy.A groundbreaking work as delicate as a butterfly’s wing and as menacing as a knife in the dark, The Ocean at the End of the Lane is told with a rare understanding of all that makes us human, and shows the power of stories to reveal and shelter us from the darkness inside and out.“[Gaiman’s] mind is a dark fathomless ocean, and every time I sink into it, this world fades, replaced by one far more terrible and beautiful in which I will happily drown.” New York Times Book Review"}, {"id": "1494988151", "genre": "Science Fiction & Fantasy", "title": "1-5: Sysco Volumes 1 to 5", "description": "Three people in a modern corporate town might be the world's only hope. Some people say that Sysco is absolute power. Others said she could kill with just a glance. What they didn't know was that Sysco was just a girl, a teenage kid with a terrible power... ever since a horrible accident involving toxic chemicals in Sydney Nova Scotia, Sysco and her friends have been secretly fighting against the evils of industrial pollution, a corrupt society and a world of danger hidden so no one knew it was possible. But Sysco sets fires with her mind, and the power to survive is getting harder to find... ever since Sysco vol. 1 was published in December 2012, it has been sold in over twenty countries and gotten five-star reviews from some. Now you can get volumes 1 to 5 of the series all in one rather than read them separately!"}, {"id": "1619861828", "genre": "Science Fiction & Fantasy", "title": "Villainy Victorious: Mission Earth Volume 9", "description": "Earth is rising in the House of Voltar . . .And there’ll be hell to pay!That’s right. The invasion is on . . . and it’s coming soon to a galaxy near you. The action couldn’t be hotter, and the plot couldn’t be more diabolical. Earth is coming to Voltar—and the Voltarians won’t know what hit them.Murder, blackmail, drugs, psychoanalysis, PR firms, sex-crazed teenyboppers, riots in the streets, women in chains. These are the powerful secret weapons of war—perfected on Earth and imported to Voltar—which are now being exploited by the ruthless Lombar Hisst, chief of the Coordinated Information Apparatus (the infamous CIA). His obsession: total domination of the Voltarian Confederacy.Can anyone stop the madness? Does anyone have the courage and charisma to crash this party?Enter Royal Officer of the Fleet, Jettero Heller. Dodging Death Battalions and death warrants, he’s racing from Earth to face the challenge. But Hisst has taken Heller’s beautiful sister hostage, and she may be the one who has to pay the ultimate price of VILLAINY VICTORIOUS.“A superlative storyteller with total mastery of plot and pacing.” —PUBLISHERS WEEKLY"}]