[{"id": "B00FOFWNOC", "genre": "Children's Books", "title": "Bryn Morgan and the Mystery of Sinclair Cove (A Thirteen Ancient Treasures Mystery Book 1)", "description": "Ten year old Bryn Morgan is having quite a year. Her mother, Archaeology Professor, Elen Morgan, is on an exciting ‘dig’ with her final year students from the University of Prince Edward Island’s School of Anthropology and Bryn is along for the ride. Bored with all the tedious details of setting up a new excavation, Bryn sets off to explore on her own. Stopping for a snack she sits down on a funny looking slab of rock. Deciding this would be a great place to try out her new rock hammer, Bryn starts tapping on the stone as she’s seen her mother do countless times. And that’s when the fun begins…C.J. Oakley writes children's mystery and adventure books for ages 9 12"}, {"id": "1479522899", "genre": "Children's Books", "title": "Little Elephant Listens (Hello Genius)", "description": "Little Elephant uses his big ears to listen to his parents. He listens to them at playtime, bathtime and bedtime. Vibrant photos and short text make this sturdy board book perfect for 6 months and up!"}, {"id": "B00LI8MXCG", "genre": "Children's Books", "title": "Twenty-Four Paul Klee's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Paul Klee's Paintings. Twenty-Four Paul Klee's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "B0012QGZZA", "genre": "Children's Books", "title": "The Seven Chinese Sisters", "description": "Once there were seven Chinese sisters who lived together and took care of each other. Each one had a special talent. When baby Seventh Sister is snatched by a hungry dragon, her loving sisters race to save her."}, {"id": "0737735554", "genre": "Children's Books", "title": "Shel Silverstein: Poet (Innovators (Kidhaven))", "description": "The Inventors and Creators series examines the fascinating life stories of some of the world's most interesting innovators in science, the arts, technology, and other fields. These short biographies will inform and inspire young readers. Each book includes color photographs, an annotated bibliography, glossary, and index.  Glossary  Bibliography  Indexes  Full-color photographs"}]