[{"id": "0486466094", "genre": "Children's Books", "title": "Samurai Stickers (Dover Stickers)", "description": " Return to ancient times when the legendary samurai lived by a strict code of honor and personal bravery was the noble way. Based on thorough research, this dramatic collection of 20 full-color stickers depicts the elite class of warriors, bearing arms and armor of metal and leather. Finely detailed illustrations include fierce face masks, plus helmeted figures fighting on horseback, aiming bow and arrow, and wielding swords and other weaponry. A fun way to entertain and inform kids!"}, {"id": "0374306168", "genre": "Children's Books", "title": "The Hugely-Wugely Spider", "description": "We've all heard of the Itsy-Bitsy Spider right? But have you heard of the the Hugely-Wugely Spider? He's just like Itsy-Bitsy except he's a little―no―a lot bigger. The Hugely-Wugely Spider went up the water spout, well not really, because he wasn't invited by the other spiders. And maybe because his size was bit of an issue . . . But that didn't stop him from trying. The Itsy-Bitsy Spider and his friends get into a bind when down comes the rain and threatens to wash them out, and only the Hugely-Wugely Spider can save them. With his quick thinking and huge thorax, Hugely-Wugely clogs the drain and saves the day."}, {"id": "B01MS9OAV3", "genre": "Children's Books", "title": "Isaac the Alchemist: Secrets of Isaac Newton, Reveal'd", "description": "A surprising true story of Isaac Newton’s boyhood suggests an intellectual development owing as much to magic as science.Before Isaac Newton became the father of physics, an accomplished mathematician, or a leader of the scientific revolution, he was a boy living in an apothecary’s house, observing and experimenting, recording his observations of the world in a tiny notebook. As a young genius living in a time before science as we know it existed, Isaac studied the few books he could get his hands on, built handmade machines, and experimented with alchemy—a process of chemical reactions that seemed, at the time, to be magical. Mary Losure’s riveting narrative nonfiction account of Isaac’s early life traces his development as a thinker from his childhood, in friendly prose that will capture the attention of today’s budding scientists—as if by magic. Back matter includes an afterword, an author’s note, source notes, and a bibliography."}, {"id": "0006644023", "genre": "Children's Books", "title": "The Witches and the Singing Mice", "description": "When three witches move into Glenmagraw, disaster strikes for the villagers. Kirstie and Jamie are inflicted with a sleeping sickness, caused by bites from the singing mice who are under the witches' power. It is up to two brave cats to try to help the villagers by following the witches."}, {"id": "1580894399", "genre": "Children's Books", "title": "Global Baby Girls (Global Fund for Children)", "description": "Continuing in the tradition of best-selling GLOBAL BABIES and AMERICAN BABIES, GLOBAL BABY GIRLS puts baby girls from around the world in the spotlight, celebrating their strength, diversity, and potential. From Peru to China, from Russia to Mali, this board book features captivating photographs of baby girls to share a simple, yet powerful message: no matter where they are born, baby girls can grow up to change the world.Baby girls are precious, but they are not valued everywhere. It’s never too early to introduce the importance of girls, and the power they can have in the world."}]