[{"id": "1512416010", "genre": "Children's Books", "title": "Learn to Program (Kids Get Coding)", "description": "\"Learn programming basics in this kid-friendly, easy-to-follow book. It covers computer languages, writing programs, bugs, and loops using real-world examples and fun illustrations. Online and offline activities also boost learning and skills.\"--"}, {"id": "B0030H26BQ", "genre": "Children's Books", "title": "The Arthur Trilogy #1: The Seeing Stone", "description": "Arthurian legend comes to life in the first novel in this remarkable, award-winning sagaThirteen-year-old Arthur de Caldicot lives on a manor, desperately waiting for the moment he can become a knight.  One day his father's friend Merlin gives him a shining black stone - a seeing stone - that shows him visions of his namesake, King Arthur.  The legendary dragons, battles, and swordplay that young Arthur witnesses seem a world away from his own life. And yet there is something definitely joining the Arthurs together.  It will be Arthur de Caldicot's destiny to discover how his path is intertwined with a king's . . . for the past is not the only thing the seeing stone can see."}, {"id": "1504645359", "genre": "Children's Books", "title": "Juba!: Library Edition", "description": "A tale based on the life of dancer Master Juba traces young William Henry Lane's childhood practice of a traditional African dance style before his meteoric rise to fame as an influential artist. By the Newbery Honor-winning author of Monster. Simultaneous."}, {"id": "0895652609", "genre": "Children's Books", "title": "Word Bird Makes Words With Hen: A Short \"E\" Adventure (Moncure, Jane Belk. Word Bird's Short Vowel Adventures.)", "description": "When his father brings him some new word puzzles, Word Bird makes up more words with his friend Hen, and each word that they make up leads them into a new activity."}, {"id": "0525421645", "genre": "Children's Books", "title": "Every Cowgirl Needs a Horse", "description": "In Every Cowgirl Needs a Horse, Nellie Sue does everything with a western flair. Whether it is cleaning up the animal sty (picking up her stuffed animals) or rounding up cattle (getting the neighborhood kids together for her birthday party), she does it like a true cowgirl. All she really needs is a horse. So when Dad announces at her birthday party, “I got a horse right here for you,” Nellie Sue is excited. But when her horse turns out to be her first bicycle, it will take an imagination as big as Texas to help save the day.Activities for Every Cowgirl Needs a Horse by Rebecca Janni"}]