[{"id": "B00B55A06S", "genre": "Children's Books", "title": "Baby Mammoth Mummy: Frozen in Time: A Prehistoric Animal's Journey into the 21st Century (National Geographic Kids)", "description": "Meet Lyuba—the most perfectly preserved baby mammoth ever discovered! Found lying along a riverside 31,000 years after her birth, Lyuba provides a never-before-seen view of prehistoric life in Siberia. Together with award-winning author Christopher Sloan, kids learn the story of her discovery by the indigenous Nenet people and peak inside Lyuba’s mysterious prehistoric world. Readers will join scientists as they recreate Lyuba’s life and death using cutting edge science—including paleontology, radiology, and forensic science—and reveal new information about mammoths and their ice age home. Lyuba’s incredible story, which debuted as a National Geographic Channel exclusive and as articles in National Geographic magazine and National Geographic Kids magazine, is certain to be a fascinating read for kids and a great complement to science curriculum."}, {"id": "1614794863", "genre": "Children's Books", "title": "Ghostbusters 1: The Man from the Mirror", "description": "The Ghostbusters have many questions after a strange encounter with the mysterious Jim Silver. Before they can get any answers, they're called away to a haunted orphanage."}, {"id": "0688064183", "genre": "Children's Books", "title": "Johnny Appleseed", "description": "John Chapman, better known as Johnny Appleseed, was a historical figure whose wilderness adventures became larger-than-life legends.Born in Massachusetts during the Revolutionary War, John headed west as soon as he was able. Along the way, he cleared land and planted orchards so he could supply apples to settlers he knew would follow. When the settlers did arrive, John befriended them, often giving away his trees. Soon he became known as Johnny Appleseed.Legends about him spread quickly: It was said that he slept in a treetop hammock, that he had a pet wolf, that he played with a bear family. Everyone seemed to know a story about Johnny Appleseed. And even today people claim to have seen him.In vivid prose and magnificent pictures that spring off the pages, Steven Kellogg tells the lively story of a true American hero."}, {"id": "B00CF5QG88", "genre": "Children's Books", "title": "The Adventures of Sir Balin the Ill-Fated (The Knights' Tales Series)", "description": "Many years ago, the storytellers say, the great King Arthur brought justice to England with the help of his gallant knights of the roundtable.        While most of King Arthur’s knights freely chose a life of duty, for Sir Balin the Ill-Fated, destiny was foretold in a prophecy. And seriously, \"ill-fated\" is right there in his title, so Balin’s not surprised when things go sour. Still, no matter how dire the task, a loyal and gallant knight never refuses adventure!       Will Sir Balin finally discover his true destiny? And which ill-fated path will he have to choose? Join Balin on this, the noblest quest of all."}, {"id": "1611609887", "genre": "Children's Books", "title": "Frizzy Frieda's Gymtastrophe: First Book in the Frizzy Frieda Series", "description": "Join Claire, aka Frizzy Frieda, on her adventure to try out for cheerleading to try and fit in---hair and all! She can chant \"Ready? Okay,\" but she is far from the popular cheer prompt. Her clumsy limbs are flailing in all the wrong directions and she's sporting what her annoying brother, DJ, calls a \"poof doo.\" But, making the cut is her only way to be part of the \"in crowd\" and catch the attention of dreamy Josh, the star basketball player. With only three days to learn the cheer routine, tryouts are fast approaching. As Claire cartwheels across the gym floor, she soon discovers that more than her hair is spinning out of control, in this delightfully illustrated story!"}]