[{"id": "1940716241", "genre": "Children's Books", "title": "The Red Sun (The Legends of Orkney Series)", "description": "Sam Baron is about to get the shock of his life. First his substitute English teacher claims to have turned his old teacher into a lizard; then a strange dwarf named Rego arrives and claims Sam is from a magical realm called Orkney. When his friends are taken prisoner, it’s up to Sam to save them. Sam embarks on a journey to Orkney through a stonefire to find his friends―but when he arrives, he discovers that an ancient curse has turned the sun a poisonous red and threatens to destroy the land. With only a young witch girl to guide him, Sam must choose: save his friends, or stop the red sun from consuming the land?Drawing on Norse mythology, The Red Sun follows Sam’s journey to uncover the truth about his past―a journey during which he has to overcome the simmering anger inside of him, learn to channel his growing magical powers, and find a way to forgive the father who left him behind."}, {"id": "0997799374", "genre": "Children's Books", "title": "The Drawing Book for Kids: 365 Daily Things to Draw, Step by Step (Woo! Jr. Kids Activities Books)", "description": "The most comprehensive how to draw book for kids! This children's drawing book gives you 365 things to draw every day for an entire year - animals, objects, food, plants, vehicles, sports, holidays and more. Every mini drawing lesson is broken down into easy to follow step by step instructions, so that all budding artists can create a masterpiece. This book is perfect for kids 9-12 +, but kids age 6-8 with a high interest in art will be able to follow our diagrams easily as well. The Drawing Book for Kids is the only book you'll need to turn your kids' creativity into artistic confidence!"}, {"id": "1683367723", "genre": "Children's Books", "title": "It's a ... It's a ... It's a Mitzvah", "description": "A fun-filled introduction to the joys of doing good deeds and mitzvot.Join Mitzvah Meerkat and friends as they introduce children to the everyday kindnesses that mark the beginning of a Jewish journey and a lifetime commitment to tikkun olam (repairing the world). Through lively illustrations and playful dialogue, children engage with Jewish wisdom as they share in welcoming new friends, forgiving mistakes, respecting elders, sharing food with the hungry, and much, much more."}, {"id": "1943541302", "genre": "Children's Books", "title": "Rahab and the Walls of Jericho", "description": "Superbook takes Joy, Chris, and Gizmo to Jericho as Joshua and the Israelite army are preparing to attack the walled city. They meet Rahab, who risks her life to hide the Hebrew spies. The children discover that even the highest walls are no match for faith in God! CBN's Superbook team is made up of Emmy-winning artists and storytellers, whose credits include Mulan, The Lion King, and Beauty and the Beast. Together they are collaborating to completely reimagine the classic Superbook series using the latest 3D CGI technology. The new Superbook honors the life-changing legacy of the classic series and introduces the stories of the Bible to a new generation."}, {"id": "1845070763", "genre": "Children's Books", "title": "Lanterns and Firecrackers: A Chinese New Year Story (Festival Time)", "description": "A simple introduction to the Chinese New Year festival. Follow a family as they let off firecrackers, watch the amazing dragon dances and light their beautiful lanterns to celebrate the start of their New Year. This pre-school series introduces young children to world religions and focuses on the way the festival is celebrated today. There is detailed historical and cultural information at the end for parents and teachers."}]