[{"id": "1933846682", "genre": "Science Fiction & Fantasy", "title": "Red Dust and Dancing Horses and Other Stories", "description": "This debut collection from Nebula-nominated author Beth Cato brings together works that span history and space, a showcase of vividly imagined speculative stories that range from introspective and intense to outright whimsical. Here you'll find the souls of horses bonded into war machines of earth and air, toilet gnomes on the rampage, magical pies, a mad scientist mother, a bitter old man who rages against giant extraterrestrial robots, and a sentient house that longs to be a home. The book features 28 stories and 6 poems, and includes Cato's acclaimed story \"The Souls of Horses.\""}, {"id": "0853235732", "genre": "Science Fiction & Fantasy", "title": "Mechanics of Wonder: The Creation of the Idea of Science Fiction (Liverpool University Press - Liverpool Science Fiction Texts & Studies)", "description": "This is a sustained argument about the idea of science fiction by a renowned critic. Overturning many received opinions, it is both controversial and stimulating Much of the controversy arises from Westfahl's resurrection of Hugo Gernsback - for decades a largely derided figure - as the true creator of science fiction. Following an initial demolition of earlier critics, Westfahl argues for Gernsback's importance. His argument is fully documented, showing a much greater familiarity with early American science fiction, particularly magazine fiction, than previous academic critics or historians. After his initial chapters on Gernsback, he examines the way in which the Gernsback tradition was adopted and modified by later magazine editors and early critics. This involves a re-evaluation of the importance of John W. Campbell to the history of science fiction as well as a very interesting critique of Robert Heinlein's Beyond the Horizon, one the seminal texts of American science fiction. In conclusion, Westfahl uses the theories of Gernsback and Campbell to develop a descriptive definition of science fiction and he explores the ramifications of that definition. The Mechanics of Wonder will arouse debate and force the questioning of presuppositions. No other book so closely examines the origins and development of the idea of science fiction, and it will stand among a small number of crucial texts with which every science fiction scholar or prospective science fiction scholar will have to read."}, {"id": "B00MQK8TGE", "genre": "Science Fiction & Fantasy", "title": "Dead Apocalypse: Necrose Series Book One", "description": "You don't expect the zombie apocalypse when you're on vacation.The Necrose-7A virus is spreading. It catches up to Ben Chase on his way to Kona, Hawaii for an adventurous trip with his friend Ty. Unwilling to acknowledge the reality of the horrors they witness, they nevertheless find themselves surrounded by flesh-eating monsters - zombies.The infection spreads virtually unchecked, forcing them into a daring fight for survival. When Ben is faced with a critical decision that places the fate of his friends in his hands, what he must do to save them is unthinkable.Dead Apocalypse will leave your skin crawling as you follow Ben's desperate attempt to survive the doomed island paradise.Reader ReviewsIt will feed your ZOMBIE addiction, and leave you wanting more. - Augusta C.“The perfect amount of gore and personal tragedy…” – Sally B.“Effective, taught, engaging beginning…” – M. HemingerDead Apocalypse is the first book in the Necrose zombie apocalypse series. Dead Horde is the sequel. Other books in the Necrose Series zombie apocalypse world include Dead Frozen and Dead Escape."}, {"id": "B00C8Z697S", "genre": "Science Fiction & Fantasy", "title": "By Force Alone", "description": "A scientist with a seven-mile-deep elevator, a 91-year-old woman who knows more than her middle-aged doctor, a pair of fishermen who clash with ancient Rome, a 10-year-old girl who teaches her parents the facts of life, and a young lab technician who brings-down a tyrant. Each tale addresses life's complexities with a twist, and gives us hope that some day humanity will find answers to the questions that have vexed us from the beginning of time."}, {"id": "1478942851", "genre": "Science Fiction & Fantasy", "title": "The Tourist: Library Edition", "description": "The Tourist is a masterpiece of suspense and a gripping new spin on the time travel story.The future has already happened. It is expected to be an excursion like any other. There is nothing in the records to indicate that anything out of the ordinary will happen. A bus will take them to the mall and they will have an hour or so to look around, perhaps buy something, or try some food. A minor traffic incident on the way back to the resort will provide some additional interest, but the tour rep has no reason to expect any trouble—until he notices that one of his party is missing. Most disturbingly, she is a woman who, according to the records, did not go missing. Now she is a woman whose disappearance could change the world.With breathtaking plot twists that ricochet through time, this is the most original conspiracy thriller you will hear this year."}]