[{"id": "1550288601", "genre": "Children's Books", "title": "Suspended (Lorimer Sports Stories)", "description": "Fast-paced sports action novels that get kids reading.Shay and his pal Toby are among the players on the school soccer team who fall foul of the \"fair play contract\" introduced by the new school administration. After being banned from playing on behalf of the school for the rest of the season, the dismissed players form their own unofficial team -- and become one of the top teams in the league. But will they be allowed to play in the championship game? Based on a true incident, Suspended is a story about determination and true sportsmanship. [Fry Reading Level - 4.5"}, {"id": "1600103928", "genre": "Children's Books", "title": "Michael Recycle Meets Litterbug Doug", "description": "Litterbug Doug is lazy. He is wasteful. He is messy. But worst of all, he hates recycling!  The clean and green town where he lives is in danger from his lazy ways, not to mention suffering from the stench released by the mountains of garbage that Doug leaves wherever he goes! So strong is its stink that even the army of rats that follow Doug around are rethinking their friendship with him. It's up to Michael Recycle, planet Earth's green-caped crusader, to show dastardly Doug the error of his ways...before it's too late!"}, {"id": "1250163617", "genre": "Children's Books", "title": "Amazing Brick Mosaics: Fantastic Projects to Build with Lego Blocks You Already Have", "description": "Build awesome paintings brick by brick!Every LEGO-loving kid has at least one huge bin of bricks – the sets are built, dismantled, and typically never built again – and this book gives them dozens of ways to reuse them in fun projects that range from easy to challenging. Featuring a simple yet elegant mosaic technique, step-by-step instructions, and full-color photographs for making 25 cool two-dimensional pictures, Amazing Brick Mosaics offers unique projects that will delight any LEGO enthusiast."}, {"id": "B006W4597M", "genre": "Children's Books", "title": "Mordechai Anielewicz: Hero of the Warsaw Ghetto Uprising (Holocaust Biographies)", "description": "Traces the life of the activist who, at the age of twenty-three, became the commander of the Jewish Combat Organization (Zydowska Organizacja Bjowa) and lead the historic Warsaw ghetto uprising."}, {"id": "1426323166", "genre": "Children's Books", "title": "100 Things to Know Before You Grow Up", "description": "It's fun to be a kid, but are you ready for what comes next? Challenge yourself with these 100 things and you will be! Jam-packed with tips, tricks, and skills that every kid should master before turning 18, this is the ultimate guide to becoming a fun-loving, well-rounded, totally competent and confident young person. Complete with expert advice from real life explorers, adventurers, and masters of their craft, it's perfect for jump-starting an amazing life!"}]