[{"id": "B075FTY799", "genre": "Children's Books", "title": "Cranky (Thomas & Friends Engine Adventures) (Thomas Engine Adventures)", "description": "The perfect introduction to Thomas the Tank Engine! All aboard for a Railway adventure! Mighty Cranky the Crane towers overs Sodor’s Docks. But when a big storm hits the Island, will Cranky still stand tall?"}, {"id": "0998944033", "genre": "Children's Books", "title": "Cleveland Wins a Championship: The Story of the 2016 Cavaliers", "description": "The city of Cleveland had not won a title of any kind since 1964, but that all changed in 2016. This tale tells the story of the King’s return home and the Cavaliers’ triumphant comeback over the Golden State Warriors in the NBA Finals of 2016!"}, {"id": "0811820629", "genre": "Children's Books", "title": "Juan y los frijoles mágicos / Jack and the Beanstalk", "description": "Striking art accompanies the favorite tale of Jack and the Beanstalk giving it a fresh look that will enchant a new generation of readers. Retold in both Spanish and English, this universally familiar story is now a springboard for inspiring early readers and older learners alike to recognize Spanish and English words. The dual-language text make this book a useful and beautiful addition to both home and classroom libraries."}, {"id": "0766085317", "genre": "Children's Books", "title": "How Lyndon B. Johnson Fought the Vietnam War (Presidents at War)", "description": "Though Lyndon B. Johnson did not make the initial decision to enter the conflict in Vietnam, he accepted the burdens of the unofficial war when he took office. Through full-color and black-and-white photos, informative sidebars, and engaging text, readers sneak a peek into the Johnson administration and the people who advised him, gaining insight into the combat and political strategies of the war itself and its legacy. Understanding the pressures of this unpopular war and what went into the decision making to ramp up the conflict will give readers a new perspective on the frustrating struggle that took place in this small nation in Southeast Asia."}, {"id": "1547082437", "genre": "Children's Books", "title": "Happy Birthday 49: Birthday Books For Adults, Birthday Journal Notebook For 49 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]