[{"id": "B071W3B7HZ", "genre": "Science Fiction & Fantasy", "title": "Aemilia Winterguard: The Creatures That Were Unheard Of", "description": "Aemilia Winterguard is the black sheep. She is the only flightless female fairy of her age and prefers dueling with the boys instead of chatting with the females. Aemilia dreams of heroic quests and blazes of glory... if only she were allowed to leave her village. Viola Ambrož is the beautiful and adventurous human girl who is the daughter of her town's elder, but is cursed with idealism and curiosity. Not only this, but while her father insists she start searching for the right boy to marry, she is certain that she doesn't want to be wed... not to a boy, at least. When a chance encounter brings these two odd creatures together, their worlds will intertwine. As friendship becomes love, secrets become lies. Perhaps some things are best left undiscovered after all."}, {"id": "1633882713", "genre": "Science Fiction & Fantasy", "title": "Nebula Awards Showcase 2017", "description": "The Nebula Awards Showcase volumes have been published annually since 1966, reprinting the winning and nominated stories of the Nebula Awards, voted on by the members of the Science Fiction and Fantasy Writers of America (SFWA).  This year's editor, selected by SFWA's anthology Committee (chaired by Mike Resnick), is Canadian science fiction and fantasy writer and editor Julie Czerneda.  This year's Nebula Award winners are Naomi Novik, Nnedi Okorafor, Sarah Pinsker, and Alyssa Wong, with Fran Wilde winning the Andre Norton Award for Young Adult Science Fiction and Fantasy Book. Also included in this volume are works by N. K. Jemisin and Ann Leckie."}, {"id": "1530640105", "genre": "Science Fiction & Fantasy", "title": "They Mostly Come Out At Night", "description": "He locked himself away from the dark, but in the Magpie King’s forest nowhere is safe… Lonan is an outcast, accused of letting the monsters that stalk the night into the homes of his fellow villagers. Now, he will not rest until he wins back the heart of his childhood love and reclaims the life that was stolen from him. However, locked safely in his cellar at night, in his dreams Lonan finds himself looking through the eyes of a young prince… Adahy has a destiny, and it terrifies him. How can he hope to live up to the legend of the Magpie King, to become the supernatural protector of the forest and defender of his people? But when the forest is invaded by an inhuman force, Adahy must rise to this challenge or let the Wolves destroy his people.  Watching these events unfold in his sleep, Lonan must do what he can to protect his village from this new threat. He is the only person who can keep his loved ones from being stolen away after dark, and to do so he will have to earn back their trust or watch the monsters kill everyone that he holds dear. They Mostly Come Out At Night is a Dark Fantasy novel from Benedict Patrick’s Yarnsworld series. If you like Neil Gaiman and Patrick Rothfuss then you will love this captivating, dangerous world in which ordinary people struggle to find their place in a land ruled by stories. Start reading today to discover this epic tale of dreams, fables and monsters!"}, {"id": "0578174731", "genre": "Science Fiction & Fantasy", "title": "Dark Grimoires: The Adventures of Saka & Thundar", "description": "A handsome African prince and the beautiful daughter of a Japanese warlord enter into the romance of a lifetime in this harrowing and hopeful young adult sci-fi novel about the bonds of brotherhood. Saka, the prince, and Thundar, a baby gorilla, are mystically bonded as brothers and through magic are blessed with several supernatural abilities that ultimately lead to a great ancient power in this coming-of-age journey."}, {"id": "1785721127", "genre": "Science Fiction & Fantasy", "title": "Ciaphas Cain: Defender of the Imperium", "description": "The Imperial hero returns in a second set of tongue-in-cheek memoirs relating his greatest victories against savage greenskins, monstrous Tyranids and the greatest Chaos invasion in ten thousand years…The legendary Commissar Ciaphas Cain, lauded as one of the great heroes of the Imperium, finds himself thrust onto the battlefield again. Cain wants nothing more than to keep out of trouble and get to the other side of his commission in one piece, but the war-torn 41st millennium has other ideas. Confronted with the powers of Chaos and hordes of alien foes, our intrepid Commissar seeks to sidestep danger and talk his way out of trouble. Yet each time he survives his legend only grows, and his life is in ever-greater jeopardy…"}]