[{"id": "0310708931", "genre": "Children's Books", "title": "VeggieTales I Can! And So Can You! (Big Idea Books / VeggieTales)", "description": "A collection of four VeggieTales books about how God made amazing and wonderful you!---for ages 6 and under This package of fun Veggiebooks contains four board books shaped like kids' favorite Veggie friends: *Bob the Tomato: I Can Do Many Things! Bob the Tomato shows kids how he can do so many things because God made him special. As kids turn each fun page of this book, they discover that God made them special, too. *Larry the Cucumber: I Can Be Me! Kids will love the board book shaped like Larry the Cucumber as he shows them how they can be so many things because God made them special. *Junior Asparagus: I Can Have Fun! Junior Asparagus shows kids the importance of friendship and how they can have fun every day because God created all of them special. *Laura Carrot: I Can Learn! Laura Carrot teaches kids they can learn and discover new things every day because God made them special."}, {"id": "0316111813", "genre": "Children's Books", "title": "Arthur's April Fool (Arthur Adventures)", "description": "This is a read along and fun filled package. Millions of fans agree: Arthur's hilarious adventures speak right to the heart of children everywhere."}, {"id": "0545079624", "genre": "Children's Books", "title": "I Am A Train", "description": "Simple train facts in a board book shaped like a train!I am a train.I travel on railroad tracks.All aboard for this fun and sturdy board book shaped like a train. Read along as trains travel from town to town delivering passengers and important cargo to train stations across the country.Little engineers will love seeing these big machines in action. It's a book and a toy in one!"}, {"id": "1416927832", "genre": "Children's Books", "title": "Misty of Chincoteague", "description": "Nobody could capture the Phantom. She was the wildest mare on Assateague Island. They said she was like the wind, that the white \"map\" on her shoulders was her mark of freedom.   Paul and Maureen Beebe had their hearts set on owning her. They were itching to buy and tame her, and worked hard to earn the money that she would cost. But the roundup men had tried to capture her and for two years she had escaped them....   Pony Penning Day holds a surprise for everyone, for Paul not only brings in the Phantom, but her newborn colt as well. Can Paul and Maureen possibly earn enough to buy them both?"}, {"id": "063501551X", "genre": "Children's Books", "title": "Jean Nicolet: French Explorer (82) (1000 Readers)", "description": "Jean Nicolet was brave and curious. He left his home country of France to come to present-day Canada and make a life. He lived among Indians. He explored new lands. He was the first to discover Lake Michigan. Jean loved his life in New France.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}]