[{"id": "1632353237", "genre": "Children's Books", "title": "12 Great Tips on Writing a Blog", "description": "Walks readers through the process of writing blog posts. Examples, writing prompts, and checklist summaries help readers apply their knowledge effectively."}, {"id": "B01A2YIXEI", "genre": "Children's Books", "title": "Wonders of the World: Mother Nature at Work: Nature Books for Kids (Children's Mystery & Wonders Books)", "description": "Mother Nature is definitely a wonderful provider! She gives us not only the things we need but also the things we’d love to see. This educational book is a collection of all best natural wonders of the world. Through this book, your child will get to learn and appreciate the sights found from all over the world. This will raise awareness and responsibility towards environmental care. Buy a copy today!"}, {"id": "0060275715", "genre": "Children's Books", "title": "If You Give a Mouse a Brownie (If You Give... Books)", "description": "Mouse is back in this ninth picture book in the beloved #1 New York Times bestselling If You Give... series! If you give a mouse a brownie, he's going to ask for some ice cream to go with it. When you give him the ice cream, he'll probably ask you for a spoon. He'll start drumming on the table. Drumming will get him so excited he'll want to start a band. . . .Mouse makes his long-anticipated return to the spotlight in this winning picture book from the acclaimed team of Laura Numeroff and Felicia Bond. Fans of If You Give a Mouse a Cookie won't want to miss this!"}, {"id": "153832623X", "genre": "Children's Books", "title": "Leonardo Dicaprio: Actor, Environmental Activist, and Un Messenger of Peace (Breakout Biographies)", "description": "This biography will introduce readers to the causes behind this actor's talent and fame. In addition to being an award-winning actor, Leonardo DiCaprio has been involved in several endeavors to better our planet. DiCaprio participated in an environmental documentary entitled \"Before the Flood.\" His efforts to educate the masses on the consequences human life has on our planet are seen most in his position as a U.N. Messenger of Peace. The Leonardo DiCaprio Foundation strives to mitigate and reverse negative human impacts. DiCaprio has used his fame and influence to inform people of the dangers of global warming and the loss of biodiversity."}, {"id": "0789422832", "genre": "Children's Books", "title": "Funpax: Creepy Cookies", "description": "Learn a card trick. Pretend you're a spy. Make a friendship bracelet. Children can have fun for hours with Fun Pax. Unique design and colorful packaging includes everything needed."}]