[{"id": "1432961209", "genre": "Children's Books", "title": "Australia (Countries Around the World)", "description": "Australia offers complete coverage of this fascinating country, including sections on history, geography, wildlife, infrastructure and government, and culture. It also includes a detailed fact file, maps and charts, and a traceable flag."}, {"id": "1770492623", "genre": "Children's Books", "title": "Capturing Joy: The Story of Maud Lewis", "description": "Maud Lewis was born into a loving Nova Scotia family who accepted her physical limitations. When her parents died and she was forced to find her own way in the world, she married and set up a modest household in a small cabin. Despite the hardships she faced, she was able to find joy in her life, a joy that she expressed through her art. She painted canvases of animals, children, and her surroundings. Her art spilled over into everything from dust pans to the walls of her house. Maud Lewis died in 1970, but her wonderful, life-affirming art lives on and is treasured by people who understand and appreciate folk art all over the world.From the Hardcover edition."}, {"id": "1575724340", "genre": "Children's Books", "title": "The Cold War (20th Century Perspectives)", "description": "Examines the twentieth-century standoff between the United States and the Soviet Union, discussing origins, nuclear strategies, and the breakup of the USSR."}, {"id": "1770857729", "genre": "Children's Books", "title": "Basketball Stars", "description": " Basketball's biggest stars, with special emphasis on how nice guys finish first!  Basketball Stars is chock-full of the biggest superstars of the NBA, as well as a primer on the parts of the game that matter most to kids.  Players like Steph Curry, LeBron James and Kevin Durant line the pages of this book because their tremendous hardcourt skills have paired with their will to succeed.  From backgrounds as diverse as the population of the world, these all-star ballers have had to deal with all manner of road blocks to get to the top of the basketball world.  Through adversity, defeat and triumph, players like DeMar DeRozan, Russell Westbrook and Zach Randolph have carved a space in basketball history for themselves, and each one gives back to the community in ways that will benefit kids today.  Lighting up smiles by day and hoops by night, the athletes featured in Basketball Stars are a shining example of what can happen if you keep focused on your goals and make the right choices.  These basketball stars are role models for today's generation. "}, {"id": "1554530237", "genre": "Children's Books", "title": "Scaredy Squirrel", "description": "Scaredy Squirrel never leaves his nut tree. It's way too dangerous out there. He could encounter tarantulas, green Martians or killer bees. But in his tree, every day is the same and if danger comes along, he's well-prepared. Scaredy Squirrel's emergency kit includes antibacterial soap, Band-Aids and a parachute. Day after day he watches and waits, and waits and watches, until one day ? his worst nightmare comes true! Scaredy suddenly finds himself out of his tree, where germs, poison ivy and sharks lurk. But as Scaredy Squirrel leaps into the unknown, he discovers something really uplifting ?"}]