[{"id": "B01NCZAV6Q", "genre": "Children's Books", "title": "Marketing, Sales & Service (Bright Futures Press : World of Work)", "description": "Marketing, Sales & Service in the World of Work series provides an age-appropriate and interactive introduction to the nationally recognized Marketing career pathway using informal self-assessment elements, career profiles, informative sidebar features, and back matter activities."}, {"id": "073684483X", "genre": "Children's Books", "title": "Anne Hutchinson: Religious Reformer (Colonial America Biographies)", "description": "A biography of the Puritan woman who was banished from the Massachusetts Bay Colony for disagreeing with the prevailing religious practices."}, {"id": "059045708X", "genre": "Children's Books", "title": "A Girl's Best Friend", "description": "Loving her aging canine companion, Jessie, Laurie Moss, a young blind girl, fears that her father will have the ill dog put to sleep, until the vet recommends an expensive new medicine that Laurie must find some way to afford. Original."}, {"id": "194747300X", "genre": "Children's Books", "title": "The Science of Climate Change: A Hands-On Course", "description": "What It Is Why It Matters And What Can Be Done to Help The Science of Climate Change: A Hands-On Course uses text and eighteen hands-on activities to explain and teach the science of global warming and climate change, how humans are responsible, and what can be done to slow or stop the rate of global warming and climate change. This book is a complete, comprehensive guide to an essential environmental topic.  Subjects covered in this book include: how molecules transfer energy from the sun to warm the atmosphere, greenhouse gases, the greenhouse effect, global warming, the Industrial Revolution, the combustion reaction, feedback loops, the relationship between weather and climate, climate change, carbon sinks, extinction, carbon footprint, recycling, and alternative energy. The data for this course was obtained from credible science sources: National Oceanic and Atmospheric Administration (N.O.A.A.) Earth Systems Laboratory (ESL) National Aeronautics Space Administration (NASA) Environmental Protection Agency (EPA) National Renewable Energy Laboratory (N.R.E.L.)."}, {"id": "081186555X", "genre": "Children's Books", "title": "In My Nest", "description": "Children are sure to love this delightful finger puppet book. Layered die-cut pages allow a peek at all the colorful things that make up each animal's home, and an adorable folk-art style finger puppet make this book that is filled with reading and playtime fun."}]