[{"id": "0375846859", "genre": "Children's Books", "title": "Shake, Rattle & Turn That Noise Down!: How Elvis Shook Up Music, Me & Mom", "description": "FOR HIS EIGHTH birthday, Mark Alan Stamaty’s parents gave him his very own radio. Little did his mother realize that that innocent-looking plastic box would one day be the gateway for a new kind of sound that would “rock” her nearly out of her mind. . . .Mark first heard the howling thunder of Elvis Presley singing “Hound Dog” on the radio one lazy day and his life was forever changed. Soon he was styling his hair like the King and practicing his dance moves with a tennis racket as his pretend guitar in front o f the mirror. But his mother lived in constant fear that her son’s new love of rock ’n’ roll would turn him into a juvenile delinquent. Could Mark’s performance at his Cub Scout talent show change her mind?"}, {"id": "0399231757", "genre": "Children's Books", "title": "Astro Bunnies", "description": "Up and away, a group of curious bunnies set their sights for the skies above and go on a grand adventure to space where they encounter alien bunnies, measure comets, gather moondust, and more."}, {"id": "1508146470", "genre": "Children's Books", "title": "1: Uncovering the Culture of Ancient Britain (Archaeology and Ancient Cultures)", "description": "Travel back in time to ancient Britain, a region loaded with archaeological finds that have been instrumental in our understanding of the past. This volume explores ancient Britain’s most exciting archaeological digs and discoveries. Readers are introduced to this area’s history, characteristics, and importance, and then are treated to detailed text and full-color photographs of important artifacts. The text is organized chronologically, helping students track the development of this ancient civilization. A simple map, timeline, and fact boxes complete a comprehensive learning experience about ancient Britain’s fascinating archaeological history."}, {"id": "1582464227", "genre": "Children's Books", "title": "An Edible Alphabet: 26 Reasons to Love the Farm", "description": "Bouncing blueberries, eager ewes, and giggling geese! Join this lively bunch on an alphabetical tour of today’s farm. With families and schools thinking more than ever about fresh, healthful choices for the table, kids want to know about the foods they see and eat every day: Where does it come from? How is it grown? What’s the difference between a fruit and a veggie? Why don’t chickens have teeth?  This entertaining survey of modern farming provides a wealth of farm facts and farm lore, including: -Why some egg yolks are deep orange and others pale yellow -Which kind of tomato is used to make ketchup-What butterflies, hummingbirds, bats, and bees all have in common-Why farmers love ladybugs-Why sheep smell with their feet Of course there are far more than 26 reasons to love the farm. What are yours?From the Hardcover edition."}, {"id": "0531211754", "genre": "Children's Books", "title": "You Wouldn't Want to Be a Greek Athlete!: Races You'd Rather Not Run", "description": "This lively, interactive series will enthrall young and reluctant readers by making them part of the story, inviting them to become the main character and revel in the gory, dark, horrific side of life throughout important eras in history. Simultaneous."}]