[{"id": "1561459232", "genre": "Children's Books", "title": "Claude on the Slopes", "description": "Claude and Sir Bobblysock go to the Snowy Mountains to swish down the powdery slopes. When their winter wonderland threatens to avalanche, Claude must come to the rescue."}, {"id": "1481448455", "genre": "Children's Books", "title": "Small Walt", "description": "“Charming and endearing.” —Kirkus Reviews (starred review) “The grit of The Little Engine that Could, the nostalgic illustrations of Katy and the Big Snow, and a touch of modernity from an accomplished author and illustrator, combine to become Small Walt.” —School Library Journal A tiny snowplow determined to prove his worth battles a blizzard in this supremely charming story in the tradition of Mike Mulligan and His Steam Shovel and The Little Engine that Could.My name is Walt, I plow and I salt. They say I’m small, but I’ll show them all.  Small Walt and his driver, Gus, take on a blizzard! All the bigger snowplows doubt that Walt has what it takes to plow the roads in the storm, but Walt is determined to prove them wrong. Brimming with onomatopoeia and Walt’s affirming chants, this sweet picture book shows that when it comes to strength, size doesn’t matter. Bestselling illustrator Marc Rosenthal’s wintry scenes make this book the perfect cozy read-aloud."}, {"id": "B00X5UABFQ", "genre": "Children's Books", "title": "Baby Zeke: Rescue Mission: The diary of a chicken jockey, book 3 (an unofficial Minecraft autobiography) (Baby Zeke- The Diary of a Jockey)", "description": "Book 3! -- Rescue Mission!Baby Zombie Zeke and his friends need to find shelter in a cave before the sun rises.All is going well until baby zombie pigman Otis decides to act tough and take on a Minecraft player.With the lives of Otis and his chicken, Bob, at stake, will Zeke be able to rescue him?And what does a ewe have to do with it?***This is Book 3 of the Baby Zeke the Chicken Jockey unofficial Minecraft series. Don't read it unless you've read the first two books!***Learn about all of Dr. Block's unofficial Minecraft books at DrBlockBooks.com!"}, {"id": "0312527217", "genre": "Children's Books", "title": "Picture Fit Board Books: A Barnyard of Friends", "description": "In A Barnyard of Friends it's fun to find out where each farm animal lives, from pig sty to chicken coop, by exploring the raised and recessed shapes on every page!In this lively and engaging novelty board book, little learners will enjoy meeting cute farm animals, such as cows, sheep, and ducks, and finding out where they live. On the turn of every page, they’ll be excited to discover raised shapes to touch, feel, and explore, that neatly tuck into shaped spaces on the opposite page. Offering a tactile and visual experience that your child will want to repeat time and time again, A Barnyard of Friends is just right for little hands!Also available: A Traffic Jam of Trucks, A Parade of Animals, A Stampede of Dinosaurs, and A Toy Box of Shapes."}, {"id": "1607530643", "genre": "Children's Books", "title": "Trucks (Machines on the Move)", "description": "\"Describes many different types of large trucks and what they are used for including semi-trailer trucks, fire engines, and dump trucks\"--Provided by publisher."}]