[{"id": "B00BBPVX2C", "genre": "Children's Books", "title": "Anthony Burns: The Defeat and Triumph of a Fugitive Slave", "description": "The true story of a young man struggling for freedom at the dawn of the Civil War Anthony Burns is a runaway slave who has just started to build a life for himself in Boston. Then his former owner comes to town to collect him. Anthony won’t go willingly, though, and people across the city step forward to make sure he’s not taken. Based on the true story of a man who stood up against the Fugitive Slave Law, Hamilton’s gripping account follows the battle in the streets and in the courts to keep Burns a citizen of Boston—a battle that is the prelude to the nation’s bloody Civil War."}, {"id": "161477014X", "genre": "Children's Books", "title": "Along The River Tweed--A Kid's Guide To Peebles, Scotland", "description": "Peebles is a burgh in the committee area of Tweeddale, in the Scottish Borders, lying on the River Tweed.  That said, Peebles, Scotland is a wonderful little town, plucked out of a storybook, where birds fly and dogs run, and red-haired boys and girls ride bicycles and play in the green of the town and vast countryside.   Award winning author, attorney, and former teacher Penelope Dyan and professional photographer John D. Weigand invite you to embark with them on a small trip though this colorful town where they ate delicious fish and chips along the river tweed and stayed in a hotel that was a castle! This book, like all the Weigand/Dyan travel books, will not merely spoon feed kids a bunch of facts. It will encourage imagination.  See what things your children can find out about this place and make this book their own by inserting their own photographs, drawing, tickets, notes and whatever they want within these pages.  This is how a child really learns--by doing, not my memorizing sets of facts.  Children always see things very differently than adults, and Dyan and Weigand are able to see what children see and invite them to find out more!"}, {"id": "0448431807", "genre": "Children's Books", "title": "The Little Engine That Could Goes on a Class Trip (Reading Railroad Books)", "description": "The Little Engine That Could is so excited-she's going to the safari zoo with Piney Vale School's second-grade class! But something terrible happens: a baby elephant goes missing! Can the Little Blue Engine find Baby Lulu and deliver her back safe and sound?"}, {"id": "1480518301", "genre": "Children's Books", "title": "Chancey of the Maury River", "description": "On the night Chancey is born, a \"fire star\" gallops across the sky. But many years of hardship will pass before the orphaned albino Appaloosa can believe the prophecy his dam foretold—that his \"fire star\" was a beacon for a horse of profound wisdom and extraordinary potential, one who will eventually change the lives of two children forever. Told through Chancey’s eyes in the classic tradition of great horse stories, here is a tale about bravery, destiny, and hope—and about sharing the magic of a second chance.“Injects a dose of modernity into the old hard-luck horse story...Delightful.” -The Chronicle of the Horse“The horse story is revived to magni?cent effect in this moving novel.” -The Horn Book“Many details about equine behavior and horsemanship lend authenticity...A highly enjoyable read.” -School Library Journal“Earnest, heartfelt, and uplifting.” -Voice of Youth Advocates"}, {"id": "0316018171", "genre": "Children's Books", "title": "To Catch a Mermaid", "description": "Boom Broom doesn't think his life could get any worse. Ever since his mother was swept away by a twister, his family has gone crazy. They refuse to leave the house and Halvor, the Viking descendant who rents the room over their garage, will only cook fish for Boom and his sister Mertyle to eat.When Boom finds a baby mermaid who seems to grant unlimited wishes, he thinks his luck has turned around. That is, until his sister is hit by the curse of the merfolk and starts to turn green. Now Boom and his best friend Winger must find a way to return the foul-tempered merbaby to its mother and save Mertyle before it is too late."}]