[{"id": "1577682483", "genre": "Children's Books", "title": "Key Skills Workbooks: Toddler (McGraw-Hill Junior Academic)", "description": "For convenience and orderliness, one bindup book includes materials for the Toddler in A,B,C's, Counting, Colors and Shapes featuring the popular Baby Looney TunesTM characters. 128 full-color pages. The McGraw-Hill Junior Academic Series and logo are trademarks of The McGraw-Hill Companies (c) 1999. BABY LOONEY TUNES, characters, names, and all related indicia are trademarks of Warner Bros. (c) 1999."}, {"id": "081982674X", "genre": "Children's Books", "title": "57 Stories of Saints", "description": "Portrays the lives of fifty-seven Christian saints from the time of Jesus through the twentieth century, and suggests ways to apply what each stood for to one's own life."}, {"id": "0635015188", "genre": "Children's Books", "title": "'Wild Bill' Hickok: Wonder of the West (49) (1000 Readers)", "description": "Wild Bill Hickok was a legendary gunfighter and marshal of the Wild West. He had a tendency to embellish his gun-fighting stories with fiction. His reputation across America gained him huge popularity.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "162619159X", "genre": "Children's Books", "title": "For the Love of Texas: Tell Me about the Colonists!", "description": "Before Texas was Texas, it was a lot of things to a lot of different people. Comanche, Choctaw, French, Spanish, Mexican and more laid claim to Texas soil as their own, and no one wanted to share. The fights and alliances that arose out of the colonization of Texas shaped the state's future. Find out all about the beginning of the state and the colonists who helped pave the way for the Texas we now know. Saddle up with Betsy and George Christian for an interactive, fun chapter in Texas history for kids that challenges them to ask questions about the history they're told and the world in which they live."}, {"id": "0679891889", "genre": "Children's Books", "title": "The Prince Who Ran Away: The Story Of Gautama Buddha", "description": "On a night more than two thousand years ago, a prince was born in India. He could have been the most powerful rajah in all the world. But instead, the prince chose to become a common beggar, seeking a way to end the suffering he saw around him. He knew riches could not end suffering. He learned that deprivation could not end suffering. Then, under an enormous spreading fig tree, deep in concentration, he found Enlightenment. He understood Dharma, the law governing all things. He had achieved Nirvana, the peace that triumphs over suffering. And he found this knowledge and understanding inside his own mind, nowhere else. He became the Buddha, and taught his way of ending suffering to all who wished to learn."}]