[{"id": "B0727PMNFS", "genre": "Children's Books", "title": "The Wind Blows Wherever It Pleases: Silo Country", "description": "When Amanda Vissac moves from Paris to the small village of Thym, with her family, she must adjust to a new life and new friends. In the French countryside of the 1970s, follow this young heroine from first grade to the end of middle school, as she navigates childhood, school bullying, and questions about God. Silo Country is a true story, written in a style similar to the Little House on the Prairie. It only takes place in France instead of in the USA and a century later. The book is designed to introduce American children and teenagers to an authentic French culture and thus contains a short French-English glossary. The story—filled with simple French words and expressions—is quite descriptive and readable and would make a great material for a classroom discussion."}, {"id": "0307119424", "genre": "Children's Books", "title": "The New Baby", "description": "Mercer Mayer’s Little Critter has a brand-new baby sister in this classic, funny, and heartwarming book. Whether he’s rocking her to sleep, helping change diapers, or pushing the stroller, both parents and children alike will relate to this beloved story. A perfect way to help a soon-to-be older sibling welcome a younger one!"}, {"id": "B0084U5K8A", "genre": "Children's Books", "title": "The Little Small Red Hen - The Children Picture Books with colorful illustrated", "description": "The Little Small Red Hen by May Byron**This eBook version is originally form the scanned book with colorful illustrated pictures published in 1911The Little Small Red Hen is a well known old English folk tale with a timeless moral story. Not only is this book about life and karma, but also Integrated with simple and captivated stories in which they all personalize very nature of human through the figure of the little red hen and fox."}, {"id": "B00WM2VEMW", "genre": "Children's Books", "title": "Spirit of the Snowpeople", "description": "Somewhere in the north, where the winters are long, the adults decide to brighten their children's days by creating snow figures. While the children sleep, their elders create snowpeople. Eventually, the lake is surrounded with them. Word gets around, and people come to see the marvelous figures. But snow doesn't last forever, and when the snowpeople melt, the villagers must find another way to keep the spirit of the snowpeople alive in their hearts. In this enhanced version, enjoy read-along and fun animations that bring this charming story to life! "}, {"id": "0062394053", "genre": "Children's Books", "title": "Action Presidents #1: George Washington!", "description": "Where the history is real and the jokes are fake!The first Action Presidents book will turn even the most reluctant reader into a history buff. George Washington, ultimate founding father and awesome American, practically jumps off the page.We all know that George Washington was our first president and a hero of the American Revolution, but did you also know that he didn’t want to be president and had teeth so bad that he hated to smile? Wimpy Kid meets the Who Was … series in these hilarious new graphic novels from New York Times bestselling comic book author Fred Van Lente and award-winning cartoonist Ryan Dunlavey.U.S. history comes to life like never before! Historically accurate and highly entertaining, Action Presidents is perfect for curious minds. With timelines, maps, charts, and more, readers will keep learning until the last page."}]