[{"id": "0811852253", "genre": "Children's Books", "title": "Down to the Sea with Mr. Magee", "description": "With enough lunch for three, Mr. Magee and his dog Dee head out to the sea. But what begins as a fun day in the sun turns a bit bumpy when onel playful whale decides to say hello. Soon the crew that once was floating finds themselves flying! How will they get down? Who will come to their rescue? And when will they ever get to eat lunch? Down to the Sea with Mr. Magee is a great read-aloud, sure to provide fits of giggles."}, {"id": "0880451491", "genre": "Children's Books", "title": "My Ocean Liner: Across the North Atlantic on the Great Ship Normandie", "description": "In 1939, nine-year-old Paul goes on a memorable five-day voyage from New York to France on the luxurious ocean liner Normandie, the biggest ship in the world."}, {"id": "1633223817", "genre": "Children's Books", "title": "Ranger Rick Kids' Guide to Camping: All you need to know about having fun in the outdoors (Ranger Rick Kids' Guides)", "description": "If you're like most kids who love the outdoors, you want to do more than go on picnics or hike a nature trail. You don't want to go home at the end of the day. You want to stay out in the woods, mountains, or desert. You want to camp.   With Ranger Rick Kids' Guide to Camping, you'll learn how to make roughing it easy. You'll find great tips for choosing the best campsite and setting up your home away from home. You'll even find recipes for great fireside dishes, like mac and cheese, biscuits and dumplings, and s'mores, of course! Also included is a real working compass to help you navigate through the wilderness.    It might take you a while to read this book, because it is filled with ideas for things to DO. You might stop reading right in the middle of a page to go out and try a new camping skill. And that's great, because the better you get at those skills, the more fun you'll have on your camping adventure.  "}, {"id": "1614931216", "genre": "Children's Books", "title": "Allow Me To Introduce Myself", "description": "This little book is about a frog named Pete who inspired his friends in the garden to learn from human traits to better their lives. \"Dream, Believe and Achieve...\" www.independentfrog.net"}, {"id": "B00BAW43LY", "genre": "Children's Books", "title": "Esther and the King", "description": "The biblical story of Esther and the King is a fascinating tale about a beautiful and clever jewish orphan girl who becomes the queen of Persia (Iran).She is taken into the king's harem where the king falls in love with her and marries her.When the scheming Haman plots to kill her and her people and the king, she outsmarts him and prevents him from implementing his infamous plans.Young readers will enjoy this exciting story."}]