[{"id": "1550372947", "genre": "Children's Books", "title": "Mr. Patapoum's First Trip", "description": " Momo the duck is still playing in the pond when his family flies South. His good friend, Mr. Patapoum, wants to do all he can to help Momo. So he decides they'll travel South together to find Momo's family, no matter how difficult the journey.  And indeed, it is a difficult journey. There are dark forests, immense lakes, and deserts awaiting them. But there are also friends along the way whose kindness and encouragement help Mr. Patapoum and Momo have one of the best times of their lives. "}, {"id": "1525237489", "genre": "Children's Books", "title": "Talking About Freedom: Celebrating Emancipation Day in Canada", "description": "Talking About Freedom explores the history and significance of this freedom festival in Canada. Discover the main features of Emancipation Day celebrations, learn about the people of African ancestry's struggle for freedom, and the victories achieved in the push for equality into the 21st century."}, {"id": "B0756VWHWW", "genre": "Children's Books", "title": "Escape From Shudder Mansion (Goosebumps SlappyWorld)", "description": "In an old-fashioned \"trapped-in-a-haunted-house\" story, twins Riley and Scarlett receive an interesting assignment from their teacher, Mrs. Stermon. Everyone in class needs to do a documentary video about an adventure, something exciting that they experienced. Mrs. Stermon gives them a suggestion, along with their friends Carter, Lee, Danitia, and Mia. She shows them a brochure about a scary old house on the edge of town, called Shudder Mansion. \"If you six kids and your parents can stay there overnight, you'll all get A's,\" says the teacher. \"I'll even give you extra credit.\"Just how scary is Shudder Mansion?It's terrifying."}, {"id": "1580891845", "genre": "Children's Books", "title": "The Story of the Samson", "description": "Sam and his grandpa relive the Samson's adventures on the high seas. Kathleen Benner Duble uses actual events to weave a tale about the Samson and its many voyages, from witnessing the Titanic's demise to the rescue of Shakleton's men to an appearance at the 1933 Chicago World's Fair."}, {"id": "0836842316", "genre": "Children's Books", "title": "Cameron Diaz (Today's Superstars Entertainment)", "description": "Highlights the life of model-turned-actress Cameron Diaz, who has starred in such films as \"There's Something About Mary,\" \"The Mask,\" and \"Charlie's Angels.\""}]