[{"id": "B075NRTXNR", "genre": "Children's Books", "title": "Diary of an Angry Alex: Book 21 [An Unofficial Minecraft Book] (Minecraft Tales 100)", "description": "This is part 21 of the Diary of an Angry Alex, the Minecraft diary. If you're new to the series be sure to start with number 1. In this book there's a \"happy\" reunion, they meet a mysterious VERY DANGEROUS AND POWERFUL guy, and Alex needs to buy new underwear. Find out what happens in the Diary of an Angry Alex 21!"}, {"id": "1499880235", "genre": "Children's Books", "title": "My Book of Mighty Machines", "description": "How big is the world’s longest train? Which plane flies faster than the speed of sound? How do rockets work? Strap yourself in and get ready to discover the answers to these questions and many more in this fantastic, fact-packed board book. Bursting with incredible images and chunky fold-out pages, this book is perfect for small hands and curious minds."}, {"id": "1910277193", "genre": "Children's Books", "title": "The Wonderful Adventures Of Nils", "description": "Join Nils as he is shrunk to the size of a thumb and embarks on a fantastical journey across the wilds of Sweden, from the glittering Baltic to the frozen north. This Scandinavian classic, written by Nobel prize-winning Selma Lagerlöf, is exquisitely illustrated by renowned illustrator Olivier Latyk and incorporates a series of laser-cut pages. These create depth and enhance detail to tremendous effect, lending the book a unique and delicate charm. With soft winter scenes and a gentle but engrossing story, The Wonderful Adventures of Nils would make an ideal gift for any reader, young or old, with a taste for fun and adventure.  "}, {"id": "B003MGK8II", "genre": "Children's Books", "title": "William Shakespeare: Famous People", "description": "Learn about the life and times of William Shakespeare with iMindsJNR learning series for younger minds. William Shakespeare is one of the most famous writers of all time. But little is known about the life of this playwright and poet.What we do know is that Shakespeare was born in 1564 in a town in the west of England called Stratford-Upon-Avon. His father, John Shakespeare, was a glove-maker who was also on the local council. His mother, Mary Arden, was the daughter of a wealthy farmer. Shakespeare went to school in Stratford and historians believe he studied at King’s New School there.Perfect to engage, entertain and broaden young thinkers.. iMindsJNR brings targeted knowledge to your eReading device with short information segments to whet your mental appetite and broaden young minds. iMindsJNR offers 6 main categories for ages 7-14years including General Knowledge, Geography & Nature, Famous People, Science & Maths, The Arts and History. Clear, concise and engaging, open young minds to a love of learning."}, {"id": "0756947030", "genre": "Children's Books", "title": "Color And Light (Reading Essentials in Science - Physical Science)", "description": "Describes how people see color, the different characteristics of light, how spectrums are made, and the various ways that light is used."}]