[{"id": "0345477375", "genre": "Science Fiction & Fantasy", "title": "Path of Destruction (Star Wars: Darth Bane, Book 1)", "description": "“Two there should be; no more, no less.One to embody the power, the other to crave it.”–Darth Bane, Dark Lord of the SithOn the run from vengeful Republic forces, Dessel, a cortosis miner, vanishes into the ranks of the Sith army and ships out to join the bloody war against the Republic and its Jedi champions. There, Dessel’s brutality, cunning, and exceptional command of the Force swiftly win him renown as a warrior. But in the eyes of his watchful masters, a far greater destiny awaits him. As an acolyte in the Sith academy, studying the secrets and skills of the dark side, Dessel embraces his new identity: Bane. But the true test is yet to come. In order to gain acceptance into the Brotherhood of Darkness, he must defy the most sacred traditions and reject all he has been taught. It is a trial by fire in which he must surrender fully to the dark side–and forge from the ashes a new era of absolute power. “A solid space adventure [that] charts the evolution of an antihero almost as chilling as Darth Vader.”–Publishers Weekly"}, {"id": "B0722RVTMH", "genre": "Science Fiction & Fantasy", "title": "Delicate Ministrations", "description": "Delicate Ministrations holds eleven short tales from speculative author J.L. Forrest, including \"Come Gomorrah\", \"Roboot\", \"Sum of Errors\", \"Where No Fox Should Follow\", \"Betty Jam\", \"Dandelions in the Kentucky Blue\", the novelettes The Unlighted Sentinel and Liminal, and others.Honest Indie writes, \"These are great stories from a writer who knows the techniques of good writing and infuses them with heart, soul, insight and a fearful imagination.\" Both fay and science fictional, these tales will haunt you far beyond the final page.J.L. Forrest's stories appear in Analog Science Fiction and Fact, Crossed Genres' Fierce Family, Robot Cowgirl's Alien Abduction, Third Flatiron's Principia Ponderosa, and elsewhere. He is the author of multiple novels, including Requies Dawn and Requies Day, available digitally and from booksellers everywhere."}, {"id": "1937013413", "genre": "Science Fiction & Fantasy", "title": "Weird Wars: Rome (Savage Worlds, S2P10601)", "description": "Stride forth with the legions of Rome to the corners of the world-the Celtic wilds, the forests of Germania, the deserts of Aegyptus-and into a history few will ever know. Witness a history of the dark things that rise as blood and war mingle with shadows and fear. Fight the darkness in a war that spans centuries. Fight the darkness to your last breath-and beyond! Fight the darkness for Rome! Players in Weird Wars Rome are legionaries battling the enemies of Rome, as well as stranger things they encounter in their bloody travels across the Empire. The book features two Plot Point Campaigns, new rules for creating \"Legacies\" from era to era, equipment, strange creatures, enemies and allies, expanded rules for naval combat and sieges, the history of Weird Wars in the Roman period, a new Arcane Background, and an Adventure Generator for any war the legionaries of Rome find themselves fighting. Weird Wars Rome is a setting book for Savage Worlds, and requires the Savage Worlds core rules to play."}, {"id": "B073R712HG", "genre": "Science Fiction & Fantasy", "title": "Falling For A Wolf #1: BBW Werewolf Shifter Romance", "description": "Christina ‘Chrissy” Monet aspired for something more than the life of a simple blog columnist. Her wishes come true when an old wooded property comes up for sale, and she pours her life-savings into the fixer-upper. The property comes with the added bonus of a handsome neighbor by the name of Adam Smith, but sparks fizzle rather than sizzle when she realizes he owns half the property she hoped to have. They part ways with biting remarks on her part, but she finds her carpentry skills aren’t up to the task and she’s forced into a relationship with the mysterious Smith. Strange happenings occur and she’s left wondering whether Smith has more up his sleeve than muscle."}, {"id": "B073SDZQ8M", "genre": "Science Fiction & Fantasy", "title": "Coed Demon Sluts: Pog: Coed Demon Sluts, Book 5", "description": "Aren't you tired of doing everything right?Wouldn't you like a second chance to go back and do it wrong?_________________________________________________As a child, Pog (“Person Of Girth”) was her wealthy parents’ little angel until she started gaining weight. They gave her an ultimatum: lose the weight, or be kicked out of the family. Ten years later she was a fat, broke whore—and then Delilah offered her a chance to be a thin, rich whore for hell.  Today, Pog is the coed demon sluts' team leader, taking guff from no one, not even her supervisor Ish Qbybbl.For years Ish has happily supervised his field ops via Skype from his private cubicle at the Regional Office. But when they win the Demonic Intramural Basketball Tournament and put him in danger of a promotion, Ish panics and goes into hiding with his coed demon sluts. Can Pog save Ish from his jealous demonic boss? Or will their secret history crack her open and leave her defenseless in hell's prison?The fifth adventure in the Coed Demon Sluts series!"}]