[{"id": "B0773VZY7Q", "genre": "Children's Books", "title": "Thanksgiving Short Story Collection: 18 Wonderful Stories in one Bundle (interesting, hilarious, smart, funny, spooky)", "description": "18 Original Short StoriesAre you ready for the funniest short story of the year?These stories are hilarious and some are even a bit scary.  You won't believe how these stories ends!   Are you ready for the funniest short story of the year?Kids love the funny animal characters!Grandparents will love reading these books to their grandchildren!**Price drop for the holidays!   Scroll up and click \"Buy Now\" to get your copy!**"}, {"id": "1600601316", "genre": "Children's Books", "title": "Sahara (Vanishing Cultures Series)", "description": "Manda, a young Tuareg boy, is excited. He and his father are going to travel to a nearby village for a festival and camel races. Manda helps his father prepare the camel caravan for the trip. The Tuareg have been traveling through the Sahara Desert on camelback for centuries, and the men take great pride in their camel-riding skills. As Manda leaves his village, he is eager to see the great riders in the races. He is proud to be going on this special journey with his father."}, {"id": "0766031292", "genre": "Children's Books", "title": "The 1900s Decade in Photos: A Decade of Discovery (Amazing Decades in Photos)", "description": "Through photos, captions, sidebars, and text, see how the 1900s were a time of amazing discovery. Feats covered in this book include: how the Wright brothers invented the airplane, how Henry Ford built the Model T car, and how Albert Einstein solved mysteries of the universe. These are just a few of the astonishing feats. Robert Peary set out to reach the North Pole. Thousands of workers were digging the Panama Canal. U.S. soldiers and sailors went abroad. America was becoming a world power. The 1900s helped shape the course of human history."}, {"id": "0062110780", "genre": "Children's Books", "title": "Stick Dog", "description": "Introducing everyone's new best friend: Stick Dog!He'll make you laugh...he'll make you cry...but above all, he'll make you hungry!Follow Stick Dog as he goes on an epic quest for the perfect burger. With hilarious text and stick-figure drawings, reluctant readers will eat this one up!Perfect for fans of such series as Dog Man, Big Nate, Timmy Failure, and Diary of a Wimpy Kid. "}, {"id": "148963035X", "genre": "Children's Books", "title": "Australia (Exploring Continents)", "description": "Did you know Australia is both a continent and a country? Australia is the smallest of the seven continents. It is home to natural wonders like the Great Barrier Reef, a coral reef so large it can be seen from space. Discover more intriguing facts in Australia, an Exploring Continents book."}]