[{"id": "1534100547", "genre": "Children's Books", "title": "Midwest (21st Century Basic Skills Library, Level 3)", "description": "Books in the Outdoor Explorers series introduce children to the specific regional plants, animals, landscape, and weather in the United States through a fun nature hike. This book studies the Midwest. Bright, colorful pictures will keep children engaged as they learn about the great outdoors in the United States. Glossary, index, and bibliography are included."}, {"id": "B00GMIPM66", "genre": "Children's Books", "title": "What's So Great About Van Gogh? A Guide to Vincent Van Gogh Just For Kids! (What's So Great About... Book 2)", "description": "Everyone says Vincent Van Gogh is one of the greatest artist whoever lived…but why? What makes him so great? At a single glance, his work doesn’t look so special. Why is his artwork celebrated around the globe, and for hundreds of years?This book introduces you to the life and work of Van Gogh, and helps show what made him so important to the world."}, {"id": "B0075CU240", "genre": "Children's Books", "title": "Baby: Tractor!", "description": "Perfect for reading aloud and encouraging early word recognition, these books are just right for babies who love to explore shapes and colors.Bright colors, and simple, bold designs will grab baby's attention.  Simple, playful text makes it easy for reading aloud."}, {"id": "B075GFKCNJ", "genre": "Children's Books", "title": "The Book of Jonah: Much More than a Fishy Tale - Benefiting Phoenix Children's Hospital (The Max Reid Bible Adventures Collection Book 5)", "description": "100% of all proceeds on the first 5,000 books sold will go directly to Phoenix Children's Hospital.When most people talk about Jonah, they will just mention him being swallowed by a whale. The Book of Jonah, which is only four chapters long does mention him being swallowed by a great fish; whether it was a whale or not is not clear or all that important. What is important is that there is much more to this small but fascinating book. This story was written to bring all four chapters of this book to life and teaches the reader about obedience and God's love for everyone."}, {"id": "B00HNXBNZ8", "genre": "Children's Books", "title": "#13 School of Evil (Twisted Journeys ®)", "description": "At Darkham Academy, the teachers are creepy, monsters lurk in the lab, and your dorm room is haunted! Can you survive the first day of school and finish your homework on time? Every Twisted Journeys® graphic novel lets YOU control the action by choosing which path to follow. Which twists and turns will your journey take?"}]