[{"id": "1403441790", "genre": "Children's Books", "title": "The Civil Rights Movement (20th Century Perspectives)", "description": "What is the Civil Rights Movement? -- A Movement many years in the making -- Early steps -- Dashed hopes -- The first victories -- Resistance to the Brown ruling -- Bus boycott in Montgomery -- Martin Luther King Jr. and nonviolent protest -- Central High School in Little Rock -- Sit-ins and SNCC -- Freedom rides -- Birmingham -- Political responses to the Movement -- March on Washington and the Civil Rights Act -- Struggle in Mississippi -- Selma and the Voting Rights Act -- Civil rights and the arts -- A new direction -- Other civil rights struggles -- The Movement continues -- Timeline."}, {"id": "1411434854", "genre": "Children's Books", "title": "States and Capitals (Flash Kids Flash Cards)", "description": "Flash Kids Flash Cards offer essential practice in key concepts such multiplication, division, the alphabet, sights words, and state capitals. Containing 88 cards in each package, these cards are sturdier than others on the market. "}, {"id": "9812465332", "genre": "Children's Books", "title": "1000 Palabras en Ingles (1000 Words) (Spanish Edition)", "description": "Presents 1000 entries for terms in English for Spanish speakers, with corresponding illustrations to show usage."}, {"id": "1623709547", "genre": "Children's Books", "title": "Aquaman Is Fair (DC Super Heroes Character Education)", "description": "Aquaman is open-minded and listens to others. He can even communicate with sea animals. Fighting with the other Justice League members, he plays by the rules. He even treats villains like Black Manta with fairness. Learn more about what makes Aquaman fair in this exciting picture book."}, {"id": "1541208730", "genre": "Children's Books", "title": "5 Bear Sisters Get Some Honey And A Big Surprise", "description": "A great little child's tale about 5 bears who were sisters.  The sisters find some yummy honey and get a big surprise too.  This books includes another book about bears...\"Little Bears First Day Of School\""}]