[{"id": "0766030024", "genre": "Children's Books", "title": "Baby Animals of the Frozen Tundra (Nature's Baby Animals)", "description": "Supporting the National Science Education Standards for K-4 Life Science, each book in this series focuses on cute baby animals in a specific biome, taking the reader on a trip through the animals' habitats."}, {"id": "0990960927", "genre": "Children's Books", "title": "You, the Magician", "description": "A collection of positive, though-provoking reminders, \"You, the Magician\" is a book that speaks to everyone, literally. The first line is, \"Since you are reading this book, it is written for you.\"  Each page is vibrantly written and illustrated to remind you, the reader, that you already have all the tools you need to be the best you. We want to nudge people back toward themselves, to trust themselves. You are intentional, and you are a part of everything!"}, {"id": "1609053915", "genre": "Children's Books", "title": "Animal Teachers", "description": "An Oppenheim Toy Portfolio 2014 Platinum & Gold Best Book Award WinnerHow Do Animals Learn To Swim, Fish, Box, Or Build?In the forest, in the pond, in caves, prairies, and jungles, in all the world's outdoor \"classrooms,\" baby animals are...learning! They are taking lessons on how to be an expert swimmer, alarm-sounder, racer-chaser, or hide-and-seeker. They don't have books, or desks, or computers. But they do have teachers!With clear, graceful prose and striking illustrations, Animal Teachers showcases the teacher-student dynamic between adult and young animals as they are taught crucial skills needed to handle daily challenges.An entertaining combination of science and storytelling, this instructive title presents skills that a dozen different young animals have to learn.Will the animals earn an \"A\" for their efforts? No! But a banana or a good hiding place might be even better!"}, {"id": "0805016376", "genre": "Children's Books", "title": "Alphabears: An ABC Book", "description": "In Alphabears, twenty six huggable teddies help teach children the letters of the alphabet:A is for Amanda, a good teddy bearWho carries sweet apples everywhere. Michael Hague's warm, detailed paintings complement Kathleen Hague's happy, rhyming texts. Even the youngest of readers will treasure and learn from these two charming concept books"}, {"id": "1534563083", "genre": "Children's Books", "title": "India in Ancient Times (World History)", "description": "The history and culture of ancient India is rich and complex. However, most history classes only touch on the most prominent aspects of ancient Indian culture, such as Hinduism. Readers experience the full breadth of this ancient society through detailed text, insightful quotes from historians, and fascinating sidebars. Vivid photographs and historical images are included to enhance the reading experience. From the lives of powerful historical figures to the stories of mythological heroes, ancient India comes to life in a way that strongly supplements standard social studies curricula."}]