[{"id": "B01C2IZX5E", "genre": "Children's Books", "title": "Home Collection Vol. 1: Home Sweet Home", "description": "Fresh from DreamWorks Animation’s new film Home, Titan Comics bring you seven all-new adventures of the friendliest and most bumbling world dominators you’ve ever seen! In ‘Hide & Seek & Oh’, Oh takes a simple game to galactic proportions, in ‘Oh the Human’, Oh tries to fit in at Tip’s school, in ‘Ghost Stories’, Oh tries to overcome his fears – plus there’s ‘The Funny Pages’, ‘Pig in Space’, and ‘Oh-Employment’."}, {"id": "B00IJ9HIMW", "genre": "Children's Books", "title": "Story of a Truthful Boy Abdul Qadir", "description": "an awesome true story which every kid must read. this story is about a boy who showered the world how powerful truth can be."}, {"id": "B073K66D5S", "genre": "Children's Books", "title": "Filipino Heritage (21st Century Junior Library: Celebrating Diversity in My Classroom)", "description": "Filipino Heritage in the Celebrating Diversity in My Classroom series explores the geography, languages, religions, food, and culture of the Philippines in a fun age-appropriate way. Students with Filipino heritage are a significant and important part of the fabric of America and this book helps foster empathy in all students and a multi-cultural community in the classroom. Glossary, index, and additional backmatter aids further learning."}, {"id": "B00LZVNDWK", "genre": "Children's Books", "title": "The Korean War (You Choose: Modern History)", "description": "Its 1950 and the Communist country of North Korea has invaded its neighboring country of South Korea. The United Nations has stepped in to help South Korea by providing weapons and soldiers. Nearly all of these soldiers come from the United States. Will you:  Serve as a pilot in Korea with the U.S. Marine Corps? Lie about your age to enlist as a 16 year old member of the U.S. military reserves? Join in the fight for your country as a young South Korean man?  Everything in this book happened to real people. And YOU CHOOSE what you do next. The choices you make could lead you to survival or to death."}, {"id": "B0099RYJY8", "genre": "Children's Books", "title": "Quack!", "description": "When a rhythmic read-aloud master pairs up with a Caldecott Honor­winning artist to visit endearing species of baby animals, the result can only be instant toddler appeal. QUACK! Mama Duck announces the hatching of five peeping, waddling, flapping, nibbling, wobbling, wibbling baby ducklings. Splish, splosh, splash! A lively, lilting text by Phyllis Root links with luminous collages by Holly Meade in an original board book perfect for reading aloud to the preschool crowd."}]