[{"id": "031222009X", "genre": "Science Fiction & Fantasy", "title": "Orwell's Politics", "description": "Orwell's Politics is a study of George Orwell's political ideas and beliefs from his time as a policeman in Burma through the publication of 1984. The book places Orwell in historical context, examining his response to Imperialism, mass unemployment in the 1930s, the revolution in Spain, as well as the Second World War and its aftermath. Particular attention is paid to Orwell's American connection, to his writings for Partisan Review and for Politics. In addition, the book looks at recent feminist critiques of Orwell's politics. Orwell's belief that Russia had nothing in common with socialism is discussed, and new sources for 1984 are identified. While his political beliefs inevitably changed over the years, he remained both an anti-Stalinist and a committed socialist up to the time of his death."}, {"id": "089879692X", "genre": "Science Fiction & Fantasy", "title": "Science Fiction Writer's Marketplace and Sourcebook", "description": "Combining how-to-write instruction with where-to-sell direction, this comprehensive guide is invaluable for science fiction and fantasy writers. Includes samples with editor's critiques and advice from established authors, more than 100 detailed market listings for magazines, dozens of listings for publishing houses, and information on related organizations, on-line services, and more."}, {"id": "B01CKN4HLM", "genre": "Science Fiction & Fantasy", "title": "Mystical Rome: The War of Infinite Regress", "description": "Beware the Ides of March! warned the Soothsayers on the steps of the Senate. Caesar scoffed, but Antony took the warning to heart and later shielded his friend with his own flesh, altering forever the destiny of Rome. Twenty years later, Caesar reigns over the unified Roman Empire and the Soothsayers operate an academy where they instruct select sons of the patricians in their eldritch arts. All that stands now against Rome’s domination of the entire world are the barbarous Caledonians and the power of the seemingly invincible Parthian Empire.Caught in this chaotic time, the children of murdered hero of the imperial legions, Titus Valerius, struggle to avenge their father and create their own branch family. To achieve this, they must regain their family’s lost political influence, and obtain recognition from the Imperial Senate. Together they must face undead assassins, feuding patrician families, dangerous prophecies, eldritch magic, and a journey through the Underworld before they can reclaim what is theirs. "}, {"id": "1518622593", "genre": "Science Fiction & Fantasy", "title": "1-8: The Story: Episode I-VIII", "description": "The Story explores a different take on the history of Earth. Ancient astronaut refugees fleeing a long standing interstellar war build a space craft and set out for a new home. They find one on a distant planet they call \"Urth\", a planet already inhabited by human natives."}, {"id": "B075Y9J4FP", "genre": "Science Fiction & Fantasy", "title": "The Frog Prince (Fairy Tale Adventures Book 2)", "description": "All she needs is a clueAfter a disastrous Princess Test, Carina tries to pick up the pieces and prove she is still a trustworthy spy. But all her evidence points to magical interference, and her father won’t believe such preposterous theories without proof. She’ll have to solve this mystery fast to salvage her reputation, but can she do it alone?All he needs is a kissWhen Carina refuses to attend his brother’s wedding, Prince Stefan crosses the ocean to change her mind. But the perfect surprise turns into a perfect disaster when a witch transforms him into a frog. Only a kiss from Princess Carina can break the curse, and she doesn’t seem inclined to kiss anyone. Can Stefan win her heart before it’s too late?Or will dark magic sweep them all away?The Frog Prince is a retold fairy tale and the second book in the Fairy Tale Adventures series. These books take place in the same world, and each novel is a stand-alone with a fairy tale ending. Enjoy them one by one or read the entire series to see how everything connects.If you like strong characters, sweet romance, and daring escapades, download a Fairy Tale Adventure today!"}]