[{"id": "1847808573", "genre": "Children's Books", "title": "All Aboard the London Bus", "description": "Come! Board the London Bus and see the London sights with us. At any time, hop off, explore! Then climb back on, and ride some more… As a family of four spend a day exploring London, fun, child-friendly poems introduce readers to our wonderful capital city, and all its secrets. Well-known landmarks like Buckingham Palace, Big Ben and the London Eye, plus inescapable features like rain and taking tea, all get Patty Toht's witty treatment. Non-fiction facts provide more information about the subjects, while rising star Sam Usher brings them to life with his signature style and humour. This gorgeous celebration of London will be loved by both tourists and those who call the city home."}, {"id": "1250050464", "genre": "Children's Books", "title": "My First Kwanzaa (My First Holiday)", "description": "A simple way to get acquainted with Kwanzaa.\"Hooray! Hooray!It's time to get ready for Kwanzaa.\"During the seven days of Kwanzaa, we celebrate the importance of family, friends, and community. This warm and lively introduction to a very special holiday will help even the youngest children join in!Author and illustrator Karen Katz's wonderful series of picture books for the very young offer a simple and fun way to get familiar with the traditions of holiday celebrations from different cultures."}, {"id": "B01JGWDGL2", "genre": "Children's Books", "title": "The Big 7 Talk: Crucial Subjects Every Parent Must Discuss With Their Children", "description": "The Big 7 Talk: Crucial Subjects Every Parent Must Discuss With Their Children is a book on healthy conversations between parents and children. Many adults have made costly mistakes and taken the wrong turn in life because their parents never had these conversations with them. It is true that mistakes are a part of life and we learn from our mistakes, but as a parent you have a moral obligation to help your child circumvent disaster and avoid costly mistakes that could derail them.By discussing these seven subjects with your children, you will empower them to make informed decisions and choices that put them in complete control of their circumstances. So go ahead and buy your copy of The Big 7 Talk, and start having those healthy and meaningful conversations with your children TODAY!"}, {"id": "B01H28S3RE", "genre": "Children's Books", "title": "Amazing Pictures and Facts About Monsoons: The Most Amazing Fact Book for Kids About Monsoons", "description": "Kid’s U Presents...Monsoons- Amazing Pictures and Facts about Monsoons.  Have your children ever wondered what a monsoon is? How are monsoons formed? Where do monsoons occur? In this book you will explore the wonders of monsoons, finding the answers to these questions and so many more. Complete with incredible pictures to keep even the youngest of children captivated, you will all embark on a little journey into the great unknown.  In school our children aren’t taught in a way that makes them curious and want to learn. I want to change that!  This book will show your children just how interesting the world is and help ignite a passion for learning.  Your children will learn how to:    Become curious about the world around them.   Find motivation to learn.   Use their free time to discover more about the world-and have fun while doing so!   And much more! "}, {"id": "B005TTC3IY", "genre": "Children's Books", "title": "Shira's Wish", "description": "Shira is misunderstood by her family, until she meets two real live lion cubs. They take her to their family in the African Savanna, where she is transformed into a lion cub too. Excitement abounds everywhere – huge elephants, quick zebras, and even leopards who would like to make her their dinner!"}]