[{"id": "1936172402", "genre": "Children's Books", "title": "Achoo!", "description": "Achoo! Is a whimsical story with a message of kindness and leadership. Swing along with confident Mayor Munkin as he tends to the healthy monkeys on the unusual Island of Blue, until little Lulu lets out a great big ACHOO! Will the Mayor be able to set aside his pride and accept some help from a wise old monkey? Grab a spoon for some blueberry stew as this infectiously delightful and richly illustrated tale unfolds."}, {"id": "1602190186", "genre": "Children's Books", "title": "Good Night Zoo (Good Night Our World)", "description": "Good Night Zoo features gorillas, kangaroos, elephants, tigers, giraffes, wolves, birds, zebras, bears, lions, hippos, monkeys, rhinos, penguins, and more. Who doesn't love the zoo? This sweet and educational board book explores the fascinating world of animals at the zoo—a delightful story that is sure to make your child's most requested bedtime book list.This book is part of the bestselling Good Night Our World series, which includes hundreds of titles exploring iconic locations and exciting themes."}, {"id": "1580130631", "genre": "Children's Books", "title": "Too Many Cooks: A Passover Parable", "description": "Each time Bubbie gets diverted from making charoses for the Passover seder, family members add their own secret ingredient until the charoses is atrocious!"}, {"id": "0486261530", "genre": "Children's Books", "title": "Easy-to-Do Card Tricks for Children (Become a Magician)", "description": "Children love card tricks, and with this book by an expert in magic and card conjuring, youngsters will be able to master a host of tricks especially designed for them.Tricks are arranged in order of difficulty, with the simplest at the beginning of the book. Clearly written, easy-to-follow instructions and over 60 helpful diagrams take aspiring magicians through each step — from preparing and manipulating the cards to developing a line of patter (a necessary ingredient for any successful performance).Newcomers to the art of performing card tricks need no special skills — just a willingness to practice — to accomplish such astonishing stunts as finding a card under seemingly impossible conditions, causing a card to rise mysteriously from the deck, reading the spectator's mind, and 27 other mind-boggling maneuvers."}, {"id": "1760296465", "genre": "Children's Books", "title": "A Different Dog", "description": "The forest is dense and dark. And the trail full of unexpected perils. The dog can't move. The boy can't talk. And you won't know why. Or where you are going. You will put this story down not wanting the journey to end. But it's from Paul Jennings, so watch out for the ambush. One of the best. From one of the best."}]