[{"id": "1630763357", "genre": "Children's Books", "title": "Grandfather Duck", "description": "When Mother Duck calls on Grandfather Duck to entertain her three ducklings, Grandfather Duck obliges with a riotous visit to a nearby pond, where the ducklings tempt fate by taunting a cat, trying to eat a poisonous plant, and attempting to fly off of a very large rock. In each case Grandfather Duck comes to the rescue and teaches the ducklings a valuable life lesson."}, {"id": "149108586X", "genre": "Children's Books", "title": "The ABC's of Australian Animals: An Interactive Kids Yoga Book", "description": "Give Your Children the Healthy Benefits of Yoga with this Kids Yoga Stories Adventure Book. Learn the alphabet with Luke’s ABC’s of Australian Animals! Curl up like a koala, hop like a kangaroo, and waddle like a wombat as you act out Australian animals through this unique and interactive alphabet book. The book includes an alphabetical list of Kids Yoga Poses and a Parent-Teacher Guide.  Kids Yoga Stories introduce you to engaging characters who will get your child laughing, moving, and creating. Reading is good for the mind AND body! This book for toddlers and preschoolers is more than a storybook, but it's also a unique experience for children. Learn something new, explore movement, and have fun together! A matching coloring book, Luke's A to Z of Australian Animals, is also available."}, {"id": "B0159LCBA6", "genre": "Children's Books", "title": "Diary of Steve the Adventurer (5 Book Series)", "description": "From Book 1: Steve’s not your ordinary teenaged boy. The respected Master Thonc has trained him and, starting today, his training is complete. Now Master Thonc has given Steve his first quest. Steve is to venture to a mysterious ruin, located deep in a forest, and retrieve a treasure simply known as the Crystal Creeper. But, before Steve can do that, he has to visit a mine, which has a chest that contains a key needed to enter the ruin. Steve is a confident adventurer but, during his travels, he soon realizes that adventuring isn’t as easy as he thought. Steve will battle mobs, the elements, tricky platforms, and dangerous traps as he journeys to get the Crystal Creeper. Can he do it?As Steve writes about his journey in his diary, readers will enjoy every entry. Filled with action, adventure, and a bit of humor, The Crystal Creeper is a must-read for anyone who loves Minecraft.Grab your copy of The Crystal Creeper: Steve the Adventurer now and join Steve adventures today!"}, {"id": "0395389496", "genre": "Children's Books", "title": "The Polar Express", "description": "For twenty years, The Polar Express has been a worldwide bestseller and Christmas classic. A perfect keepsake for any family, this beautiful edition can be handed down to each new generation of readers. In 1986 The Polar Express was awarded the prestigious Caldecott Medal and hit the New York Times bestseller list. Since that time, more than six and a half million copies have been sold, and every December it faithfully reappears on national bestseller lists. In 2004, The Polar Express became a blockbuster holiday movie. The DVD release in 2005 assures, that like the book, the movie will become a holiday classic."}, {"id": "0064435989", "genre": "Children's Books", "title": "Good Rhymes, Good Times!", "description": "Lee Bennet Hopkins, noted anthologist and educator, has collected a group of witty and whimsical poems that celebrate the joy of reading. Karla Kuskin, Jack Prelutsky, and Arnold Lobel are just a few of the acclaimed children's book authors whose poems are joined into this delightful ode to the world of words. Wonderfully wacky illustrations by Harvey Stevenson help make this a rollicking good book––and a rollicking good time."}]