[{"id": "1556343930", "genre": "Science Fiction & Fantasy", "title": "GURPS Warriors (GURPS: Generic Universal Role Playing System)", "description": "Strong of Arm and Steely of Eye   Mighty barbarians hacking away with massive broadswords and battle-weary grunts with cordite-stung eyes come to life! GURPS Warriors expands upon the template system introduced by GURPS guru Sean \"Dr. Kromm\" Punch in GURPS Wizards so you can get on with the game!   Inside you'll find 29 warrior archetypes, along with templates and design advice allowing you to quickly and efficiently recruit your new warrior.   Templates include . . .   * Soldiers from all time periods - past, present, and future - such as the aviator, cavalryman, commando, heavy foot soldier, marine, and rifleman . . .  * Warriors from the pages of history and literature, including the barbarian, berserker, gunslinger, holy warrior, martial artist, and swordsman . . .  * Specialist warriors like the archer, engineer, guard, guerrilla, sharpshooter, and scout . . .  * Highly trained operators of weapons of war, such as artillerist, aviator, mecha pilot, and naval crewman.   Warriors also provides many templates suitable for use by the GM as is to represent NPC soldiers, mercenaries, or guards.   Each template comes with four original characters, drawn from a wide range of settings, giving you 116 ready-to-use sample characters as well as historical background and information on the technology and tactics that helped shape many of these professions, to help you better detail these characters."}, {"id": "0441478123", "genre": "Science Fiction & Fantasy", "title": "The Left Hand of Darkness", "description": "Ursula K. Le Guin's groundbreaking work of science fiction—winner of the Hugo and Nebula Awards.A lone human ambassador is sent to Winter, an alien world without sexual prejudice, where the inhabitants can change their gender whenever they choose. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the strange, intriguing culture he encounters...Embracing the aspects of psychology, society, and human emotion on an alien world, The Left Hand of Darkness stands as a landmark achievement in the annals of intellectual science fiction."}, {"id": "0998970522", "genre": "Science Fiction & Fantasy", "title": "Ball", "description": "It's 2039 and Los Angeles has fallen in love with M.O.I.s, intelligent basketball-shaped robots that have taken the world by storm. The whole craze is a little annoying to introverted teenager John Glover until Ball rolls into his life, a wise-cracking robot with a heart of tungsten (and some gold).But buried deep in Ball's code is a secret that will send its new owner into a collision course with a host of scheming parties who want the robot for their own gain. Can John and Ball stay out of the crosshairs long enough to answer the riddle that keeps running through Ball's mind?Ball is a science fiction novel set in a world populated by intelligent machines for the first time. If you like your robots hilarious instead of homicidal, you'll love the witty and colorful M.O.I.s."}, {"id": "018506602X", "genre": "Science Fiction & Fantasy", "title": "Galaxy, February 1966 (Vol. 24, No. 3)", "description": "Vol. 24, No. 3, February 1966. Cover art by Virgil Finlay. STORIES: Under Old Earth [The Instrumentality of Mankind] by Cordwainer Smith; Courting Time by Tom Purdom; The Echo of Wrath by Thomas M. Disch; Where the Changed Ones Go [Blue Fire] by Robert Silverberg; Eye of an Octopus [Known Space] by Larry Niven; In the Imagicon by George H. Smith; Mulligan, Come Home! by Allen Kim Lang; The Age of the Pussyfoot (serial, part 3 of 3) by Frederik Pohl. FEATURES: The Business of Science (editorial essay) by Frederik Pohl; For Your Information: The Wreck of La Lutine (science essay) by Willy Ley; Galaxy Bookshelf by Algis Budrys. INTERIOR ILLUSTRATIONS BY: Virgil Finlay, Jack Gaughan, Wood."}, {"id": "160125542X", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Campaign Setting: Reign of Winter Poster Map Folio", "description": " Enter the frigid lands of the Pathfinder campaign setting with the Reign of Winter Poster Map Folio. Seek high adventure or map your party's explorations on three giant poster maps designed for use with the Reign of Winter Adventure Path. Three huge poster maps depict the city of Whitethrone, capital of the frozen realm of Irrisen, the rough wilderness region of Iobaria, and a giant player's map of Irrisen designed to look like an ink-and-parchment map of the region, complete with sketches of local threats and legendary winter creatures! “Price Includes VAT” "}]