[{"id": "1786030535", "genre": "Children's Books", "title": "Audrey Hepburn (Little People, Big Dreams)", "description": "New in the Little People, Big Dreams series, this inspiring and informative little biography follows the colourful life of iconic actress Audrey Hepburn, from her early life during World War Two, to ballet school, her acting career and UNICEF work. With stylish and quirky illustrations and extra facts  at the back, this empowering series celebrates the important life stories of wonderful women of the world. From designers and artists to scientists, all of them went on to achieve incredible things, yet all of them began life as a little child with a dream. These books make the lives of these role models accessible for children, providing a powerful message to inspire the next generation of outstanding people who will change the world!"}, {"id": "0195409280", "genre": "Children's Books", "title": "A Circle Is Not a Valentine (Alphonse Knows Series)", "description": "The first book in the Alphonse series deals with shapes.  Alphonse, a delightfully wacky artist, attempts to paint a valentine but, by mistake, creates a square, a circle, and a triangle."}, {"id": "B00J3ZO78O", "genre": "Children's Books", "title": "The Cruise of the Noah's Ark (Illustrated)", "description": "From the author of the hugely popular Little Jack Rabbit series, this is a delightful interpretation of the Noah's Ark fable written for children aged 3-8. Enormously enjoyable and easy to read, it's just as accessible for today's children as it was when first published almost a century ago.This meticulous Heritage Illustrated Publishing digital edition is beautifully illustrated with reproductions of the original black and white sketches from the 1922 first edition."}, {"id": "0792789695", "genre": "Children's Books", "title": "Crewel: Sound Library: Complete (Crewel World Trilogy)", "description": "For generations, girls known as spinsters have been called by Arras' Manipulation Services to work the looms and control what people eat, where they live, how many children they have, and even when they die. Gifted with the unusual ability to weave time with matter, sixteen-year-old Adelice Lewys is exactly what the guild is looking for, and in the world of Arras, being chosen as a spinster is everything a girl could want. It means privilege, eternal beauty, and being something other than a secretary. It also means the power to embroider the very fabric of life. But Adelice isn't interested. Because once you become a Spinster, there's no turning back."}, {"id": "1538326019", "genre": "Children's Books", "title": "Llamas (Wild and Woolly)", "description": "Llamas have two coats: a soft, insulating undercoat and a coarse, protective outer coat. Both fibers are used in the production of llama wool. In this engaging book, readers will learn about the domestication of llamas, the resources they offer, and how their fiber has been used and produced historically. Readers will gain insight into curricular life science studies by examining real-world examples. Dynamic photographs enhance the book's appealing and accessible content."}]