[{"id": "B01IJCKLNG", "genre": "Science Fiction & Fantasy", "title": "Flash Fiction", "description": "Step into the worlds of Richard Dee. Imagine the magazine of the future, or how to fake your own demise. Maybe it’s time you were tested to prove your adulthood? Or perhaps you’re a sleeping space traveller?All these ideas and more are explored in this collection of short stories. They're complemented by excerpts from my novels and two teasers of work in progress. "}, {"id": "1365614034", "genre": "Science Fiction & Fantasy", "title": "Railroad Train to Heaven", "description": "The memoirs of Arnold Schnabel, a railroad brakeman and part-time poet recovering from a mental collapse in the summer of 1963 in the guest house of his three maiden aunts in the New Jersey seashore town of Cape May. Arnold falls in love with a beautiful bohemian girl called Elektra, has many meetings with a chain-smoking Jesus, fights off the advances of a mad lady novelist, travels back and forth in time, and to heaven and back, and ever onward."}, {"id": "B071CK6LKG", "genre": "Science Fiction & Fantasy", "title": "Altered States of Exodus", "description": "\"...horror that grabs you by the hands and says, 'C'mon, we're going to go on a gruesome trip far from the safe world you're currently in.'\" —Unnerving MagazineIn a world powered by the souls of the dead, a uniquely deformed girl embarks on a dark journey that takes her from a life of imposed solitude to the depths of human depravity.   Accompanied by her only friend, a technologically-enhanced rat, young Lucretia Bonnecourt spirals into a world so demented and cruel that it is only rivaled by the nightmare landscapes of her own, psychotic fugues.   Will she survive the wicked and debaucherous world which threatens to claim her? Or will she be lost forever to the altered states of exodus?  Praise for William Todd Rose “Rose never lets up when it comes to disturbing concepts. . . .”—Publishers Weekly “Rose has a gift for creating believable science fiction worlds that are wrought with real, and even imagined, dangers around every corner.”—Savvy Verse & Wit “Rose provides intensity in his writing trifecta pertaining to environment, emotions, and incredibly halting vivid horror backdrops.”—A Tattered Copy"}, {"id": "0575035145", "genre": "Science Fiction & Fantasy", "title": "Terminal Beach (Everyman Fiction)", "description": "From the author of CRASH and EMPIRE OF THE SUN, a reissued collection of short stories last published in 1985, which examine the paradox that exists between humanity's creative abilities and destructive impulses. Includes THE TERMINAL BEACH, about an island used for atomic bomb tests and subsequently deserted, and THE GIOCONDA OF THE TWILIGHT NOON."}, {"id": "B076474318", "genre": "Science Fiction & Fantasy", "title": "The City of Shades: The Good Witch Anaïs Blue Prequel", "description": "I am Anaïs Blue.Seventeen years of age. Trapped in the body of a five-year-old. And a witch.You see, we grow differently to the rest of you guys. It kind of sucks, but It’s not all bad. At least I get to experiment on naturals like you.If you were in London recently our paths may have crossed. Then your world probably looked a little strange for few hours.My caretaker told me I should apologise. So, here goes…Sorry!! :)I’ve also been told I should explain myself. This short story should help clear it all up.Before Amsterdam there was London. Follow Anaïs's magical mishaps in the city of shades. Painting a town purple was never so much fun.The City of Shades is the prequel to the Anaïs Blue series.Volume's One and Two available free until Christmas with Kindle Unlimited."}]