[{"id": "B009ZCXUWO", "genre": "Science Fiction & Fantasy", "title": "Shadows of Light and Sound (The Merlin Protocol Book 2)", "description": "When the whole world goes mad, only a madman can save it. Still, it takes a special kind of crazy to try recreating the legends of King Arthur. But this Merlin commands exotic technologies that make him a credible, if ambiguously moral, mage.Immersive VR training, delivered by Chester, Sanctuary’s sardonic AI major domo, enable Merlin to groom a young amnesiac to the role of the once and future king. But their success hinges on help from a mysterious quantum computer at Exeter’s Hidden Lake Labs.Qassandra not only gives Arthur a sword made from the same miraculous psi-crystal that powers Merlin’s flute, but it also delivers the weapon to Stonehenge, embedding it in the central altar stone. The stage is set for the storied ritual of choice.At the winter solstice meeting, Merlin plays a Timesong -- music quite unlike any other. Mystical visions stun the crowd, and hypnotic melodies strum their heartstrings. “Whosoever draws the sword from this stone,” Merlin intones, “is the true-born ruler of Britain.”At the apex of the drama, Arthur takes his turn. When he draws the sword, the crowd gasps as one. When he raises it overhead and sends a bolt of energy skyward, they roar with delight.Hope, Merlin finds, is still alive. But will it be enough to save the world?"}, {"id": "0316334715", "genre": "Science Fiction & Fantasy", "title": "Nemesis Games (The Expanse)", "description": "The fifth novel in James S.A. Corey's New York Times bestselling Expanse series. Now a major television series!A thousand worlds have opened, and the greatest land rush in human history has begun. As wave after wave of colonists leave, the power structures of the old solar system begin to buckle.Ships are disappearing without a trace. Private armies are being secretly formed. The sole remaining protomolecule sample is stolen. Terrorist attacks previously considered impossible bring the inner planets to their knees. The sins of the past are returning to exact a terrible price. And as a new human order is struggling to be born in blood and fire, James Holden and the crew of the Rocinante must struggle to survive and get back to the only home they have left.The Expanse Leviathan WakesCaliban's WarAbaddon's GateCibola BurnNemesis GamesBabylon's AshesThe Expanse Short Fiction The Butcher of Anderson StationGods of RiskThe ChurnThe Vital Abyss"}, {"id": "1521190542", "genre": "Science Fiction & Fantasy", "title": "2288 A.D.: A LOVE STORY (The Ashlyn Chronicles - Book 2)", "description": "Fans of Star Trek, Star Wars, Marvel, D.C. and Game of Thrones will love the Wonder Woman / Gal Gadot type heroine in this SIZZLING-HOT, ACTION-PACKED adult novel (age 18+). Read the #1 BEST SELLING, AWARD WINNING, Kindle ALL-STAR Series (TOP 100 of ALL AMAZON BOOKS) for 16 weeks!*This hybrid series combines all the elements of an action-packed fantasy, sci-fi, superhero, adventure saga ... yet holds fast to what makes humanity unique, our ability to endure the seemingly impossible for the sake of love.*SYNOPSIS: Enter the universe of Ashlyn and Steven, two people endowed with extraordinary powers...as they confront an eons old enemy in the ultimate battle to save the last surviving humans. Their incredible journey will take them back in time...where sacrifices will be made, and their love will be tested. Full of unexpected twists and turns...the story will keep you guessing as to what comes next. *Prepare for the adventure of your life ... boldly going where no one has gone before.*To get the latest information on the next upcoming novel in the series, please visit us at: 2287AD.com"}, {"id": "1771484632", "genre": "Science Fiction & Fantasy", "title": "Graveyard Mind", "description": "In Winnipeg’s underworld, every mortician is on the take and every revenant of myth waits to claw their way out of their tombs. The dead stay in the ground because of Winter Murray, a necromancer of the Compact. A victim of abduction and a criminal herself, Winter stalks Winnipeg’s Graveside, preventing larger, more heinous crimes from spilling over into the lives of the Sunsiders, no matter what laws of gods and men she must break to do so. Winter is a chimera, sharing the genetic material of her own never-born fraternal twin sister. Her dead twin’s essence provides her a link to the Kingdom―the land of the dead―and a tie to a past she’s run from for thirteen years. Winter struggles to find a redemption she doesn’t believe she deserves. The temptation of dirty deeds is everywhere: An animated skeleton with a penchant for wearing dead men’s clothes wants her on his payroll. Her deceased, but not gone mentor, still pushes her to take the easy way by being hard. A composite man assembled from soldiers who still puts boot to ass when Winter demands. A vampire that wants just a taste. Each pulls at Winter ensuring a normal life remains eternally out of reach, and the easy way is anything but."}, {"id": "0979578825", "genre": "Science Fiction & Fantasy", "title": "Spellbound", "description": "\"Gino's is down here.\" I shoved my hands into my jacket pockets and started down the hall. Jason hesitated again. This time, I wasn't worried. He was either going to follow me, or get back in the elevator by himself. I counted to three and smiled. The sound of footsteps hurrying after me usually gets that reaction. We walked together to the end of the hall to a door with a large sign bearing the name 'Gino's' in fancy script. I knocked and waited. The door ignored me so I knocked again. This time, it opened and the heavenly smell of frying hamburger drifted through the crack. Jason's eyes lit up brighter than the hall bulbs. I snickered, pushed the door open and walked into what had once been a living room. Jason followed me, stopped just inside the door and stared at the mystic symbols etched into the walls, his jaw hanging almost to his knees. I took my jacket off, tossed it to one side then cracked my knuckles and turned around. \"Welcome to Gino's.\" I grinned again, only this time not so nicely. His face turned the shade of French vanilla ice cream and he backed up. Right into the waiting arms of Gino himself. I smirked. \"You shoulda run when you had the chance.\" When Lynda passes her final exam with flying colors, she graduates into the elite world of Wizards. Unexpected side effects of her graduation spell, an evil wizard with designs on the city and a nosy mother complicate things. Lynda finds her life spiraling into chaos and to make matters worse, she's falling in love!"}]