[{"id": "0142408239", "genre": "Children's Books", "title": "Good Morning, Digger", "description": "When a group of construction trucks comes rolling down the street and gets to work on an empty lot, a young boy is fascinated by all the excitement, noise, and movement taking place as the wonderful new structure slowly begins to take shape. Reprint."}, {"id": "0635028565", "genre": "Children's Books", "title": "George H. W. Bush: 41st President of the United States (231) (1000 Readers)", "description": "These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group-reading programs, centers, library programs, and have many other terrific educational uses.  DID YOU KNOW?: George was the first U.S. president who had served as director of the CIA? George was the youngest pilot in the U.S. Navy during World War II? George played baseball in high school and college? George served as Ambassador to the United Nations? Your students will want to read more!"}, {"id": "0061781266", "genre": "Children's Books", "title": "Emeraldalicious (Pinkalicious)", "description": "Everyone’s favorite pink-loving gal returns in Emeraldalicious, the imaginative, glitterlicious sequel to the #1 New York Times bestselling Pinkalicious!Pinkalicious combines magic, love, and imagination to turn an ordinary place into an Emeraldalicious world.Pinkalicious and Peter visit their favorite park, but on the way Pinkalicious’s wand breaks. She isn’t worried at all, because she knows just what to do. She takes a stick, some vines, and a very special flower to make a magical wand.When Pinkalicious and Peter finally arrive at the park it’s covered in stinky trash! But never fear, Pinkalicious is here with her magical wand, lots of love, and pinktastic rhymes to turn the trash into an Emeraldalicious paradise."}, {"id": "0823965015", "genre": "Children's Books", "title": "Eleanor Roosevelt: More Than a First Lady (Women Who Shaped History)", "description": "A brief biography of the First Lady, spouse of Franklin D. Roosevelt, who is particularly known for her work for human rights."}, {"id": "1504697243", "genre": "Children's Books", "title": "Dreamology: Library Edition", "description": "Experiencing dreams about her soulmate all of her life, Alice meets the real boy, Max, when she moves to a new school and finds that their real relationship is more complicated than their dream one. Simultaneous."}]