[{"id": "1484636449", "genre": "Children's Books", "title": "The Indus Valley (Excavating the Past)", "description": "Contents include: The Lost Cities of the Indus Civilization; Constructing Great Cities (The cities of the rivers, Monumental Mohenjo-daro, An Indus Valley home, Excavating Harappa, Dholavira); Clues to Daily Living (Jobs, Figuring out figurines, Food and cooking); The Mystery of the Indus Script; Traveling Far and Wide; Craft Technology and the Art of Fire; The Rulers and People; The End of the Indus Civilization; Archaeology Today; Timelines."}, {"id": "1435272749", "genre": "Children's Books", "title": "Billy and Blaze", "description": "Available again, for the first time since 1987, Anderson's classic Billy and Blaze series will delight yet another generation of young horse lovers. In the heartwarming first book of the series Billy and his loyal pony Blaze explore the countryside together, and encounter new adventures at every turn. Illustrated throughout."}, {"id": "B0767N92ZJ", "genre": "Children's Books", "title": "Jackie Rabbit Lives in the Desert", "description": "A child's illustrated storybook about a young jackrabbit's adventures one night. It takes place in the Sonoran desert of the American Southwest, with its creatures, plants, and unpredictability. Well suited for reading to small children at bedtime, inter-generational bonding, learning about the desert, and as a gift."}, {"id": "B0742JK2GM", "genre": "Children's Books", "title": "The Adventure of Jeppy and the Trash King", "description": "When Jeppy Plastic is separated from his friends and family during a storm, he is determined to find his way home. Instead, he stumbles upon Trash Row, ruled by the infamous trash king. The trash king promises to find homeless trash new homes. He even promises to return Jeppy back to his blue recycle bin. But Jeppy quickly learns the trash king is not who he claims to be. In this fun children's adventure story, Jeppy must find a way to save his new friends and prevent the trash king from carrying out an evil plan that will destroy his home forever."}, {"id": "B00RQXS0GK", "genre": "Children's Books", "title": "Nations Of Asia: Fub Facts About The Asia (Continents for Kids)", "description": "Learning about other countries and continents can be an exhilarating experience. Not only does it open children's minds and allow them to become more diverse, but it also teaches them unique trivia that is sure to blow their friend's minds. For instance, did you know that everybody in Vietnam has the same birthday? Or that it is illegal to be fat in Japan? With a Nations of Asia picture book, they will learn even more interesting facts and discover the beautiful geography that is the countries of Japan, China, Vietnam, and Malaysia just to name a few. This picture book is sure to thrill all young minds."}]