[{"id": "B01BA441Q8", "genre": "Science Fiction & Fantasy", "title": "Ultimate Betrayal", "description": "Imagine a dystopian world where society cannot protect their children from moral decay and the spread of evil. Andrew Zenith, a conscientious local TV reporter, never worries about getting ahead just making a difference. He uncovers a story that will change the direction of his life forever. After hearing this story, all he thinks about every moment is confirming the facts he hopes are not true. He is driven to save the children. This task is near impossible since the majority of people have cold hearts and a loss of compassion for others. He joins with others who care. Their mission-is to save the children at all costs. If their mission fails young lives will be ruined and even cut short. The fate of the children rests upon finding answers to the questions no one even wants to ask. Will he succeed against overwhelming odds?"}, {"id": "B077W2CJQX", "genre": "Science Fiction & Fantasy", "title": "The Beyond Now Device: A Fictional Exploration Of Time", "description": "We are all fated to die and the earth will continue to circle the sun. This is the future we can be sure of. Yet when four people sharing an apartment happen upon a device that transports them three weeks into the future, they care less about the grand scheme and more about their own lives in the time to come. During their brief episodes they are cast as key players in a crime. One will grow physically attracted to the man she is to blackmail, annoying her boyfriend. One will fire two bullets into the chest of an attorney he doesn’t know, growing to like the power of the gun, while his friend tries her best to stop him.Both wanting and not wanting the seen future to unfold, they contact the maker of the device who is convinced only a true understanding of time will help them. From Plato to quantum physics, religion to common sense, immediacy and anticipation to the gravity of elephants, the maker expresses time from a variety of perspectives. Returning to the dilemma of free will at odds with determinism, the characters take seriously the question 'Does the future already exist?'Realizing that physics, philosophy, and theology hold no consensus on the nature of time, or on the existence of the future, their day of destiny arrives, affirming and refuting the power of choice to smooth the road beyond now."}, {"id": "B00TBSZGO2", "genre": "Science Fiction & Fantasy", "title": "Metal Emissary: A Steampunk Adventure with Muskets, Magic and Mayhem  (Hanover and Singh Book 1)", "description": "Despatched on a secret mission in Central Asia, 22 year old Lieutenant Jamie Hanover encounters hostile tribes, steam-powered robots and djinn in his search for answers regarding the British defeat at Trafalgar.Helped by the strange mystic, Hari Singh, the two men fight side by side in the mountains as they track a strange metal emissary through the infamous Khyber Pass.Following in the emissary’s destructive footsteps Jamie and Hari travel to Adina Pur, where the uncovering of secrets and the culmination of their respective missions demands a heavy price.Metal Emissary is a Steampunk Adventure set in Central Asia in the 1850s, full of weird machines, exotic characters, dust, snow and blood."}, {"id": "B00P09ZOJI", "genre": "Science Fiction & Fantasy", "title": "A Hellion of the Skies", "description": "Lady Sara Worthington went missing once upon a time, leaving a fiancee both searching and pining for her. When he encounters the very woman he has spent years looking for, and she doesn't know who he is, Andrew Rawdon decides its time to get her back, by any means necessary.  A short sexy steampunk tale about airships, pirates, true love and the lengths people go to bring back whats most dear to them."}, {"id": "B01CCCZQQ6", "genre": "Science Fiction & Fantasy", "title": "100 A.Z.: Book 1 - Colorado", "description": "It is 100 A.Z., one hundred years after the zombie outbreak. Ironically, the undead were what ultimately saved humans from utter annihilation. They are now essential to humanity’s survival. Agriculture, transportation, and warfare all use the enslaved undead by exploiting their innate desire for human flesh.But it’s all coming to an end.Once zombies from the original outbreak began perishing, the cartels realized they’d lose the wretched thing giving them power, the tool their civilization was built upon. One powerful cartel leader, Sara Academy, wants out of her family’s business – anything to get away from the rotting stench. She’ll use whatever tactics possible to build a zombie army capable of conquering her target…the beach.In a world where a zombie can be more valuable than a human life, few stand up to protect the innocent, except John Taylor, a man trying to heal his sick wife. His life becomes embroiled in a conflict, though, that engulfs the entire continent in a power struggle costing him nearly everything. 100 A.Z. takes the zombie genre into a new era, revealing the injustice, faith, power struggles, loyalty and self-sacrifice of the world 100 years after the zombie apocalypse.100 A.Z. Book 2: https://www.amazon.com/dp/B01CCCZQQ6"}]