[{"id": "0606230874", "genre": "Children's Books", "title": "The Spooky Scavenger Hunt (Turtleback School & Library Binding Edition) (Dinosaur Train)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. The conductor of the Dinosaur Train, a nocturnal Troodon, leads Mr. Pteranodon, Buddy, and Tiny on a scary ride to Big Pond, where they go on a scavenger hunt designed to let them use all their senses in the dark."}, {"id": "1602701423", "genre": "Children's Books", "title": "In the Horse Stall (Barnyard Buddies Abdo iBooks)", "description": "Self-paced interactive CD teaches young readers about a day in the life of a horse. Easy-to-use, features easy navigation tools to read and listen to."}, {"id": "1947303066", "genre": "Children's Books", "title": "Franny and Pom Pom and the Fruit That Lasts", "description": "Come frolic in the grass with us, alongside the river bank of King’s Valley, as we laugh and learn from Franny Fig, Polly Pomegranate (Pom Pom for short) and their grandmothers, Nana and Rue Rue. If we will only lend them our ears, these lively tree characters will teach us much about God the Father, God the Son, and God the Holy Spirit. The little girl trees ask their ever-wise grandmothers the question all fruit trees need answered, “How do we make fruit?” Listen, and learn, as they get an answer they didn’t expect. Nana and Rue Rue instead answer one of the most important questions we can ever ask. “How do we make sure our lives leave a legacy?” “How do we make FRUIT THAT LASTS?” Perhaps you too will find the answer."}, {"id": "1458775496", "genre": "Children's Books", "title": "Amelia Earhart: Young Air Pioneer", "description": "These true-life tales of aviation pioneer Amelia Earhart, based on the remembrances of her sister Pidge, will inspire and thrill young readers. Kids will cheer as Amelia rescues two neighbor boys from an angry dog and when she builds her own ''rolly coaster' off the roof of her grandparents shed. Amelia's fascination at seeing her first airplane, as well as her curiosity, courage, and determination to learn, will make this portrayal of an American heroine a favorite of both children and adults."}, {"id": "0316012068", "genre": "Children's Books", "title": "Cranium Silly Stories (A Play It Again Book)", "description": "Cranium Silly Stories has everything kids need to create an endless supply of their very own tales - and each one is a hilarious surprise! With wacky word prompts on each die-cut page, all you need to do is fill in the blanks, then flip the page to reveal your customized silly story. You'll tell your own funny fortunes, write a spooky ghost story, and even create invitations for the World's Best Birthday Party. Complete the stories again and again on the write-on/wipe-off pages with the signature erasable Cranium marker, specially packaged for immediate story time fun.With Cranium Silly Stories, the storytelling possibilities are endless!"}]