[{"id": "B07583JK94", "genre": "Children's Books", "title": "Getting Started with the micro:bit: Coding and Making with the BBC's Open Development Board (Make)", "description": "The micro:bit, a tiny computer being distributed by the BBC to students all over the UK, is now available for anyone to purchase and play with. Its small size and low power requirements make it an ideal project platform for hobbyists and makers. You don't have to be limited by the web-based programming solutions, however: the hardware on the board is deceptively powerful, and this book will teach you how to really harness the power of the micro:bit. You'll learn about sensors, Bluetooth communications, and embedded operating systems, and along the way you'll develop an understanding of the next big thing in computers: the Internet of Things."}, {"id": "1515773094", "genre": "Children's Books", "title": "Motorcycles (Transportation)", "description": "Zoom! A motorcycle rider twists the throttle. She zips by. Dirt bikes race on bumpy tracks. Touring motorcycles go on long trips. Give beginning readers a captivating close-up look at motorcycle parts and their favorite types of motorcycles."}, {"id": "0670012084", "genre": "Children's Books", "title": "Obama: The Historic Journey: Young Reader's Edition", "description": "Special Clearance Price of $12.50Including his inauguration as the 44th president of the United States, this beautifully designed book tells the extraordinary story of Barack Obama's life and rise to power in both words and photographs.The young readers hardcover edition is specifically written and designed to appeal to and inspire the 8-12 age group, with age-appropriate text and a different selection of photographs and illustrations from the adult version."}, {"id": "0531222071", "genre": "Children's Books", "title": "Alexander Graham Bell: Setting the Tone for Communication (Getting to Know the World's Greatest Inventors & Scientists)", "description": "Presents the life and accomplishments of the Scottish inventor, whose interest in sound and work with the deaf led to the invention of the telephone."}, {"id": "0679844686", "genre": "Children's Books", "title": "ELMO'S BIG LIFT-AND-", "description": "Sesame Street fans will find hours of interactive fun and learning in this giant, interactive board book with more than 60 sturdy flaps to lift. Elmo and his Sesame Street friends invite girls and boys ages 1 to 3 to learn about numbers, shapes, the alphabet, opposites, and more. Full-color illustrations filled with charming details turn playtime into learning time in colorful scenes of lovable Sesame Street characters in the biggest flap book ever! Toddlers can lift alphabet blocks to find a word beginning with each letter, open doors and windows on Sesame Street to count objects from one to ten, lift flaps that reveal opposites, and help Elmo find his teddy! The sturdy flaps—10 to 26 per double-page spread—are made to stand up to the repeated wear and tear little ones are sure to inflict with lots of lifting, looking, seeking, and finding!"}]