[{"id": "1843153084", "genre": "Children's Books", "title": "Mathematics to A* (GCSE Exam Success File)", "description": "This is the premium exam practice series for GCSE Grade A/ A success. This new limited edition contains full mock exam papers, which provide extensive coverage of the entire GCSE specification. The mock papers are written by chief examiners, who know what is likely to come up in the exams. There are full answers with examiner's tips and the series also contains an exclusive examiner's report revealing how to boost your grade. This series provides essential practice to improve students exam performance."}, {"id": "B01MTAO0NO", "genre": "Children's Books", "title": "Saint Genevieve, Savior of Paris: Real Life Princesses and Heroines (Traditional History for Children Book 4)", "description": "Genevieve was a poor, ordinary girl who became a saint and a great heroine because of her trust in God.  She saved the city of Paris twice from destruction and became the patroness of Paris.  Genevieve is an example of bravery and faith to all people.  This is her story."}, {"id": "B01MXW2JU6", "genre": "Children's Books", "title": "Scarlett and Sam: Escape from Egypt", "description": "One minute, twins Scarlett and Sam are bickering about who's going to read the Four Questions at the Passover seder. The next minute, they've been swept up by Grandma Mina's time-traveling carpet and dumped in the ancient Egyptian desert! And as if being stranded 3,000 years in the past isn't bad enough, they also find their fellow Hebrews suffering in slavery. So they team up with Moses, Aaron, and Miriam to help free the slaves. The future's looking bright! But the story they know so well doesn’t turn out the way they expected..."}, {"id": "081249203X", "genre": "Children's Books", "title": "Switch On, Switch Off (Let's-Read-And-Find-Out Science: Stage 2 (Pb))", "description": "The switch goes up -- the light goes on, The switch goes down -- the light goes off.It seems like magic! It's not -- it's electricity. But how does a light actually work? In this clear and simple book learn all about electricity, how it's produced, and how it can be used. At the end you'll learn how to conduct fun experiments that will let you generate electricity yourself!"}, {"id": "0370324528", "genre": "Children's Books", "title": "You Can Swim, Jim", "description": "A rhyming picture book designed to make children laugh and to instill swimming confidence. Jim can only stand on the edge of the pool while the others are splashing around, until suddenly he falls in1and finds, to everyone's surprise, that he can swim after all."}]