[{"id": "1579657605", "genre": "Children's Books", "title": "Classic Bedtime Stories", "description": "Once upon a time, artist Scott Gustafson set out to illustrate classic stories, fairy tales, and nursery rhymes. Decades later, his immediately recognizable paintings have made bestsellers of Peter Pan,The Night Before Christmas, Classic Fairy Tales, and Favorite Nursery Rhymes from Mother Goose. Now he gives us Classic Bedtime Stories, a lavishly illustrated, oversized collection of some of his favorite tales. Stories such as “Sleeping Beauty,” “Jack and the Beanstalk,” and “Sambha and the Tigers” leap off the page thanks to Gustafson’s exquisite paintings and lively retelling of these classics. “The Lion and the Mouse” and “The Country Mouse and the City Mouse” demonstrate his talent at creating uncanny anthropomorphic characters who keep us smiling even as they teach us about tolerance, diversity, and the Golden Rule.A book that even adults will enjoy reading aloud again and again, Classic Bedtime Stories will keep youngsters of all ages engaged for hours. Gustafson’s unique style makes this a volume to be cherished by children, parents, and grandparents for generations to come."}, {"id": "1575654040", "genre": "Children's Books", "title": "Kylie Kangaroo’s Karate Kickers (Animal Antics A to Z)", "description": "Kylie Kangaroo is ready to let her kicker fly at Koora's karate club. There's just one tricky trickwill Kylie ever learn to break a brick?"}, {"id": "1404810463", "genre": "Children's Books", "title": "The Top Ten Inventors (Crafty Inventions)", "description": "Describes the basic science principles and the history behind many inventions including the printing press, the radio, the locomotive, the electric motor, the telephone, the lightbulb, and the airplane."}, {"id": "B016H4VMYU", "genre": "Children's Books", "title": "Mermaid Books for Kids: Mermaid Magic - Best Friends (Mermaid Magic, Sea Fairy Rescue Book 1)", "description": "Best Friends is the first book in the exciting new Mermaid Magic series, FREE on Kindle Unlimited!Mermaid Magic is an exciting underwater adventure for kids and parents to enjoy!Join Brooke, an adventurous and brave girl, as she discovers that mermaids are living just steps away from her new beach home. The mermaids of Aquatica need Brooke's help to save the sea fairies. When Serena, a mermaid who protects the sea fairies, shows up on Brooke's beach, Brooke can't believe that she can turn into a mermaid too. Find out what happens when Brooke joins Serena under the sea!"}, {"id": "0531086623", "genre": "Children's Books", "title": "Iktomi and the Buzzard: A Plains Indian Story", "description": "In his fifth book, Iktomi the Plains Indian Trickster convinces Buzzard to fly him to a powwow, cannot resist laughing at Buzzard's bald head, and is promptly tipped headfirst into a hollow tree by the offended bird."}]