[{"id": "0766022382", "genre": "Children's Books", "title": "Hanukkah Crafts (Fun Holiday Crafts Kids Can Do)", "description": "Provides information about the origin and customs of Hanukkah, ideas for celebrating this holiday, and directions for making such crafts as a dreidel mobile, holiday cards, and candle candy holders."}, {"id": "0448447886", "genre": "Children's Books", "title": "David Beckham: Born to Play (All Aboard Reading)", "description": "David Beckham\u0097the world-famous soccer star, celebrity, and sports icon\u0097has joined the Los Angeles Galaxy soccer team! As captain of England’s famous soccer team, Manchester United, Beckham singlehandedly scored 85 spectacular goals and became the only English player to score in three World Cups. With an easy-to-follow narrative and actionpacked full-color photos, this book is sure to score with young readers."}, {"id": "1603577475", "genre": "Children's Books", "title": "St. Patrick's Day (Beginning-to-read)", "description": "\"Learn about St. Patrick's Day traditions and symbols, including shamrocks, wearing green, eating corned beef and cabbage, the story of St. Patrick, leprechauns, and more. This title includes reading activities and a word list\"--"}, {"id": "B06W2NBW5R", "genre": "Children's Books", "title": "Cat Soup: A new fairy tale for kids ages 4-6; and those who are kids at heart", "description": "In the kingdom of Bandon, the princess loses her beloved cat! __One day the cat gets trapped in a travelling tinker’s cart and without knowing it, many miles away, the frightened cat jumps out and runs away.  __The princess’s father, the king, will give half his kingdom to the one who finds the cat. __Afar off, the King of Hod sends his son, Gael, out to find the cat, but he is delayed when he finds a cottage in the woods where a pot of soup is boiling. Gael eats it and falls asleep only to be awakened by an ogre. The ogre threatens to kill him, but Gael promises to give the ogre half a kingdom if he will take the prince back to the kingdom of Hod.  __After many misadventures with the ogre, a cat is found. Is it the right cat? Does the ogre get half the kingdom? Does Gael? Or was it all just Cat Soup?  "}, {"id": "B014F6OLVS", "genre": "Children's Books", "title": "Wings of Fire (8 Book Series)", "description": "From Book 1: A thrilling new series soars above the competition and redefines middle-grade fantasy fiction for a new generation!The seven dragon tribes have been at war for generations, locked in an endless battle over an ancient, lost treasure. A secret movement called the Talons of Peace is determined to bring an end to the fighting, with the help of a prophecy -- a foretelling that calls for great sacrifice.Five dragonets are collected to fulfill the prophecy, raised in a hidden cave and enlisted, against their will, to end the terrible war.But not every dragonet wants a destiny. And when the select five escape their underground captors to look for their original homes, what has been unleashed on the dragon world may be far more than the revolutionary planners intended . . ."}]