[{"id": "1481497715", "genre": "Children's Books", "title": "Night-Night, Little Pookie", "description": "Get ready for bed with a little Pookie flair in this slumber time board book from the beloved and bestselling Sandra Boynton.Oh, Pooooooo-kie! It’s time for bed, now. Come out, Little Pookie. Oh, where can you be? It may be bedtime, but Pookie still has a whole night-night routine to finish: picking out pajamas, brushing teeth, washing up, and a little hide-and-seek. With Sandra Boynton’s signature charm and piggy pizzazz, this not-quite-ready-for-bed story proves that every Little Pookie loves a good night’s sleep."}, {"id": "1974294838", "genre": "Children's Books", "title": "Preschool Teachers Are Fantastical & Magical Like A Unicorn Only Better: Thank You Gift For Teacher (Teacher Appreciation Gift Notebook)(8.5 x 11 Composition Notebook)", "description": "Do you need unique teacher gifts under $10?This awesome teacher appreciation gift is a simple 8.5” x 11”, 120 page lined journal notebook that beats a teacher thank you card any day. Let the teacher know how grateful you are and that their hard work is appreciated.These are also great teacher gifts to start the school year off with. You know as a pre-apology for your kids future behaviors. Always good to be prepared when going back to school.These composition notebooks make the perfect:End Of The Year Teacher BooksTeacher Appreciation GiftsTeacher Thank You GiftsFirst Day Of School Teacher GiftComposition Notebook For TeachersBack To School NotebookTeacher’s Planner & JournalScroll up today and give your teacher a gift they will actually use."}, {"id": "1606045377", "genre": "Children's Books", "title": "Smiddychew and Friends", "description": "Equipping children with the tools of strength and wisdom, Judy introduces some colorful characters that embody tools to success. Children will love the dinosaur characters, and you will too!"}, {"id": "140530300X", "genre": "Children's Books", "title": "Olympics (Eyewitness Guides)", "description": "Do you know why athletes used to compete in the nude? Or which country has the most Gold medals? Get in shape for Athens this summer and be an eyewitness to the heroic world of the Olympic Games - the greatest sporting festival in the world."}, {"id": "197431569X", "genre": "Children's Books", "title": "Best Coach Ever: Baseball Coach Gifts (Baseball Notebook Journal)(Baseball Books For Kids)(V22)", "description": "The Best Gift Ever For Baseball CoachesDo you have that special baseball coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your baseball coach will appreciate the thoughtful gift and use it for seasons to come.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any baseball player’s tastes. Great baseball books for kids to give as gifts.Grab your baseball notebook journal today."}]