[{"id": "B00LYPIVJW", "genre": "Children's Books", "title": "How to Tie a Shoe: A Learn to Tie Your Shoes Color Picture Book for Kids", "description": "How to Tie a Shoe is a full color, brightly illustrated Kindle board book featuring step-by-step illustrations of how to tie shoelaces, using the “one loop, wrap around, push through” method.Let your child discover this important part of growing up by simply following the carefully produced illustrations in this color picture board book. Each step in this tying shoes instruction book includes brief text describing the step.Help your child learn how to tie shoes today! Download this book today."}, {"id": "0635022850", "genre": "Children's Books", "title": "Maryland Native Americans", "description": "One of the most popular misconceptions about American Indians is that they are all the same-one homogenous group of people who look alike, speak the same language, and share the same customs and history. Nothing could be further from the truth! This book gives kids an A-Z look at the Native Americans that shaped their state's history. From tribe to tribe, there are large differences in clothing, housing, life-styles, and cultural practices. Help kids explore Native American history by starting with the Native Americans that might have been in their very own backyard! Some of the activities include crossword puzzles, fill in the blanks, and decipher the code."}, {"id": "1614488010", "genre": "Children's Books", "title": "Hungry Hearted Kids (Morgan James Kids)", "description": "Do you feel an internal yearning for something new and better in your life? Does your heart long for self-expression? You are not alone with those feelings, and children can capture emotions with one look in their eyes. You are invited to explore the pages of this book, to not only connect with children around the world but also your own self-awareness.  The majority of photos and content of this book were done by Raelynn Willis while doing volunteer work abroad. Proceeds from the sale of this book will directly benefit Naturopaths International, Dr. Gowey’s 501c3 humanitarian organization (www.naturopathsinternational.org)."}, {"id": "B0113GTAX2", "genre": "Children's Books", "title": "Cheeper: Seasons of Song", "description": "Cheeper is the story of an orphaned baby robin, thrown from his nest in a summer storm and rescued, raised, and released back into the wild by the Brown family. Cheeper’s life gets even better when he meets Lady Robin and starts his adventure south to weather the winter. A sudden and terrible tragedy, however, shatters Cheeper’s rosy, self-centered view of life and forces him to deal with sorrow, loneliness, and pain. What will happen to him? Will he learn the important lessons of dealing with suffering? Will sorrow triumph, or will song? This beautifully illustrated book will warm your heart!"}, {"id": "B01AN5PKOC", "genre": "Children's Books", "title": "We Will Not Be Silent: The White Rose Student Resistance Movement That Defied Adolf Hitler (Jane Addams Honor Book (Awards))", "description": "The dramatic, disturbing story of the small group of university students who dared to distribute leaflets condemning Hitler and his policies. Several paid with their lives. It's also an inspiring story of the profound effect young people can create on a nation's history by taking action based on their fervent beliefs."}]