[{"id": "0375856390", "genre": "Children's Books", "title": "Have You Seen My Dinosaur? (Beginner Books(R))", "description": "How do you find a missing dinosaur who’s large and green and likes to roar? When a little boy’s dinosaur decides to play hide-and-seek, he is surprisingly difficult to track down. Veteran illustrator Joe Mathieu’s dinomite illustrations and Jon Surgal’ s saur-ing verse will have kids roaring with laughter as they romp through this funny rhyming Beginner Book.Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning."}, {"id": "B071CJZYW1", "genre": "Children's Books", "title": "The Good Night Choo Choo", "description": "The Good Night Choo Choo is passing through.  The sun is down for the night and little animals from puppy dogs to ponies pack their dreams and hop on board.  This bedtime story will wind down the day with lulling rhyming verse and playful illustrations.  A read-to-me bedtime story to prepare little ones to say Good Night."}, {"id": "145210249X", "genre": "Children's Books", "title": "A Bear Sat on My Porch Today", "description": "What to do if a rather insistent bear squats on your porch today? Followed in short order by a shaggy squirrel, a spraying skunk, a playful possum, and a bevy of forest critters large and small? This hilarious cumulative tale of reluctant hospitality and generous inclusivity will leave readers chanting, \"OKAY. OKAY! YOU CAN STAY.\" But watch out! That porch is starting to sway. . . .Jane Yolen's uproarious chant-aloud story is brought to life by Rilla Alexander's dazzling retro-hip illustrations in an exuberant collaboration sure to take its place alongside such cumulative classics as This is the House that Jack Built and There Was an Old Lady Who Swallowed a Fly."}, {"id": "1534521763", "genre": "Children's Books", "title": "Triceratops (All About Dinosaurs)", "description": "What did a Triceratops eat? How did it get its name? What kind of habitat did it live in? Readers find the answers to these questions and many more as they explore the exciting world of the Triceratops. Vibrant computer-generated images take readers back in time, helping them visualize these popular dinosaurs and their surroundings. These detailed images accompany simple, accessible text filled with fun facts about a common curriculum topic. Informative fact boxes and diagrams provide additional information for readers who want to become Triceratops experts."}, {"id": "B00HNXC3RU", "genre": "Children's Books", "title": "#09 Lizard Loopy (S.W.I.T.C.H.)", "description": "The mad scientist Petty Potts has a crazy new formula—a spray that can turn Josh and Danny into lizards! The boys immediately give themselves a spritz and whizz up the nearest tree. But soon, they find themselves in deep doo-doo and surrounded by owls that eye them as snacks. Will Josh and Danny make it out in time?"}]