[{"id": "B01MUB7WS6", "genre": "Science Fiction & Fantasy", "title": "Appendix N: The Literary History of Dungeons & Dragons", "description": "APPENDIX N: The Literary History of Dungeons & Dragons is a detailed and comprehensive investigation of the various works of science fiction and fantasy that game designer Gary Gygax declared to be the primary influences on his seminal role-playing game, Dungeons & Dragons. It is a deep intellectual dive into the literature of SF/F's past that will fascinate any serious role-playing gamer or fan of classic science fiction and fantasy.Author Jeffro Johnson, an expert role-playing gamer, accomplished Dungeon Master and three-time Hugo Award Finalist, critically reviews all 43 works and authors listed by Gygax in the famous appendix. In doing so, he draws a series of intelligent conclusions about the literary gap between past and present that are surprisingly relevant to current events, not only in the fantastic world of role-playing, but the real world in which the players live."}, {"id": "B01N0OASDN", "genre": "Science Fiction & Fantasy", "title": "Destroyermen (12 Book Series)", "description": "From Book 1: Pressed into service when World War II breaks out in the Pacific, the US Walker—a Great War-era destroyer—finds itself retreating from pursuing Japanese battleships. Its captain, Lieutenant Commander Matthew Patrick Reddy, desperately leads the Walker into a squall, hoping it will give them cover—only to emerge into an alternate world. A world where two species have evolved: the cat-like Lemurians and the reptilian Griks, and they are at war. With its power and weaponry, the Walker's very existence could alter the balance of power. And for Reddy and his crew, who have the means to turn a primitive war into a genocidal Armageddon, one thing becomes clear. They must determine whose side they're on. Because whichever species they choose is the winner. "}, {"id": "B01D3Y2SKY", "genre": "Science Fiction & Fantasy", "title": "Abducted: Escape From Kraile (Abducted Series Book 1)", "description": "After discovering two aliens trying to milk a cow in his Grandfather's barn, thirteen year old Luke Summers is abducted. Scared out of his wits, he soon realizes that the aliens, Simon and Leonidas, don't mean him any harm… huge relief.Instead, after injecting Luke with nano-translators so he can understand them, they tell him that his parents, both astronauts who were pronounced dead during a failed mission to Mars, are still alive... and they need his help to rescue them from an evil spider-alien dictator named Drac Moor.There’s just one itsy bitsy catch. Luke will first need to be “reconditioned” so that he can withstand the harsh alien atmospheres that he’ll be subjected to. Oh… and it’s probably going to hurt a little.Follow along as Luke stumbles through one disaster after another, in an attempt to pull off a daring prison break and free his parents before it’s too late."}, {"id": "1503953157", "genre": "Science Fiction & Fantasy", "title": "Nightblade's Honor (Blades of the Fallen)", "description": "In the riveting sequel to Nightblade’s Vengeance, the nightblades must choose a side, and the Kingdom will either rise again…or shatter into pieces.With the realm on the brink of war, the once-celebrated blades have become an easy target for the rage of its devastated citizens. The nightblade warrior Asa’s lifelong quest for vengeance is over, but now she finds herself on the run from the people she sought to protect. As Asa forges a new course of action in an uncertain world, her path crosses with that of a young noblewoman.Mari knows that great opportunity lies in the heart of chaos. If the Kingdom is to rise again, Mari will need support, and she can think of no group better than the nightblades. But the nightblades have been betrayed before, and gaining their trust will not be easy.Mari wants to save the Kingdom. Asa wants to save the people. Both are willing to risk everything. But do their quests make them allies… or enemies?"}, {"id": "B072BC3G58", "genre": "Science Fiction & Fantasy", "title": "2017: The Last President", "description": "When Russell finally accepts that he has escaped the purging of humanity from the city, he hunkers down in an abandoned house in a suburb far from the city’s center. In the mess left behind, managing for his day-to-day needs occupies every waking hour. When he accidentally encounters someone else doing the same, he sets out to discover who it is that is trapped in a situation not dissimilar to his own.The world he’s known may be no more, but Russell has a plan, and so far, he’s very happy with it. He has a roof over his head. He’s got the goods. He’s got the girl. His plan appears to be working. Then a wrench and a stranger are thrown into the mix, and it’s anybody’s guess as to who will eventually win to save the day and the relationship in a new and unforgiving land."}]