[{"id": "1927083117", "genre": "Children's Books", "title": "The Spirit Trackers", "description": " Cousins Will and Tom have always wanted to become Trackers just like their uncle.  While spending time with Uncle he shares the story of the Windigo with the boys. A story that seems to be coming true when Will and Tom hear strange noises outside of their bedroom window. And then they find the huge tracks in the snow. It has to be the Windigo - the Wandering Night Spirit of Winter!  And the boys know what good trackers would do so they follow the trail deep into the dark forest to uncover the mystery.  Young readers will be able to improve their tracking skills as they find clues hidden in the illustrations along with Will and Tom. "}, {"id": "0241316146", "genre": "Children's Books", "title": "The Tale of Peter Rabbit - Ladybird Readers Level 1", "description": "Peter Rabbit goes in the farmer's garden for some radishes. Then, the farmer sees him! Can the farmer catch Peter? Ladybird Readers is a graded reading series of traditional tales, popular characters, modern stories, and non-fiction, written for young learners of English as a foreign or second language. Beautifully illustrated and carefully written, the series combines the best of Ladybird content with the structured language progression that will help children develop their reading, writing, speaking, listening and critical thinking skills. The six levels of Readers and Activity Books follow the CEFR framework and include language activities that provide preparation for the Cambridge English: Young Learners (YLE) exams. The Tale of Peter Rabbit, a Level 1 Reader, is Pre-A1 in the CEFR framework and supports YLE Starters exams. Short sentences contain a maximum of two clauses, using the present tense and some simple adjectives."}, {"id": "0803731876", "genre": "Children's Books", "title": "Sweethearts of Rhythm: The Story of the Greatest All-Girl Swing Band in the World", "description": "In the 1940s, as the world was at war, a remarkable jazz band performed on the American home front. This all-female band, originating from a boarding school in the heart of Mississippi, found its way to the most famous ballrooms in the country, offering solace during the hard years of the war. They dared to be an interracial group despite the cruelties of Jim Crow laws, and they dared to assert their talents though they were women in a ?man?s? profession. Told in thought-provoking poems and arresting images, this unusual look at our nation?s history is deep and inspiring."}, {"id": "B00PG2B3MG", "genre": "Children's Books", "title": "Luciano and His Sunshine Boots", "description": "Luciano loves his yellow puddle-stomping boots. Everyone he meets loves them too! Luciano's Sunshine Boots help him feel better when he's sick. When Luciano's brothers discover a way that everyone can have a pair of Sunshine Boots, they bring hope and happiness to people everywhere."}, {"id": "1612441750", "genre": "Children's Books", "title": "Who Could You Be at the Zoo?", "description": "Zaring uses rhyme and repetition to help children imagine what it would be like to become an animal at a zoo.  This book takes children on a personal journey, allowing them to not only witness the animals in their habitat, but also to gain the animal's perspective.  Barlup's illustrations encourage children to \"act out\" the descriptions as they are read.  Let your child's imagination run wild!"}]