[{"id": "074600978X", "genre": "Children's Books", "title": "The Usborne Book of Science Activities, Vol. 2", "description": "-- Basic scientific principles are explained with the aid of fun experiments and activities-- All experiments use everyday household equipment-- Simple text and illustrations enable children to use the books by themselves"}, {"id": "B00G3I5IJ6", "genre": "Children's Books", "title": "Charlie and Joe", "description": "This story takes place on the beautiful Oregon Coast. It is about the friendship between an Otter and a baby Tabby Cat. It is amazing who you can become friends with if you look past the differences. This story has a message that even the most unlikely characters can be friends if you just give them a chance."}, {"id": "B01H0OOJWI", "genre": "Children's Books", "title": "Amazing Pictures and Facts About Hedgehogs: The Most Amazing Fact Book for Kids About Hedgehogs", "description": "Kid’s U Presents...Hedgehogs - Amazing Pictures and Facts about Hedgehogs.  Have your children ever wondered what a hedgehog looks like? Where do hedgehogs live? What do they eat? In this book you will explore the wonderful world of hedgehogs, finding the answers to these questions and so many more. Complete with incredible pictures to keep even the youngest of children captivated, you will all embark on a little journey into the great unknown.  In school our children aren’t taught in a way that makes them curious and want to learn. I want to change that!  This book will show your children just how interesting the world is and help ignite a passion for learning.  Your children will learn how to:    Become curious about the world around them.   Find motivation to learn.   Use their free time to discover more about the world-and have fun while doing so!   And much more! "}, {"id": "1400071569", "genre": "Children's Books", "title": "Martyr's Fire: Book 3 in the Merlin's Immortals series", "description": "Will this dangerous quest lead the outcast Orphan King toward an ancient secret—or to certain destruction? Posing as a beggar, Thomas escapes Magnus after fifteen men, who are calling themselves the Priests of the Holy Grail, arrive and take control of the castle through wondrous acts and apparent miracles. With the help of his longtime friend Gervaise, Thomas sets out on a journey that leads him to the ancient Holy Land. Unaware that Katherine and Hawkwood are watching over him, Thomas is tested in his beliefs and comes face to face with the ancient power that the Merlins and Druids have long been searching for. Enter the world of Merlin’s Immortals, where ancient secrets and evil conspiracies take you on a breathless adventure of discovery, intrigue, and hidden knowledge. "}, {"id": "0374347921", "genre": "Children's Books", "title": "Manjiro: The Boy Who Risked His Life for Two Countries", "description": "In 1841, Japan had been closed to the outside world for 250 years, and anyone who tried to return to the country after leaving it could be executed. So when the small fishing boat on which fourteen-year-old Manjiro was working was shipwrecked, he despaired of ever returning to his village. The captain of the American whaling ship that rescued Manjiro took a special interest in him, inviting him to come live in Massachusetts. There, Manjiro was treated like Captain Whitfield's son, and he began to feel as though Massachusetts was his second home. Still, he never gave up his dream of finding a way to return to Japan and see his mother again. Watercolor illustrations bring to life the true story of a determined and resourceful young man whose intimate knowledge of two cultures later led him to play an important role in the opening of Japan to Western trade and ideas. Manjiro is a 2009 Bank Street - Best Children's Book of the Year."}]