[{"id": "0310700388", "genre": "Children's Books", "title": "The 12 Days of Christmas: The Story Behind a Favorite Christmas Song (Traditions of Faith from Around the World)", "description": "Discover the Christian truth concealed in the familiar carol The 12 Days of Christmas. In this beautifully illustrated book, you'll learn the history of the twelve days between Christmas and Epiphany (January 6th) and the commemoration of the gifts given on each day. The story is told that during a time when the Church of England forbid any teaching of Christ other than their own, many parents who refused to join the church also used the song to teach their children in secret. Now you and your child, age four to eight, can uncover the meaning of this beloved song as you learn the wonderful story of Christ redemption for all of us. Through imaginative and innovative products, Zonderkidz is feeding young souls."}, {"id": "1981486569", "genre": "Children's Books", "title": "Merry Christmas Curtis - Xmas Activity Book: (Personalized Children's Activity Book)", "description": " Merry Christmas Curtis is a personalized kids activity book, it includes personalized crosswords, word searches, number puzzles, jokes, drawing and coloring  >It is suitable for children between 6-11 years old   It is a unique Christmas present for Curtis, and is the perfect gift this Xmas  This personalized book is also available for other names This is a great gift for children and an amazing keepsake for parents"}, {"id": "0975428039", "genre": "Children's Books", "title": "2: Dance Praise Expansion Pack: Hip-hop/Rap", "description": "Dance Praise, the best-selling interactive dance game with top Christian hits, is now even more fun with this Expansion Pack containing 35 new Hip Hop and RAP tracks. With 3 dances per track, that's over 100 new dances for hours of exercise and enjoyment. Onscreen lyrics reinforce Christian values. The hip beat will appeal to teens and adults alike. Requires Dance Praise or Dance Praise 2 -the ReMix and up to 4 interactive dance pads.For ages 4 and up."}, {"id": "B005Q5ZF90", "genre": "Children's Books", "title": "Cromwell Dixon's Sky Cycle", "description": "In the years and decades following the Wright Brothers' famous first flight, an obsession with aviation gripped the nation. Thousands caught the bug. In an era of innovation and invention, scores of people pursued their own personal dreams of building a flying machine, and many did so right in their own backyards. Few stories, though, are as remarkable as that of Cromwell Dixon, a fourteen-year-old boy who successfully designed, built and flew what he dubbed his \"Sky-Cycle\" - literally a flying bicycle, that he could fully steer, and that he flew thousands of feet in the air."}, {"id": "B0768TJ9R6", "genre": "Children's Books", "title": "100+ Witch Jokes for Kids (Clean Fun for the Whole Family)", "description": "This book is full of clean, family-friendly, funny jokes about witches.  It's child appropriate and Halloween spirited, not mean spirited.  All the jokes are appropriate for all ages. Early and beginning readers will be able to read most jokes on their own. Colorful pictures sprinkled throughout the book break up the walls of text that could intimidate a young reader and serve as an easy way for mom or dad to pick a stopping point. \"Let's just read until we reach the next picture.  What do you think it will be?\" Sample jokes: What do you get if you cross a dinosaur with a witch?Tyrannosaurus hex.What do you get if you cross a flea and a witch?Very worried dogs.**Kindle Unlimited and Amazon Prime members can read for free.**"}]