[{"id": "1909290815", "genre": "Children's Books", "title": "Around the World Weather: Fun Rounded Board Book", "description": "It's never too early to go global and learn about our amazing planet. This charming book gently introduces children to all sorts of worldwide weather, and to the animals that thrive in it in a variety of habitats. The repeated search-and-find \"Can you see what I saw?\" line encourages even the youngest reader to get involved and interact. Before you know it, your little pre-schooler will have a wealth of weather know-how. So, zoom around the world with your binoculars and see what you can spot together. From snowstorms to thunderstorms, heatwaves to whirlwinds - a whole world of wild weather is waiting for you. This fun board book is perfect for little globetrotters with a thirst for adventure. Other titles in the series include Around the World Animals and Around the World Places. Suitable for children aged 2 plus."}, {"id": "0689873751", "genre": "Children's Books", "title": "The Day Ray Got Away", "description": "Ray is a parade balloon who longs to float far above the crowd, no strings attached. It’s his dream to fly on his own, though circumstances always seem to tie him down. But Ray is determined to achieve his goal, and with persistence and determination he manages to break free and soar through the skies. Readers will cheer for Ray’s triumph and delight in the joyful parade scenes—you’ll never look at a parade balloon the same way again!"}, {"id": "0780708474", "genre": "Children's Books", "title": "Hank the Cowdog and Monkey Business (Hank the Cowdog (Pb))", "description": "Hank apprehends a large red box bearing a mysterious label: WARNING! MONKEY! DO NOT OPEN THIS BOX! The goods consist of nothing less than the Pasha of Shizzam, a bizarre little monkey willing to answer to Hank's beck and call. Or is he? "}, {"id": "1592987133", "genre": "Children's Books", "title": "Wakanda Whooper: The Curious Cinnamon Crane", "description": "Here is a magnificently illustrated story of one whooping crane, Wakanda, who, through her curiosity and questions to her parents, shares the story of an incredible species being saved by caring biologists. This delightful, educational children's chapter book takes place in central Wisconsin's Necedah National Wildlife Refuge, the starting place of the new eastern flyway to southern wildlife refuges in Florida. Whooping cranes, the tallest birds in North America, came so near extinction that Wakanda Whooper offers an incredible story of survival. With seventeen cranes left in the wild by the 1940s, humans finally came to their rescue in 2001 at the eleventh hour. The effort continues to this day. Included in this 72-page book are many full-page illustrations, multiple hands-on activities, a glossary, and crane trivia pages. Through this story, the author hopes young people will be inspired to care for and help save our environment with its beautiful and varied species."}, {"id": "1426310471", "genre": "Children's Books", "title": "National Geographic Readers: Weird Sea Creatures", "description": "Did you know that the deep-sea anglerfish has a glowing fishing rod attached to its body, or that the barreleye fish has a see-through head? See these wacky creatures and more in this brilliantly illustrated book that explores the strangest creatures under the sea. This level two reader uses easy-to-grasp language that will keep children intrigued and learning on every page.This high-interest, educationally vetted series of beginning readers features the magnificent images of National Geographic, accompanied by texts written by experienced, skilled children's book authors. The inside back cover of the paperback edition is an interactive feature based upon the book. Level 1 books reinforce the content of the book with a kinesthetic learning activity. In Level 2 books readers complete a Cloze letter, or fun fill-in, with vocabulary words.Releases simultaneously in Reinforced Library Binding: 978-1-4263-1048-5 , $13.90/$15.95 Can"}]