[{"id": "0595282075", "genre": "Science Fiction & Fantasy", "title": "1: The Princess and the Prophet: Guardians of the Light, Volume One", "description": "The Princess and the Prophet launches Thomas Henry Quell's new sci-fi trilogy, Guardians of the Light. In the series opener, Quell serves up a fast moving action-adventure tale set in the 28th century, upon a world fifteen thousand light years from Earth. Commander Vernon Shaffer of the Starship Santa Maria battles sword-swinging religious fanatics under the double suns of the planet Abith in search of a priceless techno-access key known as the Crystal Cube. This white-hot story weaves together sci-fi and fantasy, psionic wizardry and deep space battles, with a cast of unforgettable characters. To research his novel, Quell explored European dungeons, climbed castle walls, poured over astronomical texts and Hubble telescope images, and attended WICCA meetings. The result is a sci-fi thriller sizzling with action and great characters. If you're looking for humor, romance and high adventure, The Princess and the Prophet will take you there faster-than-light."}, {"id": "B0079V5CME", "genre": "Science Fiction & Fantasy", "title": "The Dragon Who Loved Me", "description": "New York Times and USA Today best-selling author G.A. Aiken is widely celebrated for her compelling Dragon Kin series. In The Dragon Who Loved Me, Rhona the Fearless, first daughter of a proud warrior family, resents that she's not respected for her battle prowess by the male Northland dragons. But when one barbarian dragon becomes enamored with her, she begins to relish her influence over him."}, {"id": "1503183688", "genre": "Science Fiction & Fantasy", "title": "The Measure of Temperance (The Adventures of Ichabod Temperance) (Volume 6)", "description": "“...Moan...” “Are you well, Mr. Temperance?” “Hunh? Oh, yes, Ma'am, Miss Plumtartt, Ma'am, it's just that since we find ourselves stranded on this voodoo-drenched Carribean island, I thought it might be a good idea to practice acting like a mobile corpse, cause it's looking like we are up to our armpits in dead folks walking. My suspicion is that they're wanting to snack on our gray matter.” “Indeed, Mr. Temperance, for I fear that if you, I, and our compatriots are not successful on this escapade, the entire planet could be threatened by cadaver cataclysm, eh hem?” “Yes, Ma'am, Miss Plumtartt, Ma'am, and don't let the singing and dancing fool you. This here adventure is full of scary circumstances, Ma'am, and that's a fact!”"}, {"id": "0060590327", "genre": "Science Fiction & Fantasy", "title": "Fool: A Novel", "description": "“Hilarious, always inventive, this is a book for all, especially uptight English teachers, bardolaters, and ministerial students.” —Dallas Morning NewsFool—the bawdy and outrageous New York Times bestseller from the unstoppable Christopher Moore—is a hilarious new take on William Shakespeare’s King Lear…as seen through the eyes of the foolish liege’s clownish jester, Pocket. A rousing tale of “gratuitous shagging, murder, spanking, maiming, treason, and heretofore unexplored heights of vulgarity and profanity,” Fool joins Moore’s own Lamb, Fluke, The Stupidest Angel, and You Suck! as modern masterworks of satiric wit and sublimely twisted genius, prompting Carl Hiassen to declare Christopher Moore “a very sick man, in the very best sense of the word.”"}, {"id": "162378283X", "genre": "Science Fiction & Fantasy", "title": "2011 Non-Series Titles (2011-2016)", "description": "Collector's edition available for a limited time in celebration of the five year anniversary of the launch of Lizzyland. Includes all three non-series titles released in 2011: \"The Warlord's Secret,\" \"Maddy's Oasis,\" \"A Demon's Desire.\" The Warlord's Secret A queen with a secret ... Rissa, the tormented Warlord of Tiyan, struggles to protect her people and Tiyan's magical springs against enemies and traitors within her own walls. She must also safeguard the secret of Tiyan's magic and the source her ultimate doom: the parasitic demon lurking within her, which has awoken to kill her as is tradition every generation of ruler. Maddy's Oasis With an ill mother in need of expensive surgery, Madeleine flies from NYC to the west Texas desert to take on the doomed Desert Oasis resort project in hopes of earning the bonus attached to finishing it on schedule. She soon finds there's only one thing hotter than the desert sun: Jake, the infuriating Texan whose dislike of the fast-paced city puts them at odds at everything. A Demon's Desire Emma crossed paths with a black witch in an ill-fated love triangle that ended in Emma fleeing and the death of the man they both loved. Two years later, the witch is seeking revenge. Emma turns to the only person who can help her: a man rumored to be half-demon with the power to control the shadows. Tristan agrees to help her lift the curse on her family but isn't prepared for what he uncovers. "}]