[{"id": "1947118900", "genre": "Children's Books", "title": "If You Were Me and Lived In... Renaissance Italy: An Introduction to Civilizations Throughout Time (If You Were Me and Lived In... Historical)", "description": "Join Carole P. Roman and travel through time to visit the most interesting civilizations throughout history in the first four books of her new series. Learn what kind of food you might eat in Florence, Italy, the clothes you wore in the 15th century, what your name could be, and what children did for fun. If You Were Me and Lived in...does for history what her other award-winning series did for culture. So get on-board this time-travel machine and discover the world through the eyes of a young person just like you."}, {"id": "0340409126", "genre": "Children's Books", "title": "Greedy Zebra (African Animal Tales)", "description": "When the animals discovere a cave full of furs and skins, they discarde their drab skins for glossy new ones. Greedy zebra, arrives late, after a delicious snack, only to find a few stripes of black cloth. He squeezes into them but Greedy Zebra iis too big for them and his new coat bursts open!The story of how all the animals chose their clothing, except for Greedy Zebra, who had to take the left-over pieces . . ."}, {"id": "073686427X", "genre": "Children's Books", "title": "Pirate Ships: Sailing the High Seas (The Real World of Pirates)", "description": "Presents different types of pirate ships and their features, how they were obtained, their uses and care, and some of the famous pirates who used them."}, {"id": "B007TXDJJU", "genre": "Children's Books", "title": "#1 Escape from Planet Yastol (Way-Too-Real Aliens)", "description": "Josh Higgins loves to make up stories about other planets. At least he thought he was making them up. After Josh publishes his first book, sinister blue aliens visit Earth! Josh quickly learns that the worlds he wrote about in his stories are way too real.The outer space thugs take Josh and his kid sister Maggie all the way to the desert planet Yastol. And when Josh and Maggie refuse to aid the blue guys, a chase begins across Yastol's harsh landscape.Will the help of the planet's brave Prince Izor be enough to save Yastol from the bad blue aliens? Or will the planet's many dangers finish off Josh and Maggie first?"}, {"id": "1910512605", "genre": "Children's Books", "title": "Hanukkah (Festivals Around the World)", "description": "Learn about the diverse and vibrant festivals that are celebrated around the world. This series encourages children to consider religious beliefs and cultural practices via easy to read text and informative, full color images."}]