[{"id": "1524718602", "genre": "Children's Books", "title": "Runaway Baby Brother", "description": "Chick and his baby brother are back in this sequel to Katy Hudson's rollicking barnyard adventure, Runaway Egg!Now that Chick's baby brother is officially hatched (and no longer just a two-legged egg sprinting around the farm), Chick is discovering that the hassle of babysitting was just the tip of the iceberg -- the little guy just won't leave Chick alone! Try as he might, Chick just can't shake his brother, who adoringly waddles wherever he goes. But perhaps having his brother close by will prove to be a good thing in the end...Katy Hudson's sequel to Runaway Egg is as heartwarming and hilarious as the original, and will surely find a place in the hearts of big and little siblings."}, {"id": "1783443839", "genre": "Children's Books", "title": "Spooky Night! (The Not so Little Princess)", "description": "Princess Rosie is woken in the night by a very strange noise. Just what could it be?Together with her best friend Ollie she goes on a hunt round the royal castle to find out. It's going to be a very spooky night!"}, {"id": "B00GIRTGO0", "genre": "Children's Books", "title": "#2 Escape from Pyramid X (Twisted Journeys ®)", "description": "The mummies of Pyramid X are on the move—against you! How will you escape? Every Twisted Journeys® graphic novel lets YOU control the action by choosing which path to follow. Which twists and turns will your journey take?"}, {"id": "0736864784", "genre": "Children's Books", "title": "Alexander Graham Bell and the Telephone (Inventions and Discovery)", "description": "Tells the story of how Alexander Graham Bell came up with the telephone, and how his invention changed the way people communicate. Written in graphic-novel format."}, {"id": "174285057X", "genre": "Children's Books", "title": "The Cat Who Liked Rain", "description": "This is the story of young Lucas who gets a most precious present for his birthday, a black kitten which he calls Night. Lucas becomes very attached to Night but one day Lucas comes home from school and discovers that his beloved cat has disappeared. He is desperate and no one is able to console him. He searches for Night everywhere and doesn’t stop hoping for his return. It’s only sometime later that Night appears in his dreams and tells him that he had to leave to see the world, just as Lucas will do one day when he has grown up. A wise, gentle and moving story unlike anything Mankell has ever written."}]