[{"id": "1575252538", "genre": "Children's Books", "title": "Plays for Learning : Israel Reborn: Legends of the Diaspora and Israel's Modern Rebirth for Grades 4-6 (Young actors series)", "description": "Twelve original plays drawn from the flowering of Jewish culture during the Diaspora and the modern rebirth of Judaism worldwide—tales of Hasidic wit and wisdom, Midrash and Haggadah stories, legends of the Kaballah, Sephardic and Ashkenazic and more."}, {"id": "B00SP4C9SE", "genre": "Children's Books", "title": "21 Cats", "description": "A fully illustrated children's book that introduces readers to twenty-one adopted cats. The amount of character these cats have are as fun and colorful as the illustrations! All proceeds are donated to Animalhouses Pet Rescue, a 501 (c3) charity."}, {"id": "1938092074", "genre": "Children's Books", "title": "Mommy Tell Me About Heaven", "description": "Mommy, Tell Me About Heaven was inspired in 2003 by Dana’s youngest of four sons, Marshall.  While the two were riding in the car he asked her to tell him about heaven.  Dana quickly pulled the car over and wrote a little poem God put in her heart.  Marshall was not only satisfied with the rhyming response but it became his most cherished bedtime ritual for months.  It wasn’t until years later that longtime family friend Michelle Morse brought the words to life through vivid illustrations.  By bringing this inspired book to print, the author prays heaven would become a very real place to children.  Through receiving the free gift of God’s grace they can look forward to living for eternity with Jesus Christ."}, {"id": "8497646436", "genre": "Children's Books", "title": "Atlas histórico de las tierras santas (Atlas históricos)", "description": "This collection provides an in-depth look at some of the most provocative civilizations and religions in history. With photographs, maps, and colored illustrations this text provides an understanding of the politics and culture of ancient civilizations, and the origins of world religions.Con un texto atractivo, mapas, fotgrafías e ilustraciones, esta colección descubre la profunidad de algunos de los espisodios mas transcendentes de la humanidad. Estos libros se adentran en los antiguos politícos y las culturas de Grecia, de Roma y de las civilizaciones precolombianas y descubren con un riguroso tratamiento histórico el origen y significado de las religiones, del Islam y de los lugares biblicos."}, {"id": "B0012NXJWA", "genre": "Children's Books", "title": "The Bremen Town Musicians", "description": "This is the classic tale of four beleaguered animals—a donkey who can no longer work, a hound who can no longer hunt, a cat who’s too old to chase mice, and a rooster who’s scheduled to become dinner—who decide to run off to be musicians in the town of Bremen. But they get more than they bargained for when they stumble upon a frightful gang of robbers. Maybe they can find a clever way to turn their dreadful singing to their advantage in this wittily illustrated book that’s sure to appeal to Ms. Zwerger’s many fans."}]