[{"id": "0062367013", "genre": "Children's Books", "title": "Warriors #6: The Darkest Hour (Warriors: The Prophecies Begin)", "description": "The sixth book in Erin Hunter’s #1 nationally bestselling Warriors seriesJoin the legion of fans who have made Erin Hunter’s Warriors series a bestselling phenomenon. More thrilling adventures, epic action, and fierce warrior cats await in Warriors #6: The Darkest Hour.The time has come for Fireheart—now Firestar, leader of ThunderClan—to face his destiny. Tigerstar’s sinister ambitions have brought the whole forest to the brink of a terrible and deadly battle. Now prophecies will unfold, and heroes will rise…. "}, {"id": "1585955167", "genre": "Children's Books", "title": "My Favorite Advent & Christmas Activity Book", "description": "The Advent and Christmas seasons are a mysterious and exciting time for children. To help them remember the real “reason for the season,” popular author Jenny Erickson has prepared some simple, delightful activities for My Favorite Advent and Christmas Activity Book. In addition to Advent and Christmas, she offers activities and prayers for the New Year, the feast of the Holy Family, and Epiphany. Children will enjoy the riddles, mazes, coloring pages, crosswords, crafts, and more. At the same time they will learn about seasonal symbols, traditions, prayers, and important events in Scripture. Catechists can use the reproducible pages as part of their lessons, to introduce, reinforce, or review important aspects of the Advent and Christmas seasons. Families can use the book to celebrate these seasons together in an enjoyable and meaningful way. My Favorite Advent and Christmas Activity Book is a wonderful, “star-lit” resource for bringing the seasons into your religion sessions in class or at home."}, {"id": "1402706723", "genre": "Children's Books", "title": "Sign Language for Kids: A Fun & Easy Guide to American Sign Language", "description": "From the ABCs and the “1-2-3s” to full sentences, this fun guide, illustrated with photos of children signing, teaches youngsters all the basics of American Sign Language (ASL). They’ll start with the alphabet and counting, and move on to vocabulary for family, pets, and the home; things at school; days of the week; colors; favorite foods; sports and hobbies; and much more. Often, a sentence accompanies the sign, so that kids can grasp the use of verbs and other parts of ASL grammar. There are even explanations of how to change a statement into a question just by changing your facial expression. Now, even hearing kids can communicate easily with deaf friends or family members and have secret conversations whenever they want."}, {"id": "B01N6YULD8", "genre": "Children's Books", "title": "The Dark Hunger", "description": "Humans coexist with a species blessed with abilities known as the Gifted, a race the humans voted out of society several years ago. Aaron Harker has to keep his dark urges a secret if he's to stay on the right side of the fence, but doing so is about to become harder as he’s set to become a Gespiator – one entrusted to Keep the Peace. Aaron knows he isn’t human, but what he doesn’t realise is he’s not a Gifted. He’s something entirely different – a Reaper; a being that requires the life essence from others in order to survive. The Dark Hunger; a curse to deal with in a time when being different means survival is not a certainty."}, {"id": "142631504X", "genre": "Children's Books", "title": "National Geographic Kids Just Joking 5: 300 Hilarious Jokes About Everything, Including Tongue Twisters, Riddles, and More!", "description": "The fifth book in this successful series delivers 300 new laugh-out-loud knock knocks, question-and-answer jokes, tongue twisters, and more! Another sure-fire winner, guaranteed to tickle the funny bone of kids everywhere! National Geographic Kids Just Joking 5 is packed with 300 more of the silly jokes that kids love paired with photos of laughing animals and funny people. Featuring National Geographic Kids' signature square trim size and candy-colored palette, this hilarious party-starter is perfect for tossing into a backpack to share with friends at school or camp."}]