[{"id": "1909263915", "genre": "Children's Books", "title": "Smart About Sharks", "description": "It’s time to learn about the sea’s most feared (and most misunderstood) residents: sharks!Owen Davey returns to nonfiction to explain the mysteries of those denizens of the deep. Some deadly, some not-so-deadly, and almost all just generally misunderstood. Exciting and detailed illustrations fill the page and educate young readers about these thrilling residents of the sea! Delivering information with the same whimsical text and brash illustration that saw his previous book win the affection of the Wall Street Journal, Smart About Sharks is sure to have teeth!Owen Davey is a freelance illustrator, living and working out of Leicester, United Kingdom. He graduated with a First Class BA in Illustration from Falmouth University. Davey's work has been published in every continent (except Antarctica), including picture books in the United Kingdom, America, Australia, Germany, France, Portugal, China, and Korea. He has worked for some impressive clients, including the New York Times, Microsoft, and Orange. This is his first book about sharks."}, {"id": "0792271793", "genre": "Children's Books", "title": "Remember World War II: Kids Who Survived Tell Their Stories", "description": "Remember World War II: Kids Who Survived Tell Their Stories allows readers to understand the war not as seen through the eyes of soldiers but through the eyes of children who survived the bombings, the blackouts, the hunger, the fear, and the loss of loved ones caused by the war. The author shares her own recollections of being able to see the faces of Japanese pilots as they headed for the naval base at Pearl Harbor to drop their deadly bombs on unsuspecting American ships and soldiers, then shares her feelings at having to leave her father behind as the rest of the family is evacuated to the U.S. mainland."}, {"id": "B009R93D3Q", "genre": "Children's Books", "title": "14 Days to Midnight (The Bradford Family Adventures Book 7)", "description": "When you have your heart set on something, a substitute just won’t do! Yolanda Bradford wanted the dog.  Not just any dog, but one dog: a beautiful black Newfoundland.  When she saw it picked up by the dogcatcher, she knew she wanted that dog.  But dreams like that seldom come true.  Such valuable dogs are not often left unclaimed in a dog pound.  Yolanda’s family tried to help her face that fact, but she didn’t want to think about it.  She wanted that dog.  As her two-week wait came to an end, she learned there was a claim on the dog.  Not from the owner, but from someone like Yolanda.  Someone who knew the dog was at the pound.  Someone else who was waiting for the required fourteen days.  And that claim was dated one day earlier than Yolanda’s. Was it real? Was Yolanda’s cause hopeless? And why was she sneaking around the pound at midnight?  Find out in 14 Days to Midnight, number 7 in the Bradford Family Adventures series."}, {"id": "1338047035", "genre": "Children's Books", "title": "This is THE Day!", "description": "Right now is the moment.It's yours! Don't delay!Step into the sunshine.Yes, THIS IS THE DAY!Every day is a day to celebrate and find hope in this colorful, creative storybook inspired by Psalm 118:24. With joyous rhymes and colorful illustrations of all kinds of children, find the beauty and wonder of every moment of the day -- and learn that you can make the world even more glorious, too!A jubilant, inspirational reminder to seize the opportunities of the day that God has made just for us by bestselling author Amy Parker and illustrator Leeza Hernandez."}, {"id": "0516228544", "genre": "Children's Books", "title": "Laura Bush (Rookie Biographies)", "description": "An introduction to the life of the former Texas librarian and teacher who, as the wife of the forty-third president, became first lady in 2001."}]