[{"id": "071661734X", "genre": "Children's Books", "title": "Ships: The Hands-Approach to Science (Make It Work! Science (Paperback World))", "description": "Directions for using simple construction methods and tools to make models of a Viking ship, sailboat, paddle steamer, submarine, aircraft carrier, and other types of boats."}, {"id": "B0176WNJFW", "genre": "Children's Books", "title": "Diary of a Curious Guardian [An Unofficial Minecraft Book] (Minecraft Tales Book 49)", "description": "Read the Story of a Minecraft Guardian!This guardian is curious about what happens outside the ocean monument he's been guarding. He wants to be an elder guardian until a little squid makes him even more curious about what else the ocean has to offer. Will he venture out? Find out what happens in the Diary of a Curious Guardian!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books."}, {"id": "1442496738", "genre": "Children's Books", "title": "Click, Clack, Ho! Ho! Ho! (A Click, Clack Book)", "description": "Santa comes to the barnyard in this holiday addition to the award-winning Click, Clack series, and the inspiration for a new Christmas special, CLICK, CLACK, MOO: Christmas on the Farm.It’s the night before Christmas and all through the farm, not a creature is stirring, not even a...duck? Farmer Brown is busy decorating his home in preparation for Santa’s arrival on Christmas Eve! All seems calm in the barnyard, but Farmer Brown isn’t the only one who is getting ready... Ho Ho OH NO! Once again, Duck has gotten the whole barnyard STUCK in quite a predicament! Will anyone be able to un-stuck Duck and save Christmas?"}, {"id": "B01MYBO9U0", "genre": "Children's Books", "title": "Coding with LEGO WeDo (21st Century Skills Innovation Library: Makers as Innovators Junior)", "description": "LEGO WeDo enables students to build and program their own robots. Through simple text written to foster creativity and problem solving, students will the art of innovation. Large, colorful images show students how to complete activities. Additional tools, including a glossary and an index, help students learn new vocabulary and locate information."}, {"id": "1575050250", "genre": "Children's Books", "title": "The Road to Seneca Falls (Creative Minds Biography) (Creative Minds Biography (Paperback))", "description": "A biography of suffragist Elizabeth Cady Stanton, one of the organizers of the country's first women's rights convention, which took place in Seneca Falls, New York, in 1848."}]