[{"id": "0890518580", "genre": "Children's Books", "title": "Buddy Davis' Cool Critters of the Ice Age", "description": "Kids love to learn about the Ice Age and its animals - between the woolly mammoths and saber-tooth cats, what's not to enjoy? But it can be hard to find books on the subject that are not from a secular, evolutionary point-of-view. But look no further because your child will enjoy this exciting book that introduces children to fascinating Ice Age animals and also explains how the Ice Age was caused from a biblical, creationist perspective.  Surveys 17 strange and unusual Ice Age animals Full of engaging illustrations, including height comparisons From popular creationist speaker and author Buddy Davis "}, {"id": "B0779D9HZ3", "genre": "Children's Books", "title": "Mojo Make-Believe", "description": "Mojo, the small dog with WAGATTUDE invites you into her make-believe world.Who’s Mojo?!I am 6 years oldI am a black Toy PoodleI like mudI love sausages I like kissesI get my hair done a lotI wreck my hair a lotI like to bark at cats I am very good at balancingI was on Britain’s Got Talent 2017 and I got 4 yeses!If you lie down I will stand on your tummy and probably kiss your nose!"}, {"id": "1590319761", "genre": "Children's Books", "title": "The U.S. Lawyer-Presidents Coloring and Activity Book (Aba Journal)", "description": "Perfect for the children of lawyers and judges, or for teachers looking for a new resource for learning about the U.S. Presidents who were also lawyers. The book also includes lawyer-president related activities and puzzles such as, matching, word-search, and connect-the-dots games for slightly older children. Suitable for all ages, this book is perfect for teachers and young children, law firms and lawyers looking for client or visitor give-aways, and makes a great gift, too!"}, {"id": "B00GNLE2EK", "genre": "Children's Books", "title": "An Unexpected Christmas", "description": "Pull back the curtain of Time and take a peek into heaven as God reveals his plans for the very First Christmas - the angels are in for a surprise or two!An Unexpected Christmas tells the old familiar story from a whole new perspective, with a dash of humor and plenty of warm fuzzies, this story will become a Christmas read-aloud favorite.Written originally as a Christmas gift for author Simone Graham's children, it is illustrated with the children of the world (including hers) as Heaven's \"angels\". The story was selected to be made into a short film where it was an instant hit in Christmas 2012. Since the film's release on YouTube, people from all over the world contacted the author thanking her for writing this beautiful (funny and touching) story. Now you can take it home and read it to your children this Christmas.\"They won't be expecting that!\" ~Scragger (from An Unexpected Christmas)(The film can be found on YouTube under the same title, An Unexpected Christmas)"}, {"id": "0751367729", "genre": "Children's Books", "title": "Hulk: The Incredible Guide", "description": "Created with unlimited access to the Marvel comic archives, The Incredible Guide traces the legend of the Hulk's entire career since the character was created 40 years ago, revealing the secret of his superhuman powers and multiple personaltities which torment this infamous man-monster. Each chapter details a different decade of the Hulk story including all the major heroes, villains and storylines from that era. Features over 300 full-colour illustrations."}]