[{"id": "B071J8Q69C", "genre": "Children's Books", "title": "Tearing the Veil (The Uncloaked Trilogy Book 2)", "description": "They trained us well. Power punctuated our every move, driving fear into the intended target. Who would stand against them?Braxton Luther, the sellout. Now a part of the Den, he’s determined to make good on Eliza Knight’s faith in him—to be more than what he’d settled for when the Party had taken over. But his goal is dangerous, and not just for him. As he searches for a way to protect the silent, invisible victims of the new government, Braxton’s mission—which includes finding a way to rescue Eliza from the Reformation Camp—becomes even more complicated. Hannah Knight, Eliza’s sister, is simply too much like him.Tired of standing in her perfect sister’s shadow, Hannah determines to find her own place in the world. If that place is with the Pride—the girls’ home and training center provided by the Party—so be it. When she leaves the hopelessness of the cellar, that’s all she’s aiming for. But Quinn Sanger, the handsome son of a powerful political leader, finds her at the creek, and her life takes an unexpected and optimistic turn. Braxton’s convinced Hannah’s in trouble. Hannah’s convinced Braxton, and all the Uncloaked, are insane. But when they peek behind the real veil the Party maintains, the truth is beyond what either had feared or hoped. If everyone knew, it could change everything. They redefine their mission. It’s time to tear the veil. "}, {"id": "B00K5EBJ4M", "genre": "Children's Books", "title": "Duck for Turkey Day", "description": "It’s almost Thanksgiving, and Tuyet is excited about the holiday and the vacation from school. There’s just one problem: her Vietnamese American family is having duck for Thanksgiving dinner—not turkey! Nobody has duck for Thanksgiving—what will her teacher and the other kids think?  To her surprise, Tuyet enjoys her yummy Thanksgiving dinner anyhow—and an even bigger surprise is waiting for her at school on Monday. Dinners from roast beef to lamb to enchiladas adorned the Thanksgiving tables of her classmates, but all the celebrations had something in common—family!  Kids from families with different traditions will enjoy this warm story about “the right way” to celebrate an American holiday."}, {"id": "1482457431", "genre": "Children's Books", "title": "2: America's Oddest Crimes (Weird America)", "description": "Crime and punishment can be a complicated subject, but sometimes it gets downright strange. Robberies gone wrong and attempts to cash billion-dollar checks are just some of the wacky crimes covered in this book. With colorful photographs and graphics bring these crimes to life, readers learn that criminals often have strange motivations for the odd things they do. Some even commit crimes you might never think would be punishable by lawlike laughing too loudor crimes from history that rarely happen today like train robbing."}, {"id": "8181903129", "genre": "Children's Books", "title": "Farmer Falgu Goes to the Market", "description": "Farmer Falgu is on his way to the market with eggs, onions and tomatoes loaded on his cart. During the rickety road ride, unexpected things happen. What does he encounter on the way?"}, {"id": "0316137324", "genre": "Children's Books", "title": "On the Court with Kobe Bryant", "description": "Kobe Bryant may be one of the youngest basketball players in the NBA, but no one would dare call him inexperienced. The son of Joe \"Jellybean\" Bryant, a former NBA player and star of various European teams, Kobe spent his childhood watching professional basketball. From the moment he could pick up a ball, he was learning to dribble and shoot. His basketball education was unique - a combination of lessons on basic fundamentals, one-on-one games against his dad, and keen observation and analysis of the world's best players. Kobe learned his lessons well, and at age eighteen was given the chance to prove it when he was drafted into the NBA. Fresh out of high school, Kobe showed that he had the talent and the heart to make it in the pros. This exciting biography traces Bryant's life from childhood to his part in the Lakers' 2000 NBA championship. For more information on the Matt Christopher Sports Bio Bookshelf, please turn to the last pages of this book."}]