[{"id": "1555603211", "genre": "Science Fiction & Fantasy", "title": "The Dragon Roars (Battletech)", "description": "The Dragon Roars is a BattleTech scenario pack that describes the brutal conflict between forces of the newly constituted Star League Defense Force - made up of a coalition army from every Great House - and the savage Smoke Jaguars. Detailed descriptions and maps follow each wave of this titanic struggle as the Inner Sphere sweeps into the Smoke Jaguar Occupation Zone. Twelve BattleTech scenarios and one BattleForce 2 scenario allows players to actively participate one of the largest conflicts in human history."}, {"id": "1416524525", "genre": "Science Fiction & Fantasy", "title": "7: The Dark Tower VII (The Dark Tower, Book 7)", "description": "Now a major motion picture starring Matthew McConaughey and Idris ElbaCreating \"true narrative magic\" (The Washington Post) at every revelatory turn, Stephen King surpasses all expectation in the stunning final volume of his seven-part epic masterwork. Entwining stories and worlds from a vast and complex canvas, here is the conclusion readers have long awaited—breathtakingly imaginative, boldly visionary, and wholly entertaining. Roland Deschain and his ka-tet have journeyed together and apart, scattered far and wide across multilayered worlds of wheres and whens. The destinies of Roland, Susannah, Jake, Father Callahan, Oy, and Eddie are bound in the Dark Tower itself, which now pulls them ever closer to their own endings and beginnings...and into a maelstrom of emotion, violence, and discovery."}, {"id": "1533355274", "genre": "Science Fiction & Fantasy", "title": "Unbreakable: Heroes of Arcania (Volume 3)", "description": "Nova started the fight against Fortune for simple revenge, but now it’s turned into something much bigger. Arcania’s criminals are at each other’s throats, putting the city right in the middle of a warzone. She’ll have to work with a few unlikely allies to end Fortune’s games once and for all. Nova thought she understood what it meant to be a superhero, but will she have to lose herself to truly defeat Fortune? Fortune has given Cole a choice, one with unbearable consequences. When Cole takes matters into his own hands to save his sister Penelope, he realizes too late he’s another pawn in Fortune’s games. Fortune will use Cole’s gift against his enemies…including Nova. Cole will have to become the hero he always wanted to be if he’s going to protect the love of his life. Nova and Cole could finally save Arcania from Fortune’s deadly games, but are they willing to sacrifice each other?"}, {"id": "B00V3Y6KTC", "genre": "Science Fiction & Fantasy", "title": "The Rift", "description": "“Stoll proceeds to pay homage to most YA fantasy tropes even as he systematically subverts them.” -Barb Taub, barbtaub.comA civil war from a world of magic has spilled over into the small California town of San Luis Obispo. In a desperate act, a warrior from Ruach gives soul armors—the ultimate weapons of his world—to four high school students.This sounds like the exact opposite of how Vero would like to spend her senior year. Poor and new to the area, she finds surviving in her new surroundings hard enough without stepping into the middle of a war of wizards.Unfortunately, two soldiers from the other world know what she looks like and want her dead. In the small town of San Luis Obispo, it’s only a matter of time before they find her. She might have to fight, whether she wants to or not.Read the book that started it all: The Rift“My favorite feature is how the four main characters have flaws/quirks that serve as both strengths and weaknesses and that often put even those on the same side at odds with one another.” – MB, Amazon Review"}, {"id": "B0193M3BTC", "genre": "Science Fiction & Fantasy", "title": "The Last Fairy Tale", "description": "Olivia Wickworth lives in Orphanage Nine, a refuge for the genetically-modified children living in the final days of a dying Earth. In what could be our near future, mankind has completed the widespread implementation of cellular computing - but with devastating unforeseen consequences. Just when all hope seems lost, Olivia enters Aeldyn, a land created thousands of years ago when man exiled magical creatures from Earth. Although Aeldyn seems like the world of Olivia’s dreams, it is not without its own darkness. There is evil in the land that threatens to corrupt Aeldyn just as Earth has been corrupted, and Olivia is the only one who can stop it. On her quest to defeat this evil, Olivia forges friendships, meets fantastic creatures, and rediscovers the lost art of magic. But can she save both Aeldyn and what is left of mankind?"}]