[{"id": "0486286495", "genre": "Children's Books", "title": "Old-Fashioned Cats Stickers: 93 Full-Color Pressure-Sensitive Designs", "description": "Scores of engaging tabbies outfitted in turn-of-the-century costumes, posing prettily for the artist, popping out of hats, baskets and boxes; lapping at a plate of milk, playing with a ball of yarn, and dozens of other charming scenes. Apply to packages, notecards and other flat surfaces."}, {"id": "1772261637", "genre": "Children's Books", "title": "Aesop's Fables (1000 Copy Limited Edition)", "description": "In this collection of over three hundred fables, Aesop masterfully unravels the morals behind every action in human nature. Included are the favouries \"The Shepherd-Boy and the Wolf,\" \"The Tortoise and the Hare,\" and \"The Dog and the Shadow.\" These time-honoured morals teach children that persuasion is better than force, slow but steady wins the race, and to look before you leap. A fable is often thought of as a story intended to help children learn wholesome values and how to behave within society at large. However, in ancient Greece, fables were used as a means of persuasion, as the moral of a fable can be delivered in an indirect manner. This helped philosophers such as Plato, Aristophanes, and Socrates argue controversial points without offending their audience."}, {"id": "B010EXMNLG", "genre": "Children's Books", "title": "Tremendous Turtle", "description": "A Tremendous Turtle fights four big, hungry Crocs to protect the turtles of Turtle Lagoon.  He is tremendously strong, fast, smart, and brave.  However, when the Crocs decide to leave Turtle Lagoon, Tremendous Turtle is no longer needed.  What will he do now?"}, {"id": "1587280752", "genre": "Children's Books", "title": "You and Me (Follow Me)", "description": "Kids choose to read these books straight through or they can follow the 'guides', which will lead them to all of the information on a specific subject. Exploring the world with a question-and-answer format. Bite-sized information is perfect for children with short attention spans."}, {"id": "B072K61DD3", "genre": "Children's Books", "title": "Asante's Gullah Journey", "description": "A new epic adventure with sword and bow.Beneda loves tending the crops on her family’s farm, until they are attacked by armed strangers. She doesn’t understand how to stop it, as she embarks on a dangerous journey to find help. She appeals to the all-powerful Libraries for help in stopping the land grabbers that threaten her family and village. Librarian-swordsman Asante joins her and helps her pull her community together. His sword and Beneda’s bow join forces to protect her birthright. Can Beneda become the leader her grandmother was years before and save her family?"}]