[{"id": "B01MAWGR0D", "genre": "Science Fiction & Fantasy", "title": "Mourners: Scum of Shatterdown", "description": "The StoryAnastasia Luxan wasn't expecting to end up with a government job when she went with her master to oust a criminal warlord from the city of Shatterdown, but she ends up with one when a deal is struck between the paladin order she serves and the self-styled Scarlet Princess. Offered a rare lesson in how those she sees as villains live their lives, Ana is challenged to be both an opposing voice and a student - until the Princess's past catches up with her."}, {"id": "0984347798", "genre": "Science Fiction & Fantasy", "title": "Things We Thought We Saw in the Water", "description": "In these eight mesmerizing tales, author C. Frazier Jones takes us to a playground built by imagination, where mermaids ferry the dead to the the afterlife, a husband, long missing, returns as a cat and a vengeful spirit haunts a Pawnee, Oklahoma Walmart, much to the inconvenience of both customers and staff. Overflowing at times with heartbreak, humor and hope, Things We Thought We Saw in the Water will stay with the you long after you have placed the book aside."}, {"id": "1530301157", "genre": "Science Fiction & Fantasy", "title": "Sunflower Fields", "description": "Sunflower Fields takes us to a post-apocalyptic world where the power is held by only a few. Average citizens are inoculated into submission, except for those who could see through the plan their leaders had for them. It's a fight to the death for them - and one very elusive madman decides to make them all pay for his pain."}, {"id": "1941283438", "genre": "Science Fiction & Fantasy", "title": "c3 (46. Ascending)", "description": "While traveling as an exchange student, a Texan teenager discovers that she possesses strange powers that she can barely control. As her innocence collides with an underworld in which young women are bartered and sold, a stranger makes her an unexpected offer. He will teach her how to save her missing friends, but she will never be normal again. She accepts his challenge to show those guilty of unspeakable crimes just how powerful a young woman can be."}, {"id": "B01NC0HLYN", "genre": "Science Fiction & Fantasy", "title": "Gatc'hh'en's Rite", "description": "One thousand years into his Rite of Passage on Earth, Gatc’hh’en, part machine, part living being is half mad with loneliness and despair. The only woman he has ever loved died horribly four hundred years earlier, and he wants her back. It seems the only way to settle  his raging guilt. He decides on Emily, a young woman near death’s door. She is a perfect choice, it seems. He cures her fatal disease and then proceeds to genetically modify her into the lover he remembers.  At first, Emily loves her new lease on life to say nothing of her newly minted and beautiful body, but as she soon discovers there is a steep and unexpected price that they each must pay.John Talisker is the author of Heather, a novel about an exceptional 11-year-old girl who can see through us all.  Checkout jdreid1p0.com to find out more."}]