[{"id": "B00GCICU02", "genre": "Science Fiction & Fantasy", "title": "Frostborn: The First Quest", "description": "A thousand years ago, the last grandson of Arthur Pendragon led the survivors of Britain through a magical gate to a new world, a world of magic and high elves, of orcs and kobolds and stranger, darker creatures. Now the descendants of the exiles rule a mighty kingdom, peaceful and prosperous under the rule of the High King.But dangers stir that the realm is not ready to face.RIDMARK ARBAN is a new-made knight and Swordbearer of the realm. When the archmage of the high elves asks for aid against the dread Warden of Urd Morlemoch, Ridmark volunteers for the quest, eager to prove himself and win glory and renown.   But terrible evil awaits in Urd Morlemoch, and those who enter the Warden's clutches rarely escape them...ABOUT THE AUTHORStanding over six feet tall, Jonathan Moeller has the piercing blue eyes of a Conan of Cimmeria, the bronze-colored hair of a Visigothic warrior-king, and the stern visage of a captain of men, none of which are useful in his career as a computer repairman, alas.He has written the DEMONSOULED series of sword-and-sorcery novels, and continues to write THE GHOSTS sequence about assassin and spy Caina Amalas, the COMPUTER BEGINNER'S GUIDE series of computer books, and numerous other works."}, {"id": "B013PR85XI", "genre": "Science Fiction & Fantasy", "title": "Children of the Hollow Worlds: 65 Cybele (The Lost Children of Earth Saga Book 2)", "description": "Now four months out from Earth, Callum Farr and the crew of the Resolution have arrived at the planetoid, 65 Cybele, in the main asteroid belt. To their great surprise they find a thriving colony, the descendants of those colonists abandoned by the corporations. The colonists, who have become the greatest geneticists of the human race during their century of isolation, are deeply suspicious of Callum Farr and his crew.On this strange new world the inhabitants have a secret. In order to survive they have had to adapt to their world. They have created a unique biome, unlike any ever seen before, with exotic, but dangerous creatures. But all is not right on 65 Cybele. There are secrets on the asteroid that threaten the Earth crew and the viability of the colony itself. Callum Farr must find a way to guide the colony onto a new path and avert the disaster that is bearing down on the inhabitants, all while thwarting the attempts of the corporations to sabotage his mission. To accomplish these goals he must survive a brutal race, savage battles with the ferocious creatures that inhabit the valley of the biome, an attempt on his life by the corporate saboteur and a natural disaster of epic proportions. If he fails, the world of 65 Cybele and its’ inhabitants, as well as his ship and crew, will be destroyed."}, {"id": "B077Z5Z9WW", "genre": "Science Fiction & Fantasy", "title": "The Convent's Secret (Glass and Steele Book 5)", "description": "To find the one man who can fix the magic in Matt’s watch, he and India are led to a convent where the nuns will do anything to keep their secrets private. Including murder? Matt and India must uncover the truth behind the disappearance of the mother superior and two babies given to her care many years ago. But sometimes, the truth is painful and its exposure can have deadly consequences.With his magic watch slowing down, Matt needs all the help India and his friends can offer before time runs out. But his nemesis will do anything to bring about his downfall, including rock Matt’s family with a scandal that can ruin them, and Matt and India’s chance of happiness."}, {"id": "0441019625", "genre": "Science Fiction & Fantasy", "title": "First Lord's Fury (Codex Alera, Book 6)", "description": "In the final novel in #1 New York Times bestselling author Jim Butcher's acclaimed Codex Alera series, the people of Alera—who use their unique bond with the elementals of earth, air, fire, water, wood, and metal for protection—must face the ultimate conflict…   For Gaius Octavian, life has been one long struggle. Battling ancient enemies, forging new alliances, and confronting the corruption within his own land, he became a legendary man of war and leader of men—and the rightful First Lord of Alera.   Now, the end of all he fought for is close at hand. The brutal, dreaded Vord are on the march, using fear and chaos to turn the Alerans against one another, and forcing those who will not submit to flee to the outer reaches of the realm.   Perhaps for the final time, Gaius Octavian and his legions must stand against the enemies of his people. And it will take all his intelligence, ingenuity, and furycraft to save their world from eternal darkness..."}, {"id": "B0058M785A", "genre": "Science Fiction & Fantasy", "title": "Pirate Sun: Book Three of Virga", "description": "This is the third novel, after Sun of Suns and Queen of Candesce, to be set in Virga, a bubble universe artificially separated from our own future universe. “Schroeder's Virga series is highly reminiscent of the Golden Age of SF, when A. E. van Vogt, Isaac Asimov, and E. E. “Doc” Smith were all mixing the pulp heritage with high adventure and innovative scientific projections to create interesting worlds, peoples, and stories.” (The Sacramento Book Review).Chaison Fanning, the admiral of a fleet of warships introduced in the first book, has been captured and imprisoned by his enemies, but is now rescued and set free. He must flee to his home city to confront the ruler who betrayed him. Perhaps while there he will also regain his lovely, powerful, and subversive wife, Venera. He has not seen her since she fled, careening off into the air of Virga, with the key to the artificial sun, Candesce, at the center of Virga. In Pirate Sun, Schroeder sets a whole new standard for hard SF space opera."}]