[{"id": "0763643505", "genre": "Children's Books", "title": "Stink: The Ultimate Thumb-Wrestling Smackdown (Book #6)", "description": "Stink needs a sport, fast! Can his alter-ego, Shark Hammersmash, wrestle a win at thumb wars? Or will a perfect karate kick lead him to victory?Stink Moody, family brain, brings home a report card that isn’t perfect? Yikes! Time for him to get into fighting shape and beat back that U for Unsatisfactory in gym! A scan of the sports channel leads to a knock-out find: world-class thumb wrestling, with tricky moves like Snake in the Grass and Santa’s Little Helper (no equipment needed, save for a tiny terrifying mask to sit on your thumb). But when Mom and Dad are not wowed, Stink gets another idea: he’ll kick and punch his way to a yellow belt with the help of a Dragon Master, a seeing-eye Moose, and a mind as still as a pond. Can you say Crouching Tiger, Hidden Thumb? Hee-ya! Ha! Ha! Ha!"}, {"id": "B00BQ8YCS6", "genre": "Children's Books", "title": "The Flash's Book of Speed (DK READERS)", "description": "With two new JLA Readers the Green Lantern looks at some of the greatest inventions throughout history and The Flash introduces some of the fastest things in the world, from wildlife to transportation."}, {"id": "0780770102", "genre": "Children's Books", "title": "Martin Luther King", "description": "An illustrated introduction to Martin Luther King discusses the segregation laws that denied equal rights to African Americans during his lifetime, his decision to become a minister and motivational speaker, and his belief in civil disobedience."}, {"id": "0547237642", "genre": "Children's Books", "title": "Because Your Daddy Loves You", "description": "A day spent with a young child at the beach is filled with many minor dramas—a lost shoe, a ball that floats too far out into the water, a drippy ice-cream cone. These can be frustrating events for both child and parent, but the daddy in this book finds a way to fix each problem, lovingly and patiently. Why? Because he loves his little girl, of course! This spot-on pairing of words and images is a warm, reassuring, and humorous tribute to dads everywhere."}, {"id": "B005SNJENI", "genre": "Children's Books", "title": "Island of Hope and Sorrow: The Story of Grosse Ile (Canadian Immigration)", "description": "From 1832 to 1937 more than four million people sailed across the Atlantic to the port of Quebec with the dream of creating better lives for themselves in the New World. During this period, a tiny island called Grosse Ile, located fifty kilometres downstream from the port, served as a quarantine station. Its mission was to prevent ship passengers from spreading diseases to the mainland. This is the story of the island, which served both as gateway and graveyard for the thousands of people who landed on its shores, and of the caring island workers who welcomed them."}]