[{"id": "B004VWX2SK", "genre": "Children's Books", "title": "Amazing Secrets for Christian Kids", "description": "God created a world filled with amazing secrets, just waiting to be discovered!  Children of all ages will gain valuable Christian insights as they read about:1.Chattering Chicks2.Hail To The Snail3.Earn Your Stripes4.Holding On5.Goldfish Gossip6.Blood and Bats7.Hot Flowers and Glowing Mushrooms8.Jumping Spiders9.Horned Toads—Secret Stalkers10.How’s Your Hair?11.It’s Electrifying12.Laughing Llamas13.It’s Leaning!14.Mad Dogs15.Leapin’ Leopards16.Mud Bugs17.Marked By God18.Night Lights19.Mysterious Manatees20.Ocean Giants21.Noisy Nightbirds22.Peculiar Porcupines23.A Gentle Devil24.A Taste of Despair25.All About The Aurora"}, {"id": "0152026002", "genre": "Children's Books", "title": "Egyptian Mummies: People from the Past", "description": "Who were the ancient Egyptians? Why did they mummify their dead? Why did they bury people with their possessions? And why do mummies still fascinate us today?  The remains of seven mummies from the world-famous British Museum can answer these questions and many more. From Ginger, a simple prehistoric farmer, to Katebet, a wealthy woman buried with her jewelry, to Hornedjitef, a grand priest of Amun, the lives and culture of ancient Egyptians are uncovered in thrilling detail. Nearly a hundred color photographs detail what these people looked like, how they worked, the foods they ate, and why they prepared so elaborately for the afterlife--revealing that the life of ordinary Egyptians was different, and yet not so different, from our lives today."}, {"id": "1435273222", "genre": "Children's Books", "title": "Hoodwinked", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Despite the theme of witches and creepy critters, this is a very uncreepy, sweet, and unthreatening picture book suitable for children just getting into things spooky."}, {"id": "0553536672", "genre": "Children's Books", "title": "Little Golden Book Nursery Tales", "description": "Three classic Little Golden Book nursery tales are now available together in one deluxe volume!  Published in celebration of Little Golden Books’ 75th anniversary, this collection gathers together three of the most beloved Little Golden Books of all time: The Three Bears, The Little Red Hen, and Puss in Boots. Illustrated by two Little Golden Book greats—J. P. Miller and Feodor Rojankovsky—this beautiful book of nursery tales, with its glossy pages and gold-foil spine, is a must-have for every child’s bookshelf."}, {"id": "1845072936", "genre": "Children's Books", "title": "Lighting a Lamp", "description": "Books in the Festival Time series describe the activities of typical families as parents and children celebrate some of their culture’s major holidays. Attractive color illustrations on every page will appeal to younger children. The simply yet delightfully told stories describe the festivities while giving children background information about holidays in many different cultures.  A two-page spread at the back of each book contains information for parents, and includes suggestions on ways to communicate the holiday’s meaning to kids. Diwali is the Hindu five-day festival of lights that welcomes in the lunar new year. It is celebrated on the 15th day of the dark fortnight of the Hindu month of Ashwin, or Aasho, which occurs in October or November, depending on the lunar calendar. During the festival, parents tell stories that relate to the holiday, exchange gifts of sweets, light candles, and attend elaborate fireworks displays. The holiday is marked by an abundance of lights displayed in homes and businesses."}]