[{"id": "B0058M5HJO", "genre": "Children's Books", "title": "The Summer Camp Survival Guide: Cool Games, Camp Classics, and How to Capture the Flag", "description": "Let the summertime adventure begin!Whether they’re going to day camp, sleepaway camp, sports camp, dance camp, or any other kind of camp, this is the ultimate guide for happy campers! It’s brimming with fun ideas to help children have the time of their lives, including icebreakers, games, crafts, campfire stories, sing-along songs, and more.  There’s advice on using a compass, winning camp contests, and keeping the homesick blues at bay. With charts, sidebars, tear-outs and postcards, plus time-tested information from two very expert authors, any kid carrying this book is sure to have an awesome summer."}, {"id": "1631771019", "genre": "Children's Books", "title": "Night Night, Little Tiger", "description": "Reading bedtime stories to her two-year-old son, Catherine felt there was one missing from their collection  a bedtime story about Clemson. So she and her sister Elizabeth wrote this book. A fun book for children and grandchildren of Clemson alumni, students, faculty, and fans! We hope you and your Little Tigers enjoy reading Night-Night, Little Tiger and make many Clemson memories!"}, {"id": "8426143679", "genre": "Children's Books", "title": "100 Pablo Picassos (Spanish Edition)", "description": "This book introduces children to the amazingly talented artist Pablo Picasso, or should we say 100 of him? It explains his remarkable career and accomplishments in a way children will be able to understand. Descubre la vida y la obra de Pablo Picasso, uno de los artistas más importantes de todos los tiempos. Y cuenta hasta 100 Pablo Picassos, representados entre las obras del genio."}, {"id": "B00H2Q2HCO", "genre": "Children's Books", "title": "Vegan Fudge (Easy Reader Recipes Book 59)", "description": "This book contains the recipe for vegan fudge that is very easy to prepare. The recipe is presented in both easy, photo-enhanced versions that people learning to read or who have problems reading can follow because of related photographs and simple language, as well as a version for people who don't. In addition, Text-to-Speech is available for those units that can use it. People who are learning English or who have disabilities limiting their reading may enjoy this title, as well as young English-speaking children. A mom uses this series with her middle school daughter, a new cook, and adults use the recipes for food they can make very quickly.These titles might also come in handy for bad weather days because I've tried to stay away from strange, expensive, or hard-to-find ingredients.For more information on new releases or freebies, join me on Facebook at https://www.facebook.com/profile.php?id=100006613178112 ."}, {"id": "1563978962", "genre": "Children's Books", "title": "Rio Grande: From the Rocky Mountains to the Gulf of Mexico", "description": "The Spanish called it the Rio Grande, the \"Great River.\" After the Mississippi and Missouri Rivers, the Rio Grande is the third longest river in the Unites States. In its 1,885-mile course to the sea and in the history that has unfolded on its banks, it is also one of North America's most dramatic rivers. Peter Lourie explores the Rio Grande to discover what makes the \"Great River\" great. He follows it from its headwaters in Colorado's snow-capped Rockies to the Gulf of Mexico's sub-tropical shores. His journey takes him into the territories of Billy the Kid and Pancho Villa. He visits an ancient Pueblo where he witnesses an annual feast day and corn dance. When the river becomes a 1,000-mile boarder between Mexico and the United States, he accompanies the U.S. Border Patrol, then takes a whitewater rafting trip through desert canyons of Big Bend National Park. Finally, the author's journey ends with a dive into the warm waters of the Gulf. Here is the Rio Gande of history and legend, vividly brought to life through a lively and informative text, illustrated with full-color and archival photographs."}]