[{"id": "160125198X", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Path: Council of Thieves #4 - The Infernal Syndrome", "description": " When a decadent noble mansion in the crumbling former capital city of Westcrown erupts into an enormous pillar of fire, the heroes of The Council of Thieves Adventure Path must explore the exposed chambers of the ruined estate to piece together the nefarious plot that has released a powerful devil into the treacherous foundation dungeons. Can they weaken the diabolical fiend enough to have a chance to defeat it, or will the heroes finally fall to the insidious plots of the Council of Thieves? A Pathfinder adventure designed for character levels 9-10. The Council of Thieves Adventure Path is the first to take full advantage of the new Pathfinder Roleplaying Game rules, and works with both the Pathfinder RPG and the standard 3.5 fantasy RPG rules set."}, {"id": "0061684260", "genre": "Science Fiction & Fantasy", "title": "The Thief of Always", "description": "Mr. Hood’s Holiday House has stood for a thousand years, welcoming countless children into its embrace. It is a place of miracles, a blissful round of treats and seasons, where every childhood whim may be satisfied. There is a price to be paid, of course, but young Harvey Swick, bored with his life and beguiled by Mr. Hood’s wonders, does not stop to consider the consequences. It is only when the House shows its darker face—when Harvey discovers the pitiful creatures that dwell in its shadows—that he comes to doubt Mr. Hood’s philanthropy.The House and its mysterious architect are not about to release their captive without a battle, however. Mr. Hood has ambitions for his new guest, for Harvey’s soul burns brighter than any soul he has encountered in a thousand years…"}, {"id": "1481447947", "genre": "Science Fiction & Fantasy", "title": "The Stars Are Legion", "description": "A Kirkus Reviews Best Science Fiction and Fantasy Selection of 2017  “[A] thought-provoking space opera.” —Kirkus Reviews “One of the most unusual and powerfully disturbing space operas we’re likely to see this year.” —Chicago Tribune  Set within a system of decaying world-ships travelling through deep space, this breakout novel of epic science fiction follows a pair of sisters who must wrest control of their war-torn legion of worlds—and may have to destroy everything they know in order to survive.Somewhere on the outer rim of the universe, a mass of decaying world-ships known as the Legion is traveling in the seams between the stars. Here in the darkness, a war for control of the Legion has been waged for generations, with no clear resolution. Zan wakes with no memory, prisoner of a people who say there are her family. She is told she is their salvation, the only person capable of boarding the Mokshi, a world-ship with the power to leave the Legion. But Zan’s new family is not the only one desperate to gain control of the prized ship. Zan finds that she must choose sides in a genocidal campaign that will take her from the edges of the Legion’s gravity well to the very belly of the world. In the tradition of Iain M. Banks’s Culture novels and Roger Zelazny’s Chronicles of Amber, Kameron Hurley has created an epic and thrilling tale about tragic love, revenge, and war as imagined by one of our most celebrated new writers."}, {"id": "1568585594", "genre": "Science Fiction & Fantasy", "title": "Rise of the Dungeon Master: Gary Gygax and the Creation of D&D", "description": "Rise of the Dungeon Master tells, in graphic form, the story of Gary Gygax, co-creator of Dungeons & Dragons, one of the most influential games ever made. Like the game itself, the narrative casts the reader into the adventure from a first person point of view, taking on the roles of the different characters in the story.Gygax was the son of immigrants who grew up in Lake Geneva, WI, in the 1950s. An imaginative misfit, he escaped into a virtual world based on science fiction novels, military history and strategic games like chess. In the mid-1970s, he co-created the wildly popular Dungeons & Dragons game. Starting out in the basement of his home, he was soon struggling to keep up with the demand. Gygax was a purist, in the sense that he was adamant that players use their imaginations and that the rules of the game remain flexible. A creative mind with no real knowledge of business, he made some strategic errors and had a falling out with the game's co-creator, his close friend and partner, David Arneson. By the late 1970s the game had become so popular among kids that parents started to worry -- so much so that a mom's group was formed to alert parents to the dangers of role play and fantasy. The backlash only fueled the fires of the young fans who continued to play the game, escaping into imaginary worlds. Before long, D&D conventions were set up around the country and the game inspired everything from movies to the first video games. With D&D, Gygax created the kind of role playing fantasy that would fuel the multibillion dollar video game industry, and become a foundation of contemporary geek culture."}, {"id": "0811811298", "genre": "Science Fiction & Fantasy", "title": "Somnium and Other Trips to the Moon", "description": "A selection of science fiction stories about trips to the moon fill this engaging compilation, among them fantastic tales from H. G. Wells, Johann Kepler, and Baron Munchausen. Readers of science fiction and watchers of alien nations will enjoy the remarkable assemblage of fanciful lunar voyages in Somnium."}]