[{"id": "0739356011", "genre": "Children's Books", "title": "3: Rabbit Ears Treasury of World Tales: Volume Three: Bremen Town Musicians, Koi and the Kola Nuts", "description": "Rabbit Ears Treasury of World Tales Volume 3 features mystical stories from around the globe--read by your favorite stars and featuring original music by some of today's greatest artists.The Bremen Town MusiciansRead by Bob HoskinsOriginal Music by Eugene FriesenThe Brother Grimm present the story of four over-the-hill yet spunky animals who decide it's never too late to start over. Join the dog, cat, rooster, and donkey in their comedic escapades as they decide to begin new lives as traveling musicians.Koi and the Kola NutsRead by Whoopi GoldbergOriginal Music by Herbie HancockThis humorous African folktale tells the story of Koi, the son of a chief who wants the villagers to honor him in a manner befitting his heritage. But unless he can accomplish three impossibl3e tasks he'll end up in the cooking pot instead. Will his new friends--a snake, an ant, and an alligator--be able to save his life and help him find his place in the world?"}, {"id": "1588104206", "genre": "Children's Books", "title": "The Acropolis (Visiting the Past)", "description": "Discusses the history of the Acropolis, a large fortified hill in the center of Athens, and the uses to which it and the structures built upon it have been put throughout the ages"}, {"id": "1417743875", "genre": "Children's Books", "title": "Moonflower", "description": "A lyrical account of nature after dark - perfect for children who want to know what goes on while they're asleep!  After children have been tucked into their beds on a warm summer evening, nighttime springs to life.  With language that weaves its tale like the moonflower vine winding its way upward toward the sky, THE MOONFLOWER brings an often unseen world to light for the budding young naturalist.  Sidebars containing interesting facts about these nocturnal creatures' habits complement the story of a mysterious, moonflower-inspired evening.  Jean Loewer's soft illustrations and careful attention to detail bring an authenticity to moonflowers, hawkmoths, and owls that can barely be contained on the page.  In addition, a glossary and instruction on how to grow you rown moonflower vine make this an excellent reference tool for children interested in what goes on after dark."}, {"id": "1943147094", "genre": "Children's Books", "title": "Dragons and Marshmallows (Zoey and Sassafras)", "description": "A New York Public Library Best Books for Kids 2017 Pick With magical animals, science, mystery, and adventure -- the brand new series Zoey and Sassafras has something for everyone! Easy-to-read language and illustrations on nearly every page make this series perfect for a wide range of ages.In the first book of this series, Zoey discovers a glowing photo and learns an amazing secret. Injured magical animals come to their backyard barn for help! When a sick baby dragon appears, it’s up to Zoey and Sassafras to figure out what’s wrong. Will they be able to help little Marshmallow before it’s too late?"}, {"id": "0736893725", "genre": "Children's Books", "title": "Pocahontas (First Biographies - Trailblazers and Legends)", "description": "Text and illustrations introduce the biography of Pocahontas, the Powhatan Indian who worked throughout her life to establish peace between her people and the English."}]