[{"id": "0756983010", "genre": "Children's Books", "title": "The Pumpkin Elf Mystery (Ready, Freddy! (Prebound Numbered))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Who is the Pumpkin Elf, and where is he? Can Freddy and his friends find the elf, mind their manners, and collect their pumpkin surprises?"}, {"id": "0147515661", "genre": "Children's Books", "title": "Juliette Gordon Low: America's First Girl Scout (Women of Our Time)", "description": "\"Ask the girls,\" Juliette Gordon Low always said when a problem came up. \"They'll know what's best.\"But in 1912, no one thought that children should be listened to. No one except \"Daisy,\" that is. She wanted girls to learn that they could be active and make a real difference in the world. She overcame both deafness and the disapproval of her family to establish the Girl Scouts. Now, more than four million girls are Girl Scouts in the United States alone."}, {"id": "B00I07ATI8", "genre": "Children's Books", "title": "A Chapter of Adventures (Annotated)", "description": "Jack is a boy from a small fishing village whose adventures begin when he rescues survivors from a shipwreck. His heroic act draws the attention of the ship-owner who offers Jack a position as midshipman on board one of his ships. The offer is heartily accepted and Jack sets sail on board the Wild Wave. When the ship docks in Alexandria, Egypt, he and two other young midshipmen get caught in the throngs of an Egyptian revolt and are taken prisoner. During their captivity, they witness the bombardment of the city and the Egyptian attack on the Europeans.The Lion of St. Mark (Annotated)•Active Table of Contents•Highlights on the Life of G. A. Henty"}, {"id": "0887432417", "genre": "Children's Books", "title": "Division 0-12 Flash Cards", "description": "Division 0-12 Flash Cards contain 104 problems ranging from 4/2 to 144/12. At the top of each card is a small-print answer to the problem on the reverse side."}, {"id": "0340894121", "genre": "Children's Books", "title": "Ready or Not Mr Croc?", "description": "Mr Croc are you ready or not? Mr Croc is getting dressed and ready to go out. Watch him put on this clothes and see if you can guess where he is going? Fabulous pop-up and flaps and tabs throughout."}]