[{"id": "1502905108", "genre": "Science Fiction & Fantasy", "title": "Citizen (Citizen Saga, Book 3) (Volume 3)", "description": "                  Have you been a model Citizen today?  The destruction of the Chief Overseer's Palace was meant to bring about a change. But the streets of Wanmei are just as dangerous and just as falsely perfect as they ever were. Lena Carr, now a confirmed member of the revolution, hides in the shadows of the city-state she adores and works hard to undermine those in a position of authority.  But there are secrets among the Overseers...  The leaders of Wanmei would have you believe that the nation is model. That Wanmei provides all that you need. And many do still believe it. Battling propaganda and brainwashing becomes more insurmountable for the rebels each day.  But one person will never give up on a free Wanmei. Trent Masters has led the rebel army through some tough times, but now he faces the biggest battle of all. Convincing the Citizens of his beloved nation that there is more beyond the invisible, yet impenetrable, walls of Wanmei.  And to do that he needs Lena. Because without the Elite who has captured his heart, as easily as she moves across the rooftops of the city in the dead of a storm shrouded night, he won't find the key that unlocks it all. But what that key unlocks will be the biggest shock of them all.  Citizen versus Citizen. The battle ends now!              "}, {"id": "1521407320", "genre": "Science Fiction & Fantasy", "title": "Super Sales on Super Heroes", "description": "In a world full of super powers, Felix has a pretty crappy one. He has the ability to modify any item he owns. To upgrade anything. Sounds great on paper. Almost like a video game. Except that the amount of power it takes to actually change, modify, or upgrade anything worthwhile is beyond his abilities. With that in mind, Felix settled into a normal life. A normal job. His entire world changes when the city he lives in is taken over by a Super Villain. Becoming a country of one city. A city state. Surprisingly, not a whole lot changed. Politicians were still corrupt. Banks still held onto your money. And criminals still committed crime. Though the black market has become more readily available. And in that not so black market, Felix discovers he has a way to make his power useful after all, and grasps a hold of his chance with both hands. Warning and minor spoiler: This novel contains graphic violence, undefined relationships/partial harem, unconventional opinions/beliefs, and a hero who is as tactful as a dog at a cat show. Read at your own risk."}, {"id": "B078B5CJX5", "genre": "Science Fiction & Fantasy", "title": "Oh My Goddess! (Collections) (29 Book Series)", "description": "Alone in his dorm on a Saturday night, Nekomi Tech's Keiichi Morisato dials a wrong number that will change his life forever - reaching the Goddess Technical Help Line. Granted one wish by the charming young goddess Belldandy - a wish for anything in the world - Keiichi wishes she would stay with him always! Complications are bound to ensue from this; the immediate first being the new couple getting tossed out of the dorm - it's males only!As the hapless student and his mysterious \"foreign beauty\" ride around looking for a new place to stay - risking the different dangers of seeking shelter with an otaku convinced Belldandy is an imaginary woman, and a Zen priest convinced she's a sinister witch - Keiichi's still got his classes on Monday morning! How is his new \"exchange student\" companion going to be received on the N.I.T. campus? A little too well for normal life to ever return..."}, {"id": "0802142842", "genre": "Science Fiction & Fantasy", "title": "Cold Mountain", "description": "In 1997, Charles Frazier’s debut novel Cold Mountain made publishing history when it sailed to the top of The New York Times best-seller list for sixty-one weeks, won numerous literary awards, including the National Book Award, and went on to sell over three million copies. Now, the beloved American epic returns, reissued by Grove Press to coincide with the publication of Frazier’s eagerly-anticipated second novel, Thirteen Moons. Sorely wounded and fatally disillusioned in the fighting at Petersburg, a Confederate soldier named Inman decides to walk back to his home in the Blue Ridge mountains to Ada, the woman he loves. His trek across the disintegrating South brings him into intimate and sometimes lethal converse with slaves and marauders, bounty hunters and witches, both helpful and malign. At the same time, the intrepid Ada is trying to revive her father’s derelict farm and learning to survive in a world where the old certainties have been swept away. As it interweaves their stories, Cold Mountain asserts itself as an authentic odyssey, hugely powerful, majestically lovely, and keenly moving."}, {"id": "1785654721", "genre": "Science Fiction & Fantasy", "title": "War for the Planet of the Apes: Revelations", "description": "Driven from their woodland home, Caesar and his apes are still recovering from the takeover by renegade ape Koba. Caesar is desperate to avoid war with the humans, but this is a faint hope, as his enemies are about to receive military reinforcements headed by the ruthless Colonel McCullough."}]