[{"id": "B0086K9JI0", "genre": "Children's Books", "title": "Levi and His Magic Pants", "description": "When Levi finally gets to buy pants, he chooses an old pair with holes in the knees because he can sense that the pants are lonely. Who would expect pants like this to be magic? As Levi discovers more about his pants and himself, his abilities grow. Gradually he finds himself prepared to lead a team of school superheroes.This book is written at the \"my first chapter book\" level and is comparable in difficulty to the \"Magic Tree House\" books or the Thornton W. Burgess forest adventure books."}, {"id": "0786834072", "genre": "Children's Books", "title": "My Very First Encyclopedia with Winnie the Pooh and Friends Earth", "description": "Partnering illustrations with real-life photographs, this visual guide to the Earth explores the forests, deserts, grasslands, tundra, and aquatic environment, helping young readers learn more about the planet we live on."}, {"id": "B00F6KJPA0", "genre": "Children's Books", "title": "Knight (Atomic (Grade 5))", "description": "What’s it like to fight in a joust? Can a woman become a knight? Using the nonfiction genre 'explanation,' this title explores the life of a knight from weapons to armor to castle life."}, {"id": "0613024486", "genre": "Children's Books", "title": "All-Star Fever (Peach Street Mudders Story)", "description": "Shortstop Bus Mercer has to choose between confessing an act of disobedience to his parents and dealing with a guilty conscience that is ruining his concentration on the field and may keep him from making the all-star team."}, {"id": "0517880946", "genre": "Children's Books", "title": "Children of the Dust Bowl: The True Story of the School at Weedpatch Camp", "description": "Illus. with photographs from the Dust Bowl era. This true story took place at the emergency farm-labor camp immortalized in Steinbeck's The Grapes of Wrath. Ostracized as \"dumb Okies,\" the children of Dust Bowl migrant laborers went without school--until Superintendent Leo Hart and 50 Okie kids built their own school in a nearby field."}]