[{"id": "1579909493", "genre": "Children's Books", "title": "The Lost Treasure of the Green Iguana: A Jungle Maze Adventure (Explorers' Club)", "description": "Judith Rossell has created an exciting maze mission that will entice kids everywhere! With pencil (or pen for the brave) in hand, they’ll set out to rescue Doctor Fortuito, who’s lost somewhere deep in the jungle. And that means solvers will have to figure out a pathway through the dense foliage and across the lush, exotic terrain. Can they do it? Children will get help from the good Doctor’s notes on the cover gatefolds, and sneak past some pretty dangerous forest creatures\u0085and adventure towards the lost treasure that Fortuito was trying to find. Attractive picture-book quality art and an involving story create a wonderful challenge."}, {"id": "1404865810", "genre": "Children's Books", "title": "Johnny Appleseed (My First Classic Story)", "description": "For Johnny Appleseed, nothing is better than a fresh apple. From the East Coast to the West, Johnny roamed the land and planted his trees and had many adventures in between!"}, {"id": "0545470129", "genre": "Children's Books", "title": "1: Rolling Thunder", "description": "Lines of bikes are miles long,shining, half a million strong.Rumbling, grumbling, engines roar.Peace signs. High fives. Spirits soar.Every Memorial Day in Washington, DC, more than a million veterans and their supporters gather for the Rolling Thunder® Ride for Freedom, a demonstration that pays tribute to the men and women of the US armed forces. This lyrical story honors the bravery and sacrifice of those American heroes -- the ones who have returned home, and the ones who haven't."}, {"id": "140346197X", "genre": "Children's Books", "title": "Women at War (The World at War)", "description": "What was it like to live and fight during World War II? This series uses a rich variety of illustrations and historical resources, such as newspaper extracts and other realities to provide a fascinating perspective of World War II. It includes timelines and \"In the News\" features and contains eyewitness accounts from people who were there."}, {"id": "1426301146", "genre": "Children's Books", "title": "World History Biographies: Isaac Newton: The Scientist Who Changed Everything (National Geographic World History Biographies)", "description": "Born in England in 1643, Isaac Newton grew up in the age when Renaissance thinkers were challenging accepted ideas throughout Europe. Fascinated by all earthly science, Newton developed laws of motion and universal gravitation which also furthered our understanding of the movement of celestial bodies. This vibrant biography profiles the famed physicist as an acclaimed mathematician, astronomer, alchemist, philosopher, and inventor as well. Readers will discover the genius who inspired Alexander Pope to write, \"Nature and nature's laws lay hid in night; God said 'Let Newton be' and all was light.\"National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}]