[{"id": "1785298496", "genre": "Science Fiction & Fantasy", "title": "Tom's Midnight Garden: A BBC Radio Full-Cast Dramatisation (BBC Children’s Classics)", "description": "When his brother catches measles, Tom is sent away to stay with his Aunt Gwen and Uncle Alan, and is thoroughly fed up about it. But tedium turns to adventure when, lying in bed one night, he hears the old grandfather clock in the hall strike thirteen. What can it mean? This magical drama stars Peter England as Tom, with Una Stubbs as Aunt Gwen and Crawford Logan as Uncle Alan."}, {"id": "0805440704", "genre": "Science Fiction & Fantasy", "title": "Further Up And Further in: Understanding C. S. Lewis's the Lion, the Witch, And the Wardrobe", "description": "This new popular-level book from renowned C. S. Lewis scholar Bruce Edwards will enable C. S. Lewis buffs, new and old, to gain immense access and understanding into the mind of the author of The Lion, the Witch, and the Wardrobe and the creator of the world of Narnia. Further Up and Further In examines the message and theme of the first book in the Chronicles of Narnia. This book is a perfect companion for those who intend to see the forthcoming movie based on this story and wish to know about what Lewis was trying to communicate to his readers."}, {"id": "B00VSGUL6S", "genre": "Science Fiction & Fantasy", "title": "Pathfinder: Manual of Arcane Combat", "description": "In this manual you'll find 2 new classes, created to enrich you game experience.Both are designed to be played more and more, to a wide range of different characters: the Pyromancer and the Runic Tattoer!The Pyromancer is a tue specialist with fire magic and a fiery warrior, proficient with weapons and light armors, battling with spells and martial skills alike. The Pyromancer also follows misterious training paths that enhances his capacities with spells and steel, both on the battlefield and while adventuring, making him a versatile combatant and explorer.The Runic Tattooer is a tribal hunter and warrior, powered by eldritch tattoes. Proficient in the use of different weapons, the deadliest of them are the formidable powers unleashed by the Runic Tattoer's tattoos, capable of even reshape the Runic Tattoer's body in semblance of the mithy beasts and monsters depicted on him. The Runic Tattoer fits any situation, from underwater to aerial battles.Each with more than 10 racial favourite class bonuses.In addiction you'll find several feats specifically created for the two classes, one new spell and a variant rule for augmented movement with size increments.We'll keep them updated and we'll continue to expand them in the future!Have fun!"}, {"id": "B078594YJ1", "genre": "Science Fiction & Fantasy", "title": "Mindful Things", "description": " Nineteen-year-old Lauren Reed has always felt peculiar. She has no memory of her past after her parents’ mysterious deaths, and her unusual emerald eyes and severe migraines reinforce her sense of being an outsider. With her sophomore year of Northwestern about to begin, Lauren can’t wait to escape her adoptive parents’ overprotectiveness and move in with her best friend, Raegan, for a fresh start.  Unfortunately, her plan is thwarted when a strange note in her parents’ study leads to a frightful vision of a woman running for her life. Lauren’s other senses also start to heighten—especially after she meets the very handsome and charming Quinn Maxwell. As her visions and connection to Quinn strengthen, Lauren is stalked by an irate man with a cryptic warning: Raefield is coming for her, and she better not resist, or everyone will suffer.  Frightened and confused, Lauren digs into her past, looking for answers. She is shocked to discover her biological parents were witches. Their lifesaving magic triggered her evolving abilities, which is why she’s being hunted by Raefield, a power-hungry madman. Although her parents’ coven swears to protect her, Lauren must willingly embrace her new powers or risk a dark fate. "}, {"id": "B077689Q5C", "genre": "Science Fiction & Fantasy", "title": "The Eagle's Last Stand (The Aldrinverse)", "description": "The Eagle is unarmed, badly injured, and surrounded by enemy forces.As one of Earth's finest soldiers, she must break into a highly-defended Anunnaki base in the middle of war-torn Los Angeles and rescue a girl who knows humanity’s most precious military secrets. Secrets that will doom Earth’s resistance. She has less than ten hours. After that it will be too late. If she hopes to stop the Anunnaki's plans to conquer the Earth, she'll have to betray her best friend.The Eagle's Last Stand is a prequel novella in The Aldrinverse, a YA sci-fi series full of compelling characters, engaging action, and intense adventures.Pick up The Eagle's Last Stand now and discover the Eagle's fate!"}]