[{"id": "1546212973", "genre": "Children's Books", "title": "Coyote's Christmas Tale", "description": "The story Coyote's Christmas Tale is about a young coyote who lived on the Dinetah, also referred to as the Navajo Reservation. It is a children's story that encompasses elements of the American Southwest. The story contains animals from the southwest, as well as Native Americans, the Dine, who are more widely known as the Navajo. The story does have some traditional Native American elements, but it is not meant to be a historical piece of writing. The story allows for the readers to use their imagination and to make their own inferences. I hope you enjoy it."}, {"id": "0763659428", "genre": "Children's Books", "title": "Stink It Up!: A Guide to the Gross, the Bad, and the Smelly", "description": "They don't call him Stink for nothing! Now kids can savor a smorgasbord of facts about smelly and vile stuff in honor of their favorite super sniffer.Did you know that a group of skunks is called a stench? (No lie!) Can you believe that in colonial days, window-washing rags were dipped in pee? Or that snail slime was once an ingredient in cough syrup? Stink has a nose for yuck and muck, and this book is full of it: moose poop festivals, mouse brain toothpaste, maggot cheese, and way more. Its pages are crawling with more than two hundred facts, quizzes, recipes, and bits of trivia about things that are gross, bad, and smelly. P.U.!"}, {"id": "1621573451", "genre": "Children's Books", "title": "Christmas in America (Ellis the Elephant)", "description": "Ellis the Elephant is back! In Christmas in America, the fifth in Callista Gingrich's New York Times bestselling series, Ellis discovers the meaning of Christmas and learns how this special holiday has been celebrated throughout American history. In preceding books, including Sweet Land of Liberty, Land of the Pilgrims' Pride, Yankee Doodle Dandy, and From Sea to Shining Sea, Ellis learns about the pivotal moments that have shaped our nation. Now, in Christmas in America, this adorable pachyderm explores the tales and traditions that have made Christmas a cherished part of the American experience. Authored by Callista Gingrich and illustrated by Susan Arciero, Christmas in America will delight readers who want to discover how the celebration of Christmas has prevailed and brought out the best in our nation. "}, {"id": "B01L97H8CK", "genre": "Children's Books", "title": "Larry Gets Lost in Prehistoric Times: From Dinosaurs to the Stone Age", "description": "This is a first in a new Larry Gets Lost series that features adventures back through time. In Larry the lovable pup's latest adventure, he falls asleep at home next to Pete (who is reading a book about dinosaurs) and travels back in time, waking up in the pre-historic era! Starting with dinosaurs, where he encounters some big (the Tyrannosaurus Rex and Tricerotops), and others small (the Iberomesornis), he tumbles forward to the Ice Ages where he meets a Wooly Mammoth, and on to the cavemen of the Stone Age. But will he ever find his way back to his best friend Pete and the family again?"}, {"id": "0531254836", "genre": "Children's Books", "title": "Stingrays (Nature's Children)", "description": "Stingrays wide, flat bodies and long, spiked tails help them stand out from most other fish. Readers will discover how stingrays search for food along the ocean floor, how their flexible bodies make them such good swimmers, and just how deadly their tail spikes can be. They will also find out why certain stingray species are suffering from the pollution humans have brought to their aquatic habitats."}]