[{"id": "B00CQZ5RD2", "genre": "Science Fiction & Fantasy", "title": "7 Billion Needles, Volume 3 (7 Billion Needles Series)", "description": "Hikaru  Takabe used to be the class loner. She was that girl who always kept to  herself and would have rather had her headphones on at all times, even  during class sessions. She never dared open her heart to anyone. But  after she was obliviated by a meteor and rebuilt from her DNA up by a  cosmic creature called “Horizon” her outlook on life took a quick turn  for the positive.   Now Hikaru will have to host another  inter-galactic entity within her. Now the interstellar mass-murderer  “Maelstrom” has settled inside her along with Horizon. But this  completely new life-form not only has brought less privacy into Hikaru’s  life, but it may have changed the direction of evolution itself. As if  sensing the earth’s unusual state, a new existence proclaiming itself  “the moderator” suddenly appears in front of Hikaru. According to him  the earth is about to attempt a “macro evolution” in extreme chaos, so  that he needs to correct the process in case that it causes disorder of  the universe."}, {"id": "1932564160", "genre": "Science Fiction & Fantasy", "title": "Classic Battletech: Maximum Tech (FPR35013)", "description": "Shift Into High Gear! Rediscovered Star League technology gives the Inner Sphere a new edge on the battlefield! But new weapons require new tactics; now as never before, ingenuity counts more than toughter 'Mechs and bigger guns. Maximum Tech brings BattleTech players into this brave new world of warfare, where thinking on your feet can win the day. Take your BattleTech games to the max with Maximum Tech, the ultimate expansion rulebook for BattleTech players. Maximum Tech, is packed with dozens of Level Three optional rules, including new weapons and equipment for Inner Sphere and Clan forces; expanded rules for vehicles and infantry; double-blind rules; revised and expanded artillery rules; and much more! This revised edition of Maximum Tech has been updated for use with the BattleTech Master Rules as well as incorporating the units presented in the Technical Readout: 3060 and Record Sheets: 3060 into the Battle Value units table."}, {"id": "B01KQZT1GC", "genre": "Science Fiction & Fantasy", "title": "The Other", "description": "This YA-adult thriller takes place in the Zion Republic, a remnant of the American partition. Jason is being raised in an institution, the Centre, as a source of spare body parts for an identical twin, who is being groomed for eventual leadership in Zion. Jason grows to manhood, surrounded by cruel Centre keepers, sharing a strange mental bond with his twin, though neither is aware of the existence of the other. Unwilling to submit to an eventual  \"harvest\" by Centre surgeons when his twin becomes ill, Jason plots his escape from the Centre, placing him at odds with a wild and hostile environment, his twin and Zion’s highest authorities."}, {"id": "B01EXMWRO2", "genre": "Science Fiction & Fantasy", "title": "Thaumaturgic Ramblings of an UnMarried, UnEmployed Man-Boy-Child", "description": "Thaumaturgic ramblings by Pirzada is an attempt to induce a nuance in the publishing sector by introducing a book which contains, self-developed quotes, mini-essays and few paragraphs which reflect the thought process on the day's most pressing issues which are hidden in the human psychy and which every mind attempts to think through and maybe at some try to reconcile but gets too exhausted , distracted by the day's chores. This collection of quotes and mini paragraphs is an unsuspected stance of modern philosophy where it caters to an audience that has read, heard and seen it all and is in search for nuance and charisma through the lens of hopeful cynicism. It shows that the transformation of philosophy is moving towards a high density format where input explanatory volume may shrink but rate of change of input volume and the amount of shrinkage of it is equal and opposite to the increase  and expansivity in the amount and rate of interpretive volume. Hence brevity is taking charge and this books assumes that the audience is as brave, courageous and intellectual as the author. So grab that cuppa and give it a go and once you are done reading through, then bring it along to your local pub when you go down for a brief chat, hopefully that is where your fellow pub rats will learn about it leading to their much awaited illumination and the spark they have been missing in their pseudo-optimistic alcohol infused lives. Have a “nice” day !"}, {"id": "1929976496", "genre": "Science Fiction & Fantasy", "title": "1: Tarizon: The Liberaor (Tarizon Trilogy)", "description": "When a teenager discovers his father is working on a secret government project with aliens from the planet Tarizon, the project is compromised and Peter Turner must accept exile or be killed. Tarizon is recovering from a series of super volcanic eruptions that nearly destroyed all life on the planet. It is slowly recovering ecologically but the political situation is volatile. The fight is between the Purists who want to rid Tarizon of a growing mutant population and eliminate all non-human intelligent life-forms, and the Loyalists who want to restore the Supreme Mandate that guarantees freedom and basic rights for all humans and other sentient beings.  Videl Lai has become Chancellor in a tainted election. Once in power, he renounces Tarizon's constitution, The Supreme Mandate, and orders the extermination of all non-human life forms. The Loyalist party anticipating Videl's rise to power, has been planning a civil war to restore rule under the Supreme Mandate and stop the genocide. But the Loyalist Party is weak and there is little hope it will be able to defeat Videl Lai and his formidable army. The only hope seems to be a prophecy that foretells of the arrival of a Liberator from Earth who would lead a revolt to rid Tarizon of a ruthless dictator.  Peter, much to his shock and dismay, soon learns that many on Tarizon believe that he is this Liberator and is expected to lead the revolution against Videl Lai and free the Nanomites, Mutants and Seafolken from bondage."}]