[{"id": "1887734317", "genre": "Children's Books", "title": "The Enormous Turnip", "description": "Grandpa, Grandma, their son, Tom, Tom's wife, Anna, their children, Nina and Sam, Max the dog, and Muffy the cat all fail to uproot Grandpa's enormous turnip at harvest time until a bug lends a hand"}, {"id": "1464400016", "genre": "Children's Books", "title": "Batting Ninth (Champion Sports Stories)", "description": "Chad Griffin can't hit a baseball to save his life. When he steps up to home plate, he usually leaves after the umpire shouts, \"Strike Three!\" He always bats in the same spot for the Rangers—ninth—the worst hitter on the team. Even worse, he falls short of his dad's high expectations. But when the Rangers get a major-league all-star as their new coach, Chad's hitting begins to turn around. But hitting a baseball isn't Chad's only problem. As his team strives for the championship trophy, Chad learns the value of playing the game the right way in this fast-paced fiction adventure."}, {"id": "0746006071", "genre": "Children's Books", "title": "Make This Model Wizard's Castle (Usborne Cut-Out Models)", "description": "Using only glue, scissors or a craft knife, this book demonstrates how to make a historically-accurate model of a wizard's castle. In addition there are cut-out characters to add to the lively scenes."}, {"id": "1419715976", "genre": "Children's Books", "title": "Rutabaga the Adventure Chef: Book 1", "description": "In a world where there are dragons, wyverns, and haunted squash, you’d figure someone would have recipes for them, right? Rutabaga and his magic cooking pot, Pot, join young adventurers Winnifred, Manny, and Beef on a quest to defeat a dragon, discover new ingredients, find monsters to have for and/or to dinner, and to save the day through cooking. Rutabaga will dare any danger to uncover new tastes, and there’s a whole world full of food to try—from roasted mud leech to spider soup to peanut butter on crackers. His heroic recipes combine real ingredients, fantasy ingredients, and real ingredients that sound fantastical. Rutabaga the Adventure Chef is the perfect adventure for any kid grossed out when something weird shows up on the dinner table."}, {"id": "B00NRTI1O8", "genre": "Children's Books", "title": "The Ultimate Treasure Quest I: The Jewel of Peru", "description": "The Jewel of Peru is a magical adventure through time, taking young Captain Christopher and his loyal crew of orphaned stowaways on a perilous quest in search of Christopher's missing parents.After his father's ship is found abandoned at sea, Christopher makes an unexpected discovery on board—The Ultimate Treasure Chest! Inside is a message that beckons him to set sail after the treasure and his parents. When a savage pirate and a corrupt businessman join forces to steal the treasure for themselves, the gang gets caught up in pirate chases, time travel, and an underground network of spies.  Will Christopher find the Jewel and his parents, or will all be lost forever?"}]