[{"id": "0142414417", "genre": "Children's Books", "title": "Hot Hand (Comeback Kids)", "description": "From #1 New York Times bestseller Mike Lupica!It's simple. All Billy Raynor wants to do is shoot. After all, he is one of the best shooters in the league. But with his dad as his coach, and his parents newly separated, somehow everything's become complicated. His brother Ben hardly talks anymore. His mom is always traveling on business. And his dad is always on his case about not being a team player. But when Ben's piano recital falls on the same day as the championship game, it's Billy who teaches his dad the meaning of being a team player."}, {"id": "067084487X", "genre": "Children's Books", "title": "The Stinky Cheese Man and Other Fairly Stupid Tales", "description": "The entire book, with its unconventional page arrangement and eclectic, frenetic mix of text and pictures, is a spoof on the art of book design and the art of the fairy tale. The individual tales, such as The Really Ugly Duckling and Little Red Running Shorts, can be extracted for telling aloud, with great success. Another masterpiece from the team that created The True Story of the Three Little Pigs! -Horn Book"}, {"id": "1538210150", "genre": "Children's Books", "title": "Boats Go! (Ways to Go)", "description": "Boats are amazing machines that let us travel from place to play on water. Boats big and small all help us get around, navigating waters we couldn't travel without the aid of these helpful crafts. Young readers learn that boats are an exciting way to go in this book full of full-color photographs paired with accessible text. From visiting islands in the sea to crossing rivers and streams, they'll see how boats of all shapes and sizes are used by people to go from here to there."}, {"id": "1588343251", "genre": "Children's Books", "title": "The Smithsonian Book of Presidential Trivia", "description": "Which president holds the record for the most vetoes? Which president had the largest shoe size? Who was the only president to serve in both World War I and World War II? Who was the tallest president? These questions and many, many more are answered in The Smithsonian Book of Presidential Trivia, which has been fully updated to 2017 to include trivia question and answers about every US president to date.Divided into 11 chapters, The Smithsonian Book of Presidential Trivia looks at every aspect of our heads of state and presidential history: Citizens, Officers, Heroes, and Saviors; Stumping: From Front Porch to Facebook; The Pledge and the Parties; Inside the Oval Office; The Perpetual Podium; Home, Hotel, Parlor, Playground; First Families; Impeachment, Controversy, Shame; Assassination; Death, and National Mourning; Presidents in the Popular Imagination; and The Quotable President.Many of the questions are accompanied with photographs of artifacts from the Smithsonian's collections. The Smithsonian Book of Presidential Trivia is sure to puzzle the trivia buff and presidential expert alike!"}, {"id": "1680451960", "genre": "Children's Books", "title": "Make: Volume 49: Super Cheap Computers", "description": "Whether you know them as single-board computers, microcontroller boards, SoC boards, or credit card-sized supercomputers, we just call them boards. In this issue, we teach you how to pick a board for all kinds of different projects including education, home automation, wearables, robotics, and light & sound projects. Make: Volume 49 is the only guide you'll need to boards in 2016.In this issue:How to Choose a BoardKnow your BoardSecurity and the Internet of ThingsNew boards like CHIP, Raspberry Pi Zero, and the ESP8266Hacking Teddy RuxpinDIY BaconReddit Thinking Man PrinterA Concrete Japanese Lantern"}]