[{"id": "B01MYXCBGT", "genre": "Science Fiction & Fantasy", "title": "Malcor's Story", "description": "Can a paladin defeat a lich?Join this young knight and be instantly captured into a battle where Time itself is used as a weapon. To rise a paladin, he must remain true to the path, his faith, and the dragons he serves.You'll love this book because it follows a young knight into war, conflict with shadow dragons, and an epic battle against the most powerful of the undead: a lich! Unlike most knightly tales, Malcor is young but is supported by a war machine like you've never seen before. Pick up Malcor's Story now and join the adventure!"}, {"id": "1784967556", "genre": "Science Fiction & Fantasy", "title": "War for Armageddon: The Omnibus", "description": "Space Marines from multiple Chapters unite alongside Titan Legions and the Astra Militarum to defend the world of Armageddon from ork warlord Ghazghkull Thraka.In the bleak 41st millennium, the planet Armageddon is on the cusp of annihilation. The strategically vital hive world has captured the attention of infamous ork warlord Ghazghkull Thraka, and when the Astra Militarum and whole Titan Legions prove unable to halt the invasion, it is feared that both the planet and the wider sector will be lost to the greenskins. But the Imperium refuses to succumb and unleashes the Space Marines - genetically engineered warriors who thirst for naught but blood and victory. But can even this alliance of mankind's greatest warriors hope to turn the tide against Ghazghkull and his endless ork horde? This high-octane omnibus contains the classic novel Helsreach by New York Times bestselling author Aaron Dembski-Bowden, alongside four novellas and a host of short stories by some of Black Library best-known authors, including Guy Haley, Nick Kyme, Chris Wraight and Josh Reynolds."}, {"id": "B009NI2ZKI", "genre": "Science Fiction & Fantasy", "title": "The Acts of 1 - A Collection of Short Stories", "description": "There are times when a person’s life changes forever on one decision or action. Whether the choice is on impulse or well thought out, innocuous or major, these short stories of the paranormal and science fiction explores the actions and consequences of those decisions. Some of the stories are:The Prayer – A teenage boy who gets in trouble for beating up a bully at school wakes up in the hospital the next day, badly beaten from losing the same fight he won.The Note – A teenage couple each receive a strange note from themselves to meet at an abandoned house. Everything depends on it.A Flash In Time – A store manager driving home in a lightning storm in 1999 and after a blinding flash of lightning strikes near him, he’s in 2011.The Librarian – A librarian and her coworkers face the pending relocation of their library due to budget cuts and need a miracle to save their historic building."}, {"id": "B0058KS220", "genre": "Science Fiction & Fantasy", "title": "Spectra", "description": "Light years away from Earth a mining exploration crew makes an amazing discovery…intelligent life comprised entirely of energy. This living energy is so pure and unique, it could provide proof of the existence of the human soul. Those exposed to the entities gain unimaginable cognitive abilities but at a terrible cost.A rogue scientific group will do anything to maintain the mind enhancing gifts, even if it leads to the destruction of the peaceful beings.Only two people stand in their way, and they will sacrifice everything to end the slaughter.Could the quest for the secrets of life lead to the creation of true evil; one so dark it threatens to tear down the walls of sanity and redefine our very existence?"}, {"id": "B00EXV57LO", "genre": "Science Fiction & Fantasy", "title": "Sky Hunter (Targon Tales Book 0)", "description": "Air Command pilot Nova Whiteside is assigned to a remote outpost to guard the construction of a tethered orbiter, Skyranch Twelve, against rebel sabotage. The difference between the well-ordered Union air fields and this dusty garrison is made painfully clear when she runs afoul a brutal commander of ground troops.When she is trapped behind enemy lines in a bloody uprising she meets Djari, a civilian whose trust in the governing Union is shattered by what he has witnessed.Indeed, not all runs according to protocol aboard the new station and she soon suspects that more than farming is being done up there.  When she uncovers the treacherous and illicit schemes taking place, it seems that local riots are the least of their troubles."}]