[{"id": "163492598X", "genre": "Science Fiction & Fantasy", "title": "The Ringmaker", "description": "This is the story of the Ringmaker, a woman working to harness the power-hungry will of her Tundin people's Council for the greater good of all, though she bears the stigma of Namelessness (she is a dragon changeling). When she is abducted in a political coup, she becomes the target of a madman, also a dragon changeling, who seeks to unbind the fabric of the world with lost and potent magic. She escapes his prison, but not his psychological torment.   On her journey to confront her captor, the Ringmaker meets a fellow traveler who has also suffered losses and who must come to grips with his greatest fear: his father's hidden legacy. Together, they craft a love from loss, and grief, and the Ringmaker unlocks a treasure trove of her own gifts as she comes to terms with her tormentor's villainy, and confronts him in a dream-time landscape for the final harrowing conclusion."}, {"id": "B0773Y9NQX", "genre": "Science Fiction & Fantasy", "title": "The Uprising (Erafeen Book 3)", "description": "With the Jestivan divided, their enemies only grow stronger.As the school of Phesaw closes its doors indefinitely, the Jestivan scatter across the realm. From traveling the Archaic Mountains with bounty hunters, sailing the Realm Rivers with a pirate crew, to attending a school in the city of Brilliance with the brightest minds the world has ever seen ... the young elites will chase their own goals.And as the Light Realm’s talented youth splits apart, the opposition strengthens. The Dark Realm has become united, and they continue to gain more allies from unexpected places. Only a few of the Jestivan will find themselves in position to change the global narrative while others fight personal demons of their own.Led by the relentless duo of the Dev King and Rogue Demon, the political landscape of Kuki Sphaira is shifting. The Dark Realm has never been this close to toppling the Light.The balance of power will tip, war will be declared, and an uprising starts it all."}, {"id": "0451231899", "genre": "Science Fiction & Fantasy", "title": "Freedom (TM)", "description": "The New York Times bestseller Daemon unleashed a terrifying technological vision of an all-powerful, malicious computer program. Now, our world is the Daemon's world—unless someone stops it once and for all...The Daemon is in absolute control, using an expanded network of shadowy operatives to tear apart civilization and build it anew. Even as civil war breaks out in the American Midwest in a wave of nightmarish violence, former detective Pete Sebeck—the Daemon's most powerful, though reluctant, operative—must lead a small band of enlightened humans in a movement designed to protect the new world order.  But the private armies of global business are preparing to crush the Daemon once and for all. In a world of shattered loyalties, collapsing societies, and seemingly endless betrayal, the only thing worth fighting for may be nothing less than the freedom of all humankind."}, {"id": "161868681X", "genre": "Science Fiction & Fantasy", "title": "1897: Aliens! Vampires! Zombies!", "description": "When aliens accidentally unleash zombies on the Earth in the year 1897, the populace finds themselves in the midst of a different sort of war...In Poughkeepsie, New York, recent Vassar graduate Anita Hemmings joins with Mark Twain and Edith Wharton in a desperate fight for their lives.In Berlin, August Strindberg and the cast and crew of his latest play discover an underground elven city, hoping to find safety from the sudden onsalught.In Moscow, Alexander Scriabin and his wife Vera are rescued from peril by a vampire--only to meet with more vampires who are not as friendly.Meanwhile, the aliens enlist the resurrected figures Voltaire, Caravaggio, and Alexander Hamilton to help save the Earth from an ignominiously chewy death."}, {"id": "B00XBYREOW", "genre": "Science Fiction & Fantasy", "title": "The Path of Sorrow (The World Apparent Tales Book 2)", "description": "“A song of hope and sorrow, born on the coming storm.” After the cataclysmic events of The Best Weapon, an uneasy calm has descended over the world. The Winter Realm and the Old Kingdom are ruined by war, while the people of the southlands have retreated to their deserts and jungles, to lick their wounds and wait for better days. Fulk the No Man’s Son is now the lord of Silverback, and commander of the surviving Templar knights. Considered a heretic by many of his followers, he struggles to contain his unearthly powers. His half-brother Naiyar has returned to the deep jungle of his youth, where he prefers to live alone, isolated from his tribe. Both men notice the stars shift in the sky, and become aware of the rising of a new god.  On a remote tundra in the heart of the great continent of Temeria, a peaceful nomadic tribe is attacked at night and wiped out by a mysterious enemy. There is only one survivor, a boy named Sorrow. Hunted by Templar Knights, bloodthirsty pirates and an army led by an increasingly desperate slave-turned-sorcerer, Sorrow’s chances of survival are slim. He finds an unlikely saviour in the form of Bail, a ruthless assassin, and the pair realise they must stay together to stay alive... The Path of Sorrow is Book Two of The World Apparent tales, and continues the story of the half-brothers Fulk and Naiyar."}]