[{"id": "B007FSL2EI", "genre": "Children's Books", "title": "Catty Wompus: A Tale of Friendship: Catty Wompus Book 1", "description": "A 2010 Eric Hoffer Book  Award WinnerCan one person really make a difference?From award winning screenwriter, Julie Howe and artist Chason Matthams, comes this vibrantly illustrated, heartwarming story of how one little girl's kindness  makes a positive impact on the life of another.Catty Wompus is a lonely girl who believes happiness is achieved by wearing fancy clothes and being surrounded by material possessions.  But her unhappiness and lack of friends is distressing to one classmate, Lucy Hope.  When Lucy makes it her mission to help Catty see the light of friendship and that true happiness lies within ourselves, Catty Wompus blossoms before our eyes.Change really can take place with one act of kindness. And that one act becomes two as Catty pays her valuable lesson forward in the second book of the series:  Catty Wompus and the New Kid.  "}, {"id": "0316328782", "genre": "Children's Books", "title": "The Bravest Flute: A Story of Courage in the Mayan Tradition", "description": "The Caldecott Honor-winning author of The Village of Round and Square Houses offers an inspirational tale, featuring her own exuberant illustrations, about a brave Mayan boy who leads his village's New Year's Day parade, even though he is weak and hungry."}, {"id": "B01HRLWZ7K", "genre": "Children's Books", "title": "Bedtime Stories : Tortoise Beats Hare: Tortoise Children's Books,Bed time stories, Funny, Animal, Kids", "description": "This story goes on to show everyone that hurry, hurry has no blessings. Hare knows very well that he can beat tortoise in a running race and challenges him openly. He overtakes tortoise soon after the race kicks off, but it comes as a shocker when tortoise wins the race."}, {"id": "1101995866", "genre": "Children's Books", "title": "Hooray! My Butt Left the Bench! #10 (Here's Hank)", "description": "In this winning addition to the easy-to-read bestselling series, Hank has to hustle to prove he can be his basketball team’s secret weapon!For two years running, Hank's school has beaten their arch rivals at the annual second grade basketball game. When his friends try out, Hank is determined to play, too. There's just one problem: Hank is terrible at basketball. Luckily Dr. Dunk (AKA Hank's dad) and Hank's friends have his back. With a little help, Hank just might be what the team needs to win their first three-peat in PS 87 history!This bestselling series written by Henry Winkler and Lin Oliver is perfect for the transitional reader. With a unique, easy-to-read font, endless humor, and characters every kid would want to be friends with, any story with Hank is a slam dunk!"}, {"id": "0394800273", "genre": "Children's Books", "title": "Snow (I Can Read It All By Myself)", "description": "An easy reader about the joys of playing in the snow!This classic Beginner Book edited by Dr. Seuss is a delightful ode to winter. Brrrrr—it snowed! From snowball fights and skiing to fort building and snowman-making, P. D. Eastman and Roy McKie’s Snow will have young readers eager for the kind of fun only a wintry-white day can bring. Perfect for enjoying with a cup of hot cocoa, it makes an ideal gift for the holidays, and happy occasions of all kinds! Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.\"Joyful verse relates the many ways to enjoy snow. First graders will love it.\"--Chicago Tribune.  "}]