[{"id": "B01H0PP49E", "genre": "Children's Books", "title": "I Love to Go to Daycare (Chinese English Bilingual Edition)", "description": "Chinese English Bilingual Children's Book. Perfect for kids studying English or Chinese as their second language. Jimmy, the little bunny, is very upset and nervous. Tomorrow is his first day in daycare, but he just wants to stay at home with his mom. Join Jimmy to find out how his friendly teddy bear helps him to feel excited. This children’s book can help your little ones overcome their worries of leaving their parents for the first time, while helping them to adjust to new changes. Finally, Jimmy discovers how much fun daycare really is!"}, {"id": "0985245719", "genre": "Children's Books", "title": "How I Sent My Hug Around the World", "description": "When an ewwey-stewey-cranky-with-youey bad mood sweeps through a young girl’s family and then spreads around the world like a contagious cold, Tippi wonders how she can reverse the global Grrr…. Discover how a simple loving gesture sends her dancing–prancing spirit through the interconnected lives of people of all cultures, to cockatoos and peas and dragons from the seas, and how?one hug at a time?everyone has the power to create a kinder, more joyful world."}, {"id": "1435891368", "genre": "Children's Books", "title": "20 Soccer Legends (World Soccer Books)", "description": "Since 1930, the World Cup has brought teams from around the world to compete in the global soccer competition; this exciting series presents the great legends, games, teams and superstars of the World Cup and shows how they have changed history."}, {"id": "163517497X", "genre": "Children's Books", "title": "NASA and the Astronauts", "description": "Explores scientists' thrilling quest to send humans into outer space. Engaging text, vibrant photos, and informative infographics help readers learn about this important advancement in exploring space, as well as the people and technology that made it possible."}, {"id": "B00C2YXDYW", "genre": "Children's Books", "title": "101 Animal Babies", "description": "The 4th book in the popular 101 ANIMALS series!Did you know that sea turtle mothers leave their babies to hatch from their eggs completely on their own? Or that baby gorilla black-backs are carried around for as long as three years after they are born? In 101 Animal Babies, readers will learn about penguins and sea-horse fathers that guard and hatch their eggs, birds that teach their chicks to fly, kangaroos that keep their joeys safe in pouches, and wolves that teach their pups to hunt.Filled with fascinating facts and adorable full-color photos on every page, 101 Animal Babies is sure to be an instant favorite for kids, parents, and teachers alike!"}]