[{"id": "0826600204", "genre": "Children's Books", "title": "A Touch of the High Holidays: A Touch and Feel Book for Rosh Hashanah, Yom Kippur and Sukkot", "description": "Tactile Tishrei guide for toddlers. Warmly illustrated holiday scenes include a sticky honey pot, a bumpy etrog, a soft Torah cover, and more that invite hands-on exploration. Printed on tear- and tooth-proof glossy board."}, {"id": "1508172641", "genre": "Children's Books", "title": "20 Great Career-Building Activities Using Youtube (Social Media Career Building)", "description": "More than three-quarters of teens between the ages of fifteen and seventeen watch more videos on YouTube than they watch traditional TV, according to the BBC. The online video sharing service has videos about news and pop culture, TV shows, how-to videos, music videos, movie trailers, political and historic speeches, and sports events, among other videos. Celebrities promote their work and businesses advertise their products and services on YouTube. This resource offers teens tips on how they can use YouTube to help with their personal creative endeavors, artistic expression, school-related projects, college applications, job prospects, and personal development."}, {"id": "1450762530", "genre": "Children's Books", "title": "FAME: Suzanne Collins - writer of \"HUNGER GAMES\": A Graphic Novel", "description": "Since leaving behind a career in children''s television, Suzanne Collins has made her mark on the world with her bestselling young adult book series, The Hunger Games, which is now in production as a major motion picture. FAME: Suzanne Collins offers a look at how events in her life helped shape the series that would make her a household name."}, {"id": "1843651998", "genre": "Children's Books", "title": "The Gentle Lion and the Little Owlet", "description": "A wonderful, beautifully illustrated tale of an unlikely friendship, based upon a true storyA plucky young owlet decides to try and find his own dinner one day, and so flies from the safety of his nest into the unknown world surrounding him. Little does he know that his nest is in a tree in the middle of a zoo—and he quickly finds himself face-to-face with a lion. Yet, instead of being eaten, the owlet and lion become friends. As the zookeeper tries in vain to rescue the owl, the owl comes up with a plan to help the lion escape too."}, {"id": "0756635284", "genre": "Children's Books", "title": "DK Biography: Benjamin Franklin", "description": "Filled with archival photographs and amazing fact boxes, this groundbreaking series introduces young readers to some of history's most interesting and influential characters. DK Biography: Benjamin Franklin tells the story of the famous statesman's remarkable life, from his early childhood and upbringing through his scientific experiments, his politically active years in the U.S. and France, to his death and legacy. Supports the Common Core State Standards."}]