[{"id": "1416958460", "genre": "Children's Books", "title": "Dora's Sunny Day Fiesta: Follow the Reader Level 1 (Dora the Explorer)", "description": "It's not an activity book . . . it's an interactivity book! Join Dora on a sunny day as she talks, sings, and makes music thanks to incredible portable sound technology! It's the book you can play again and again with the talking pen!"}, {"id": "1681195445", "genre": "Children's Books", "title": "Animalsaurus: Incredible Creatures from Prehistoric and Modern Times", "description": "Long ago, all sorts of magnificent animals walked, swam, and hunted across the Earth: sharks of enormous lengths, vehicle-sized armadillos, gigantic horned mammals, and many, many more. In this gorgeous guide to fascinating beasts of the prehistoric era, these creatures are compared with their closest modern relatives, or other living animals with amazing features. Packed with beautiful pictures, fascinating facts, essential stats, and scale diagrams, this paper-over-board package is a lush and comprehensive overview of prehistoric beasts."}, {"id": "1941216080", "genre": "Children's Books", "title": "The Muddy Foot Prince", "description": "The Muddy Foot Prince is the tale of Prince Oliver James Huntington IV, who loves to explore nature, splash in puddles, and get dirty, just like any young boy. The problem? He's a prince. He's supposed to play quiet, refined games. He's told to keep his good clothes clean and his royal bedroom tidy. Constantly in trouble for getting into mischief, the prince decides to venture out on his own. Things don't turn out as he plans ... But Prince Oliver isn't the only one to learn a lesson. Whimsical yet touching, The Muddy Foot Prince proves to be a relatable tale for readers of all ages!"}, {"id": "0375838678", "genre": "Children's Books", "title": "Harry and His Bucket Full of Dinosaurs: Into the Bucket (Pictureback(R))", "description": "Based on the popular new TV show on Cartoon Network, here is the tale of how Harry first discovered he could go into the the bucket to Dino-World. When Harry's hat gets dropped in the bucket and disappears, he is nervous about jumping in, but the hat was from Gran and Harry must have it back. At the urging of the dinosaurs, Harry jumps in and must explore throughout Dino-World to find his precious cap."}, {"id": "1419716581", "genre": "Children's Books", "title": "Rutabaga the Adventure Chef: Book 2: Feasts of Fury", "description": "On their mission to find only the most exotic ingredients for top-notch dishes, Rutabaga and his pet cooking pot, Pot, somehow manage to get themselves into a series of pickles. Amid the giant killer spiders, a desperate acting troupe, a nefarious thief, and a horde of toxic gubblins (nasty, goblin-like creatures) who threaten to take over the kingdom of Evanore, how is Rutabaga supposed to find any time to cook? Filled with the first volume’s same brand of humor and high jinks, this installment takes readers to new locations in the fantastical world Eric Colossal has created and showcases more out-of-this-world platters that “Ru” brings to life. As in the first book, in the back are three safe, easy-to-make recipes for all ages."}]