[{"id": "1410940721", "genre": "Children's Books", "title": "Migration from Africa (Children's True Stories: Migration)", "description": "African-American Migration will look at experiences of children through slavery, emancipation, post-War Caribbean migration to the UK, and current migration to USA / Europe from Africa."}, {"id": "0746069146", "genre": "Children's Books", "title": "The Roman Record", "description": "These funny, factual books take an imaginative, but historically accurate look at how a modern tabloid newspaper might have covered the issues of the past - but with tongue firmly in cheek"}, {"id": "0312503008", "genre": "Children's Books", "title": "First Words (Bilingual Bright Baby) / Primeras Palabras (Bebe Listo) (Spanish Edition)", "description": "Bright Baby First Words / Bebé listo primeras palabrasThis book will increase your child's vocabulary by associating words in both Spanish and English with beautiful pictures.Este libro aumentarà el vocabulario de su hijo ya que asocia palabras en Espanol y Ingles con bonitas ilustraciones."}, {"id": "B00Q386XAY", "genre": "Children's Books", "title": "Holiday Magic (A Spellbound Christmas Story)", "description": "*100% of profits from Holiday Magic benefit the Make A Wish Foundation. Now through Christmas 2014.*Every day is a gift worth celebrating—especially when you’ve died not once, but twice.Ever since giving up her powers, Lee has had to adjust to life without magic. It’s never been harder than when she and boyfriend Raj McKenna travel to Paris to spend winter break with Lee’s duplicate, Gray, and her boyfriend, Adrian Montez.Celebrating the holidays with the shifty warlock isn’t Lee’s idea of a holly jolly good time, but she fears poor Gray is still under the influence of a love spell. Why else would she settle down with the brute? It’s up to Lee to make sure her duplicate isn’t being duped.Holiday Magic is a special edition Spellbound story about love, forgiveness and second chances.(Recommended after reading the Spellbound Trilogy, but can be enjoyed as a stand-alone story. 11,000 words.)"}, {"id": "1419711989", "genre": "Children's Books", "title": "The Misadventures of Salem Hyde: Book Three: Cookie Catastrophe", "description": "Ah, the great outdoors. Tents, sleeping bags, nature walks, campfires . . . and maybe a few spells thrown in for good measure! In this entry in the series, Salem takes her first camping trip with the Squirrel Girls, but neither Whammy nor Salem is cut out for roughing it. Salem believes a bit of magic will smooth the way . . . but as usual, it creates more problems than it solves. Salem and Whammy are an irresistible duo in a book perfect for the youngest independent readers."}]