[{"id": "B007S7YF40", "genre": "Science Fiction & Fantasy", "title": "2012 Lunar Contact (Contact Series)", "description": "Available now-the entire trilogy in one volume \"Lunar Contact Complete Trilogy\" on Kindle for $4.99 Imagine a world where you and your five colleagues are the only humans. Imagine a world where automated factories can make anything you desire. A world filled with futuristic technology; gravity generators, androids, holographic computer displays, telepathic communication, plasma fields, nano-welding, pulse rifles, charged particle cannons, personal spaceships, warships, time crystals and faster than light travel.Now imagine a world surrounded by hostile aliens that only seek your destruction and the conquest of all planetary bodies. Welcome to the world of   2012 LUNAR CONTACT.Start the adventure today.Thanks to all my readers for making 2012 Lunar Contact such a great success. It is now in the top 100 Best Selling Science Fiction Novels and sales continue to grow. And a big thank you to everyone that took the time to email me with your comments, praise for the book, and request for a sequel. The Sequel will be coming soon! (I am still packing more action into it.)Thanks again,JD Clarke"}, {"id": "B01JGX6DFM", "genre": "Science Fiction & Fantasy", "title": "Age of Heroes (The Pantheon Series)", "description": "CHILDREN OF THE GODS!Born of the Gods, created to be their champions, their names echo in eternity: Theseus, Perseus, Hippolyta, Heracles, Helen of Troy and all their half-mortal ilk. But the Age of Heroes is long past, and no more epics are told of their deeds. Blessed – and cursed – with eternal life, they have walked the Earth for millennia, doing their best to fit in among ordinary humans, taking new names and living new lives.And one by one, the demigods are meeting terrible, bloody ends.Now it’s up to Theseus, comfortably ensconced in New York and making his living as a crime fiction writer, to investigate the deaths. His search for the culprit draws him back into the lives of his dysfunctional extended family, and into a world of tragedy and long-held grudges that he thought, and hoped, he’d put behind him."}, {"id": "1580630200", "genre": "Science Fiction & Fantasy", "title": "The Zen of Oz: Ten Spiritual Lessons from Over the Rainbow", "description": "Does The Wizard of Oz touch a spiritual chord in each one of us because it has a certain Zen to it? Glinda, the Good Witch of the North, is clearly a Zen Master. She sets Dorothy on the Yellow Brick Road to spiritual enlightenment. When Dorothy, the Scarecrow, the Tin Man, and the Cowardly Lion let go of their conscious yearning and free their minds to function spontaneously and inharmony with the cosmos, brains, heart, and courage flow easily and effortlessly. Ultimately, Dorothy attains satori, the Zen experience of \"awakening.\" She finds her true Self, her higher consciousness, her ultimate Oneness with the cosmos--and her home."}, {"id": "0765324385", "genre": "Science Fiction & Fantasy", "title": "Crown of Vengeance (The Dragon Prophecy Trilogy)", "description": "Mercedes Lackey and James Mallory, bestselling authors individually and together, return to the world of their New York Times and USA Today bestselling Obsidian and Enduring Flame Trilogies with Crown of Vengeance.Here, readers will learn the truth about the Elven Queen Vielissiar Faricarnon, who was the first to face the Endarkened in battle and the first to bond with a dragon. She worked some of the greatest magics her world has ever known, and paid the greatest Price.Crown of Vengeance is an exciting fantasy adventure that will appeal to fans of Mercedes Lackey's Valdemar series. No previous knowledge of Lackey and Mallory's collaborations is necessary to enjoy this fast-paced, action-packed novel, but returning readers will be excited to discover this amazing story.Previous Trilogies set in the world of Crown of Vengeance:The Enduring Flame Series:The Phoenix UnchainedThe Phoenix TransformedThe Phoenix EndangeredThe Obsidian Trilogy:The Outstretched ShadowTo Light a Candle When Darkness Falls"}, {"id": "0786429100", "genre": "Science Fiction & Fantasy", "title": "Culture, Identities and Technology in the Star Wars Films: Essays on the Two Trilogies (Critical Explorations in Science Fiction and Fantasy)", "description": "Released in May 1977, the original Star Wars movie inaugurated the age of the movie blockbuster. It also redefined the use of cinematic special effects, creating a new textual universe that now stretches through three decades, two trilogies and generations of fascinated viewers. The body of critical analysis that has developed from this epic focuses primarily on the Star Wars universe as a contemporary myth. However, like any fiction, it must also be viewed and consequently analyzed as a product of the culture which created it. The essays in this book analyze the Star Wars trilogies as a culturally and historically specific phenomenon. Moving away from the traditional myth-based criticism of the films, the essayists employ a cultural studies model to examine how this phenomenon intersects with social formations such as economics, technology, race and gender. Critical approaches are varied and include political and economic analysis informed by feminism, contemporary race theory, Marxism, new media studies and post-humanism. Among the topics covered are the connections between the trilogies and our own cultural landscape; the problematic issues of race and gender; and the thematic implications of Lucas presentation of technology."}]