[{"id": "1600141048", "genre": "Children's Books", "title": "F-16 Fighting Falcons (Torque Books: Military Machines) (Torque: Military Machines)", "description": "The F-16 Fighting Falcon has been one of the most successful attack fighters in the history of the United States Air Force. Young learners will read about the extraordinary performance and the assortment of weaponry of this classic fighter plane."}, {"id": "B00NUMILME", "genre": "Children's Books", "title": "Helicopters (Penguin Core Concepts)", "description": "Helicopters are amazing machines. They can take off and land vertically, hover over an area, and fly forward, backward, and laterally. This new nonfiction 8x8 is full of fascinating facts and photographs of these incredible choppers."}, {"id": "1456731106", "genre": "Children's Books", "title": "Keiko The Koala", "description": "Everyone shares one thing in common. We are all different from each other and it is our diversity, which makes each person unique. \"Keiko the Koala\" is so much more than a book. It's a powerful tool for parents to teach their children how to build strong relationships and self esteem. Young children will cherish Keiko in their formative years because he is comforting and entertaining. This exciting story is immediately rewarding to children, as they hear about the adventure of a koala bear, who finds himself lost in the forest. As he meets other animals, he quickly learns that he is different from other bears. You feel the anticipation as Keiko searches for a way out of the forest. While on his journey, he meets a young boy named Cody and they become friends. Cody is sad because he is different from other kids. Keiko teaches him that being different is what makes us special"}, {"id": "1681521385", "genre": "Children's Books", "title": "Do You Really Want to Meet a Pterosaur? (Do You Really Want to Meet a Dinosaur?)", "description": "New titles in our popular animal series introduce young readers to five dinosaur species plus a family of flying prehistoric reptiles (the Pterosaurs). In each book, a child explorer travels back in time to meet these incredible animals and shares his or her experiences, which are based on fossil finds. Delightful illustrations and carefully crafted text help the stories come alive, making these books both educational and entertaining. A young child adventures back in time to 80 million years ago to meet the Pteranodon, one species of pterosaur, and learns what they ate, how they laid eggs, and how they lived with dinosaurs. This illustrated narrative nonfiction title includes a map of fossil findings, glossary, and further resources."}, {"id": "0545414539", "genre": "Children's Books", "title": "Rain & Fire (A Companion to The Last Dragon Chronicles)", "description": "A fascinating and comprehensive companion to the New York Times bestselling series, the Last Dragon Chronicles!  While the New York Times bestselling Last Dragon Chronicles has come to a close, husband and wife Chris and Jay d'Lacey have collaborated on RAIN & FIRE, a fabulous companion to the series. Fans will be able to explore d'Lacey's fiery world one last time as they uncover secrets behind all seven books and gain insight into the characters they thought they already knew. Revealing the inspiration behind the dragons and full of fun facts, little-known tidbits, informative glossaries, and never-before-seen images, RAIN & FIRE is sure to be a crowd-pleaser -- the perfect treat for devoted fans of the series who are hungry for more! And don't miss Chris d'Lacey's addition to his rich dragon mythology in his next series, The Erth Dragons!"}]