[{"id": "0140282033", "genre": "Science Fiction & Fantasy", "title": "Chocolat", "description": "Even before it was adapted into the Oscar-nominated film starring Juliette Binoche and Johnny Depp, Joanne Harris' New York Times bestselling novel Chocolat entranced readers with its mix of hedonism, whimsy, and, of course, chocolate.In tiny Lansquenet, where nothing much has changed in a hundred years, beautiful newcomer Vianne Rocher and her exquisite chocolate shop arrive and instantly begin to play havoc with Lenten vows. Each box of luscious bonbons comes with a free gift: Vianne's uncanny perception of its buyer's private discontents and a clever, caring cure for them. Is she a witch? Soon the parish no longer cares, as it abandons itself to temptation, happiness, and a dramatic face-off between Easter solemnity and the pagan gaiety of a chocolate festival. Chocolat's every page offers a description of chocolate to melt in the mouths of chocoholics, francophiles, armchair gourmets, cookbook readers, and lovers of passion everywhere. It's a must for anyone who craves an escapist read, and is a bewitching gift for any holiday."}, {"id": "1515047156", "genre": "Science Fiction & Fantasy", "title": "Revived (Snoqualmie Valley Sasquatch) (Volume 1)", "description": "A mysterious friend reappears in the lives of cousins Hannah and Jenna, and revives a haunting past. Tragic loss and prejudices lead to a search for answers about ancient myths that thrive in the Snoqualmie Valley of Washington State. Does modern science hold the key, or does the truth lie in something supernatural? Heartbreak and hope encourage an unlikely romance while drawing out the darkness of unexpected enemies. Can the strength of their bond protect the friends from a fearful future?"}, {"id": "B01M0ZIVQL", "genre": "Science Fiction & Fantasy", "title": "The Dying & The Dead 2: A Post Apocalyptic Thriller", "description": "Haven't started The Dying & the Dead? Get Book 1 now at: http://amzn.to/2dGU9QaAn Outbreak that destroyed the world…A gene that granted immunity to some…An empire that hunts them for their flesh…The Capita spread their talons across the Mainland, destroying survivor settlements and killing any who won’t join them. They hunt  those who are immune  to the virus and transport them to Camp Dam Marsh, where the flesh will be stripped from their bodies and used to cure people who have been bitten by the infected.Eric and Kim find themselves on a train bound for Dam Marsh. He knows that his mum and sister may have been taken there when they were captured by the bounty hunter, Charles Bull. Kim wants nothing more than to escape and find her own mother. Dam Marsh is run by Doctor Scarsgill and an old man named Goral Vitch. They are dark men with nasty secrets, and neither will let the children leave there alive.Kim’s mum, Heather, is halfway across the Mainland in the company of Charles Bull. She needs to find her daughter, but the bounty hunter is the only person who can guide her there. As much as she despises him, she knows she will have to try and trust the loathsome man.Ed and Bethelyn have escaped Golgoth island and are on The Savage’s boat. They are crossing the Albusian sea when a storm hits and they wash up on the shores of Loch-Deep, a dark place where a terrible creature is said to live.Can Ed and Bethelyn trust the cannibalistic Savage enough to let him lead them out? Will Ed find his brother James, who for years he thought was dead? Will Eric and Kim escape Camp Dam Marsh?Is Heather going to keep Charles Bull under control long enough to find her daughter?"}, {"id": "0786965681", "genre": "Science Fiction & Fantasy", "title": "Rise of the King: Companions Codex, II (Forgotten Realms: Companions Codex)", "description": "In the second book of the Companions Codex, the latest series in the New York Times best-selling saga of dark elf Drizzt Do'Urden, R.A. Salvatore picks up with the fan-favorite storyline of dwarf king Bruenor Battlehammer and his bloody feud with the orc kingdom of Many Arrows."}, {"id": "1588468682", "genre": "Science Fiction & Fantasy", "title": "Pillar of the Sun  (EXALTED)", "description": "Against the Barbarian Horde   The First Age Lunar Ma-Ha-Suchi has unleashed a barbarian army to ravage the Hundred Kingdoms, looting and burning everything in its path on a relentless march into the heart of the Realm. Nothing can stand against the Arczeckh horde - until it crosses paths with Panther, a former pit-fighter whose fearsome skills were legendary even before his Exaltation   Pillar of the Sun   Exalted: Pillar of the Sun is the fourth in an unlimited series of novels based on the hugely successful Exalted property."}]