[{"id": "1594747156", "genre": "Science Fiction & Fantasy", "title": "William Shakespeare's The Empire Striketh Back (William Shakespeare's Star Wars)", "description": "The saga that began with the interstellar best seller William Shakespeare's Star Wars continues with this merry reimagining of George Lucas's enduring classic The Empire Strikes Back.  Many a fortnight have passed since the destruction of the Death Star. Young Luke Skywalker and his friends have taken refuge on the ice planet of Hoth, where the evil Darth Vader has hatched a cold-blooded plan to capture them. Only with the help of a little green Jedi Master—and a swaggering rascal named Lando Calrissian—can our heroes escape the Empire's wrath. And only then will Lord Vader learn how sharper than a tauntaun's tooth it is to have a Jedi child. What light through Yoda's window breaks? Methinks you'll find out in the pages of The Empire Striketh Back!"}, {"id": "B0778ZHWWX", "genre": "Science Fiction & Fantasy", "title": "The 53rd Card: A Dark Tale about Finding Light", "description": "Yearning for that indefinable thing, that ever-elusive something one might call home? The 53rd Card may point your way to it.Agoraphobic Emma Addison is afraid of any place too far from home, afraid of outside. But when one Christmas Eve she inadvertently summons the devil, she opens a door that will not close.Emma dismisses her unbidden guest, though not before relinquishing a cherished stone carving of Kuan Yin—an unwitting concession that bestows on her an unusual power. This power isn’t much—not by diabolic standards—just a taste of something more. But it’s plenty enough to spark a craving for the devil’s tantalizing promise of more.And now Emma has some disquieting choices to make. Because if the devil is real, doesn’t that mean God is too? But if God is real, then why is the world such a mess and so desperately wanting the attention of the very power in her hands?Meanwhile, a door hangs open, an unmendable portal through which the devil will step again and again, through which a host of divine beings will follow, all with an agenda of their own. And impelled to the remotest regions of faith and doubt, Emma discovers a place beyond both—a place the reader just might recognize as home."}, {"id": "0786966319", "genre": "Science Fiction & Fantasy", "title": "D&D DUNGEON TILES REINCARNATED: WILDERNESS", "description": "Breathe life into your tabletop Dungeons & Dragons® game with these full color dungeon tiles.Infinitely expandable and easy to set up, these dungeon tiles allow you to create the adventures you want to play. This box contains 16 durable, double-sided, fully illustrated tile sheets, featuring grasslands, ruins, sandy beaches, and other terrain elements that Dungeon Masters can use to build exciting encounters. Use these tiles to make fantastic wilderness maps to enhance your tabletop roleplaying game experience. For use with the Dungeons & Dragons Fantasy Roleplaying Game."}, {"id": "1975326202", "genre": "Science Fiction & Fantasy", "title": "Wolf & Parchment: New Theory Spice & Wolf, Vol. 2 (light novel)", "description": "The young man Col and the daughter of the Wisewolf, Myuri, survived the scripture riots in the port town of Atiph. Col spends intense days being pined for after Myuri tells him about her love. Meanwhile, Heir Hyland commissions them for another next job. In the coming war with the Church's forces, control over the strait between the Kingdom of Winfiel and the mainland will play a crucial role. While Myuri is excited for a new adventure, Col cannot hide his unease after hearing about potential heresy among certain pirates for their faith in the \"Black-Mother\"!"}, {"id": "0316098094", "genre": "Science Fiction & Fantasy", "title": "Aurora", "description": "A major new novel from one of science fiction's most powerful voices, AURORA tells the incredible story of our first voyage beyond the solar system. Brilliantly imagined and beautifully told, it is the work of a writer at the height of his powers. Our voyage from Earth began generations ago. Now, we approach our new home.AURORA. "}]