[{"id": "1979840172", "genre": "Children's Books", "title": "Kids Sketch Book: Sketch Book for Kids To Enjoy The Imagination And Creativity For Drawing, Doodling, Writing And Sketching and Most of All Having Fun ... Cover (Sketch Books For Kids) (Volume 1)", "description": "Enjoy Wonderful and Magical Moment When You Fill This Book With Your Imagination and Creativity. Perfect Gift For Your Loved Ones Who Loves to Practice and Create. - Unicorn Cover with Empowering Affirmation- I Am Unique ! - 110+ Blank Sketch Pages, no lines no rules to express your Creative Energy - Ideal Gift from Grandparents, Parents to Loved Ones for Birthday and Christmas and From Teachers to Students to Celebrate Class Events. Be the Unique You ! Enjoy This Unicorn Sketch Book !"}, {"id": "B0089LOMEW", "genre": "Children's Books", "title": "One Direction: A Year with One Direction", "description": "One Direction are the biggest band on the planet. Celebrate their story with this official guide crammed full of exclusive interviews and never-seen-before photos."}, {"id": "153832461X", "genre": "Children's Books", "title": "The Luiseño (Spotlight on the American Indians of California)", "description": "Between two and three thousand years ago, the ancestors of the Luiseos settled along the coast of what is now southern California. The Luiseos have faced many challenges since that time. Today, they're considered one of California's most notable Native American groups. Students will learn about the history, culture, and traditions of the Luiseos. Primary sources and full-color photographs add visual depth to the informative text. Readers will enjoy learning about the interesting lives of these American Indians of California."}, {"id": "1432925911", "genre": "Children's Books", "title": "Bats (2nd Edition) (What's Awake?)", "description": "Each book in the 'What's Awake?' series opens the door to the world of a mysterious nocturnal animal. This book introduces the reader to the nighttime world of the bat. You will learn about the bat's habitat, nightly activities, diet, and the unique things that a bat does."}, {"id": "0307931528", "genre": "Children's Books", "title": "Big Girl Panties", "description": "Big Girl Panties! features a light, positive approach to motivate toddlers to become toilet trained. What could be more rewarding for a little girl than wearing big girl panties, just like mommy? Adult caregivers and toddlers alike will love the snappy, rhyming text and colorful, hip illustrations. Valeria Petrone's stylized artwork ensures that this commercial yet heartwarming book will have a special place on little girls' favorite bookshelves. Soon they'll all be saying, \"Bye, bye diapers!\""}]