[{"id": "0812551958", "genre": "Children's Books", "title": "Deadly Disguise (Freddy Kruegers Tales of Terror)", "description": "It's Halloween in Springwood and the place to be is the old Appleby mansion where the lord of the manor is none other than Jack Spyder, himself.Born John Appleby, Jack Spyder changed his name when he was eight, right after he was discovered in a national talent search and landed a role on a hit television sitcom. But like many child stars, Jack rose to fame too fast, and when he lost his parents suddenly in a terrible accident, he returned home to the mansion they owned in Springwood.Then teen idol Jack throws a Halloween bash--the party to end all parties. Not only has the local boy-made-good returned home, but it has also been rumored that the accident which Jack himself had been in had ruined his clean-cut good looks. Will he be as hideous as the gossip papers have suggested? Will the party be beyond Springwood's wildest expectations? Everyone is literally dying to find out."}, {"id": "0545222761", "genre": "Children's Books", "title": "Ride, Fly Guy, Ride! (Fly Guy #11)", "description": "The New York Times-bestselling Fly Guy series goes on an action-packed adventure by boat, train, plane, and beyond!Dad takes Fly Guy and Buzz for a car ride, but in a funny and wacky turn of events, Fly Guy is blown out of the car window and into a passing truck, where he lands in the driver's mouth! The driver spits him out, and Fly Guy tumbles onto a boat. Fly Guy then winds up on a circus train with an elephant and then an airplane ... and he just misses taking off with a rocket ship!This easy-to-read adventure concludes with Buzz, Dad, and Fly Guy returning home on a bike. Fly Guy loves RIDEZZZ!"}, {"id": "B01KGO4QRC", "genre": "Children's Books", "title": "Belly of this Great Land: A Hudson's Bay Adventure", "description": "Nathaniel is an adventurer with nothing to lose. Working for the Hudson’s Bay Company seems like the perfect job for the fourteen-year old. But when his party finds unexpected competition at every turn Nathaniel finds himself up against one of the greatest legends of Canadian history – Pierre Esprit Radisson. And Radisson doesn’t play fair. Can Nathaniel find a way to out-play one of history’s greatest players?A rip-roaring adventure full of Canadian spirit and intrigue, Belly of this Great Land is sure to entertain people of all ages."}, {"id": "1459412265", "genre": "Children's Books", "title": "Golden Goal (Soccer United: Team Refugee)", "description": "When Dylan doesn't get off to a good start at his new school and gets in trouble for fighting, he has to join the soccer team with a group of immigrant and refugee students who play on a rough, gravel field. Mocked by his old team, Dylan becomes determined to bring his new team to the championship finals. Getting to know his teammates opens Dylan\u0092s eyes about hardship, and shows him the value of a goal that wins in sudden-death play — a golden goal.Golden Goal is one of four new books that offer readers insight into the experiences of refugee youth as they adjust to life in North America."}, {"id": "1631409735", "genre": "Children's Books", "title": "Angry Birds Comics: Game Play", "description": "One of the most popular mobile games ever brings down the house in an explosive comic series for readers young and old alike!Featuring art and stories from some of today's finest storytellers, this new volume is guaranteed to please readers of all ages who love the Angry Birds app or great comics in general! Follow the adventures of the angriest bird, Red; Chuck, who has no filter; Bomb, who's just a blast; Matilda, the hippie of the flock; the bad Piggies; Terence, who is really big; and Stella, the feisty optimist."}]