[{"id": "B074F21HGX", "genre": "Children's Books", "title": "Easter Island: Giant Stone Statues Tell of a Rich and Tragic Past", "description": "Giant stone statues on Easter Island (also known as Rapa Nui) reveal a rich and complex history. Few places in the world are as mysterious or intriguing as Easter Island, a tiny, isolated volcanic outcrop in the Pacific Ocean. When Europeans first stumbled on Easter Island in the 1700s they found a rocky, treeless coast lined with rows of giant stone statues, and a quiet farming and fishing community. Since then, this remote island has raised many questions. Who were the first inhabitants, and where did they come from? And why did they create such giant stone structures? Answers to many of these questions have been uncovered by archeologists or found in legends and family histories. This book, illustrated with brilliant color photographs, gives a clear and concise account of one of the most fascinating places on earth."}, {"id": "1404809694", "genre": "Children's Books", "title": "The Gingerbread Man (Read-It! Readers: Folk Tales)", "description": "A freshly baked gingerbread man escapes when he is taken out of the oven and eludes a number of pursuers until he meets a clever fox."}, {"id": "0316133515", "genre": "Children's Books", "title": "Kitty & Dino", "description": "When a little boy brings home a dinosaur egg, the cat of the house isn't too keen on the tiny creature that pops out. But after a few weeks of showing the new baby the ropes, a bond forms between kitty and dino that transcends species. Featuring stunning and fluid line work from artist Sara Richard, Kitty & Dino will win the hearts of children everywhere."}, {"id": "0750240555", "genre": "Children's Books", "title": "My Sikh Year (A Year of Religious Festivals)", "description": "This book moves chronologically through the calendar year and looks at the typical events, customs, and celebrations celebrated by Sikh children. Festivals such as Vaisakhi, Hola Mohalla, Diwali, and personal customs such as praying at the gurdwara are experienced through the use of religious articles, books, buildings, symbols, and food. Look inside eight-year-old Amar's diary to read what it's like to be at each event."}, {"id": "159325220X", "genre": "Children's Books", "title": "Jesus Speaks to Me about Easter", "description": "The books is for children ages five to ten. \"I'm alive, I love you, and I'm always with you.\" That's the message Jesus tells young readers in this beautifully illustrated book about the story of Easter. Jesus \"speaks\" in a personal way to the children, not only about his glorious resurrection, but also about the exciting adventure of the disciples following Easter. St. Peter's amazing dream, St. Paul's conversion, Philip's rid in a chariot - all of these events will help children understand the true meaning of Easter and the new life that Christ has won for them!"}]