[{"id": "1772754447", "genre": "Children's Books", "title": "Disney Darkwing Duck: Orange Is the New Purple: Comics Collection (Disney Darkwing Duck Comics Collection)", "description": "Catch Darkwing Duck, Launchpad McQuack, Gosalyn, and more in this collection of issues 1–4 of the Disney Darkwing Duck comic series from Joe Books.The Terror that Flaps in the Night clashes with a villain who may be unstoppable, and faces off with his arch nemeses Megavolt and Negaduck as they wreak havoc on the city. Don't miss the slapstick, crime-fighting adventures of the feathered protectors of St. Canard in this four-issue comics collection."}, {"id": "0833568345", "genre": "Children's Books", "title": "Harry Houdini: Young Magician (Turtleback School & Library Binding Edition) (Childhood of Famous Americans (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. A biography of Harry Houdini, concentrating on his earlier years and the training that made him a master magician and escape artist."}, {"id": "B078C6XRM2", "genre": "Children's Books", "title": "Make More Noise!: New stories in honour of the 100th anniversary of women’s suffrage", "description": "An incredible collection of brand new short stories, from ten of the UK's very best storytellers, celebrating inspirational girls and women, being published tocommemorate the 100th anniversary of women's suffrage in the UK. Featuring short stories by Kiran Millwood Hargrave, author of the Waterstones Children's Book Prize-wining The Girl of Ink and Stars, M.G. Leonard, author of Beetle Boy, Patrice Lawrence, author of the Waterstones Children's Book Prize-winning Orangeboy, Katherine Woodfine, author of The Mystery of the Clockwork Sparrow, Sally Nicholls, author of Things a Bright Girl Can Do, Emma Carroll, author of Letters from the Lighthouse, and more! £1 from the sale of every book will be donated to Camfed, an international charity which tackles poverty and inequality by supporting women's education in the developing world."}, {"id": "0736433546", "genre": "Children's Books", "title": "LET'S STICK TOGETHER", "description": "Join Anna, Elsa, and Olaf for hours of fun with this deluxe color and activity book that features over 1,000 stickers! It’s the perfect gift for boys and girls ages 3 to 7 who love Frozen."}, {"id": "1945069031", "genre": "Children's Books", "title": "Cake for Breakfast Every Day", "description": "Imaginative children's story with 28 colorful full-page illustrationsFive stars on Amazon - \"The message is so sweet and important! A must read!\" - Sara M\"I would do everything she did. I love it!\" - Katrina, age 9\"Cake for Breakfast Every Day\" is a feel-good story available in English and bilingual Spanish, French and Traditional Chinese editions for families to share. The story is that of a little girl who imagines all the fun things she would do if she lived in a house with no rules. You'll be giggling as she collects 100 pets and puts a trampoline in her bedroom.Written and illustrated by award-winning journalist Kathleen Rasche, \"Cake for Breakfast Every Day\" is simple reading for reluctant readers. It's meant to be shared. Take the story off the page, too. Readers can imagine aloud all the fun they would have in a house with no rules. Of course, in the end the child realizes having someone to love her is better than anything she can imagine.The story is also published in bilingual editions - English and Traditional Chinese, English and French, and English and Spanish. Visit http: //www.cakeforbreakfasteveryday.com to watch the book trailer."}]