[{"id": "B00RQXS1VY", "genre": "Children's Books", "title": "Predators Of The World: Fun Facts and Pictures for Kids (Wildlife for Kids)", "description": "Children usually do not live in areas where they are exposed to the great predators of the wild. Their sense of wonder is boosted when they learn about bears, sharks, spiders, and tigers who serve as earth's great and small predators. Kids also learn that predators are not evil in any way and that the belief these creatures are \"monsters\" is wrong. Upon seeing the truth about these animals and the size and scope of the natural world, a sense of wonder and imagination grows."}, {"id": "0613341155", "genre": "Children's Books", "title": "Celebrating Chanukah: Eight Nights (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Explains to students of all faiths the significance of Chanukah to those who celebrate the holiday. Emergent Reader book."}, {"id": "B01AR3C3V8", "genre": "Children's Books", "title": "One Egg, Too Much Trouble", "description": "A dragon couple is surprised to find their egg bore not one, but two baby dragons. The new parents are exhausted by raising twins, but they manage. The baby dragons grow, eat and play but eventually start fighting one another. For a therapeutic change of scenery, the family goes on a camping trip. When the boys get lost in the woods, they realize how nice it is to have a twin sibling and how important a loving family really is."}, {"id": "1419728253", "genre": "Children's Books", "title": "Hero vs. Villain: A Book of Opposites", "description": "Hero vs. Villain is a gently irreverent book of opposites with a slight narrative that plays on the popularity of benign villains and superheroes. Their adversarial relationship makes heroes and villains the perfect stars for a book about opposites. But can sworn enemies learn to be friends?"}, {"id": "0316392863", "genre": "Children's Books", "title": "The Littlest Train", "description": "In this endearing story of a tiny toy train, the creator of the hit series Dinotrux now breathes life into more than a half-dozen trains that climb, haul, chug, zip, and zoom.In a small room, down a short flight of stairs, there lives a little toy train...about to have a BIG adventure! There's an endless world to explore, and awe-inspiring new friends to meet. Mighty Max, Chloe Cogs, Sara Speedster, and Farley Freighter can reach all the best sights, lickety-split. But when the day is done and the sun goes down, will the littlest train find his way home? Calling all train lovers: All aboard!"}]