[{"id": "054569082X", "genre": "Children's Books", "title": "The Taken (Foxcraft #1)", "description": "The first book in a thrilling fantasy trilogy starring one of the animal kingdom's most hunted heroes. Foxcraft is full of excitement and heart, and a touch of magic. Isla and her brother are two young foxes living just outside the lands of the furless -- humans. The life of a fox is filled with dangers, but Isla has begun to learn mysterious skills meant to help her survive. Then the unthinkable happens. Returning to her den, Isla finds it set ablaze and surrounded by strange foxes, and her family is nowhere in sight. Forced to flee, she escapes into the cold, gray world of the furless. Now Isla must navigate this bewildering and deadly terrain, all while being hunted by a ruthless enemy. In order to survive, she will need to master the ancient arts of her kind -- magical gifts of cunning known only to foxes. She must unravel the secrets of foxcraft."}, {"id": "0822568020", "genre": "Children's Books", "title": "Jeff Gordon (Revised Edition) (Amazing Athletes)", "description": "Recounts the life of race car driver Jeff Gordon, whose highly successful, record-breaking career was kicked off when he was four years old and received a quarter midget race car from his father."}, {"id": "0823436691", "genre": "Children's Books", "title": "Magnets Push, Magnets Pull", "description": "We can’t see magnetism, but it’s everywhere around us―even the Earth is a giant magnet! In this fun and accessible book, David A. Adler covers the basics of magnetism. Terms such as attraction, pole, electromagnetism and force are plainly explained, while Anna A. Raff’s lively art illustrates these concepts clearly. Suggested activities include instructions to make your own magnet! Kids who read this direct and uncomplicated introduction will learn to appreciate how magnetism powers our world."}, {"id": "0374330719", "genre": "Children's Books", "title": "Hidden Child", "description": "A powerful story of survival, loss, and hopeIsaac was seven when the Germans invaded France and his life changed forever. First his father was taken away, and then, two years later, Isaac and his mother were arrested. Hoping to save Isaac’s life, his mother bribed a guard to take him to safety at a nearby hospital, where he and many other children pretended to be sick, with help from the doctors and nurses. But this proved a temporary haven. As Isaac was shuttled from city to countryside, experiencing the kindness of strangers, and sometimes their cruelty, he had to shed his Jewish identity to become Jean Devolder. But he never forgot who he really was, and he held on to the hope that after the war he would be reunited with his parents.After more than fifty years of keeping his story to himself, Isaac Millman has broken his silence to tell it in spare prose, vivid composite paintings, and family photos that survived the war."}, {"id": "0786856858", "genre": "Children's Books", "title": "Shhh!", "description": "When everything gets too loud and voices are drowned out, a well-dressed shrew tells everyone to be quiet, sit still, and listen, in a wonderful story that demonstrates how silence can make a difference. Reprint."}]