[{"id": "1588465853", "genre": "Science Fiction & Fantasy", "title": "Mage the Awakening CHARACTER SHEET PAD", "description": "A Sheet for Everything   The Awakened struggle to rebuild their societies and carve out their own kingdoms on Earth. Witch, technomancer, shaman - which one are you?   A Play Aid for Mage: The Awakening   * Preprinted character sheets, customized for every playable path and order.   * Easy to photocopy or use as is - no need to photocopy your rulebook.   * Every player needs a sheet, making this a valuable play aid."}, {"id": "0812967127", "genre": "Science Fiction & Fantasy", "title": "The Day of the Triffids", "description": "In 1951 John Wyndham published his novel The Day of the Triffids to moderate acclaim. Fifty-two years later, this horrifying story is a science fiction classic, touted by The Times (London) as having “all the reality of a vividly realized nightmare.”Bill Masen, bandages over his wounded eyes, misses the most spectacular meteorite shower England has ever seen. Removing his bandages the next morning, he finds masses of sightless people wandering the city. He soon meets Josella, another lucky person who has retained her sight, and together they leave the city, aware that the safe, familiar world they knew a mere twenty-four hours before is gone forever.But to survive in this post-apocalyptic world, one must survive the Triffids, strange plants that years before began appearing all over the world. The Triffids can grow to over seven feet tall, pull their roots from the ground to walk, and kill a man with one quick lash of their poisonous stingers. With society in shambles, they are now poised to prey on humankind. Wyndham chillingly anticipates bio-warfare and mass destruction, fifty years before their realization, in this prescient account of Cold War paranoia."}, {"id": "B01E6DE7EQ", "genre": "Science Fiction & Fantasy", "title": "The 12th Dimension: The Timegate Series, Book 1", "description": "Our Earth is not the only one out there. Since the beginning of time, there have been twelve dimensions, each with its own Earth that is ruled by one of twelve supreme beings: Humans, Gods, Demigods, Alchemists, Shamans, Titans, Demons, Robots, Superheroes, Wizards, Prophets, and Fairies. Humans travel between these dimensions using devices called Timegates. But many of these dimensions live under the thumb of the evil Chthonian Empire, an interdimensional empire that seeks to conquer all twelve dimensions. The last free dimension is our world, Human Earth.In Los Angeles, an ordinary college student named Dewey Likens has been named as the Aviah, a special human with the magical power to influence the fate of entire dimensions. Only he has the power to stop the Chthonian Empire from conquering the twelve dimensions. Will Dewey realize his destiny? Find out in the first installment of the Timegate Series!"}, {"id": "0141394935", "genre": "Science Fiction & Fantasy", "title": "Twenty Thousand Leagues Under the Sea (Penguin Clothbound Classics)", "description": "Verne’s timeless underwater adventure story, now available in a new translation as a Penguin Classics black spine. In this thrilling adventure tale by the father of science fiction, three men embark on an epic journey under the sea with the mysterious Captain Nemo aboard his submarine, the Nautilus. Over the course of their fantastical voyage, they encounter the lost city of Atlantis, the South Pole, and the corals of the Red Sea. Along the way, they must battle countless adversaries both human and monstrous. This triumphant work of the imagination shows the limitless possibilities of science and the dark depths of the human mind.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."}, {"id": "0316339156", "genre": "Science Fiction & Fantasy", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon?, Vol. 1 - light novel", "description": "In Orario, fearless adventurers band together in search of fame and fortune within the monstrous underground labyrinth known as Dungeon. But while riches and renown are incentive enough for most, Bell Cranel, would-be hero extraordinaire, has bigger plans. He wants to pick up girls. Is it wrong to face the perils of Dungeon alone, in a single-member guild blessed by a failed goddess? Maybe. Is it wrong to dream of playing hero to hapless maidens in Dungeon? Maybe not. After one misguided adventure, Bell quickly discovers that anything can happen in the labyrinth--even chance encounters with beautiful women. The only problem? He's the one who winds up the damsel in distress! "}]