[{"id": "B019HML2IU", "genre": "Children's Books", "title": "Eli, No!", "description": "Eli is a sweet black dog with a knack for getting into huge messes. He makes his disastrous way through the house and the yard, at every turn disobeying his owners, who each time repeat with mounting exasperation, \"Eli, no!\" At the end of the day, there's only one important question left to answer: Do his owners still love him? Of course, in this case the answer is \"Eli, yes!\" Eli and his antics are depicted in clean, graphic spreads with a fresh and modern palette. Readers will enjoy adding their voices to the call of \"Eli, no!\""}, {"id": "B00BANVAIW", "genre": "Children's Books", "title": "My Love Is...(Read-Out-Loud Valentine's Day Kids Books) (Big Red Balloon Book 5)", "description": "Celebrate the holiday of love with this adorable Valentine's Day kids' book.This fun holiday book brings a cast of characters from across the animal kingdom as they share their expressions of love. Fully illustrated with bright charming pictures, this picture book will bring smiles and laughs to your little one's face. It's a great, quick read-out-loud book that you can share with your child before bed or anytime of the day.Share \"My Love Is...\" with your family and grab it today!"}, {"id": "0310758157", "genre": "Children's Books", "title": "With Love, From Me to You", "description": "A red heart sends a messagethat says \"I so love you,\"but we can send those same wordsin what we say and do. If I see someone cryingor looking very sad,I'll stop to show some kindnessand he won't feel so bad.With Love, From Me to You is a board book for little ones that will remind them how important it is to love and be loved. With adorable illustrations and sweet, rhyming text by bestselling author Dr. Mary Manz Simon, this book shows children how important their actions and words are in expressing God’s great love with one another. Parents will enjoy reading this book on Valentine’s Day or any day of the year to encourage their children to remember that love is more than gifts and candy; it’s about doing for others and sending love to everyone who’s near."}, {"id": "0310745535", "genre": "Children's Books", "title": "'Twas the Evening of Christmas", "description": "’Twas the evening of Christmas, when all through the town,Every inn was so crowded, no room could be found.Tired Mary and Joseph, who went door to door,At last found a place on a small stable floor.For over 200 years, families have gathered on Christmas Eve to hear the much loved words of Dr. Clement C. Moore’s ’Twas the Night Before Christmas. This year, families can gather together to share the real Christmas story––the story of Jesus’ birth. ’Twas the Evening of Christmas echoes the familiar language and rhythm of Dr. Clements’ poetry, but instead of focusing on Santa, it focuses on the baby Jesus, who is, after all, the true hero of Christmas. All families will delight in this simple retelling of the most famous story ever told. With a cover that comes alive with foil and sculpted embossing, this book is sure to become a Christmas classic."}, {"id": "0749631562", "genre": "Children's Books", "title": "Buddhist Temple (Where We Worship)", "description": "Part of the WHERE WE WORSHIP series which takes a first look at the principal religions of the world, explaining the features and functions of each place of worship. Illustrated with photographs and suitable for the National Curriculum at Key Stage 1."}]