[{"id": "B00AXJA1VG", "genre": "Science Fiction & Fantasy", "title": "Beat Down 3 - Badassaur!", "description": "After yet another championship win, the world's most awesome wrestler, Russell T. Goode, receives a letter from a fan on the other side of the world, asking for help.  Russell and his friends must journey to the high Andes Mountains to save a mythical beast known as the Badassaur from Kurt Sniveller's clutches.  In their most daring adventure yet the gang will face peril they could never imagine, while Russell will come face to face with the secrets of his own mysterious past . . . Beat Down 3 - The Badassaur is Michael S. Hunter's most thrilling adventure yet.Michael S. Hunter was born at the beginning of time and lives somewhere south of midnight in a quaint little town called Valhalla.  There he spends his time crushing rocks with his bare hands and snapping trees in his fingers.  Contact Michael at michaelshuntersbeatdown@gmail.com or visit the blog at www.beatdownonline.blogspot.jp.  For information on future releases be sure to sign up to the mailing list at http://eepurl.com/sRWK9Also by Michael S. Hunter -Beat Down 1 - ClonesBeat Down 2 - The HeistBeat Down 3 - Badassaur!Beat Down 4 - The Sneevla"}, {"id": "1539922944", "genre": "Science Fiction & Fantasy", "title": "Magifamilia", "description": "Three thousand years ago, the Magus came from the stars, forging the familias into immortal sorcerers with blood communion. He slashed his palms and bled lustrous ichors into chalices, stripping himself of dread powers whilst they drank his essence. Each communion drained him profoundly, and as he withered away, he hoarsely whispered dire warnings to his newly anointed disciples. The Magus foretold the coming of ancient horrors that would devour their very souls if they practiced magic openly, and swore them to eternal secrecy. He bade them knight only a chosen few with the sacred blood ritual. Then, in the stillness of dawn, he hobbled away into the desert sands, never to return... ...until now. As cosmic hunters descend and primordial foes awaken to settle old scores, an intergalactic conflict will pit the Magifamilia against the Iglesians and the Alchemist Cartel. Mafioso wizardry, angelic abominations, and futuristic weaponry collide in this genre-bending Lovecraftian fantasy series, which will span six novels."}, {"id": "1408467534", "genre": "Science Fiction & Fantasy", "title": "3: Doctor Who Collection Three: The Lost TV Episodes (1966-1967)", "description": "Dozens of Doctor Who TV episodes are lost as visual film recordingsbut they survive as audio soundtracks, digitally remastered with additional linking narration by members of the original cast. This handsome box set collects six Doctor Who adventures starring William Hartnell and Patrick Troughton as the first and second Doctors -- plus extra bonus material (bonus interviews with Anneke Wills and the BBC Radio 3 program Dance of the Daleks.)"}, {"id": "B00T06KWF8", "genre": "Science Fiction & Fantasy", "title": "Duplicate (Installed Intelligence Series Book 0)", "description": "You're dead. While your body has gone cold, your mind is installed onto a computer. You are immortal, providing the power stays on. But are you really you?Chris Santson asked himself that very question when he died. But then he came back. It shouldn't be possible for someone's mind to exist in a computer and a human body, yet here he was. And if he was still alive, then who is the real Chris?This science fiction short story is the prologue to the cyberpunk Installed Intelligence series by Phoenix Ward.This story was formally titled \"The Man With Two Bodies\"."}, {"id": "1601257635", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Player Companion: Dirty Tactics Toolbox", "description": " Make sure you never get stuck in a fair fight again with Pathfinder Player Companion: Dirty Tactics Toolbox. Learn how to use poisons, dirty trick maneuvers, sneak attacks, ambushes, and hidden equipment to more than even the odds in any encounter. This player-focused volume contains dozens of new feats, magic items, spells, and other character options to let you have a nasty trick or two up your sleeve, or become the unquestioned master of fighting dirty."}]