[{"id": "B01G5VME56", "genre": "Children's Books", "title": "Royal Children of English History (Annotated & Illustrated)", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors.This publication is an Illustrated Edition.\"History is a story, a story of things that happened to real live people in our England years ago; and the things that are happening here and now, and that are put in the newspapers, will be history for little children one of these days. And the people you read about in history were real live people, who were good and bad, and glad and sorry, just as people are now-a-days.\"E. Nesbit writes about some of the people behind the names, dates and battles of English History in this lovely book for older children."}, {"id": "184059537X", "genre": "Children's Books", "title": "My First Bilingual Book–Colours (English–Italian) (Italian and English Edition)", "description": "Guaranteed to enrich a toddler’s vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting the two basic concepts of colors and numbers, this collection combines photographs and colorful illustrations. All images include the words in both English and the second language in clear, bold text. Suitable for toddlers on their own or in groups, these books are a child’s perfect introduction to exploring new languages."}, {"id": "1843727927", "genre": "Children's Books", "title": "10-11 Mathematics Assessment Success Papers: 10-11 years, Leves 3-5", "description": "* This assessment series encourages pupils to work at their own levels and improve their abilities with further practice. * 24 papers with graded questions. A wide variety of test questions that check all topics. Guidance from experienced teachers on getting the best out of test practice. A glossary to help with difficult words. Helpful progress chart."}, {"id": "0316016306", "genre": "Children's Books", "title": "On the Court with...LeBron James (Matt Christopher Sports Biographies)", "description": "                Get on the court with basketball superstar LeBron James in this in-depth, updated biography!LeBron  James was a sensation in his early days playing ball in Akron, Ohio,  and he continued to amaze as a high school phenomenon. Now an  international icon and the heart of his hometown Cleveland Cavaliers, he  is widely known as one of the greatest basketball players ever to step  onto the court. Discover LeBron James's incredible story in this  in-depth biography of one of basketball's brightest stars. The book takes readers on the court through suspenseful accounts of pivotal games, paints a picture of LeBron's on- and off-court triumphs and challenges, and includes bonus  stats, career highlights, and photographs."}, {"id": "1423104315", "genre": "Children's Books", "title": "Disney Bunnies Thumper Makes a Splash", "description": " From fuzzy yellow ducklings to bright green frogs, Thumper is fascinated by his friends who live in the water. Splashing around looks like fun—but will Thumper make the leap? Thumper's mischievous antics and bendable, waterproof pages make this the ideal title for bathtime fun."}]