[{"id": "B01I72JJHC", "genre": "Children's Books", "title": "Gwenllian ferch Gruffydd: Tywysoges a Rhyfelwraig Deheubarth/The Warrior Princess of Deheubarth (Cyfres Merched Chwedlonol yn Hanes y Byd Book 6)", "description": "Princess Gwenllian ferch Gruffydd’s fascinating and tragic true story comes to life in this special bi-lingual Welsh-English edition!Born in 1097 in Aberffraw Castle, Princess Gwenllian ferch Gruffydd ap Cynan was always destined for great things.  Beautiful, kind, and one of the finest archers in all of Wales, Gwenllian’s courage against the Norman Conquest of Wales has inspired generations of Welsh for nearly one thousand years.Translated into Welsh by Gwenlli Haf.Perfect for students of both Welsh (Cymraeg) and English (Saesneg) languages."}, {"id": "1624162533", "genre": "Children's Books", "title": "MY BEST-EVER BOOK OF BIBLE STORIES", "description": "Its like Dr. Seuss meets the Biblehere are 17 great Bible stories, featuring hilarious rhyming and fun illustrations, for preschoolers through early readers. From author and illustrator Phil A. Smouse, winner of the Retailers Choice Award for his book"}, {"id": "0836249194", "genre": "Children's Books", "title": "Beauty And The Beast (Children's Classics (Andrews McMeel))", "description": "Through her great capacity to love, a kind and beautiful maid releases a handsome prince from the spell which has made him into an ugly beast"}, {"id": "B00M70S9FE", "genre": "Children's Books", "title": "Fart Squad", "description": "It was an average day at Harry Buttz Elementary until . . . KABLAM! The five-bean burritos churning in Darren Stonkadopolis's stomach exploded in a fart so volcanic it melted his desk seat, knocked out his whole class, and got him sent to the nurse—and he's not alone.Something fishy is going on in Buttzville. And it's up to Darren and his three farting friends to combine their potty powers to get to the bottom of this evil plot—before it's too late. With their scent-sei, Janitor Stan, at their side, the Fart Squad has to learn to harness the powers between their butt cheeks. And then let it RIIIP.\"A flagrant romp. Not to be passed!\"—The New York Toots\"A cut above the rest.\"—StinkyCheese.com\"If you haven't caught wind of Fart Squad yet, don't let this one go!\" —Rude News\"We've been dealt a winner!\"—SmeltIt.blog.com"}, {"id": "B0776FYRKX", "genre": "Children's Books", "title": "Brave Clara Barton (Step into Reading)", "description": "A Step 3 beginning-reader biography of Civil War nurse and founder of the American Red Cross Clara Barton!Meet a woman who outgrew her girhood shyness to became a fearless \"Angel of the Battlefield\"! This Step 3 biography follows Clara as she helps her brother recover from a terrible injury, overcomes her timidity and works as a teacher, and finally fights her way to the front lines of the Civil War, where she helps soldiers wounded in battle. Clara's story is a testament to the strength and grit of women, and is a role model who trancends history. Sarah Green's lovely and delicate illustrations render Clara's life in an appropriate and approachable way for young readers.Step 3 Readers feature engaging characters in easy-to-follow plots about popular topics. For children who are ready to read on their own."}]