[{"id": "078695499X", "genre": "Science Fiction & Fantasy", "title": "The Ghost King: Transitions, Book III", "description": "Don't miss the gripping conclusion to Salvatore's New York Times best-selling Transitions trilogy!When the Spellplague ravages Faerûn, Drizzt and his companions are caught in the chaos. Seeking out the help of the priest Cadderly–the hero of the recently reissued series The Cleric Quintet–Drizzt finds himself facing his most powerful and elusive foe, the twisted Crenshinibon, the demonic crystal shard he believed had been destroyed years ago.From the Hardcover edition."}, {"id": "B019S6ZYF2", "genre": "Science Fiction & Fantasy", "title": "Soldier of Fortune: A Gideon Quinn Adventure (The Fortune Chronicles Book 1)", "description": "On the planet Fortune, tech is low, tensions high, and heroes… unlikely, and none more unlikely than thief-turned-soldier, Gideon Quinn. Wrongly convicted of treason, Gideon Quinn has spent six years harvesting crystal under the killing suns of the Morton Barrens, until the day a general of the Colonial Corps arrives with an offer of freedom, and the chance to clear his name. Gideon doesn’t have to think twice, and with his pet draco Elvis on his shoulder he takes 'ship for the city of Nike in search of revenge—and justice. But mostly, revenge.What he finds is a dodger named Mia, a city steeped in corruption, and a menace at the heart of the Corps which could bring Fortune's new and fragile peace to an explosive end. And that’s just his first night in town.Soldier of Fortune is first of The Fortune Chronicles, a science fiction-fantasy hybrid set in the distant future, on the engineered planet Fortune. Here readers will discover elements of the Old West, steampunk, and urban fantasy, with a dash of noir and a generous serving of humor."}, {"id": "0330426648", "genre": "Science Fiction & Fantasy", "title": "Stories of Your Life and Others", "description": "Here are eight astonishing science-fiction stories that explore the boundaries between science and religion, between determinism and our ability to choose, between words and the entities they describe. Here are stories of conceptual breakthrough ... of making sense of the universe and our place in it. `What a pleasure it is to read Chiang ... Can he be the best SF writer to come down the pike in the past thirty years? I honestly believe that he is' Harry Harrison `Superb and thought-provoking. I could run out of superlatives trying to describe Chiang's work. Stories of Your Life is the best collection of short stories, novellas and novelettes I have ever read ... Ted Chiang will blow you away with this astonishing collection' The Alien Online"}, {"id": "B007UKH4HU", "genre": "Science Fiction & Fantasy", "title": "Lancelot: King Ban's Son of Benoic", "description": "Sir Lancelot of the Lake appears out of nowhere in “Le Morte d’Arthur” yet Mallory must have been aware of the story of his early life. The “Prose Lancelot,” written two centuries earlier, dealt with where Lancelot came from, who his mother and father were, how the Lady of the Lake abducted the baby Lancelot and how he become a knight in King Arthur’s court. But aside from Sir Lancelot’s battles and his relationship with Queen Guinevere there is not much in either of those prime sources that examines who he really was as a man. Was Lancelot really as good (or as bad) as they say? Why was Dolorous Garde so important? Was King Arthur a great king of sterling moral character or was he duplicitous and conniving? Should Lancelot and Guinevere be blamed for the fall of “Camelot” or were there destructive forces beyond their control? How could Lancelot have been so great and avowed such lofty principles and still be the cause of Camelot’s downfall? And how about all of the other inconsistencies and calumnies within and between the Arthurian stories? All of those questions and more are answered in this book, which covers the period from before Lancelot’s birth to his retirement to a monastery. It presents a coherent story of Lancelot and shows him as the true and unblemished hero he was meant to be."}, {"id": "B0788CCLQ9", "genre": "Science Fiction & Fantasy", "title": "Price of War: A Story of the New Glasgow War", "description": "A fanatical enemy in pursuit, can New Glasgow hold on against the odds?Locked into battle with a relentless foe, Duncan's marines are bystanders for the battle.  With their ship in single combat with the enemy, they hope they last long enough to repel boarders and contribute to victory. On the fringes of the FUP, a new threat arises.  Exiled to a backwater planet due to his perceived failures in New Glasgow, Major Dietler's battalion faces a new adversary on the remote outpost world of Gascony. Out gunned and unsupported, he must make tough decisions for the future of his command.Will the FUP be willing to pay the price of war on multiple fronts or make an uneasy peace to keep the union together?Price of War is the third book in the New Glasgow War series.New Glasgow War Series.Out of the Ashes - Book 1 (https://www.amazon.comdp/B076JNY156)Counter Strike - Book 2 (https://www.amazon.com/dp/B077BRN7M5)Price of War - Book 3 Receive a complimentary copy of the prequel story Free Fall and updates on future books in this series by signing up to the mailing list:tinyurl.com/yb7u4qej"}]