[{"id": "1543680364", "genre": "Science Fiction & Fantasy", "title": "The Devil and the Deep: Horror Stories of the Sea", "description": "It’s only water, so why should we fear large bodies of it, such as the sea or the ocean? However, when you’re all alone, you realize how scary a place it can be. In Devil and the Deep, award-winning editor Ellen Datlow shares an original anthology of horror that covers the depths of the deep blue sea. Whether its tales of murderous pirates who stalk the waters in search of treasure and blood, creatures that haunt the depths below―ones we’ve only seen in our nightmares, or storms that can swallow you whole, the open water can be a dangerous and terrifying place. With new stories from New York Times-bestsellers and award-winning authors such as Seanan McGuire, Christopher Golden, Stephen Graham Jones, and more, Devil and the Deep guarantees you’ll think twice before going back into the water."}, {"id": "1973739194", "genre": "Science Fiction & Fantasy", "title": "5: Platinum Mind (Book Five): The journey of James Stone", "description": "During his first mission to Evigone, James Stone was arrested and sold into slavery within days of his arrival.  On board the Felspar, he helped the crew to mutiny, fought giant insects, and was then betrayed.  On the Cissoid Corindon he was employed as a bodyguard for the beautiful Faam.  After another betrayal, he had to escape from the pirate Kruvak, only to be tricked by a giant centipede, re-captured and taken to Penti Prime to be interrogated.    On the up-side, only half of Evigone believes him to be an emissary of tsars, the ancient enemy.  The other half wants him dead.  Thrown out of Evigone by the Lords of Wuminger, the Tower of Panadawn and its avatars must find a new way to study the life of the artificial constellation.  But first they have to get their human colleague back.    Dumped in a desert on Earth, James Stone wakes up in a laboratory.  In his blood is an alien virus and in his head, they’ve discovered an alien city.  Before he can get back to Panadawn, to Evigone and before the scientists drill into his brain, there’s the small matter of the US army to evade…"}, {"id": "B004GXB0C4", "genre": "Science Fiction & Fantasy", "title": "2012 AD: Mayan Apocalypse", "description": "DECEMBER 21ST 2012 The most accurate calendar the world has ever seen - the 5,125 year old Mayan long count calendar turns over to Zero. Are we on the brink of APOCALYPSE? In the Highlands of Guatemala an ancient terror rises from the cornfields... In India a renowned physicist calculates not just the end of the world but of time itself, but what did the ancient Maya know that she doesn't?... What secret monstrosity do the pyramids of Costa Rica hide? ...With the planets aligned Mayan Gods gather to end the fourth and final age of man. Severed Press brings you 10 short stories exploring the Mayan 2012 End of Days myth. WHERE WILL YOU BE DECEMBER 21ST 2012?"}, {"id": "0997262737", "genre": "Science Fiction & Fantasy", "title": "Sky Walkers: Code name: Operation Starlight", "description": "Identical twins Joe and Frank Hunter - a paraplegic and a New Jersey detective - discover in youth that their father died in a secret military operation—But, did he?   Fate takes their lives in different directions, until two government agents visited the Hunter home years later.  A promise to walk again to run, to even fly, is too good for Joe to refuse, and Frank, in time, with super-hero like skills akin to Joe’s, joins the adventure.  As the military operation escalates, the twin’s skills increase—now following in their father, Captain Jon Hunter’s footsteps.    The secret mission blasts open the door to a confrontation with alien beings, and Earthly adversaries to a final battle for possession of ancient flying machine.  Who will be victorious?  The fate of humankind is now threatened."}, {"id": "0316302449", "genre": "Science Fiction & Fantasy", "title": "The Fall of Dragons (The Traitor Son Cycle)", "description": "The blood-thirsty, epic Traitor Son Cycle comes to its gripping conclusion in this fifth and final book.In the climax of the Traitor Son Cycle, the allied armies of the Wild and the Kingdoms of men and women must face Ash for control of the gates to the hermetical universe, and for control of their own destinies. But exhaustion, treachery and time may all prove deadlier enemies.In Alba, Queen Desiderata struggles to rebuild her kingdom wrecked by a year of civil war, even as the Autumn battles are fought in the west. In the Terra Antica, The Red Knight attempts to force his unwilling allies to finish the Necromancer instead of each other. But as the last battle nears, The Red Knight makes a horrifying discovery...all of this fighting may have happened before.Read the gripping conclusion to The Traitor Son Cycle, following The Red Knight, The Fell Sword, The Dread Wyrm, and The Plague of Swords.The Traitor Son CycleThe Red KnightThe Fell SwordThe Dread WyrmThe Plague of SwordsThe Fall of Dragons"}]