[{"id": "B01HZZPLJM", "genre": "Children's Books", "title": "Solomons Southern Fist", "description": "Solomon’s Southern Fist is a story of a young man who absolutely loved the martial art of kung fu so much so that it filled his imagination at every turn. Young Solomon was given the great task of putting his skills on display. On the surface, one might think this is a simple task. However, Solomon was hit with a dose of stage fright. He was overtaken by fear, so much so that he almost was unable to perform and was stuck at the crossroad of success and failure. This book is a story of overcoming the roots of adversity and kindling a light from within. The outer strength necessary to fight the inner enemy can be found in the wondrous science of martial arts."}, {"id": "1590366948", "genre": "Children's Books", "title": "Tour De France (Sporting Championships)", "description": "Provides an overview of the Tour de France, discussing topics such as its history, the rules, equipment, and route of the race, and features historical highlights, cycling stars, and famous firsts."}, {"id": "0887762549", "genre": "Children's Books", "title": "How Two-Feather was Saved from Loneliness", "description": "Two-Feather had been wandering all winter, lonely and hungry. One spring night he goes to sleep to forget the despair, only to be awakened by a voice calling his name. It is a woman, so beautiful that Two-Feather immediately falls in love with her, and begs for her to stay with him forever. The woman leads him over mountains and through forests. Two-Feather obeys her every command, even the last, most difficult, only to find she has left him, but not without ensuring that he will never be lonely or hungry again."}, {"id": "1532111185", "genre": "Children's Books", "title": "All About Cuts and Bruises (Inside Your Body)", "description": "The human body is amazing. But sometimes it gets sick or hurt. In All About Cuts and Bruises, kids delve inside the body to learn all about the causes, symptoms, and treatments of cuts and bruises. In this engaging introductory title, readers will explore fascinating topics, from infections to scabs and scars. Aligned to Common Core Standards and correlated to state standards. Super Sandcastle is an imprint of Abdo Publishing, a division of ABDO."}, {"id": "054403256X", "genre": "Children's Books", "title": "Stick and Stone", "description": "When Stick rescues Stone from a prickly situation with a Pinecone, the pair becomes fast friends. But when Stick gets stuck, can Stone return the favor? Author Beth Ferry makes a memorable debut with a warm, rhyming text that includes a subtle anti-bullying message even the youngest reader will understand. New York Times bestselling illustrator Tom Lichtenheld imbues Stick and Stone with energy, emotion, and personality to spare.         In this funny story about kindness and friendship, Stick and Stone join George and Martha, Frog and Toad, and Elephant and Piggie, as some of the best friend duos in children’s literature."}]