[{"id": "043114317X", "genre": "Children's Books", "title": "Light (Science Files) (Science Files)", "description": "This series is a highly visual introduction to scientific concepts, how they can be understood and demonstrated and how we make use of them. Each book contains easy-to-do projects."}, {"id": "079226326X", "genre": "Children's Books", "title": "When Bugs Were Big, Plants Were Strange, and Tetrapods Stalked the Earth: A Cartoon Prehistory of Life before Dinosaurs", "description": "A centipede as long as a couch? Trees so tall they touch the clouds? Amphibians changing into reptiles? These are just a few of the amazing life forms detailed in When Bugs Were Big....This lively new paperback tickles the reader’s funny bone while imparting tons of information about the animals, plants, and bugs that lived before the dinosaurs. Children will read \"news reports\" including a weather forecast from 320 million years ago and an emergency broadcast about the swift extinction that would end the Permian period. As kids peruse Bonner’s innovative combination of narrative text, engaging illustrations, hilarious cartoons, maps, charts, and time lines, they will gather lots of valuable scientific information about the amazing creatures that ruled the Earth before the dinosaurs."}, {"id": "0982096054", "genre": "Children's Books", "title": "7: Youth Lacrosse Drills, Plays, and Games Handbook", "description": "This is a book for youth lacrosse coachesIt has drills to build your teams speed, coordination, agility, and fundamental lacrosse skills.It has offensive and defensive plays covering all phases of the game. There are 94 different drills, all numbered to help your team. There are 96 different plays, all numbered, covering all phases of the game. There are 7 different games for your team to play, that are directly related, and involved with their learning."}, {"id": "B074JML25J", "genre": "Children's Books", "title": "What if I Could...? Book 1: A Fun Game of Imagining (Fun & Games - Cartoon Animals)", "description": "This fun book will  help spark the imagination of kids everywhere.  Every young child knows that a cow goes \"moo\" but what if a cat went \"oink\"?  What a funny animal!These colorful, comic animals will get your children giggling and wondering just what a cat that goes \"oink\" might sound like!First, there is a picture of a cartoon animal with a “speech bubble” giving its real sound (like “oink” for a pig or “baaaa” for a goat.  Then, when the child turns the page they will see the same animal imaging he can make a different sound (like an elephant saying “moo”).At the very end of the pictures, there is a page that explains to the children what the pretend sound is like an elephant who says “moo” – at the end it would explain that the sound “moo” is really what a cow would say.Can you image some of these funny animal sounds?A duck that roars?An elephant that moos?A hippo that squeeks?Download your copy today!"}, {"id": "1946125008", "genre": "Children's Books", "title": "The Adventures of Zoe & Alex: The Disappearing River", "description": "Help Zoe & Alex as they journey through magical hidden lands with invisible creatures to find the disappearing river!  The MakeThinkers Team - an MIT graduate with two children, and his mom, a highly experienced, elementary school teacher - created this adventure story with fun challenges and creative activities to help children unlock their natural creativity & powerful critical thinking skills.  Read ten exciting chapters. Answer the fun challenges. Do the creative activities.  Lexile Measurement: 730L  Each chapter takes less than 15 minutes to complete. It's perfect for parents to read to their  children and for older children to read by themselves.  Zoe Flynn and Alex Everhart live on Harriet street, in a quiet town near NYC. They are best friends and enthusiastic adventurers. When they find a magnificent, golden colored wooden box in the attic, their lives change forever! Inside the box are the Enchanted Sweaks of Yellowfield which take them on a fantastic journey through magical hidden lands with invisible creatures to find the disappearing river."}]