[{"id": "1588467147", "genre": "Science Fiction & Fantasy", "title": "Dogs of War (World of Darkness)", "description": "War Is Hell  The service trains you to be strong. It teaches you team-work, how to rely on others and how to rely on yourself. Which is a damn good thing. You need every edge you can get. You’ll see for yourself when you discover what else is out there in the night…  A Chronicle Book for The World of Darkness™  • An overview of military life and guidelines for military characters in the World of Darkness.  • Guidelines for unconventional units and those units touched by the supernatural, such as Company Zero.  • Storytelling advice for stories and chronicles revolving around military confiict and the supernatural.  • Variant rules, such as increasing lethality of firearms and governing mass combat."}, {"id": "1944289097", "genre": "Science Fiction & Fantasy", "title": "Uncommon Pet Tales", "description": "Fifteen short stories involving pets. But don’t think for a moment that you’ll “See Spot Run”, or that Lassie will save her master who’s fallen in the well. Those are common pet tales, and these are Uncommon Pet Tales. Within this collection, you’ll find a little bit of romance, a little bit of revenge, a few ghosts, and some fantasy and magic. You’ll find some uncommon pets such as Katelynn, and Mr. MacCawber, and you’ll find some uncommon stories, such as Patience, and Schrodinger’s Other Cat. You’ll find stories of man’s (or woman’s) best friend, and stories where the animals are far from friendly. And you'll find some stories that simply refuse to fit into a category. As always, each story in the Read on the Run series of anthologies is short, to suit your busy lifestyle."}, {"id": "B01B5634VE", "genre": "Science Fiction & Fantasy", "title": "Fatal Alien Affection: Can one man find love in a savage world? (Rebirth of the Prophesy Book 1)", "description": "Ever since Jonathan was a child, the prophesy has haunted him.He longs to find the one who will free the human race. When aliens rain death—destruction—and fear upon his village, he is forced into a life of slavery. Zahara’s entire world shatters when her village is raided. She is sold to an alien mistress. Beyond hope, she finds love with the handsome, red-haired, determined Jonathan. When peril arises, the two must flee, but where will they go in a city full of aliens? Will they escape? Will they unlock the mysteries of the ancient prophesy?"}, {"id": "178108579X", "genre": "Science Fiction & Fantasy", "title": "Redemption's Blade: After The War", "description": "Ten years ago, the renegade demigod known as the Kinslayer returned. His armies of monsters issued from the pits of the earth, spearheaded by his brutal Yorughan soldiers. He won every battle, leaving burnt earth and corruption behind. Thrones toppled and cities fell as he drove all before him. And then he died. A handful of lucky heroes and some traitors amongst his own, and the great Kinslayer was no more. Celestaine was one such hero and now she has tasked herself to correct the worst excesses of the Kinslayer and bring light back to her torn-up world. With two Yorughan companions she faces fanatics, war criminals and the monsters and minions the Kinslayer left behind as the fragile alliances of the war break down into feuding, greed and mistrust. The Kinslayer may be gone, but he cast a long shadow she may never truly escape."}, {"id": "B00MALU2I2", "genre": "Science Fiction & Fantasy", "title": "1776 Magic Scroll", "description": "Charlie Schofield is kidnapped over a magic scroll from 1776. The kidnapper believes the scroll is the key to powerful magic. Everyone else believes Schofield is trying to get attention with a hoax. Charlie just wants it all to go away and find her true love. Who is right? What will happen? Will Charlie find love and solve the problem of the scroll?"}]