[{"id": "0756543568", "genre": "Children's Books", "title": "The World Transformed", "description": "When they come along, some technological advances change everything, their effects reverberating throughout society. The World Transformed series explores gripping tales of just such tranformations. Each books helps students appreciate the contribution of its subject and offer opportunities for making connections and thinking critically."}, {"id": "0995310327", "genre": "Children's Books", "title": "Keman's First Carnival", "description": "This was Keman's first experience of Toronto's annual Caribbean Carnival. The excited 8 year old and his Mother enjoyed the rituals at the Caribbean celebration, such as picking a flag to wave, the Caribbean influenced foods, dancing, costumes and music. Keman is a young, Black Canadian child with Caribbean roots. "}, {"id": "1877810940", "genre": "Children's Books", "title": "The Perfect Orange: A Tale from Ethiopia (Toucan Tales Series ; Vol. 2)", "description": "Inspiring gentle folktale set in Ancient Ethiopia. Breathtaking watercolors dramatize ancient Ethiopia s contrasting pastoral charm and majesty. Illustrations are rich with Ethiopian details. Fa This story reinforces values of generosity and selflessness over greed and self-centeredness. Glossary of Ethiopian terms and pronunciations. (Ages 4-13) Honored as: (1) Smithsonian Institute \"Let s Read Selection\" and (2) PBS-TV \"Storytime Selection\" and (3) Time Magazine adaptation in Feb. 2012 issue of TIME FOR KIDS magazine (Grades 3-4 issue and Grades 5-6 issue)."}, {"id": "158013033X", "genre": "Children's Books", "title": "Sammy Spider's Passover Fun Book (Sammy Spider Set)", "description": "Sammy Spider presents Passover through rhymes, mazes, puzzles, and more. A great afikomen gift for kids."}, {"id": "0752266055", "genre": "Children's Books", "title": "Match! Annual 2018", "description": "From the makers of the UK's best football magazine! Year in, year out, MATCH remains the bestselling football annual and is top of Christmas wishlists for footy fans everywhere. Inside the annual, you can build your Ultimate Player, check out the wonderkids who'll rip up 2018 and find out everything you need to know about Messi, Pogba, Rashford, Aubameyang, Aguero, Di Maria and Higuain. Plus, it's packed with stars' cars, Prem club legends, brain-busting quizzes, FIFA through the ages, mad pics, footy stars emojis, crazy cartoons and loads more! Don't miss it!"}]