[{"id": "0778739082", "genre": "Children's Books", "title": "Explore with Ibn Battuta (Travel With the Great Explorers)", "description": "Trekking from Africa to the Middle East and Asia, Ibn Battuta was one of the most well-traveled explorers of all time. He encountered many different cultural groups and recorded his interactions with them. Battutas writings influenced trade between peoples and became an important source of information about the medieval Islamic world. Engaging headlines, historic images, and fact boxes take readers through his amazing travels in a unique tabloid style."}, {"id": "1511742313", "genre": "Children's Books", "title": "Cat Salim Gets Her Wish The Monster Truck Driver: A young girl wish to be a monster truck driver comes true (Volume 1)", "description": "Perfect for little ones who loves monster trucks. Army brat Milanie \"Cat\" Salim loves cars, planes, trains and especially monster trucks. Cat Salim wishes she could be a monster truck driver one day and accidentally falls into \"Lil Monster Truck Driver\", Joycelyn Perrin. Discover how her wish comes true. This book also discusses some history of the oldies but goodies of how \"Lil Monster Truck\" came into existence."}, {"id": "B004H1U21A", "genre": "Children's Books", "title": "Rocko and Spanky Go to a Party", "description": "Rocko and Spanky have been invited to a birthday party. Before they go, they have lots to do. First they need to find a gift. Then they must find something to wear. But there's one very important detail Rocko and Spanky have forgotten . . . so when they finally get to the party, they're in for a BIG surprise! Sisters Kara and Jenna LaReau invite you to a coming-out party--the first book in a new series starring Rocko and Spanky, a crafty, spunky (and uncommonly funky) pair of sock monkeys. With complete instructions for wrapping a present the Rocko and Spanky way! "}, {"id": "1489631798", "genre": "Children's Books", "title": "San Jose Sharks (Inside the NHL)", "description": "Did you know that the San Jose Sharks have made more than 16 playoff appearances? After 15 years without a professional hockey team in the San Francisco Bay Area, the Sharks came to San Jose in 1991. Learn more fascinating facts about the team in San Jose Sharks, an Inside the NHL book."}, {"id": "0750298774", "genre": "Children's Books", "title": "Mother Teresa", "description": "In 1997, the death of an 87-year-old nun in Kolkata, in India, sparked an outbreak of mourning across the globe. Why? The nun was Mother Teresa - one of the most iconic spiritual figures of the 20th century. She became famous for her work with, and compassion towards, the world's poorest people. She and the fellow nuns of her order tended to the vulnerable, sick and dying in the most poverty-stricken places, providing care, love and compassion where it was most needed. But who was this extraordinary woman, and what inspired her, the daughter of a wealthy Albanian businessman, to dedicate her life to such a cause? Mother Teresa looks at her remarkable story, and how she became such a popular and widely-celebrated figure. It looks at how and why she went about setting up her order as well as her work with people suffering from leprosy. The publicity she undertook to raise the profile of her work, and the criticism she faced, are also discussed.The Catholic faith, and the charitable work the Church undertakes around the world, is explained, as are some of its more complex terms and processes. Boxes on each spread provide background information on topics as varied as how saints are created, the Nobel Peace Prize, Kolkata, and how an order of nuns is created."}]