[{"id": "1634916336", "genre": "Children's Books", "title": "Aidan and the Dragon Girl Save the World", "description": " Aidan Alvarado’s birthday present when he turns eleven is anything but normal, but for Aidan’s family it is ‘normally abnormal’: the key to his grandfather’s wondrous study and a student membership to the League of Dream Detectives. Aidan doesn’t know what that means, but he’ll soon find out as he tries to solve the mystery of a glowing 1300-year-old Chinese vase with the help of his new friends, Denise, her brother Jeremiah, some teenagers with a very cool car, and the dragon girl Lotus. They have to use their wits, courage, compassion and the power of Aidan’s dreams to survive and solve the mystery both in Ancient China and modern day Los Angeles. Aidan’s adventure leads him to discover a fascinating world of Ancient Chinese wisdom, history and legend as he meets sages, a shape-shifting water spirit dragon, a greedy General, a ferocious bird as large as a jet fighter, China’s only woman emperor, and some very odd characters along the way.  This is no simple mystery; the fate of the world we live in depends on Aidan and his friends getting it right!"}, {"id": "0751357782", "genre": "Children's Books", "title": "Who's Who in the Bible", "description": "A visual guide to the people of the Bible, containing entries for over 300 characters. Thematically arranged, each person is set in context. The book also explains the meaning of biblical names and includes references to relevant texts so that the reader can look up people in the Bible."}, {"id": "0547210612", "genre": "Children's Books", "title": "Martha Speaks: Play Ball! (Reader)", "description": "Martha is suprised when her friend Truman wants to run away and invites her to come along. While Martha is always up for an adventure, she knows there's more to the story. She soon learns he's afraid of going to his softball game the next day because he can't catch the ball. If there's anything Martha is an expert at, it's playing catch! With the help of their human and doggy friends, Martha coaches Truman to catch the ball without fear. But will he be good enough for the big game?  Includes a matching vocabulary game and fill-in-the-blank word activity."}, {"id": "1404822968", "genre": "Children's Books", "title": "The Grass Patch Project (Read-it! Readers: Science)", "description": "Jasons class agrees that his Grass Patch Project is the best idea for the schools Earth Day contest. They get to work sowing the grass seeds in a patch of dirt near the school. But some classmates start to doubt Jasons big idea when the grass doesnt appear. Will blades of grass ever shoot through the soil?"}, {"id": "0374513589", "genre": "Children's Books", "title": "The Juniper Tree: And Other Tales from Grimm", "description": "\"A milestone, a tour de force, a joy to see...27 stories from the Grimm brothers' collection [including] some familiar tales and others that are less well known. The translations...are direct and fresh, unexpurgated and unsweetened. The illustrations are superb; beautiful, imaginative, appropriate, tender and terrible-as though the tales had been waiting for Maurice Sendak to interpret them. For children and adults.\"-Bulletin of the Center for Children's BooksTranslated by Lore Segal with four tales translated by Randall Jarrell. Illustrated by Maurice Sendak\"Many Fur\" is translated from the text in the first edition of Kinder- und Hansmarchen (1812, 1815), which is more coherent than the versions in the later editions. The other tales are translated from lalter texts, as reworked by the Brothers Grimm. Randall Jarrell's translations of \"Fisherman and His Wife,\"Hansel and Gretel,\" The Golden Bird and Other Fairy Tales of the Brothers Grimm (Macmillian, 1962), are reprinted here."}]