[{"id": "1541910885", "genre": "Children's Books", "title": "The US President Who Served Longer Than Any Other President - Biography of Franklin Roosevelt | Children's Biography Book", "description": "The story of Franklin Roosevelt is a curious one and by reading the pages of this book, you’ll soon find out why! Discover the reasons why Roosevelt is known as The US President Who Served Longer Than Any Other President. What was he like, as a child, a man and a leader? What were his accomplishments? Know the answer to these questions today!"}, {"id": "1936307413", "genre": "Children's Books", "title": "Anni's Attic", "description": "In 1861, as the American Civil War escalates, eleven-year old Jennine is reluctantly taken by her father to live in Savannah, Georgia, with the twelve-year old cousin she despises- Annise Loreal Bouvoir. While awaiting the return of her father from his covert Nothern military duties, Jennine and Annise soon find themselves caught up in the family's espionage and Underground Railroad activities. As Jennine comes to love and admire her independent and fearless cousin she also re-examines her arrogant attitude toward Negro slaves, in particular the handsome mulatto boy who works in the family's cotton plantation. For more than three years, as the horror and deprivations of the war continue, the two cousins find comfort and joy in each other's company, and the mysterious treasures of a long-forgotten secret attic."}, {"id": "1620651572", "genre": "Children's Books", "title": "Jonathan Toews (Hockey Superstars)", "description": "A team leader and one of the best defensive offensemen in the game, Jonathan Toews became a hockey superstar at a very young age. As a little kid, he wouldn't eat breakfast until his mom let him put on his skates. Now he's captain of the Stanley Cup-winning Chicago Blackhawks. Learn about Toews' rise to hockey stardom and how he became a leader at various levels, all the way to the NHL."}, {"id": "B01N9NLPMM", "genre": "Children's Books", "title": "Frazzled #2: Ordinary Mishaps and Inevitable Catastrophes", "description": "Abbie Wu is FRAZZLED as she navigates locker thieves, diabolical cats, and other hazards of middle school.This is the second book in a New York Times bestselling graphic novel series that NPR's All Things Considered called \"hilarious\"!Things are looking up for Abbie Wu: this year she’ll run for class president and get a brand-new shiny locker. Until—she doesn’t…In her second tumultuous misadventure, Abbie Wu tackles more unbelievably unfair and calamitous middle school days. From facing locker thieves and battling diabolical cats to having absolutely no idea what to build for her science project, Abbie Wu is still in perpetual crisis. From author and professional doodler Booki Vivat, this second story follows Abbie Wu, your favorite hilariously neurotic middle school girl, as she tries to come up with solutions to what seems to be a series of inevitable catastrophes.Akin to Smile by Raina Telgemeier, Frazzled: Ordinary Mishaps and Inevitable Catastrophes is heavily illustrated, embarrassingly honest, and sure to appeal to anyone hoping to figuring out how to survive the ordinary mishaps of middle school."}, {"id": "1492659045", "genre": "Children's Books", "title": "Tiny the Alaska Easter Bunny", "description": "It's Easter morning in Alaska,and Tiny is out for a jog,but he STOPS in his tracks and discoversthe Easter Bunny STUCK in a log!With the Easter Bunny trapped, it's up to Tiny to save Easter in Alaska! But being a bunny isn't as easy as it looks, especially for an elephant. In this fun and playful story, find out how Tiny uses his own special talents to save Easter!"}]