[{"id": "0375800395", "genre": "Children's Books", "title": "Junie B. Jones and the Mushy Gushy Valentime (Junie B. Jones #14)", "description": "Barbara Park’s New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for more than twenty years. Over 60 million copies in print and now with a bright new look for a new generation!   Meet the World’s Funniest Kindergartner—Junie B. Jones! February 14—Valentime’s Day, as Junie B. calls it—is just around the corner. Junie B. can’t wait to see all the valentimes she’ll get. But she never expected a big, mushy card from a secret admirer! Who is this secret mystery guy, anyway? Junie B. is determined to find out.   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”"}, {"id": "0003154580", "genre": "Children's Books", "title": "Ancient Egypt: Resource Pack (Collins Primary History)", "description": "\"Collins Primary History\" is a new history series written to cover the National Curriculum requirements for Key Stage 2. The resource pack for each History Study Unit contain a variety of visual sources such as photographs, prints, maps and documents. They are on high-quality A4 card designed to stand up to handling by children. The pack is intended to offer children the opportunity to do their own research and to develop historical skills. Comprehensive notes, together with photocopiable material, aims to give the teacher guidance on how to get the best out of the material and provide ideas for activities. This resource pack covers the supplementary study unit \"Ancient Egypt\"."}, {"id": "1946048690", "genre": "Children's Books", "title": "9 Chocolatey Bites: A Short Story Collection for Children", "description": "From growing tails to talking ants, everything is just one big pickle in this fun collection of stories. In a box of chocolates, you never know what you’re going to get next. Every chocolate has its very own surprise and taste, and so does every story in this book.  As wishes come true and uncles go cuckoo; snowy white clouds make everything misty and unclear. The gift of a king, the valour of a girl, the beauty of friendship, a golden drop of happiness – all these would play out in front of your eyes as you flip through the pages. The wrappers of a sweet gift would come undone, once you open this beautiful present… The question is, are you ready to be surprised and savour the different flavours, each one as delightful as the next?"}, {"id": "1599201615", "genre": "Children's Books", "title": "Adventures in the Air (Difficult & Dangerous)", "description": "This high-interest, historical series provides true adventure stories of real-life spies, adventurers, explorers, and others who beat the odds to carry out their mission."}, {"id": "1452104662", "genre": "Children's Books", "title": "Wookiee Pies, Clone Scones, and Other Galactic Goodies: The Star Wars Cookbook", "description": "May the Force be with all aspiring Jedi cooks as they use Yoda, Darth Vader, and R2-D2-shaped cookie cutters to create 30 sweet and savory treats! From Chocolate Chewies to Obi-Wan Tons, this galactic cookbook features easy-to-make recipes for Star Wars–themed treats that will delight any Jedi appetite."}]