[{"id": "1423620798", "genre": "Children's Books", "title": "Bullfrog Pops!: Adventures in Verbs and Direct Objects (Language Adventures Book)", "description": "Last seen hopping a stage . . . (coach) and finding his hop in Once There was a Bull . . . (frog), our hero is now on an eye-popping eating binge trying to cure his insatiable appetite. Woven through the western town of Ravenous Gulch, the story leaves a cast of many hopping mad. However, just as things look bleak, transitive and intransitive verbs turn the tables and take Bullfrog on another adventure. Bullfrog Pops! is part of Rick Walton's tremendously successful Language Arts series. Teachers and parents know that teaching is more effective when kids are having fun. Rick Walton’s Language Adventures Series combines entertainment and education with eight newly revised picture books that cleverly teach grammar and usage. Kids will love the silly stories, funny illustrations, and witty wordplay. Teachers and parents will love the new features: definitions at the beginning of the book and activities at the end that allow kids to apply what they’ve learned. "}, {"id": "1455617911", "genre": "Children's Books", "title": "Little Things Aren't Little . . . When You're Little", "description": "Adults may see many things in life as small, but to young children, those little things aren't small at all. A beetle is not just a little bug; a border collie is not a little pup. This picture book, told in humorous rhyme from a child's perspective, helps remind us all what a big world we live in."}, {"id": "0689851839", "genre": "Children's Books", "title": "New Dinos : The Latest Finds! The Coolest Dinosaur Discoveries!", "description": "From the newly uncovered site of a real Jurassic Park to the recent investigations of Supercroc, a thrilling guide provides dinosaur enthusiasts of all ages with the latest information on these fascinating creatures."}, {"id": "1454925124", "genre": "Children's Books", "title": "The Adventures of Your Brain", "description": "The human brain . . . entertainingly explained! Filled with flaps, pull-tabs, wheels, and pop-ups, this colorful interactive book introduces children to the wonders of our brain. How does the brain work? What does it do, and what do we understand about it? The Adventures of Your Brain allows kids to explore this amazing and amazingly complex part of our body. Each page offers loads of fun features to play with, so kids will love learning all the fascinating facts!"}, {"id": "0761389849", "genre": "Children's Books", "title": "Strange Foods (No Way!)", "description": "You might think anchovies and fruitcake are pretty weird foods. But wait until you hear about durian, a huge, spiky fruit that smells like gym socks. Or salmiakki , the licorice with a salty, fishy taste. And don’t forget kopi luwak , the coffee made from…poop! Discover all kinds of unusual foods from around the world!"}]