[{"id": "1933002999", "genre": "Children's Books", "title": "Mabel Takes a Paddle", "description": "Mabel, the famed dog of Mabel Takes the Ferry and Mabel Takes a Sail, is back! This time, Mabel rides in a kayak, admiring the Maine wildlife of Orange Lake. But all of the animals around the lake seem frightened. Are they afraid of Mabel? She tries hard not to bark at them, and yet they run away. Even a moose looks startled as Mabel and her family paddle by. What is scaring the animals? Find out in the third of the Mabel series."}, {"id": "0066238706", "genre": "Children's Books", "title": "Saint Francis and the Wolf", "description": "Terrible wolf is terrorizing the town of Gubbia, and no one can stop him! First the townspeople send a brave knight. He never returns. Then they send an army of trained warriors. They get destroyed. Finally the townspeople send a great and mighty war machine, but even that can't stop the wolf. The villagers don't know what to do -- until Saint Francis visits the town and speaks to the wolf in his own language.Caldecott Medal -- winning artist Richard Egielski exquisitely illustrates this classic tale of love, friendship, and the importance of living together in harmony."}, {"id": "1880000725", "genre": "Children's Books", "title": "Allie's Basketball Dream", "description": "Hooked on basketball from the moment she first plays, Allie nearly gives up trying to get her girlfriends to play the \"boy's game\" with her, but her persistence is finally rewarded. Reprint."}, {"id": "2733820966", "genre": "Children's Books", "title": "Cleopatra: Queen of the Nile (Big Picture Book)", "description": "As a queen, she was admired and despised. As a female, she was powerful and passionate. And as a legend, Cleopatra is one of the most celebrated women in history. From her rise to the throne to her tragic death, Cleopatra led an exceptional life."}, {"id": "1496557387", "genre": "Children's Books", "title": "Maximum Horsepower!: A Monster Truck Myth (ThunderTrucks!)", "description": "Watch the BELLEROPHON monster truck take on his toughest competition-himself! Can this ThunderTruck discover his special skill before he has a nervous breakdown? With short, action-packed chapters and high-powered art, the ThunderTrucks will have little motorheads and mythology fans alike shifting their reading habits into high gear."}]