[{"id": "0817255613", "genre": "Children's Books", "title": "Kwanzaa (World of Holidays)", "description": "Discusses the origins and symbols of Kwanzaa, the holiday that focuses on African American history, culture, and experiences, and offers suggestions for ways to celebrate this holiday"}, {"id": "0545561639", "genre": "Children's Books", "title": "Klutz Nail Style Studio Book Kit", "description": "Nail Style Studio is the perfect big sister to our bestselling title Nail Art, providing simple step-by-step instructions to create 25 tween-approved designs for budding fashionistas 10 and up. Though the designs look impressively intricate, our secret weapons make them practically foolproof: A two-sided custom dotting tool makes tiny, perfect dots, and stick-on stencils define crisp, geometric shapes. Our exclusive palette of practice polish lets any girl try a design, wash it off, and try it again."}, {"id": "0008266077", "genre": "Children's Books", "title": "Maths Puzzles Ages 10-11 (Collins Easy Learning KS2)", "description": "Children will have hours of fun solving these maths puzzles and brain teasing activities. Written to support the primary curriculum, each puzzle is designed to test their problem-solving skills and logical thinking. This fun and motivating maths puzzles book: • Covers key areas of maths that children are required to learn at school.• Includes guidance for parents and answers.• Provides hours of holiday fun."}, {"id": "1495227537", "genre": "Children's Books", "title": "Alpha", "description": "In a world where wolves and dogs, together and forever, must defend; a wolf rises. . . His name is Comet. Comet strives to lead his pack through hardship. He leads his pack through doom and destiny."}, {"id": "0448450909", "genre": "Children's Books", "title": "Jamie O'Rourke and the Big Potato: An Irish Folktale", "description": "Jamie O?Rourke is the laziest man in all of Ireland, far too lazy to help his wife on their farm. Then, after a chance encounter with a leprechaun, Jamie finds himself growing the biggest potato in the world. But what will happen when the potato grows too large for Jamie and the villagers to handle?"}]