[{"id": "1338054627", "genre": "Children's Books", "title": "The Misadventures of Jibanyan (Yo-kai Watch: Chapter Book)", "description": "Join Nate and Whisper on their latest adventure with this fun, four-color chapter book! This book is all about the popular Yo-kai Jibanyan and his funny antics.  "}, {"id": "B00BRABWVS", "genre": "Children's Books", "title": "Kiss Kiss! (Classic Board Books)", "description": "In this board book edition of a simple and sweet picture book, Baby Hippo sets out one morning to wander through the jungle. As he passes different pairs of animal parents and babies, he hears \"Kiss, kiss!\" Finally, he realizes what forgot to do! He goes back the way he came to give his mama a big kiss!"}, {"id": "B06XV5PYJD", "genre": "Children's Books", "title": "Children's books: Who Needs a King? (Children's books- Animal Bedtime Stories for Kids Book 2)", "description": " Can you help the little bear to be the farm’s King?  Fully illustrated eBook, for ages 0-8  ** Read it FREE as part of your PRIME or Kindle Unlimited membership ** \"Who Needs a King?\" tells the story of a little bear that wants to be the farm’s king. Will he succeed? Author Efrat Haddi is taking young children on a journey with the little bear as he learns a very important lesson. This well-written and inspiring story, delivers bedtime fun complemented by vibrant, delightful illustrations This story may be ideal for reading to your kids at bedtime and enjoyable for the whole family as well! It is suitable as a read aloud book for preschoolers or a self-read book for older children. Grandparents will definitely enjoy reading this book to their grandchildren."}, {"id": "B073XDDVM8", "genre": "Children's Books", "title": "Elephant Secret", "description": "We Bought a Zoo meets Jurassic Park in a gripping story featuring the evergreen appeal of human-animal friendships and set in an elephant sanctuary, about a thirteen-year-old girl, a cast of elephants, and a surprising new arrival—a woolly mammoth.Sam was born and raised in an elephant sanctuary. When a beloved elephant dies giving birth, Sam develops a connection with baby Woolly—who isn't actually an elephant but was cloned from woolly mammoth DNA. And the billionaire genius behind the cloning experiment will stop at nothing to protect his investment. Smart, determined, and loving, Sam stands up to this powerful adversary to protect the sanctuary and her herd. In the best tradition of child-animal friendship stories, Elephant Secret explores the strong and complex bond between Sam and her elephants while offering a fascinating, authentic glimpse into elephant—and human—behavior."}, {"id": "0310760240", "genre": "Children's Books", "title": "The Berenstain Bears Play a Fair Game (I Can Read! / Berenstain Bears / Living Lights)", "description": "Sister and Brother Bear love soccer and their team the Rockets. But when the Steamrollers do anything to win, soccer is no fun. The Berenstain Bears Play a Fair Game shows how peacemakers are the true winners. Young readers will enjoy reading Play a Fair Game the newest Berenstain Bears® Living Lights™ Level One I Can Read."}]