[{"id": "0989548708", "genre": "Children's Books", "title": "St. Augustine A to Z: A Young Reader's Guide to America's Oldest City", "description": "St. Augustine A to Z is a rhyming, ABC adventure book that explores St. Augustine, Florida's historical figures and landmarks. You'll see a fort, a lighthouse, a pirate ship, Spanish conquistadors, and much more. Tourists and residents alike will also enjoy the map at the back, which guides families on a tour of the nation's oldest city. The fun, educational content for younger children is written by Susan Shipe Calfee and illustrated by Oscar Senn."}, {"id": "0091798728", "genre": "Children's Books", "title": "Little Red Train: Busy Day", "description": "The Little Red Train is in for a very busy day. There's post to deliver, rails and sleepers for the new track, a flock of sheep for Hilltop Farm, and lots of passengers for Barnacle Bay! Keep your eyes peeled on the journey - there's lots of added fun! Peek inside the Little Red Train's engine and East Sidings station with fun cut-aways! Can you spot the landmarks, bridges, tunnels and signals along the way? Count all the sheep at Hilltop Farm and...use the map to follow the Little Red Train on his very busy day! You'll never have a dull journey with the Little Red Train!"}, {"id": "1974327108", "genre": "Children's Books", "title": "Creativity Journal: Writing & Creativity Journal (Creativity Journal For Kids & Adults)(Lined Journal For Women)", "description": "Awesome creativity journal notebooks for all your ideas, stories and song writing!Do you love expressing your creativity through journaling? This 6x9, 108 lined page journal with vibrant images is perfect for everything your imagination can muster up.This creativity journal can help boys and girls explore their innermost feelings and adults to write down that breakthrough idea.Works great for:Idea Notebook JournalCreative Writing Practice WorkbooksSong Writing JournalNotebook For StudentsBack To School NotebooksBlank Journal For KidsAnd much more…..Makes the perfect:Birthday GiftMother’s Day GiftChristmas GiftsBack To School GiftTeacher SuppliesGrab your copy today by scrolling up and hitting the buy button today!"}, {"id": "1633221962", "genre": "Children's Books", "title": "Animal Journal: Land Mammals of the World: Notes, drawings, and observations about animals that live on land (834)", "description": "With this naturalist's notebook in hand, young zoologists can explore the world's most fascinating mammals, up close and personal.Land Mammals of the World guides readers on an exploration of the world's most fascinating mammals, from the terrifying grizzly of North America to the marsupials of Australia. Naturalists in the making can imagine themselves immersed in exotic habitats both near and far, from the rainforests of the Amazon to the grassy plains of Africa. This naturalist's notebook gives budding biologists the opportunity to explore new and unfamiliar species, as well as learn the subtle differences amongst the subspecies of their favorite animals. From great apes to the swift cheetah and the hulking rhinoceros, adventure awaits as you travel across the globe to catch a glimpse of the world's most wondrous mammals."}, {"id": "0613159845", "genre": "Children's Books", "title": "Sometimes (Green Light Readers: Level 1 (Sagebrush))", "description": "Happy or sad? Hot or cold? Up or down? Sometimes you may feel every which way, and that’s just fine. Keith Baker uses opposites and an irresistible banjo-playing, cake-baking alligator to remind us all of one of life’s simplest--and most important--lessons: Anything is possible if you like who you are and you like what you do."}]