[{"id": "0310764785", "genre": "Children's Books", "title": "The Beginner's Bible Queen Esther Saves Her People (I Can Read! / The Beginner's Bible)", "description": "The Beginner’s Bible® has been a favorite with young children and their parents since its release in 1989 with over 25 million products sold.Esther has become the queen of Persia, but God has a bigger job for Esther than just being queen. The safety of God’s people rests in her hands. Can Esther find the courage to help save her people from Haman’s evil plan? Featuring vibrant art from the beloved The Beginner’s Bible, this book is perfect for parents to share with their children.This My First I Can Read!™ book, with basic language, word repetition, and great illustrations, is perfect for shared reading with a child. It aligns with guided reading level G and will be of interest to children Pre-K to 2nd grade."}, {"id": "0766077381", "genre": "Children's Books", "title": "Aardvarks After Dark (Animals of the Night)", "description": "Aardvark, what a long snout you have! This nocturnal mammal uses its prominent nose to sniff out its next meal of termites and ants. Through fact-filled text and color photos, readers learn about these quiet African animals, including their relationship with their habitat. Read about their homes, body features, reproduction, diet, and family life. Words to Know appear at the front of the book so that readers are ready when they encounter a new term in the text."}, {"id": "1438918089", "genre": "Children's Books", "title": "Opal, Herby, and Squeaky", "description": "Opal, Herby, and Squeaky \"A very cute kitten helps her puppy friend outsmart a clever little mouse. When God is included in their game, there is a happy ending.\" A wonderfully told and illustrated story with a moral any parent would share with their young child. Jay Miller's creative tales of animals at play peaks your child's imagination with a child-like view to our Lord. Be prepared for many times of fun reading.Apple Valley Readers Club"}, {"id": "1932416978", "genre": "Children's Books", "title": "Giraffes? Giraffes! (HOW)", "description": "For many years the scientific and educational communities have wondered and worried about the possibility that semi-sane scholar-pretenders would find the means to publish a series of reference books aimed at children but filled with ludicrous misinformation. These books would be distributed through respectable channels and would inevitably find their ways into the hands and households of well-meaning families, who would go to them for facts but instead find bizarre untruths. The books would look normal enough, but would read as if written by people who have eaten too many lead-based paint chips. Giraffes? Giraffes! is the first in a proposed series of 377 reference books, all written by a couple now getting their chance to twist and tickle the brains of the impressionable. The book puts forth the following novel theories: that giraffes were not part of any evolutionary chain, but came here from Neptune, by way of very long (but convenient and fast) escalators; that giraffes are expert dancers, but become angry if asked about their dancing; that giraffes control over 90 percent of what we see in mirrors; and that the Giraffe navy is as strong as ever, contrary to recent claims in the popular press."}, {"id": "1423119150", "genre": "Children's Books", "title": "Designing Disney (A Walt Disney Imagineering Book)", "description": "Designing Disney sets into history and puts into context the extraordinary contributions of the late John Hench, who, at the age of 94, still came into his office at Imagineering each day.  His principles of theme park design, character design, and use of color made him a legendary figure, not only for Disney fans but also for students and aficionados of architecture, engineering, and design.            Designing Disney reveals the magic behind John’s great discoveries and documents his groundbreaking in several key areas: “Design Philosophy” examines the values, attitudes, aesthetics, and logic that went into the original concepts for Disney theme parks. In “The Art of the Show” and “The Art of Color,” Hench reveals the essence of what makes the parks work so well. And in “The Art of Character,” he lets the reader in on the how and why of the Disney characters’ inherent popularity\u0097their timeless human traits, archetypal shape and gestures that suggest these qualities graphically, and their emotional resonance in our lives."}]