[{"id": "1368021336", "genre": "Children's Books", "title": "¿Estás lista para jugar afuera? (Spanish Edition) (An Elephant and Piggie Book)", "description": "Gearld is careful. Piggie is not.Piggie cannot help smiling. Gearld can.Gerald worries so that Piggie does not have to.Gerald and Piggie are best friends.In Are You Ready to Play Outside? Piggie can't wait to go play in the sunshine. But will a rainy day ruin all the fun?"}, {"id": "B00TXV3608", "genre": "Children's Books", "title": "Fox and the Goat liška a koza Children's Picture Book English-Czech (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump. Krátký příběh o lišce a kozy.Příběh sleduje lišku hledat vodu a kozy liška interaguje s.Na bajky od Ezopa se použití slov sloves běhat, chodit, a skok základě."}, {"id": "B073CL4TV7", "genre": "Children's Books", "title": "Book for kids: Age Of Godzilla (Minecraft Awakening 6)", "description": "Age Of Godzilla:The Ancient Ayleids LegendThe scene was surreal, with Steve and Herobrine kneeling on the sandy beach beside their broken and shattered boat, staring at what lay before them with their mouths hanging open. Follow the epic adventures of Steve and Herobrine into the Godzilla Island. Can they escape the Godzilla Island?"}, {"id": "B01MR95O1K", "genre": "Children's Books", "title": "Chris Hogan: A Great Receiver (Football Heroes Book 1)", "description": "Chris Hogan is a rising star with the Patriots and a great all-around athlete.  He previously played wide receiver for the Buffalo Bills after playing college lacrosse."}, {"id": "1481486470", "genre": "Children's Books", "title": "Time to Be a Hero (PJ Masks)", "description": "Join your favorite heroes as they work together to save the day in this Level 1 Ready-to-Read based on PJ Masks, the hit preschool series airing on Disney Junior!Owlette can’t wait to try the new train ride at the amusement park! But when Romeo steals the train for himself, it’s up to Owlette, Catboy, and Gekko to stop him! Can Owlette put aside her excitement to track down Romeo and derail his plot? PJ Masks © Frog Box / Entertainment One UK Limited / Walt Disney EMEA Productions Limited 2014"}]