[{"id": "0786954930", "genre": "Science Fiction & Fantasy", "title": "Dark Sun Campaign Setting: A 4th Edition D&D Supplement", "description": "Explore a savage, wondrous world...Aimed at players and Dungeon Masters, this game supplement explores the heroes and wonders of Athas—a savage desert world abandoned by the gods and ruled by terrible sorcerer-kings. Use it to build Dark Sun® heroes and thrilling D&D® adventures set in the Seven Cities of the Tyr Region, the Ivory Triangle, the Sea of Silt, and monster-infested wastelands—or plunder it for your own D&D campaign! The Dark Sun Campaign Setting provides exciting character options for D&D players, including new races, new character themes and class builds, new paragon paths and epic destinies, and new equipment. It also provides everything Dungeon Masters need to run 4th Edition Dark Sun campaigns or include Dark Sun elements in their homebrew campaigns. It has rules and advice for handling survival challenges, arena encounters, desert terrain, and adventure creation. It also presents a short, ready-to-play introductory adventure."}, {"id": "1596068299", "genre": "Science Fiction & Fantasy", "title": "Golden Age and Other Stories", "description": "Naomi Novik ended her acclaimed, beloved nine-volume Temeraire series last year with a stunning finale, League of Dragons. Fans missing their favorite series can now rejoice: Novik returns with an original Temeraire collection as unique as the world she has created, with each tale inspired by an accompanying piece of fan art.The Temeraire novels provide a window into an alternate nineteenth century populated with Novik's own richly human and unforgettably draconic characters as they adventure alongside well-known historical figures. That tradition continues here. Readers will delight at appearances by fan-favorite characters from the series and historical figures like the famed explorer Matteo Ricci. In “Planting Season,” Novik shows us an early glimpse of American dragon John Wampanoag at Boston Harbor. “Golden Age” finds a dragon who believes he remembers being called Celeste hatch from a shipwreck-tossed crate onto an island where he meets others of his kind. But other famous fictional characters are to be discovered here as well. Readers will certainly recognize a certain Miss Bennet (here Captain Bennet) and her suitor, Mr. Darcy, in “Dragons and Decorum.”Filled with the inventive world-building, rich detail, sparkling wit, and deep emotion that readers have come to expect from Novik's work, Golden Age and Other Stories is a treasure at home on any Temeraire-lover's bookshelf."}, {"id": "1568822081", "genre": "Science Fiction & Fantasy", "title": "Menace from the Moon (M.U. Library Assn. monograph, Call of Cthulhu)", "description": "The Miskatonic University Library Association fosters new talent in literature and the arts. M.U. Monographs are works in which the author has performed most or all editorial and layout functions of this book. It has not been otherwise edited or modified. The trustees deem that this work offers significant value and entertainment to our patrons and fans of the Call of Cthulhu roleplaying game.MENACE FROM THE MOON: In Which the Investigators Face an Ancient Extraterrestrial Threat as a New Comet Appears in the Sky. Currently on display in the museum is a set of rocks found at the bottom of the Atlantic Ocean. These geologically unique stones are believed to be of lunar origin, ejected from the moon by the impact of a meteorite. The rocks have been on display in the Smithsonian in Washington, D.C. until recently, but they are now part of a traveling exhibit touring the country. They are on the final leg of the tour, with San Diego as the last stop before being returned to the Smithsonian, and will remain in the city for the next two weeks.  A new comet nears the inner solar system for the first time in recorded history. Comet Negretto, discovered by and named after Italian astronomer Sylvio Negretto, is moving increasingly closer to our planet as it follows its elongated path around the sun, growing more prominent in the skies as it approaches. Because of its current location in the heavens, it appears only at night—and, because of its distance, only on clear evenings. As it nears and crosses Earth’s orbit our planet will pass through the comet's tail, just as it did with Halley's Comet earlier in the century. Astronomers and other scientists assure the public that no harm will be done, as the gasses are so diverse that no one would ever know of the event if the public hadn’t been alerted ahead of time. How are these circumstances related, and what have they to do with our intrepid investigators?"}, {"id": "B0066B2WOO", "genre": "Science Fiction & Fantasy", "title": "Touchstone (2. Family at War): The time travel saga that spans a century (Touchstone Season 1)", "description": "A moving novella which packs an exciting mix of time travel, historical adventure, a dash of mystery, and the beginnings of what builds to a memorable love story over the series of books…Dealing with the catastrophic fallout of their previous encounter with Amy Parker in 1912, Rachel now finds herself pitted against Danny during the Second World War in Birmingham.But she has a mysterious ally in the shape of Charlie. A dashing young lieutenant who knows everything about her and her mission to get her life back. In fact, it was her future self who sent him to this exact moment in 1940 to help her.As every night the Blitz fills the sky with fire, as every night the German bombs rain down, and as every morning the people of this quiet corner of an English city clear up the horrifying aftermath and count the dead, a hesitant friendship blooms. And the first stirrings of a romance that will span a hundred years.“For the price, you won’t be better entertained, and soon, you too will be as hooked as I am.”“A very good short book that kept me riveted through the whole story — I never wanted it to end.”“A wonderful read… I believe it’s one of the best series of its kind.”LENGTH: 20,000 words / 100 pages KEYWORDS: time travel, science fiction time travel, teen & young adult time travel, urban fantasy series, low fantasy, historical adventure, time travel romance, historical fantasy, Birmingham, Blitz."}, {"id": "1904577431", "genre": "Science Fiction & Fantasy", "title": "Encyclopaedia Arcane: Components and Foci", "description": "This volume presents the first ever serious study of the long-neglected questions of why material components are used in spells, what logic governs their use and whether or not it is possible to change them. We look at the typical components used in arcane spells and outline the key principles on which they work. An exhaustive treatment of the standard arcane spells is then provided which will inject new life and creativity into spellcasting. By daring to challenge the wisdom of the ages and use their own home-brewed recipes rather than keeping slavishly to the old ones, players may gain hitherto inaccessible levels of spell potency. Beware, however, for there is a price; he who presumes to tamper with magic must be very sure of himself, or he will cause an imbalance in the arcane forces and he will be the first to suffer for it. Even the slightest error can cause a side effect. While some of these are relatively harmless, others can cause disfigurement, crippling injury or even death. To the courageous mages who are willing to read on, this is a risk well worth taking."}]