[{"id": "1783299452", "genre": "Science Fiction & Fantasy", "title": "Exile's Throne: The Empress Game Trilogy 3", "description": "One seat on the intergalactic Sakien Empire’s supreme ruling body, the Council of Seven, remains unfilled, that of the Empress Apparent. The seat isn’t won by votes or marriage. It’s won in a tournament of ritualized combat in the ancient tradition. Now that tournament, the Empress Game, has been called and the women of the empire will stop at nothing to secure political domination for their homeworlds. Kayla Reunimon, a supreme fighter, is called to battle it out in the arena.  The battle for political power isn’t contained by the tournament’s ring, however. The empire’s elite gather to forge, strengthen or betray alliances in a dance that will determine the fate of the empire for a generation. With the empire wracked by a rising nanovirus plague and stretched thin by an ill-advised planet-wide occupation of Ordoch in enemy territory, everything rests on the woman who rises to the top."}, {"id": "B0714F2FK5", "genre": "Science Fiction & Fantasy", "title": "Activated: Age Of Expansion - A Kurtherian Gambit Series (The Ascension Myth Book 2)", "description": "In the Future, Even the Broken Can Make a Change...When Molly gets called onto a case that she is uniquely qualified for, the team discovers a little more about her past.In the race against the clock to prevent the city of Spire from being subjected to a deadly toxin, it takes both new team members and new allies working together in order to save the millions of lives.Meanwhile, problems continue on the political scene, and exciting progress is made with the investigation into the strange door in the safe house basement.Set on the foundation laid by the Kurtherian Gambit Series, The Ascension Myth tells an entirely new story in the Age of Expansion--when the Etheric Empire is fast becoming the Etheric Federation with all of the trials and tribulations that come with bringing together different peoples, systems, and ideals."}, {"id": "080956274X", "genre": "Science Fiction & Fantasy", "title": "Elric of Melnibone, Vol. 1", "description": " It is the color of a bleached skull, his flesh; and the long hair that flows below his shoulders is milk-white. From the tapering, beautiful head stare two slanting eyes, crimson and moody... He is Elric, Emperor of Melnibone, cursed with a keen and cynical intelligence, schooled in the art of sorcery and the hero of Michael Moorcock's remarkable epic of conflict and adventure at the dawn of human history.  A 5 disc CD-Audio edition. Read by Jeff West. Included is a dramatic introduction, over 10 minutes in length, read by Michael Moorcock."}, {"id": "1546714618", "genre": "Science Fiction & Fantasy", "title": "Sea of Clouds", "description": "One day something happened and John vanished. He left me. It was autumn, 1982. “But is that a fact?” asked Zhang. “I don’t know,” I said, opening the palms of my hands. When I met John, he was twenty-six years old and I was twenty. A few months later we got married. I thought we were happily married but one evening, all of a sudden, he said that he had to go. Why or where? He didn’t say. I wanted to go with him but he said, “No.” I asked, “But don’t you love me?” He said, “I do love you, and I was happy with you. That’s why I came to say goodbye” – and he left. Shortly after his thirty-first birthday, he was found dead in Guangzhou, China. I was there. I saw the body but, at that time, I didn’t give it too much thought."}, {"id": "B01CQ1CRPQ", "genre": "Science Fiction & Fantasy", "title": "Legends and Stories of King Arthur", "description": "King Arthur and his court come to life in this four volume omnibus of Howard Pyles 'Legends and Stories of King Arthur.' Included herein are 'The Story of King Arthur and His Knights,' 'The Story of the Champions of the Round Table,' 'The Story of Sir Launcelot and His Companions,' and 'The Story of the Grail and the Passing of Arthur.' Hours upon hours of enchanted adventures for the whole family."}]