[{"id": "0060274735", "genre": "Children's Books", "title": "Crocodiles & Alligators", "description": "Crocodiles and alligators have always been one of humankind's most feared predators. Around since the days of the dinosaurs, they are probably the source of myths about ferocious serpents and man-eating dragons. All tall tales aside, these reptiles remain fascinating creatures. Did you know that crocodiles and alligators eat their food without chewing? Or that they use the sun to regulate their body temperature? Renowned science writer Seymour Simon's accessible text, and full-color photos, provide a stellar introduction to these reptile wonders.  Outstanding Science Trade Books for Children 2000--selected by Natn'l Science Tchrs Assoc. & Child. Bk Cncl. "}, {"id": "0140365443", "genre": "Children's Books", "title": "Fox at School (Penguin Young Readers, Level 3)", "description": "Starring in the school play means hard work, and being left in charge means keeping the class under control. Fox thinks there's nothing to it. And, when he's put to the test, will Fox retreat? Never!"}, {"id": "0545685451", "genre": "Children's Books", "title": "Escaping Peril (Wings of Fire, Book 8)", "description": "Peril has been loyal to Queen Scarlet, who used her fatal firescales to kill countless dragons in the SkyWing arena. Now, Peril is loyal to Clay, the only dragonet who has ever been her friend. So when Scarlet threatens Jade Mountain Academy, Peril sets off to find her former queen, stop her, and save the day, no matter what it takes.There's just one problem: a strangely persistent SeaWing, Turtle, insists on coming along, too. Turtle is worried about his friends, who left to search for Scarlet and haven't returned. Peril is worried that she might accidentally burn Turtle -- or burn him on purpose, for being so annoying -- and frustrated that she keeps saying and doing the wrong things. She can't escape her firescales, and she can't escape her reputation as the deadliest dragon in Pyrrhia.So when she's offered a chance to trade everything for a new life, Peril has to decide who she's really loyal to . . . and whether her own scales might actually be worth saving."}, {"id": "0439114276", "genre": "Children's Books", "title": "The Case of the Great Sled Race (Jigsaw Jones Mystery, No. 8)", "description": "Clever, funny detectives Jigsaw Jones and Mila Yeh solve mysteries in shool and out."}, {"id": "0761315519", "genre": "Children's Books", "title": "Wildshots:The World Of The Wil", "description": "An informative and instructional guide reveals the true nature of the professional wildlife photographer and what it really takes to get truly amazing shots by comparing the myths to the realities, detailing the hard work and patience one must have to comprehend wildlife, and much more."}]