[{"id": "B01M6TMTNM", "genre": "Children's Books", "title": "A Diary of a Private School Kid", "description": "Private school is tough: bullies, peer pressure, uniforms, and social issues. You think it's bad being a wimpy kid in public school? Try walking in my shoes for one day! I'm Ben Montgomery and these are my unintentionally hilarious stories of misfortune. A Diary of a Private School Kid is a funny illustrated chapter book that's entertaining for children, middle school students, and adults."}, {"id": "1563977540", "genre": "Children's Books", "title": "In the Moonlight Mist", "description": "Boyds Mills Press publishes a wide range of high-quality fiction and nonfiction picture books, chapter books, novels, and nonfiction"}, {"id": "077870047X", "genre": "Children's Books", "title": "Cyber Space: Virtual Reality and the World Wide Web (Megatech)", "description": "Surveys digital technology from the early days of computers to virtual reality and the World Wide Web, describing the uses of computer simulation in flight, battle, hazardous environments, and entertainment."}, {"id": "B005Q8JMAK", "genre": "Children's Books", "title": "Five: The Official Book", "description": "The 2nd revised edition of the story of the pop group Five's rise to fame, with photos, profiles and personal messages from Scott, Rich, Sean, Abs and J. This new edition features a section on Five's adventures around the world, along with exclusive backstage photos and new studio shots."}, {"id": "146545070X", "genre": "Children's Books", "title": "The Rock and Gem Book: And Other Treasures of the Natural World", "description": "What is the difference between a rock and a gem? What makes the Hope Diamond so special? Why are some minerals fluorescent?Dig deep to find the answers in The Rock and Gem Book. Filled with over 1,200 stunning full-color photographs, The Rock and Gem Book is the perfect encyclopedia for young geologists to consult.Chapters are organized according to scientific classifications with straightforward explanations that bring each specimen to life. From the quartz in watches to the limestone in the Great Pyramids, the earth's natural treasures are used in architecture, art, and science. Get up close to diamonds, rubies, pearls, and sapphires, and study the different types of rocks, from granite to meteorites.Designed in DK's signature style, the pages are filled with highly visual spreads that show off the depth and unique quality of each gemstone, rock, and fossil. See the past with fossils, learn about the ocean through shells, and find out what makes gold so special in The Rock and Gem Book."}]