[{"id": "0486470695", "genre": "Children's Books", "title": "Knights in Armor Fun Kit (Dover Fun Kits)", "description": " Enter the glorious age of chivalry with medieval knights and warriors bearing shields and swords. The kit contains Knights and Armor Coloring Book; Knights in Armor Stained Glass Coloring Book; Knight in Armor Sticker Soldier including 4 suits of armor; 6 precut stencils; 2 activity books, including a 32-piece sticker puzzle; crayons, and a special bonus: 20 medieval knights stickers!"}, {"id": "0679838856", "genre": "Children's Books", "title": "To the Top! Climbing the World's Highest Mountain (Step-Into-Reading, Step 5)", "description": "Illus. in full color. Here is the gripping story of Hillary and Norgay's perilous ascent of Mount Everest as they battled snow and ice slides, whipping winds, and the grim knowledge that 19 others had died in the same attempt."}, {"id": "0736920978", "genre": "Children's Books", "title": "1-2-3 God Made Me (The Land of Milk & Honey)", "description": "Little ones journey through the land of numbers in this sunny board book populated with critters from The Land of Milk and Honey. From 1 to 10, sweet and simple rhymes introduce youngsters to the wonders of the world--their own one-of-a-kindness, the beauty of Creation, the love they share with family and friends. The book celebrates all things special to a child's heart--hugs and rainbows, treats and play--while giving a glimpse of God's loving care.Colorful watercolor paintings and easy-to-repeat verses make this an ideal book for many occasions-a peaceful bedtime story, a first introduction to counting and numbers, a name-the-animals game, or simply as a favorite read-aloud to keep close by on the bookshelf.With its companion book, ABC God Loves Me, this sweet volume invites toddlers to tote it around, climb onto a favorite grown-up's lap, and offer a not-to-be-refused invitation: \"Read to me!\""}, {"id": "B076DNH5M7", "genre": "Children's Books", "title": "Matt Ryan (Sports All-Stars)", "description": "Matt Ryan is known for staying cool under pressure. He's been one of the world's best quarterbacks since he started playing for the National Football League (NFL) in 2008. In 2016, he won Most Valuable Player and led the Atlanta Falcons to the Super Bowl. But Ryan wasn't done yet—he said the next season would be even better. Read all about Ryan's football career, his life off the field, and how he keeps his body and mind in shape for the game."}, {"id": "B00HNXC1A4", "genre": "Children's Books", "title": "#16 The Planet of Gehom (The Little Prince)", "description": "On this spinning cube-shaped planet, the inhabitants must walk endlessly to keep from falling off and tumbling into the stellar void! A handful among them have rejected this destiny. Can the Little Prince help them discover who is really responsible for the forced marching?"}]