[{"id": "157525140X", "genre": "Children's Books", "title": "Plays of People at Work: Grades K-3 (Young Actors Series)", "description": "A collection of twelve plays in which Janice, Steve, Paula, and Burton investigate a variety of occupations, including newspaper reporter, robotics engineer, and crime lab technician"}, {"id": "B01HIMFLPG", "genre": "Children's Books", "title": "A Symphony of Cowbells", "description": "Petra just loves spring in Gimmelwald. Each season she and her family lead their prize dairy cows into the pastures to graze and each cow wears her own jingling, jangling, clanging bell. What a symphony! But when Petra's favorite cow, Elfi, loses her bell the whole herd is out of harmony and refuses to move. Will Petra be able to find Elfi's bell before it's too late? With charming illustrations, this whimsical story is sure to delight children and adults alike."}, {"id": "1612861857", "genre": "Children's Books", "title": "From Youth to Youth", "description": "Om Sam gacchadhvam sam vada dhvam vo manamsi janatam I deva bhagam yatha purve sam janana upasate II                       RigVed.1.191.2 O citizens! Live in harmony and concord. Be organized and co-operative. Speak with one voice and make your resolutions with one mind. As our ancient saints and seers , leaders and preceptors, have performed their duties righteously, similarly, may you not falter in executing your duties."}, {"id": "B00I6MZ6XA", "genre": "Children's Books", "title": "The Adventure of Paperman: Journey Into Night", "description": "Paperman, Masked Warrior and Bomb Boy have already faced countless dangers, journeyed across volcanoes and battled dragons, but now their journey grows darker. Darkness haunts them at every turn and they are unsure of who to trust. Old villains return as Dr. Eraser’s power grows stronger. Paperman and his friends must seek out the help of new friends to make it through the Ice Mountains and 2D City beyond. Who is a friend? Who is a foe? Journey back into Paperworld on the next leg of Paperman’s quest to save Paperworld from the clutches of evil.In this second installment of the Paperman trilogy our heroes must face off against Frost Goblins, Shadow Vampires, bandits and even themselves!"}, {"id": "1508193991", "genre": "Children's Books", "title": "Princess Nika's Dog (Little Princesses)", "description": "Dogs can be great pets, but taking care of them is a lot of work. The young princess in this book gets a dog before learning all the work that being a pet owner requires. Readers follow the princess on her journey with the dog. Charming illustrations and accessible text will engage readers and animal lovers of many ages. This lovely story touches on important topics in pet care and responsibility. This colorful tale is sure to be a hit with animal lovers and young readers alike."}]