[{"id": "B00LU4QSPQ", "genre": "Children's Books", "title": "Twenty-Four Gustav Klimt's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Gustav Klimt''s Paintings. Twenty-Four Gustav Klimt''s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "0756543967", "genre": "Children's Books", "title": "Man on the Moon: How a Photograph Made Anything Seem Possible (Captured History)", "description": "It is a bizarrely beautiful image: A man in a spacesuit stands isolated in an alien world. His companion, the photographer, and their landing craft are reflected in his visor. This photograph, taken by Neil Armstrong of fellow astronaut Buzz Aldrin, is the most famous documentation of Americas 1969 moon landing. But to people in every country on Earth, it represented and still does so much more. The man in the photograph was hundreds of thousands of miles away from his home planet. He had conquered another world. It was, as Armstrong said, a giant leap for mankind. The photo of this historic event remains one of the most powerful and inspiring representations of the achievements of humankind."}, {"id": "1570915261", "genre": "Children's Books", "title": "Ralph Masiello's Bug Drawing Book", "description": "Who better to teach kids to draw creepy crawlies than the Icky Bug Man himself, Ralph Masiello? With simple, step-by-step instructions—and extra challenges for more experienced artists—this how-to book will have kids on their way to drawing bug masterpieces."}, {"id": "B00PNUO22O", "genre": "Children's Books", "title": "Mods Handbook for Minecraft: The Best Minecraft Mods That You Will Love (Unofficial Minecraft Guide )", "description": "Mods Handbook for Minecraft: The Best Minecraft Mods That You Will Love (Unofficial Minecraft Guide )Since the beginning of Minecraft countless mods have been created with an intention to enhance the game and improve the gaming experience for the players.  That’s why I’ve made a book containing only the best Minecraft mods. In this eBook you will find a wide variety of awesome mods. Some mods let you do what was impossible before: effortlessly find the best resources, create complex contraptions, ride motorbikes, use parachutes, sail boats and more. Other mods let you enjoy the game to a greater degree by avoiding various hassles, improving the graphics and speed. You will also find mods that make playing Minecraft a lot more fun. Some of them are: a special TNT mod, a camping mod, a biospheres mod and more.Scroll Up, Grab Your Copy and Enjoy Some Fantastic Mods!"}, {"id": "1888306394", "genre": "Children's Books", "title": "ELSIE'S CHILDREN, The Elsie Books 6", "description": "This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work."}]