[{"id": "1489638792", "genre": "Children's Books", "title": "The Ghosts Go Haunting (Av2 Fiction Readalong)", "description": "All through the school, ghosts go marching, witches go flying, and goblins go groaning with a whole host of other creatures! The teachers and staff are terrified, but of course the students know its just Halloween fun! Helen Kettemans verseswritten to the counting tune of The Ants Go Marchingmake this a rollicking read-aloud, while Adam Records artwork brings the ghoulish parade to life."}, {"id": "1424556414", "genre": "Children's Books", "title": "A Giant Headace: The Story of David and Goliath", "description": "A Giant Headache - is the biblical story of David and Goliath in a rhyming, fun format. The story teaches about the courage and strength we receive from God when we trust in him completely. Each page is beautifully illustrated and includes scripture references from 1 Samuel 17:1-49. The book ends with a Salvation page for your child to fill out with their name for a personal commitment to Christ. "}, {"id": "0711211817", "genre": "Children's Books", "title": "The Drop in My Drink: Story of Water on Our Planet", "description": "The story of a drop of water. The reader is taken back thousands of years to see where the Earth's water came from, and how life began in the oceans and later moved onto land. The author describes the water cycle, discusses environmental issues, and provides a collection of facts on water."}, {"id": "B01G6GKZ4M", "genre": "Children's Books", "title": "Diary of a Spider Chicken, Book 2: An Unofficial Minecraft Diary (Minecraft Spider Chicken)", "description": "Book 2: I'll be back...Martin, the spider chicken, is trying to process what just happened. He and his friends barely escaped from the mad scientist villager and his chimera golems. Now, they are resting in a cave, at least for the moment.But, their rest won't last long because they discover something insane in the cave.And, what can they do about the mad scientist villager?Read Book 2 of the Diary of a Spider Chicken now!"}, {"id": "1562477676", "genre": "Children's Books", "title": "Molly Takes Flight (American Girl Collection)", "description": "Molly feels that everything in her life has changed when her father goes off to England to help wounded soldiers and her beloved aunt joins the Women's Airforce Service Pilots."}]