[{"id": "1680104195", "genre": "Children's Books", "title": "The Abandoned Hamster (Animal Rescue Center)", "description": "When Ella finds a hamster hiding in the garbage can at her grandpa’s garden center, she is determined to find out who he belongs to. All signs point to Katie, who has just moved into the neighborhood with her parents; but how can Ella prove that the hamster belongs to Katie?"}, {"id": "1681521652", "genre": "Children's Books", "title": "Pro Sports Biographies: Chloe Kim", "description": "A photo-illustrated biography for early readers on US pro snowboarder Chloe Kim. Describes her childhood, when she started riding a snowboard, and how he got to be one of the youngest pro halfpipe and slopestyle snowboarders. Includes a fact sheet with highlighted accomplishments, glossary, books, and websites."}, {"id": "1571970622", "genre": "Children's Books", "title": "The Adventures of the Itty Bitty Frog", "description": "This story centers around a small, lovable frog who has a lot of kindness to offer to a baby bird. Although the frog encounters many pitfalls in his attempt to get the baby bird home, he never loses his determination."}, {"id": "0062681907", "genre": "Children's Books", "title": "Wonder Woman: The Deluxe Junior Novel", "description": "Official tie-in books for the new hit movie!Wonder Woman, DC Comics’ greatest heroine, soared to the big screen on June 2, 2017, for the first major motion picture in her 75-year history! The all-star cast includes Gal Gadot, Chris Pine, Connie Nielsen, Robin Wright, and more.To the outside world, Diana Prince is just a regular woman. But that’s not who she truly is. Diana is an Amazon princess from the island of Themyscira. She is also Wonder Woman. From a secret hidden island to the frontlines of battle, Diana is ready for the role of a lifetime—to become the hero the world needs most.Based on the major motion picture, this hardcover edition of Wonder Woman: The Junior Novel retells the exciting story of Diana’s journey to become one of the world’s greatest heroes and features eight pages of full-color images from the film."}, {"id": "0613013166", "genre": "Children's Books", "title": "Archeologists Dig For Clues (Turtleback School & Library Binding Edition) (Let's-Read-And-Find-Out Science: Stage 2)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Describes how scientists can learn about the past and how ancient people lived by excavating rocks and other clues."}]