[{"id": "0237512513", "genre": "Children's Books", "title": "Jerusalem (Holy Cities)", "description": "Surveys the history, places of worship, legends, traditions, and art and architecture of the great city, in which Christians, Jews, and Muslims live side by side"}, {"id": "1605966371", "genre": "Children's Books", "title": "Nascar Sprint Cup (Sporting Championships)", "description": "Introduces the NASCAR sprint cup, including its history, the rules of stock car racing, and notable past winners."}, {"id": "1569765464", "genre": "Children's Books", "title": "The Young Investor: Projects and Activities for Making Your Money Grow", "description": "Explaining the language of finance and the skill of investing, this guide gives kids an early start at making their money grow. The book explains the general concept of money and demonstrates how saving works based on the concepts of simple and compound interest. Children then learn where Wall Street is located, what stocks and bonds do, and, with the help of an adult, the right way to buy or sell a stock, mutual fund, or savings bond. Dozens of projects illustrate how to balance a checkbook, read a stock table, and understand common financial terms such as inflation, recession, and the Federal Reserve Board. This updated edition details the current financial environment, including what is meant by a global economy, economic clues for recovery, and a special section on what mortgages are and how they work. Updated resources for further information online are also included."}, {"id": "1592650880", "genre": "Children's Books", "title": "The Big Book of China: A Guided Tour Through 5,000 Years of History and Culture", "description": "This full-color whimsical “tour” through four thousand years of Chinese history has something for all readers. Designed to appeal to a younger audience, the author’s detailed illustrations shed new light on everything from China’s diverse geography to its art, culture, clothing, customs, history, food, travel, and all aspects of traditional and contemporary society. With a great eye for detail and a funny, thoughtful knack for tackling such a huge subject, Qicheng Wang offers what could be considered a “China encyclopedia” for younger readers, and an ideal first book through which they can begin years of discovery about Chinese history and culture.Qicheng Wang is one of China’s most popular illustrators."}, {"id": "1575423804", "genre": "Children's Books", "title": "What Are My Rights?: Q&A About Teens and the Law (Revised and Updated Third Edition)", "description": "“Can I be prosecuted for comments I make online?” “Can I get a credit card?” “When can I get a tattoo?” “Why can’t I wear what I want to school?” These questions—and many more—are asked and answered in What Are My Rights? Teens often have questions about the law, but they don’t always know where to turn for the answers. This book gives them those answers, exploring more than 100 legal questions pertaining specifically to teens. The third edition includes fresh facts, updated statistics, and additional questions and answers, including a new chapter addressing online issues from Facebook to file sharing. Using a straightforward “just the facts” tone, and drawing on examples from real-life court cases involving young people, Judge Tom Jacobs explains to teens what their rights are. Readers learn about the laws that affect them, appreciate their rights, and consider their responsibilities."}]