[{"id": "B01EXQ3SQO", "genre": "Children's Books", "title": "Twenty-Four Paul Signac's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Paul Signac''s Paintings. Twenty-Four Paul Signac'’s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "077872414X", "genre": "Children's Books", "title": "Samuel De Champlain: From New France to Cape Cod (In the Footsteps of Explorers)", "description": "Describes the life and accomplishments of the French explorer who made many voyages to North America, founded a colony in present-day Canada, and became known as the \"Father of New France.\""}, {"id": "1328810194", "genre": "Children's Books", "title": "Super-Duper Spooky Doodle Book (Super Duper Doodle Books)", "description": "Just in time for Halloween, a spook-the-imagination doodle and draw book jam-packed with \"scary\" monsters, creative story starters, \"haunted\" hidden pictures, and more than 50 stickers!  Welcome to the weird world of the Super-Duper Spooky Doodle Book!   Learn to draw more than twenty ghastly characters in silly scenes on every page. It’s clever, creative, and contagious fun! Just grab your markers, crayons, or colored pencils and get set to laugh and create awesome art—just in time for Halloween!   Inside each book, you’ll find 96 pages of fun!Easy-to-follow drawing tips Imaginative doodle promptsSilly story startersHilarious hidden picture pages More than 50 stickers!"}, {"id": "0805072381", "genre": "Children's Books", "title": "Old Mother West Wind", "description": "Perfect for gift-giving--a classic illustrated by Michael Hague, in a beautifully redesigned edition.Thornton W. Burgess said that imagination was \"the birthright of every child.\" His Old Mother West Wind stories, first published in 1910, have worked their magic on generations of children."}, {"id": "1589807987", "genre": "Children's Books", "title": "Kvetch Who Stole Hanukkah, The", "description": "In the town of Oyville, the children were preparing for Hanukkah. But the kvetch who lived high on the hill said what he said every year: \"The latkes smell bad, the dreidels make me dizzy, and to hear children laugh puts me in a tizzy.\" This year, will Hanukkah represent another great miracle, finally bringing a smile to the kvetch's face?"}]