[{"id": "0789498898", "genre": "Children's Books", "title": "American Revolution Battles and Leaders", "description": "Portraits, scene paintings, photographs of artifacts, and locator maps all show and tell readers where the key battles took place, what happened during the clashes, and who the main figures were in the struggle for independence from England. Simultaneous. 10,000 first printing."}, {"id": "0816740089", "genre": "Children's Books", "title": "Why Spider Spins Tales: A Story from Africa (First-Start Legends)", "description": "Can Ananse the spider meet Sky God's challenge to prove he can spin stories and tales that are as splendid as his webs? Troll First-Start Legends are a delightful introduction to the fascinating world of multicultural legends written and designed especially for primary-level readers."}, {"id": "B01LMD1CT6", "genre": "Children's Books", "title": "Under a Halloween Moon", "description": "On Halloween night...under spooky moonlight, friends gather round, for treats in their town. To a party they travel, when plans start to unravel. An adventure is in store, so come along and explore. The strange things that take place, will leave a smile on your face.  A magic night to behold, where anything can unfold - under a Halloween Moon!"}, {"id": "0007102054", "genre": "Children's Books", "title": "German Grammar (German Edition)", "description": "COLLINS Gem German Grammar is designed to help students at all levels. It offers learners of German all the grammatical information they need, in a clear, user-friendly layout. A step-by-step layout gives maximum ease of reference, quickly allowing the user to become familiar with the presentation of information. The grammar points are illustrated by numerous idiomatic examples. Special attention has been given to problem areas where German may differ markedly from English. And of course, German spelling reform has been fully implemented. Ease of reference is further enhanced by a comprehensive index, listing grammatical topics and keywords in both German and English, and giving the user immediate access to the solution to his or her grammatical queries."}, {"id": "1338216406", "genre": "Children's Books", "title": "What Would She Do?: 25 True Stories of Trailblazing Rebel Women", "description": "From historic world leaders to brilliant scientists, artists, and modern-day pioneers, What Would She Do? shares twenty-five incredible women's stories that educate and empower. Learn about the remarkable achievements and attitudes of feminist trailblazers such as Cleopatra, Amelia Earhart, Malala Yousafzai, Michelle Obama, and other brave women who overcame huge obstacles to accomplish great things. Featuring stunning illustrations from diverse artists, this beautiful book will inspire young readers and prepare them to face any challenge by simply asking, \"What would she do?\""}]