[{"id": "0763652032", "genre": "Children's Books", "title": "MoshiMoshiKawaii: Where Is Strawberry Princess Moshi?", "description": "They’re cute! They’re fun! Join in on the new sensation from Japan — a search-and-find game book all about Strawberry Moshi and her friends.Strawberry Moshi wants to go to the ball, but she needs to find the right costume to dress up as Strawberry Princess Moshi. Kids will love helping her look for the proper clothes, get to the ball, and locate her Prince Moshi, of course!"}, {"id": "1894222261", "genre": "Children's Books", "title": "Kitty's First Year: A Record Book and Keepsake (Abby and Tess Pet-Sitters)", "description": "A fun and original book to capture the memories of your kitty's first year. Parents and children will love working together to create a lasting record of their early adventures as pet owners."}, {"id": "1538210274", "genre": "Children's Books", "title": "Trains Go! (Ways to Go)", "description": "Whether riding the intricate web of rails that cross the country, or just taking the subway in the big city, trains are an amazing way to get from place to place. Original, creative text paired with vibrant full-color photographs show these amazing trains moving from here to there, giving riders an easy trip to wherever they're going. Trains crossing the countryside or moving underground in big metropolises all share the same characteristics, quickly giving riders a way to get around."}, {"id": "0747555877", "genre": "Children's Books", "title": "Harry Potter and the Chamber of Secrets (Harry Potter)", "description": "The Dursleys were so mean that hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockheart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny.But each of these seem minor annoyances when the real trouble begins, and someone--or something--starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects...Harry Potter himself?"}, {"id": "0375821945", "genre": "Children's Books", "title": "Ice Age Cave Bear", "description": "Giant cave bears were creatures to be feared—and revered. Thousands of years ago, early humans painted images of them on cave walls. By the end of the ice age, the last of the cave bears had died out. The only things left were their bones—hundreds of thousands of bones—and eerie paintings in the caves they once inhabited.Ice Age Cave Bear tells the story of these massive creatures in fascinating detail—what they looked like, where and how they lived, and what may have caused their extinction."}]