[{"id": "0486468933", "genre": "Children's Books", "title": "How to Draw Animals (Dover How to Draw)", "description": "How to Draw Animals Easy-to-follow guide, with step-by-step diagrams, shows youngsters how simple it is to create delightful likenesses of a bushy-tailed squirrel, a smiling chimpanzee, a prickly porcupine, and 27 other familiar creatures. Fun-filled book also teaches basics of developing shapes and proportions."}, {"id": "0606019286", "genre": "Children's Books", "title": "The Post Office Book: Mail and How It Moves", "description": "An outing to a modern post office offers children the opportunity to see culling and cancelling machines, watch postal workers, and follow a box of baby chicks through the mail"}, {"id": "1786062178", "genre": "Children's Books", "title": "Zlatan Ibrahimovic: Red Devil (Heroes)", "description": "Ibrahimovic’s incredible career has taken him through the doors of the world’s most famous clubs, including Juventus, Inter Milan, Barcelona and Paris Saint-Germain. His extraordinary talent and eye for the goal have created classic moments at all, and cemented his status as a modern soccer legend. Known for his eccentric personality, he is not only one of the greatest strikers of his generation, but equally one of soccer’s most entertaining and popular characters. His story, beginning with his humble childhood in an industrial Swedish town, is a fascinating one."}, {"id": "0766089711", "genre": "Children's Books", "title": "Living and Working in Ancient Greece (Back in Time)", "description": "Ancient Greece was known for its sophisticated culture and great thinkers in the fields of philosophy, science, and math. The life and culture of this amazing ancient society will leap off the page, as readers engage with the compelling, informational text and complementary photos. As readers travel back in time to ancient Greece, they will discover the lasting influence this ancient civilization has had on the modern world."}, {"id": "1434709809", "genre": "Children's Books", "title": "The Action Bible Collector's Edition: God's Redemptive Story (Action Bible Series)", "description": "**Now with a dazzling premium chrome cover!** Celebrating more than one million copies sold of The Action Bible, this Collector’s Edition features a dazzling premium chrome cover kids can't resist as they dive into the action of God's redemptive story. The Action Bible presents 215 fast-paced narratives in chronological order, making it easier to follow the Bible’s historical flow—and reinforcing the build-up to its thrilling climax. The stories in The Action Bible communicate clearly and forcefully to contemporary readers. This compelling blend of clear writing plus dramatic images offers an appeal that crosses all age boundaries. Brazilian artist Sergio Cariello has created attention-holding illustrations marked by rich coloring, dramatic shading and lighting, bold and energetic designs, and emotionally charged figures. Let this epic rendition draw you into all the excitement of the world’s most awesome story."}]