[{"id": "155074237X", "genre": "Children's Books", "title": "Pioneer Story, A: The Daily Life of a Canadian Family in 1840", "description": "Meet the Robertsons, a pioneer family living on a backwoods farm. Their story begins in spring, when the hardships of winter are over and new chores are beginning. Readers follow the Robertson family through the year, until winter closes around them. Factual information and highly detailed drawings of daily life accompany each story and expand on what children have just read. This book is a comprehensive classroom resource."}, {"id": "0431098824", "genre": "Children's Books", "title": "The Life & Work Of Vincent Van Gogh", "description": "Provides a vivid picture of the lives and works of some of the world's greatest artists and their influence on world art. Includes examples of the artist's work at various stages of their career"}, {"id": "B008QY06SI", "genre": "Children's Books", "title": "14 Fun Facts About Asteroids (15-Minute Books Book 89)", "description": "Circling the heavens is a belt of rock and dust. Lying between Mars and Jupiter and orbiting our sun, The Main Asteroid Belt was once thought to be the remnants of an exploded planet or the beginnings of a planet that never formed.How much do you know about asteroids? Can you answer these questions:Where is The Main Asteroid Belt?How many asteroids are there in The Main Asteroid Belt?What was the first asteroid discovered?How much mass does The Main Asteroid Belt have?How fast do asteroids travel?Find out the answers to these questions and more and amaze your family and friends with these fun facts.Ages 8 and up.All measurements in American and metric.LearningIsland.com believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Many books are appropriate for hi-lo readers. Open the world of reading to a child by having them read for 15 minutes a day."}, {"id": "B077CMFXY9", "genre": "Children's Books", "title": "Little Miss Mia Ross: The cutest childrens book for girls and boys about friendship by age 3-5. The kind and adventure story for kids of how a little girl was trying to save a little cat in the yard.", "description": "Meet little Miss Mia RossA girl who is only four.Her mind is always activeShe’s curious to learn more.Mia loves going on adventuresShe’s never content to just sit still.Up for anything the world offers,Mia is ready to go at will.Adventure book about little girl - Miss Mia Ross. The kind and interesting toddler board book for babies who like pets (especially picture books about cats). The childrens book about feelings and kindness to the animals and other people. Very good bedtime and goodnight story for kids."}, {"id": "1590848314", "genre": "Children's Books", "title": "The People Of China: The History and Culture of China", "description": "Examines the history, customs, beliefs, and aspirations of nine of China's fifty-six officially recognized ethnic groups."}]