[{"id": "1481443550", "genre": "Science Fiction & Fantasy", "title": "Constance Verity Saves the World", "description": "For Constance Verity, saving the world isn’t the hard part. It’s keeping her new, ordinary life from falling apart along the way that’s going to be tricky. This is the next book in the witty Constance Verity trilogy, which Booklist named a Top 10 SF/Fantasy book of 2016.Constance successfully became an ordinary person. People warned her it would be boring—and they were right. That’s exactly why Connie loves it. But there’s an Adventurer-shaped hole in the cosmos now, and a lot of interested parties eager to fill it. Not all of those candidates are fit for the role, and if The Adventurer falls into the wrong hands, it can lead to chaos and destruction. Constance still has all the skills of her old life, but she’s no longer chosen. Yet when the fate of the world is at stake, she sets off, reluctantly, to keep the forces of evil from stealing the destiny she abandoned."}, {"id": "B0188404GE", "genre": "Science Fiction & Fantasy", "title": "Flame Of Recca (Issues) (33 Book Series)", "description": "Teenager Recca Hanabishi is always up for a good-natured tussle with his friends. That's because he's famous at school and around town for being a super ninja geek.Armed with the power to control flame, Recca suddenly finds himself in an awkward situation. On the day he pledges his undying ninja allegiance to a pretty classmate named Yanagi Sakoshita, a mysterious older woman pops into his life. Is she good? Is she evil? What exactly does she want? And what's the deal with tomboy, Fuko Kirisawa? She's got the power of wind at her command. Does she want to smash our hero to smithereens, or does she simply want to kiss him?"}, {"id": "B009FFPQW8", "genre": "Science Fiction & Fantasy", "title": "Silver Princess (Bk 1) (Silver Sagas)", "description": "\"Ms. Carter has written a superb novella in Silver Princess. It is a fantasy book taking place in a fairy kingdom, but with characters who could be our next door neighbors.\" --Dawn Edwards, The Kindle Book Review   The youngest daughter of the silver fairy king, Rebecca’s life up to now has been—in a word—sheltered.  Her extensive education has prepared her for almost any situation she could expect to encounter, but no one thought to teach her how to handle her first brush with love, let alone being kidnapped by traitors.    She only has her father's sense of humor, her mother's sense of pride, and the hope that her friends will rescue her in time.  She will have to draw on half-forgotten pearls of wisdom to survive these coming ordeals without bringing shame upon herself or her house."}, {"id": "0751514241", "genre": "Science Fiction & Fantasy", "title": "The Confusion Room (Minack Chronicles)", "description": "\"I will begin exploring the Confusion Room today.\" So declares Derek Tangye at the beginning of the final Minack Chronicle, the autobiographical series that has been an inspiration to readers all around the world. Delving into the mass of letters and papers in the abandoned stable at Minack, the remote Cornish cottage where he lived alone after the death of his wife Jeannie, Derek weaves pieces of his past into the story of those last peaceful years spent in the company of his donkeys Merlin and Susie. Poignant and deeply evocative, The Confusion Room is a marvelous tribute to the memory of Derek Tangye."}, {"id": "B00IWC40JK", "genre": "Science Fiction & Fantasy", "title": "Doctor How and the Illegal Aliens: The Doctor Who is not a Time Lord", "description": "What doesn't the BBC want you to know?A humorous take on a much-loved seriesHalf a century ago, Doctor How's famous brother sold his fictional life story to the BBC, painting himself as a lone hero. Disillusioned, their four cousins dropped out. For fifty years, it is Doctor How who has protected humanity against the forces of darkness and stupidity.Illegal aliens try to hack Doctor How's systems, and he finds his estranged cousin Where has already been compromised.When reports come in of mysterious attacks by alien creatures, How has to rely on his new assistant Kevin, a petty criminal from south London, and Trinity, a morphing super-predator, as he counters this threat to humanity's existence.His efforts are hampered by bungling agents from MI-16, desperate to capture How's time-travel technology.Can Doctor How keep ahead of MI-16, save Where and combat the alien threat?This book series is not affiliated with or endorsed by the BBC. It is not a Doctor Who story."}]