[{"id": "B00Q0NHZ3Q", "genre": "Children's Books", "title": "Further Chronicles of Avonlea (Illustrated) (Classics of North American Literature Book 6)", "description": "This new edition includes:The entire text of Further Chronicles of Avonlea, by Lucy Maud Montgomery, as well asIllustrations and photos that bring the story to life!Read the story of Anne, who inspired multiple films and who captured the minds and hearts of people everywhere!"}, {"id": "0763669393", "genre": "Children's Books", "title": "Emily Windsnap and the Land of the Midnight Sun", "description": "The New York Times best-selling series continues with the half-mermaid embarking on an icy and perilous journey to the Land of the Midnight Sun.Strange storms are blowing up from the ocean, caused by the nightmares of Neptune, King of the Sea. Convinced that his dreams herald an approaching threat, Neptune enlists half-mermaids Emily Windsnap and Aaron for a top-secret mission to find and eliminate the source of the trouble. But Emily and Aaron quickly get in over their heads in the frigid waters of the frozen north. Deep within an alpine lake where magical reflections show what could be rather than what is, the two discover a trove of stolen memories and Neptune's darkest secret. Double-crosses and double-takes abound in Liz Kessler's fifth magical mermaid adventure."}, {"id": "0525422307", "genre": "Children's Books", "title": "Suki, The Very Loud Bunny", "description": "Bunnies are supposed to nuzzle their carrots, hop through the meadow, and listen to their mommas. Most of all, bunnies are supposed to be quiet. Except Suki doesn't much like doing what she's supposed to do, and her BIG voice leads her into some BIG trouble. But when her adventurous streak leads her out of the burrow, her unstoppable spirit might be just the ticket to getting home to Momma."}, {"id": "1410940829", "genre": "Children's Books", "title": "Pioneers to the West (Children's True Stories: Migration)", "description": "Pioneers to the West will follow the rural experiences of children traveling across America in search of land, gold, farms, and religious freedoms."}, {"id": "0778736067", "genre": "Children's Books", "title": "Tech to Protect: High-tech Defense Science (Techno Planet)", "description": "Tech to Protect explores many of the incredible technological innovations that are occurring in the defense industry, including weaponry and military hardware, as well as surveillance and cybersecurity programs. Robots and drones are replacing humans in combat situations and police officers and soldiers are being equipped with superhuman abilities through x-ray vision and exoskeletons. Young readers will also learn about the controversies some of these innovations are creating, including concerns over privacy."}]