[{"id": "014028091X", "genre": "Science Fiction & Fantasy", "title": "T.C. Boyle Stories", "description": "Gathered into one volume, the first four short story collections of T.C. Boyle, winner of the 2015 Rea Award for the Short StoryT. C. Boyle is one of the most inventive and wickedly funny short story writers at work today. Over the course of twenty-five years, Boyle has built up a body of short fiction that is remarkable in its range, richness, and exuberance. His stories have won accolades for their irony and black humor, for their verbal pyrotechnics, for their fascination with everything bizarre and queasy, and for the razor-sharp way in which they dissect America's obsession with image and materialism. Gathered together here are all of the stories that have appeared in his four previous collections, as well as seven that have never before appeared in book form. Together they comprise a book of small treasures, a definitive gift for Boyle fans and for every reader ready to discover the \"ferocious, delicious imagination\" (Los Angeles Times Book Review) of a \"vibrant sensibility fully engaged with American society\" (The New York Times)."}, {"id": "B077MRPMRN", "genre": "Science Fiction & Fantasy", "title": "Knight and Champion", "description": "Catelyn la Berne dreams of becoming a knight, but the odds are stacked against her. The local garrison only take male squires and patrons are hard to find in the modest hamlet of Guill. Her brother, Tanis, has problems of his own. His reserved nature has won him few friends and he longs to be free of the suffocating tendrils of country life. Meanwhile, elder sister Hadley will go to any lengths to hold her family together, but not even her famous temper can halt the shadow advancing across Ardennia …For the first time in over a century, danger lurks on all sides. Orcs spotted in the west. Dwarven troops under the Furan Mountains. And, most shocking of all, murderous bands of elves in the Dawn Forest. Rumors are rife that humanity now stands alone against its former allies. When the la Berne family is decimated in a brutal ambush, Catelyn, Tanis and Hadley are thrust into the wilderness, alone and vulnerable. None are aware of the spectacular roles they are destined to play in the gathering chaos. The ancient magic that binds these three is sinister in nature, but might just be Ardennia’s only chance of survival. After all, in an age where heroes are thin on the ground and conventional magic is dying, it is said that salvation will be delivered from the darkest, most unexpected of corners. KNIGHT AND CHAMPION is the first novel in an epic dark fantasy series."}, {"id": "078696538X", "genre": "Science Fiction & Fantasy", "title": "The Legend of Drizzt 25th Anniversary Edition, Book II", "description": "An outstanding value for Drizzt fans everywhere!A demonic artifact, hurled by an angel through the spaces between planes of existence to keep it out of the hands of a demon prince, has found its way to Faerûn. There it corrupts a young wizard, turning him into a power-mad invader. Only a small band of heroes, including the exiled dark elf Drizzt Do’Urden can stand in his way—and stir up a long list of enemies in the process.The Legend of Drizzt® 25th Anniversary Edition, Book II collects the fourth, fifth, and sixth novels in this best-selling series: The Crystal Shard, Streams of Silver, and The Halfling’s Gem in a trade paperback edition that is a great value for anyone who’s ready to continue the experience of the Legend of Drizzt."}, {"id": "1680920499", "genre": "Science Fiction & Fantasy", "title": "NASA Systems Engineering Handbook: NASA/SP-2007-6105 Rev1 - Full Color Version", "description": "This is a FULL-COLOR (other variations are in grayscale) reproduction of the National Aeronautics and Space Administration (NASA) Systems Engineering Handbook (NASA/SP-2007-6105 Rev1).This handbook consists of six core chapters: (1) systems engineering fundamentals discussion, (2) the NASA program/project life cycles, (3) systems engineering processes to get from a concept to a design, (4) systems engineering processes to get from a design to a final product, (5) crosscutting management processes in systems engineering, and (6) special topics relative to systems engineering. These core chapters are supplemented by appendices that provide outlines, examples, and further information to illustrate topics in the core chapters. The handbook makes extensive use of boxes and figures to define, refine, illustrate, and extend concepts in the core chapters without diverting the reader from the main information.The handbook provides top-level guidelines for good systems engineering practices; it is not intended in any way to be a directive.NASA/SP-2007-6105 Rev1 supersedes SP-6105, dated June 1995."}, {"id": "0441017967", "genre": "Science Fiction & Fantasy", "title": "Princeps' Fury (Codex Alera)", "description": "In the acclaimed Codex Alera novels, #1 New York Times bestselling author Jim Butcher has created a fascinating world in which the people of Alera use their unique bond with the elemental forces of nature for protection. But even nature may not be enough to stave off the coming storm…   Tavi of Calderon, now recognized as Princeps Gaius Octavian and heir to the crown, has achieved a fragile alliance with Alera’s oldest foes, the savage Canim. But when Tavi and his legions guide the Canim to their lands, his worst fears are realized. The dreaded Vord—the enemy of Aleran and Canim alike—have laid waste to the Canim homeland. And the Alerans find themselves trapped alongside their former enemies.   Meanwhile, war-torn Alera rebuilds while politicians and nobles vie for power. But from the south comes the news: the Vord have come to Alera. For a thousand years, Alera and her furies have withstood every enemy, and survived every foe. But the thousand years are over..."}]