[{"id": "0531207021", "genre": "Children's Books", "title": "You Wouldn't Want to Be in the First Submarine!: An Undersea Expedition You'd Rather Avoid", "description": "Hilarious illustrations, captions, and sidebars describe the horrible conditions inside early submarines and the many dangers that those who traveled inside endured. Simultaneous."}, {"id": "1595159533", "genre": "Children's Books", "title": "Machines Large and Small (Learning Languages)", "description": "Describes how workers use machinery to build roads, and includes pairs of opposite vocabulary words relating to road constriction in both Spanish and English"}, {"id": "1547085061", "genre": "Children's Books", "title": "Happy Birthday 66: Birthday Books For Adults, Birthday Journal Notebook For 66 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0764160974", "genre": "Children's Books", "title": "Rembrandt and the Boy Who Drew Dogs: A story about Rembrandt van Rijn", "description": "Author Molly Blaisdell transports young readers to the city of Amsterdam in the 1650s. It is a time when world-renowned artist Rembrandt van Rijn is at the height of fame among his patrons―and when his young son Titus longs to imitate his father and become a great painter. At first, Rembrandt rebuffs Titus’s attempts at drawing, telling the boy he is too young to learn art. But gradually, the master painter is won over by his son’s enthusiasm and persistence, and he begins to teach a very happy Titus the basic techniques of drawing from life. Here is a warmhearted story for children, with illustrations that capture the atmosphere of seventeenth-century Holland and suggest some of the genius that radiates from Rembrandt’s own magnificent paintings."}, {"id": "0786852607", "genre": "Children's Books", "title": "Sugar Plum Ballerinas #1: Plum Fantastic", "description": "Alexandrea Petrakova Johnson does not want to be a beautiful ballerina, and she does not want to leave her friends in Apple Creek. Unfortunately, that doesn't stop her ballet-crazy mother from moving them to Harlem, or from enrolling Al at the Nutcracker School of Ballet.  Life is hard when you're the new ballerina on the block, and it's even harder when you're chosen to be the Sugar Plum Fairy in the school recital! Not only is Al a terrible dancer, but she's also got a rotten case of stage fright! Al's ballet classmates are going to have to use all the plum power they've got to coach this scary fairy! "}]