[{"id": "1426315147", "genre": "Children's Books", "title": "National Geographic Kids Weird But True!: Ripped from the Headlines: Real-life Stories You Have to Read to Believe", "description": "This just in! The most bizarre and surprising news stories you've ever read, and they're all true!Glow-in-the-dark piglets, soccer-playing parrots, cicada-flavored ice cream, fashion-forward slugs!Get ready to be amazed by weird and wacky headlines from across the globe! Weird But True! Ripped From the Headlines has all the things you’d expect from a regular news publication—world news, sports and science sections, entertainment stories, and more—but with a brand-new twist: These stories are almost too strange to believe! Ripped From the Headlines covers mind-bending trivia about animals, athletes, space, food, toys, geography, money, weather, and more. Get ready to open your eyes to the wild wonders of the world. You’ll never look at the news the same way again!"}, {"id": "1604660015", "genre": "Children's Books", "title": "The Tale of Brownie Beaver", "description": "A classic in the series by author Bailey in which he teaches children the wonders of the animal world through his charming characters. Detail in this series and title are rich and the lessons about animals unrivaled."}, {"id": "1419725580", "genre": "Children's Books", "title": "Rube Goldberg's Simple Normal Humdrum School Day", "description": "If Rube’s inventions are any indication, “normal” means something very different in the Goldberg household. For Rube, up is down, in is out, and the simplest path to accomplishing an everyday task—like brushing his teeth or getting dressed—is a humorously complicated one. Follow Rube as he sets out on a typical school day, overcomplicating each and every step from the time he wakes up in the morning until the time he goes to bed at night.   This book features fourteen inventions, each depicting an interactive sequence whose purpose is to help Rube accomplish mundane daily tasks: a simple way to get ready for school, to make breakfast, to do his homework, and so much more.  "}, {"id": "087483340X", "genre": "Children's Books", "title": "1: Twenty-Two Splendid Tales to Tell from Around the World (American Storytelling)", "description": "An illustrated collection of traditional tales from Europe, Asia, Africa, and the Americas, with brief notes for storytellers"}, {"id": "B0711PNHQZ", "genre": "Children's Books", "title": "Middle Ages Facts and Trivia for Kids: The English Reading Tree", "description": "Middle Ages Facts and Trivia for Kids The 'For Kids' series has been produced for children of seven and over. It is the perfect answer to move your child away from simple picture books to start enjoying and learning from more challenging reading material.Every book in the series is an exciting story that will boost reading confidence and introduce active and motivating vocabulary.Parental support is necessary to get the best out of the English Reading Tree Series.This is a crossover between picture books and chapter books. There are some images, but it has been written for the child to focus on words and their meaning.All of the books are fast-paced to keep children engaged. There is also a fun quiz that can be played to give you an accurate idea of how much he or she has learned.What people are saying about the English Reading TreeExcellent books that not only improve reading ability but educate: GoodreadsVery well presented and I particularly enjoy the quiz at the end: Post OnlineSimple, easy to read and full of interesting facts. What more can a parent ask? Island EBooksThe English Reading Tree is a series of Children’s books that have been written to educate and entertain. "}]