[{"id": "0606379266", "genre": "Children's Books", "title": "Big Hero 6, Volume 2 (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Hiro teams up with Baymax to resolve the mysterious disappearance of his brother and role model, Tadashi. Whith four reliable friends and an upgraded Baymax by his side, Hiro finally confronts the masked man, the one who holds the key to the truth! Spurred by his desire for revenge, Hiro corners the masked man, but then things go wrong with Baymax."}, {"id": "B00SG65EOM", "genre": "Children's Books", "title": "#2 Help! My Brother's a Zombie (The Nightmare Club)", "description": "The Nightmare Club is not for just ANYBODY. Only the spookiest, scariest stories get told at Annie's Halloween sleepovers―and if you can't take it, well, tough! Jack's older brother Stephen has always been a great friend...until he started to change. First it was his smell. Then his face. Then his diet. Stephen's just going through the usual changes that come with being a teenager... Or is he?"}, {"id": "082343964X", "genre": "Children's Books", "title": "Galaxies, Galaxies!", "description": "Planet Earth is in the Milky Way Galaxy, the cloudy band of light that stretches clear across the night sky. How many galaxies are there in the universe? For years astronomers thought that the Milky Way was the universe. Now we know that there are billions of them. Gail Gibbons takes the reader on a journey light-years away."}, {"id": "0316154040", "genre": "Children's Books", "title": "Bunny's Easter Basket (Alex Toys)", "description": "Join Bunny and her friends at the Easter Egg Hunt! Along the way, you'll punch-out the 5 colorful foil Easter eggs, then decorate them with the 100 stickers. There's even a build-your-own Easter basket to store all the eggs you've collected. This adorable basket-shaped board book is sure to delight young readers, and is perfect for tucking into Easter baskets. Let the Easter Egg Hunt begin!"}, {"id": "1481467514", "genre": "Children's Books", "title": "Daniel Learns to Share (Daniel Tiger's Neighborhood)", "description": "Daniel and Prince Wednesday learn to share their toys in this Pre-level 1 Ready-to-Read story based on a popular episode of Daniel Tiger’s Neighborhood!Daniel and his friends are all playing with their toy cars. But Prince Wednesday has forgotten to bring his car. He asks Daniel if he can play with Daniel’s car for a little while. Daniel hesitates—he wants to play with his car! But Dad Tiger suggests that they can share. Prince Wednesday can take a turn playing with the car, and then he’ll give it back. Sharing is caring! But Daniel is still unsure. What should he do? This paperback edition comes with a page of stickers! © 2016 The Fred Rogers Company"}]