[{"id": "B074ZJSS2Y", "genre": "Children's Books", "title": "The Bear (Lighthouse Family Book 8)", "description": "Newbery Medalist Cynthia Rylant brings the peaceful sounds, sights, and characters of the coast vividly to life in the eighth book of the Lighthouse Family series, in which the family meets a bear who has just woken up from hibernation!After a long winter cooped up in the lighthouse, Whistler and Lila are excited to go outside and explore. In the forest, they see some frosty vapor rising from a hole in the roots of a tree. They investigate and discover that it is a hibernating bear. The mouse children wait patiently for the bear to wake up and when he does, they invite him for breakfast at the lighthouse. But their new friend might not be quite done hibernating…"}, {"id": "0525478604", "genre": "Children's Books", "title": "2030: A Day in the Life of Tomorrow's Kids", "description": "Winner of the 2012 Grand Canyon Reader Award for a Non-fiction bookGlobal events and new technology change how we live from moment to moment. So, what will our world be like in twenty years? Come take a look as futurists Amy Zuckerman and James Daly examine what a kid?s daily life might be like in the year 2030. Inspired and informed by trends and scientifi c and technological research, 2030 is not only a peek at some cool future gadgets (talking dog collars, cars that drive themselves), but also a thoughtful examination of how our lives might be impacted as we adjust to environmental change."}, {"id": "B00FPRHNVC", "genre": "Children's Books", "title": "Stories of the Pilgrims (Illustrated)", "description": "A beautiful retelling of the lives of the pilgrims, their existence in England and Holland and their subsequent journey across the Atlantic ocean to the new land. Heavily illustrated to enhance the reading experience."}, {"id": "1846868009", "genre": "Children's Books", "title": "Adventures of Achilles (Advanced Readers: Classics)", "description": "Achilles is the son of a king and a goddess and also the best warrior in Greece. So when Prince Paris claims Helen from a Greek king and Troy declares war, everyone knows that Achilles will be vital to the Greek cause. With the help of the gods, can young Achilles lead his fellow countrymen to victory against the Trojans?"}, {"id": "1429694742", "genre": "Children's Books", "title": "The Aztec Empire: An Interactive History Adventure (You Choose: Historical Eras)", "description": "Delve into fascinating time periods! This series allows readers to explore different times and places in history from different perspectives. The narrative format, suspenseful action, and path navigation keep readers reading!"}]