[{"id": "0763635634", "genre": "Children's Books", "title": "Papa's Latkes", "description": "\"A stirring, tender portrait of beloved children and a father helping them celebrate their mother’s memory.\" — BOOKLISTFor Selma and her little sister, this is their first Chanukah without Mama. When Papa comes home carrying all the ingredients for latkes, Selma is worried. Can they make the latkes without Mama? In Michelle Edwards’s poignant story, warmly illustrated by Stacey Schuett, Selma comes to realize that while Chanukah — and especially latkes — will never be the same without Mama, Selma can still celebrate, and will always remember.- A Bank Street College Best Children’s Book of the Year- An Association of Jewish Librarians Notable Children’s Book of Jewish Content- A Cooperative Children’s Book Center Choice- A Sydney Taylor Notable Children’s Book"}, {"id": "1545131589", "genre": "Children's Books", "title": "Pirate Cove: 150 page lined notebook", "description": "150 page lined notebook. Great for keeping all your important information or memories. Wild Pages Press are publishers of unique journals and notebooks, reasonably priced so they can be enjoyed by everyone."}, {"id": "0439136369", "genre": "Children's Books", "title": "Harry Potter and the Prisoner of Azkaban", "description": "For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort.Now he has escaped, leaving only two clues as to where he might be headed: Harry Potter's defeat of You-Know-Who was Black's downfall as well. And the Azkban guards heard Black muttering in his sleep, \"He's at Hogwarts...he's at Hogwarts.\"Harry Potter isn't safe, not even within the walls of his magical school, surrounded by his friends. Because on top of it all, there may well be a traitor in their midst."}, {"id": "0794518710", "genre": "Children's Books", "title": "The Adventures of King Arthur (Usborne Young Reading: Series Two)", "description": "Retells the story of how Arthur became king by pulling a sword from a stone; how he gained his magic sword, Excalibur; and other tales of Arthur, Guinevere, Morgan le Fay, and the Knights of the Round Table."}, {"id": "B00C4YIG4W", "genre": "Children's Books", "title": "Who is Henry VIII - A Very Short Book For Children (Who is? 4)", "description": "Who is Henry VIII? Is a fantastic short book aimed at children between the ages of 5 and 9. It is part of the popular \"Who is?\" series of books. Henry VIII is THE most famous king ever to sit on the throne of England. He ruled England for 38 years and married six, poor women. One wife died, two were divorced and two were beheaded! Only one escaped...when Henry died!This book will tell you all about:This early lifeHow he became KingCatherine of AragonThe King's Great MatterAnne BoleynJane SeymourAnne of ClevesCatherine HowardCatherine ParrHenry's AdvisorsSports and Having FunHenry's DeathDON'T LOSE YOUR HEAD, MAKE SURE YOU READ THIS BOOK! It is a short book that is written for YOUNG children about the age of 5 to 9!"}]