[{"id": "0062366939", "genre": "Children's Books", "title": "The Incorrigible Children of Ashton Place: Book I: The Mysterious Howling", "description": "The first book in the Incorrigible Children of Ashton Place—the acclaimed and hilarious Victorian mystery series by Maryrose Wood, perfect for fans of Lemony Snicket and Trenton Lee Stewart—has a brand-new look.Discovered in the forest of Ashton Place, the Incorrigibles are no ordinary children. Luckily, Miss Penelope Lumley is no ordinary governess. A recent graduate of the Swanburne Academy for Poor Bright Females, Penelope embraces the challenge of her new position. Though she is eager to instruct the children in Latin verbs and the proper use of globes, first she must eliminate their canine tendencies.But mysteries abound at Ashton Place: Who are these three wild creatures? Why does Old Timothy, the coachman, lurk around every corner? Will Penelope be able to civilize the Incorrigibles in time for Lady Constance's holiday ball? And what on earth is a schottische?"}, {"id": "1860390757", "genre": "Children's Books", "title": "Amy And The Weather Wizard (Orchard Readalones)", "description": "Wiz the Wizard, Amy, and Amy''s dog, put the cloud factory into production to come to the rescue of the d rought-ridden animals in Africa '"}, {"id": "0872266923", "genre": "Children's Books", "title": "The Atlas of the Renaissance World", "description": "This new title covers almost three hundred years of European history, beginning with the city-states of Italy in the 14th century through Galileo and Shakespeare in the early 17th century. This essential research tool not only provides a historical overview of the era’s main events, it explores daily life, the roles of trade, development, art, music, and literature. Organized by region, the engaging and enlightening full-color reproductions and maps make this volume perfect for students seeking more geographical and historical information about the time of the Renaissance in Europe and will be a valuable tool for research. Supplements school curriculum in social studies, history, geography, and art."}, {"id": "B072STNXT8", "genre": "Children's Books", "title": "Mission Python: A Galactic Programming Adventure", "description": "Program a graphical adventure game in this hands-on, beginner-friendly introduction to coding in the Python language.Launch into coding with Mission: Python, a space-themed guide to building a complete computer game in Python. You'll learn programming fundamentals like loops, strings, and lists as you build Escape!, an exciting game with a map to explore, items to collect, and tricky logic puzzles to solve. As you work through the book, you'll build exercises and mini-projects, like making a spacewalk simulator and creating an astronaut's safety checklist that will put your new Python skills to the test. You'll learn how to use Pygame Zero, a free resource that lets you add graphics and sound effects to your creations, and you'll get useful game-making tips, such as how to design fun puzzles and intriguing maps. Before you know it, you'll have a working, awesome game to stump your friends with (and some nifty coding skills, too!). You can follow this book using a Raspberry Pi or a Microsoft Windows PC, and the 3D graphics and sound effects you need are provided as a download."}, {"id": "B018846D3M", "genre": "Children's Books", "title": "Batman: Li'l Gotham (Collections) (2 Book Series)", "description": "Batman, Robin, and all your favorite Gothamites romp through the year in a very special series! This festive series is the brainchild of artist/writer Dustin Nguyen and co-writer Derek Fridolfs, and showcases Dustin's stunning water-color art to illustrate a story set against a holiday each month."}]