[{"id": "1405089431", "genre": "Children's Books", "title": "Toddle Waddle", "description": "Follow-my-leader has never been so much fun! There's a hullabaloo at the seaside when a toddler takes his friends on a stroll to the end of the pier. Hurry scurry, flip flop, toddle waddle. With jaunty rhymes and bright, bold pictures, even the youngest child will love this simple, playful story."}, {"id": "1974238253", "genre": "Children's Books", "title": "Composition Notebook", "description": "Composition Notebooks For The Back To School is Cool KidsWhether it is the start of the school year or half way through it these school journals are great gifts for boys and girls, students of any age and teachers.Filled with ruled paper this school workbook is a must have for every student whether they are Grade 1, 2, 3, or even 6. It is 8.5 x 11, with 120 pages offering ample room for school homework and notes.These back to school journals work great for:Back to School Memory BookBack to School Supplies & EssentialsSchool Year Keepsake BookSchool Record & PlannerHomeschooling School SuppliesComposition Books & HomeworkTeachers Gifts & Stocking StuffersBirthday Gifts for KidsAnd much more…..Scroll up and grab a cool and unique school notebook for kids today!"}, {"id": "0545658527", "genre": "Children's Books", "title": "I Survived the Eruption of Mount St. Helens, 1980 (I Survived #14)", "description": "Eleven-year-old Jessie Marlowe has grown up with the beautiful Mount St. Helens always in the background. She's hiked its winding trails, dived into its cold lakes, and fished for trout in its streams. Just looking at Mount St. Helens out her window made Jess feel calm, like it was watching over her somehow. Of course, she knew the mountain was a volcano...but not the active kind, not a volcano that could destroy and kill!Then Mount St. Helens explodes with unimaginable fury. Jess suddenly finds herself in the middle of the deadliest and most destructive volcanic event in U.S. history. Ash and rock are spewing everywhere. Can Jess escape in time?The newest book in the I Survived series will take readers into one of the most environmentally devastating events in recent U.S. history."}, {"id": "146543805X", "genre": "Children's Books", "title": "Cars, Trains, Ships, and Planes", "description": "Get kids revved up and ready to read.Cars, Trains, Ships & Planes is a visual encyclopedia of every vehicle to zoom, sail, soar, float, or fly across the land, sea, and sky. Displaying more than 1,000 vehicles including classic cars, hybrids, race cars, sail boats, luxury cruise ships, BMX and dirt bikes, military tanks, steam locomotives, mountain trains, hot air balloons, fighter jets, International Space Station manned spacecraft and more, plus a glossary and index, this visual catalog is perfect for young transportation buffs. In addition to the eye-catching images for readers to spot and explore, exciting text covers facts and figures on record breakers and news makers and includes the story of the history of transportation — from the first wheel to the latest hybrids — giving this book a special appeal to reluctant readers.Cars, Trains, Ships & Planes is the fastest route to take young readers on a journey to learn about all things that go."}, {"id": "1572436433", "genre": "Children's Books", "title": "Raven: A Star from the Start", "description": "Describes the life, career, and interests of the young actress and singer who was a regular on \"The Cosby Show\" at three, made her first album at five, has appeared in several films, and stars in the television show \"That's So Raven.\""}]