[{"id": "1613747969", "genre": "Science Fiction & Fantasy", "title": "Afrofuturism: The World of Black Sci-Fi and Fantasy Culture", "description": "Comprising elements of the avant-garde, science fiction, cutting-edge hip-hop, black comix, and graphic novels, Afrofuturism spans both underground and mainstream pop culture. With a twofold aim to entertain and enlighten, Afrofuturists strive to break down racial, ethnic, and all social limitations to empower and free individuals to be themselves. This book introduces readers to the burgeoning artists creating Afrofuturist works, the history of innovators in the past, and the wide range of subjects they explore. From the sci-fi literature of Samuel Delaney, Octavia Butler, and NK Jemison to the musical cosmos of Sun Ra, George Clinton, and the Black Eye Peas Will.i.am, who debuted \"Reach for the Stars\" on Mars, to the visual and multimedia artists inspired by African Dogon myths and Egyptian deities. Topics range from the \"alien\" experience of blacks in America to the \"wake up\" cry peppering sci-fi literature, sermons, and activism. Interviews with rappers, composers, musicians, singers, authors, comic illustrators, painters, and DJs, as well as Afrofuturist professors, will provide a firsthand look at this fascinating movement. Ytasha L. Womack is a filmmaker, futurist and the author of Post Black: How a New Generation is Redefining African American Identity and the coeditor of Beats Rhymes and Life: What We Love and Hate About Hip Hop. She is also the creator of the Rayla 2212 sci fi/multimedia series and author of 2212: Book of Rayla. She lives in Chicago."}, {"id": "B00I251RK2", "genre": "Science Fiction & Fantasy", "title": "Scorched: A Leila Marx World Novella (The Leila Marx Novels)", "description": "Everyone has their demons. Before Conner Hoffman began his new life free of collecting souls for his demon father, he spent centuries fighting against his true nature. As a cambion with a conscience, guilt plagued his mind, while the sweet taste of souls satisfied more than just his incubus cravings. A chance encounter with a beautiful harpy leads Conner down a road to his inevitable fate. Hunted for his unique heritage, he’s forced to embrace his demon side in order to defeat those determined to see him destroyed. With friends masquerading as enemies, trusting his instincts may mean sacrificing part of his humanity.And that’s the very last thing Conner Hoffman wants to do."}, {"id": "B008RDPNTU", "genre": "Science Fiction & Fantasy", "title": "The Journey (Guardians, #1)", "description": "Following his involvement in a car accident, Daniel Graham wakes up in the land of Eden. He barely manages to crawl out from the wreckage, before he is ruthlessly hunted down by a dragon and its blood-thirsty rider. He is rescued by the Guardians of Lost Souls, a group of knights that were sent there to protect him. Now, they must journey together to the ruins of an ancient city, in search of the magical gateway that would take him back home."}, {"id": "0265603307", "genre": "Science Fiction & Fantasy", "title": "Le Morte Darthur, Vol. 2: The History of King Arthur and of His Noble Knights of the Round Table (Classic Reprint)", "description": "Excerpt from Le Morte Darthur, Vol. 2: The History of King Arthur and of His Noble Knights of the Round Table Arthur again, that horse and man fell to the earth. And there was King Arthur wounded on the left side, a great wound and a perilous. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works."}, {"id": "B0718Y8N4J", "genre": "Science Fiction & Fantasy", "title": "Madame Zero: 9 Stories", "description": "From one of the most accomplished British writers working today, the Man Booker Prize short-listed author of The Wolf Border, comes a unique and arresting collection of short fiction that is both disturbing and dazzling. Sarah Hall has been hailed as \"one of the most significant and exciting of Britain's young novelists\" (The Guardian), a writer whose \"intelligence and ambition are thrilling to behold\" (BookForum). Her work has been acclaimed as \"amazing...terrific and original\" (Washington Post). In this collection of nine works of short fiction, she uses her piercing insight to plumb the depth of the female experience and the human soul. A husband's wife transforms into a vulpine in \"Mrs. Fox\", winner of the BBC Short Story Prize. In \"Case Study 2\", a social worker struggles with a foster child raised in a commune. A new mother runs into an old lover in \"Luxury Hour\". In incandescent prose full of rich observations and striking clarity, Hall has composed nine wholly original pieces - works of fiction that will resonate long after the final word is heard. "}]