[{"id": "B0739TRC2S", "genre": "Children's Books", "title": "Do All Birds Fly? Animal Book for Children | Children's Animal Books", "description": "Unlike land animals, birds have hollow skeletons that’s why they can fly to the sky. But there are large birds who are too heavy to fly like the ostrich and the penguins. So why are birds called birds? What makes them fly other than their hollow bones? Encourage your child to discover the answers by going over the pages of this book today!"}, {"id": "0142417424", "genre": "Children's Books", "title": "The Missing Golden Ticket and Other Splendiferous Secrets", "description": "Secrets and surprises from Roald Dahl!Feast your eyes on a secret! Between these covers is a long-lost chapter—and the original ending—from Charlie and the Chocolate Factory and other delicious never-before-seen tidbits from Mr. Wonka's factory. Then slip into some tasty tales from Roald Dahl's life to discover more about the world's No. 1 storyteller. No Roald Dahl collection is complete without this splendiferous treat!"}, {"id": "0439049989", "genre": "Children's Books", "title": "Captain Underpants and the Perilous Plot of Professor Poopypants", "description": "The fourth book in Dav Pilkey's mega-bestselling Captain Underpants series. Now with super-cool foil covers! Shiny! Fun!George and Harold aren't bad kids. They just like to \"liven things up\" for everybody. Unfortunately, their thoughtful jokes sometimes get them into a LOT of trouble. And when Professor Pippy P. Poopypants becomes their new science teacher...well, George and Harold almost cause the entire planet to be taken over by a maniacal, mad-scientist guy in a giant robot suit! Who will stop the perilous plot of Poopypants?!!? This looks like a job for Captain Underpants!"}, {"id": "0805037535", "genre": "Children's Books", "title": "Building an Igloo", "description": "\"This book has simple power and great child appeal.... Photos and text work together beautifully to capture the essence of the story: the father and son are at peace with their environment, have come to know its beauty, and will pass on their knowledge from one generation of Inuit to the next.\" --Booklist"}, {"id": "0375852182", "genre": "Children's Books", "title": "Here Comes the Garbage Barge!", "description": "This New York Times Best Illustrated Book is a mostly true and completely stinky story that is sure to make you say, “Pee-yew!” Teaching environmental awareness has become a national priority, and this hilarious book (subtly) drives home the message that we can’t produce unlimited trash without consequences.Before everyone recycled . . .   There was a town that had 3,168 tons of garbage and nowhere to put it.    What did they do?   Enter the Garbage Barge! Amazing art built out of junk, toys, and found objects by Red Nose Studio makes this the perfect book for Earth Day or any day, and photos on the back side of the jacket show how the art was created.   Here Comes the Garbage Barge was a New York Times Best Illustrated book of 2010, a Huffington Post Best Picture Book of the Year, and a School Library Journal Best Book of the Year. The Washington Post said, “Cautionary? Yes. Hilarious? You betcha!” and the New York Times Book Review raved, “[A] glorious visual treat.”"}]