[{"id": "1683272765", "genre": "Children's Books", "title": "1,2,3...Dots! A Connect the Dot Book", "description": "Let’s play connect the dot today! This is a cool activity book that will boost your child’s number and counting skills. But the most important benefit to playing this game is that fact that it can be instrumental in teaching your child to follow instructions. You see, your child cannot just connect any dot. He/she should follow a specific order all throughout. Get a copy now!"}, {"id": "0688133312", "genre": "Children's Books", "title": "Why the Sun & Moon Live in the Sky", "description": "There was once a time when Sun and Moon lived on the earth--but that was before the rapturous Sun invited the never-ending Sea to visit in this playful version of an eastern Nigerian (Ibibio) creation myth. \"This delightful story is outfitted in humor, a mock seriousness, and drama....A wondrous and alluring work.\"--Kirkus Reviews."}, {"id": "0860375390", "genre": "Children's Books", "title": "Mosques of the World Activity Book (Discover Islam Sticker Activity Books)", "description": "Travel around the world's mosques with this fun sticker activity book. It features dot-to-dot drawings, coloring fun, puzzles, to solve and over sixty stickers to stick.This book introduces children to the different styles of mosques from Saudi Arabia, Palestine, Malaysia, Mali, Morocco, China, and more."}, {"id": "1631775960", "genre": "Children's Books", "title": "Mat with Only One T", "description": "\"Give with a smile and give from your heart, and your gift will keep giving even when you're apart.\" Mat dearly loves his grandpa who teaches him early on to give from the heart. When the time comes to put that lesson into practice, Mat discovers what it really means."}, {"id": "1545357390", "genre": "Children's Books", "title": "Books for Kids: 5 Minute Bedtime Stories For Kids: Preschool Books, Ages 3-5, Baby books, Kids book, Early learning, Beginner readers", "description": "Best Bedtime Stories For Kids: In Search of a Baby The White Stone Canoe Rabbit’s Eyes The Great White Bear and the Trolls The Baba Yaga The Jackal and the Alligator The Golden Nugget A Christmas Star Snow White and Rose Red Sunshine Stories Little Tuk Rumpelstiltskin Rapunzel The Selfish Giant Puss in Boots"}]