[{"id": "1434318354", "genre": "Science Fiction & Fantasy", "title": "A Dragon's Tear: The Dark Ages of Luneccia", "description": "Life is simple and easy going for the young town guard Zythe. She and her two friends live with three square meals and a solid amount of work. Until one day Zythe meets with a mysterious cloaked figure who grants her a new sword...a sword that will start Zythe down the path of destiny. Zythe is left to find herself in a world of lies and deciet....Luneccia rests upon the shoulders of a young girl following a shadowed path."}, {"id": "1451545762", "genre": "Science Fiction & Fantasy", "title": "1,2,3 Squeeze II: Forever", "description": "A young boy's curiosity about nature brought him face to face with Big Brother as he grew older. This interest in nature led the young scientist to discovering too much making him a target of Big Brother. Determined to uncover the identity of Big Brother after being drugged by mind control experts the young scientist continues his efforts to unmask Big Brother's accomplices who are trying to rob everyone of their individuality to create a world of slaves to do the bidding of Big Brother. This book is a continuation of the authors first sci-fi book '1,2,3 SQUEEZE: 1984 REVISITED'. The scientist refutes claims that George Orwell's prediction of the future never took place and claims that Big Brother used George Orwell's book '1984' as a blueprint for world domination"}, {"id": "0786960396", "genre": "Science Fiction & Fantasy", "title": "Castle Grimstead - Dungeon Tiles: A Dungeons & Dragons Accessory", "description": "This roleplaying game accessory gives Dungeon Masters an easy and inexpensive way to include great-looking terrain in their games. This set provides ready-to-use, configurable tiles with which to build exciting encounter locations. This particular set emphasizes castles and fortifications.This accessory contains six double-sided sheets of illustrated, die-cut terrain tiles printed on heavy card stock. These tiles are appropriate for any D&D setting and usable with any edition of the DUNGEONS & DRAGONS Roleplaying Game."}, {"id": "B019DEBBAG", "genre": "Science Fiction & Fantasy", "title": "Blind Faith (Shattered Lives, Book Four)", "description": "There is no true faith until one follows blindly.Henry and Elaina Daniels continue to build their relationship, but everything comes crashing down around what stability they have established. Even with the birth of their baby and a journey back north, Henry tumbles further into his sickness.Gunther Erikkson spends so much time trying to save face, he loses himself in the process.  He allows his carnal desires and needs to take over, making a mistake that will change his life forever. Deep down, he feels like he is failing his son, hiding his pain until confronted once again.Will Gunther learn to live again, finding it in himself to move forward and be the man Quinn taught him to be?Affected by the chaos across the seas, Erik Carlson, the head scientist in the program, gathers a team and develops a plan to bring Henry back to the facility. However, the cure he’s offering comes with great consequences. With only one chance at survival, Henry must decide whether to make the ultimate sacrifice, hoping to kill his demons once and for all.Will Henry accept Erik’s offer, risking death in order to save himself and his relationship?"}, {"id": "0738856959", "genre": "Science Fiction & Fantasy", "title": "Eternity's Hope", "description": "The story opens with Prince Nirron, successor to the crown, mourning the great loss of his father, Stalaran's King. Through a magical messenger of his own, Nirron sends the white dove to his brother James in Camelot, requesting relief from the monstrous Dark Army who are bringing unbearable suffering to the people of Stalaran. Meanwhile, Camelot is rising with renewed strength. Then the dove arrives from Stalaran to whisper her message to James. Unable to control his grief and wait for the support of his fellow Knights, James heads to Stalaran first, to fight beside Nirron and defend his homeland. Although James has been warned he would face unparallel evil on the road to Stalaran, he will not be left to face it alone. Not only does he meet the beautiful Saraina who was sent by the Ancient One to protect him, but King Stefan and his Knights are also quick on his heels."}]