[{"id": "1558585923", "genre": "Children's Books", "title": "King Bobble (Easy-To-Read Books)", "description": "Plump, fun-loving, and not very bright King Bobble and his queen cavort through life wearing wheels instead of crowns."}, {"id": "1250154987", "genre": "Children's Books", "title": "A Stitch in Time", "description": "An orphan grapples with her unpleasant aunt and the even more unpleasant idea of moving to Boston in this poignant middle-grade debut that handles loss and renewal.\"Heartbreaking and heartwarming at the same time, Donut’s story is gritty, hopeful and ultimately all about the various ways that love shows up. I loved it.”--Kathi Appelt, author of the Newbery Honor and Nation Book Award finalist novel The Underneath Donut is an eleven-year old geography buff who keeps her taxidermied mice hidden in her late mother’s hope chest. Her pops passed away, leaving her an orphan. Aunt Agnes has moved in, bringing along her lumpy oatmeal, knitting, and a plan to drag Donut off to Boston forever. Donut stands to lose everything: her friends, her village, her home, the woods, and walks where the memories of her pops are stored up. While Donut dodges the ache of missing her pops, she and her best friend Tiny plan how to keep her where she belongs. A Stitch in Time by Daphne Kalmar is shot through with gorgeous, evocative language, and gets right to Donut’s heart."}, {"id": "0998642657", "genre": "Children's Books", "title": "Kulipari: Poison Power! Ponto and Coorah", "description": "The tadpoles of Nova Australis are sick and it is up to Ponto and Coorah to help them. Journeying deep into the outback in search of a rare flower, they must work together to heal the village. But, far from home, they soon find a new problem as a pack of Tazmanian Devils begin following them!"}, {"id": "1426317115", "genre": "Children's Books", "title": "Try This!: 50 Fun Experiments for the Mad Scientist in You", "description": "Discover what makes science fun in this engaging book, filled with weird, wacky science facts, basic principles, and 50 creative science projects that take interactivity to a whole new level. Dynamic photos and art highlight projects step by step so kids can conduct experiments with confidence and accuracy. Most projects involve kid-friendly subjects like electrical charges, chemical explosions, and food chemistry and are based on materials easily found at home. Bonus projects throughout encourage curious kids to dig deeper and experiment on their own."}, {"id": "1519403496", "genre": "Children's Books", "title": "The Seven Days of Creation: Based on Biblical Texts", "description": "The Seven Days of Creation is the first  MazorBooks picture book for young  children based on biblical texts.      This picture book recounts, in easy to understand rhymes accompanied by colorful images, the order of creation as it is described in the first chapter of the book of Genesis: From God's creation of light on day one to the creation of Adam and Eve on day six, to the day of rest. The Sabbath."}]