[{"id": "0399587799", "genre": "Science Fiction & Fantasy", "title": "Blackwing (Raven's Mark)", "description": "“A remarkably assured fantasy debut that mixes of the inventiveness of China Miéville with the fast paced heroics of David Gemmell.”—Anthony Ryan, New York Times bestselling author of The Legion of FlameSet on a postapocalyptic frontier, Blackwing is a gritty fantasy debut about a man’s desperate battle to survive his own dark destiny... Hope, reason, humanity: the Misery breaks them all.   Under its cracked and wailing sky, the Misery is a vast and blighted expanse, the arcane remnant of a devastating war with the immortals known as the Deep Kings. The war ended nearly a century ago, and the enemy is kept at bay only by the existence of the Engine, a terrible weapon that protects the Misery’s border. Across the corrupted no-man’s-land teeming with twisted magic and malevolent wraiths, the Deep Kings and their armies bide their time. Watching. Waiting.   Bounty hunter Ryhalt Galharrow has breathed Misery dust for twenty bitter years. When he’s ordered to locate a masked noblewoman at a frontier outpost, he finds himself caught in the middle of an attack by the Deep Kings, one that signifies they may no longer fear the Engine. Only a formidable show of power from the very woman he is seeking, Lady Ezabeth Tanza, repels the assault.   Ezabeth is a shadow from Galharrow’s grim past, and together they stumble onto a web of conspiracy that threatens to end the fragile peace the Engine has provided. Galharrow is not ready for the truth about the blood he’s spilled or the gods he’s supposed to serve…"}, {"id": "0747573603", "genre": "Science Fiction & Fantasy", "title": "Harry Potter and the Philosopher's Stone", "description": "When a letter arrives for unhappy but ordinary Harry Potter, a decade-old secret is revealed to him that apparently he's the last to know. His parents were wizards, killed by a Dark Lord's curse when Harry was just a baby, and which he somehow survived. Escaping his hideous Muggle guardians for Hogwarts, a wizarding school brimming with ghosts and enchantments, Harry stumbles upon a sinister adventure when he finds a three-headed dog guarding a room on the third floor. Then he hears of a missing stone with astonishing powers which could be valuable, dangerous, or both."}, {"id": "0820416703", "genre": "Science Fiction & Fantasy", "title": "Science Fiction and Postmodern Fiction: A Genre Study (American University Studies)", "description": "In the years after 1950 a new generation of authors began to expand the thematic scope of Science Fiction, while also extending its narrative conventions by introducing ideas from modern psychology and surrealism. Science Fiction shares the new themes - the quest of identity, the relativity of time and consciousness, the overlapping of illusion and reality - with works of modern and especially postmodern fiction. On the other hand, the innovative postmodern fiction of Pynchon, Borges, Vonnegut, and William Burroughs incorporates Science Fiction motifs, thereby blending the two genres. This book, in a series of juxtapositions and contrastive literary analyses, clarifies and questions existing genre borderlines and breaks new ground in the literary theory of postmodern fiction and of Science Fiction."}, {"id": "B077PW8CBB", "genre": "Science Fiction & Fantasy", "title": "Around the World in Eighty Days", "description": "Having assured the members of London's exclusive Reform Club that he will circumnavigate the world in 80 days, Fogg - stiff, repressed, English - starts by joining forces with an irrepressible Frenchman, Passepartout, and then with a ravishing Indian beauty, Aouda. Together they slice through jungles, over snowbound passes, even across an entire isthmus - only to get back five minutes late. Fogg faces despair and suicide, but Aouda makes a new man of him, able to face even the Reform Club again.Around the World in Eighty Days (1872) contains a strong dose of post-Romantic reality plus extensive borrowing from the author's own Journey to England and Scotland - but not a shred of science fiction. Its modernism lies instead in the experimental literary technique, with parallel plots, a narrator constantly made to look foolish, four characters in search of their own unconscious, and a unique twisting of space and time."}, {"id": "1941157033", "genre": "Science Fiction & Fantasy", "title": "Short Fuse", "description": "Overweight and over-the-hill, Jason Miller was on the road to nowhere. With a minimum wage job and only Jason's cat, Leo, for companionship, bad goes to worse when Jason rear-ends a police car containing one very angry cop. Car totaled and about to receive a ticket that will cost a month's salary, Jason gets a lucky break when a brightly lit Christmas tree suddenly falls out of the sky. At least it looked like a Christmas tree. . . .         Waking up in a strange place, Jason finds his body is now twenty years younger, his cat is more intelligent than most people he knows, and that cop, in his own newly enhanced body, is still very angry. Jason and his companions soon discover they're to be used as expendable conscripts in an interstellar war. With his new body and a new mind, force-fed with advanced knowledge, Jason and the others must escape and elude hostile aliens, win a galactic war, and save some new-found alien allies before they're all blown to bits. The fuse has been lit, and time is running out!"}]