[{"id": "0984193197", "genre": "Children's Books", "title": "California's Missions: from A to Z", "description": "Twenty-six historical and architectural features shared by the famous California missions are detailed in an alphabetic format in this perfect learning tool. Using color photographs, an introductory rhyme, and a factual paragraph, each letter thoroughly covers a mission topic, such as A for arches, B for bells, and C for crosses. Comprehensive and easy to understand, the book is ideal for students, teachers, California history buffs, and mission visitors."}, {"id": "1467745618", "genre": "Children's Books", "title": "From Wood to Baseball Bat (Start to Finish: Sports Gear)", "description": "How does a piece of wood become a brand-new baseball bat? Follow each step in the process from cutting the wood to shipping the bat to a store in this fascinating book!"}, {"id": "1438073399", "genre": "Children's Books", "title": "Duck (Shake & Play Bath Books)", "description": "Bath time is play time for baby with this brightly illustrated floating vinyl book. The book is named for the Duck that appears on the front and back covers, but when toddlers open this book  they’ll see six more colorful creatures on inside pages―every little water-dwelling animal labeled with its name. Duck’s friends include a frog, a dragonfly, a beaver, and three more animals.  And when Baby picks up this book and give it a shake, he’ll hear a cheerful rattle. This is one of four titles that Barron’s offers in the Shake & Play Bath Book series: Duck, Fish, Turtle,  and Whale. Each book comes in a clear vinyl package."}, {"id": "B077XP7PPT", "genre": "Children's Books", "title": "The Adventures of Grumpy Tortuga", "description": "The Adventures of Grumpy Tortuga serves as a reminder for both children and adults that life is more colorful outside of your comfort zone. With a friend by his side, Grumpy Tortuga is able to embrace his fears and test himself in gentle ways. Watch the colors unfold in this adventurous story as the black and white images find color with every turn of the page. Follow his adventures on Facebook and Instagram @grumpytortugaadventures"}, {"id": "0998535028", "genre": "Children's Books", "title": "Zoey's First Plane Ride", "description": "Zoey and her parents are off to visit grandma! Join Zoey as she takes her first plane ride and learns the steps required for traveling through the airport. From check-in to baggage claim, this book will introduce your child to the complete airport experience and make sure that your little ones will know what to expect for their first plane ride."}]