[{"id": "076119326X", "genre": "Children's Books", "title": "Spy on History: Victor Dowd and the World War II Ghost Army", "description": "Your mission: Find Victor Dowd’s missing sketchbook. And discover one of the most unusual stories of World War II. Meet the 603rd Camouflage Engineers, better known as the Ghost Army. This group of artists and sound engineers were trained to deceive the Germans in World War II with everything from fake tanks to loudspeakers broadcasting the sound of marching troops. And meet Victor Dowd, a real-life sergeant who with his fellow Ghost Army troops fought his way from Normandy, through France, and eventually across the Rhine. Second in the Spy on History series, it’s a compelling story of a little-known chapter from the war—and a mystery to solve. Using spycraft materials included in a sealed envelope, readers will discover and unravel the clues embedded in the book’s text and illustrations, and uncover the mystery of Victor Dowd’s missing sketchbook.  "}, {"id": "1743160623", "genre": "Children's Books", "title": "Singenpoo Collection", "description": "Claws, Cliffhangers and Crackpots from the mad mind of Paul Jennings. The Paw Thing Oh Yuck. The mice were running up my trousers. They wriggled under my shirt. They were even inside my underpants. Mice, madness and mayhem. Singenpoo Strikes Again Major Mac pointed straight at me. ‘There he is,’ he growled, ‘There’s the one who stole my cat.’ Mac the two-legged rat is back. And Singenpoo is in trouble. Singenpoo Shoots Through Singenpoo wanted me to follow. She had written a sign the only way she could. What a relief. What a cat. Singenpoo does a disappearing act. And she might not be back … Singenpoo’s Secret Weapon Singenpoo waved his tail. It was a signal. A thousand cats opened fire with the only weapon they had. It’s bare bottoms and bombs from the weird, weird world of Australia’s wackiest author."}, {"id": "0763645052", "genre": "Children's Books", "title": "Mercy Watson Goes for a Ride", "description": "The NEW YORK TIMES best-selling porcine wonder finds herself behind the wheel in this hilarious adventure now available in paperback. (Ages 6 - 8)Mr. and Mrs. Watson's porcine wonder, Mercy, loves nothing more than a ride in the car. It takes a fair amount of nudging and bribing and a \"You are such a good sport, darling\" to get the portly pig out of the driver's seat, but once the convertible is on the road, Mercy loves the feel of the wind tickling her ears and the sun on her snout. One day the Watsons' motoring ritual takes an unexpected turn, however, when their elderly neighbor Baby Lincoln pops up in the backseat in hopes of some \"folly and adventure\" ï¿½ and in the chaos that ensues, an exuberant Mercy ends up behind the wheel! Soon there's a policeman on her tail, a struggle for the brake, and a blissfully airborne Mercy. Of course, it's nothing that an extra helping of buttered toast can't fix!"}, {"id": "1583403728", "genre": "Children's Books", "title": "Hindu Festivals Through the Year (Year of Festivals)", "description": "Introduces the main religious festivals of Hinduism, telling the story behind each festival, describing how it is celebrated around the world, and providing instructions for related activities."}, {"id": "1682806030", "genre": "Children's Books", "title": "Molecules & Elements: Science for Kids | Children's Chemistry Books Edition", "description": "Science can be tough but that doesn't mean it can't be made fun for kids to understand. It all depends on the presentation of the subject. In this case, it's all about the combination of texts, examples and images. Because your child will be asked to answer a lot examples, true understanding will take root. Secure a copy now!"}]