[{"id": "1432953370", "genre": "Children's Books", "title": "Reindeer (A Day in the Life: Polar Animals)", "description": "Explore the polar region, one of the most extreme environments on Earth, by following a reindeer through its day as it eats, sleeps, and cares for its young. Reindeer, by Katie Marsico, introduces readers to the behaviors, traits, and habitat of this fascinating animal with supportive text features including a labeled body map of the reindeer and further resources. With its accessible text and fast facts, this book is sure to captivate young animal lovers!"}, {"id": "0152013407", "genre": "Children's Books", "title": "Desmond the Dog", "description": "A good little dog discovers how to be very bad in this hilarious pop-up book. Toddlers will giggle with delight as they witness Desmond’s unruly behavior in this companion to Charlie the Chicken. But if they think Desmond is naughty, just wait till they meet his mischievous sister!"}, {"id": "0547483937", "genre": "Children's Books", "title": "Fish Girl", "description": "The triple Caldecott winner David Wiesner brings his rich visual imagination and trademark artistry to the graphic novel format in a unique coming-of-age tale that begins underwater. A young mermaid, called Fish Girl, in a boardwalk aquarium has a chance encounter with an ordinary girl. Their growing friendship inspires Fish Girl's longing for freedom, independence, and a life beyond the aquarium tank. Sparkling with humor and brilliantly visualized, Fish Girl's story will resonate with every young person facing the challenges and rewards of growing up."}, {"id": "1338151789", "genre": "Children's Books", "title": "The Night of Courage (Melowy#3)", "description": "The Defense Techniques teacher tests the girls on their survival skills, leaving them in the Forest of Colors overnight. They use a manual she has left them to build shelter and cook dinner. Electra wanders from the group in the night and gets lost, sending the rest of the Melowies on a mission to find her. They split up and use different skills to pass the test. Upon returning to Destino they learn that the missing Melowy was all part of the test of frienship. They all passed with flying colors, even with their rival Melowy Eris trying to foil their plans.  "}, {"id": "B0771W5SRM", "genre": "Children's Books", "title": "Sinking the Sultana: A Civil War Story of Imprisonment, Greed, and a Doomed Journey Home", "description": "The worst maritime disaster in American history wasn’t the Titanic. It was the steamboat Sultana on the Mississippi River — and it was completely preventable.In 1865, the Civil War was winding down and the country was reeling from Lincoln’s assassination. Thousands of Union soldiers, released from Confederate prisoner-of-war camps, were to be transported home on the steamboat Sultana. With a profit to be made, the captain rushed repairs to the ship so the soldiers wouldn’t find transportation elsewhere. More than 2,000 passengers boarded in Vicksburg, Mississippi . . . on a boat with a capacity of 376. The journey was violently interrupted when the ship’s boilers exploded, plunging the Sultana into mayhem; passengers were bombarded with red-hot iron fragments, burned by scalding steam, and flung overboard into the churning Mississippi. Although rescue efforts were launched, the survival rate was dismal — more than 1,500 lives were lost. In a compelling, exhaustively researched account, renowned author Sally M. Walker joins the ranks of historians who have been asking the same question for 150 years: who (or what) was responsible for the Sultana’s disastrous fate?"}]