[{"id": "1974291812", "genre": "Children's Books", "title": "Hello Grade 6: Back To School Composition Notebook Sixth Grade Boys (Journals For Kids To Write In)(8.5 x 11)", "description": "Cute & Cool Composition NotebooksThis awesome school journal for kids has 120 lined pages measuring 8.5 x 11 that people will be jealous of. Stop buying those boring composition books and grab one of these fun and exciting school notebooks.Great gift ideas for teachers and students. Perfect for back to school supplies, birthday gifts and Christmas gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "0618062645", "genre": "Children's Books", "title": "Houghton Mifflin Reading: The Nation's Choice: Theme Paperbacks, Below-Level Grade 5 Theme 4 - Junior Thunder Lord", "description": "Yue, a Chinese merchant, discovers the wisdom in passing along kindness, when Bear Face, the huge hairy man Yue has befriended, saves his life."}, {"id": "B007BOK2QA", "genre": "Children's Books", "title": "Prince Siddhartha: The Story of Buddha", "description": "This is the story of Prince Siddhartha and how he became Buddha, the Awakened One. Lyrical verse and beautiful full-color illustrations depict each major life event in Siddhartha's development. His message of nonviolence, loving-kindness, and unselfishness is vitally necessary for today's--and tomorrow's--children. A story made for the telling--open this tale to a child and shore up the possibility of a bright and loving future!"}, {"id": "0881102490", "genre": "Children's Books", "title": "Usborne Illustrated Guide to Norse Myths and Legends", "description": "Identifies the gods, goddesses, giants, and supernatural beasts of Norse mythology, and recounts the most famous stories about Thor, Loki, Freyja, and Balder"}, {"id": "1562544632", "genre": "Children's Books", "title": "In the Camps: Teens Who Survived the Nazi Concentration Camps (Teen Witnesses to the Holocaust)", "description": "Relates the stories of Jewish teenagers who were sent to Nazi concentration camps where they were separated from their families and survived years of exhausting labor, scarce food, and cruel guards."}]