[{"id": "B076Z1M14F", "genre": "Science Fiction & Fantasy", "title": "Celestial Fire (Celestial Marked Book 2)", "description": "The stakes are higher than ever for Devi Lawson...Former celestial soldier Devi Lawson is now working for the warlocks, but the fragile peace between the celestials and the preternaturally gifted rests on a knife's edge. When a mysterious demonic virus sweeps across the city, turning vampires and celestials alike into bloodthirsty killers, it's up to Devi to work with the enigmatic and dangerous warlock Nikolas to discover the cause before the city is overrun. But with power forces shifting in the demonic realms and the shadows of old enemies pursuing them, it becomes clear that everyone is keeping secrets, none more so than Nikolas himself. To survive and protect those she cares about, Devi must embrace her terrifying new demonic powers, at the risk of losing her soul to the netherworld..."}, {"id": "0099416980", "genre": "Science Fiction & Fantasy", "title": "The Islanders", "description": "A reissue of a classic adventure for young adults. The inhabitants of Halcyon Island are ruled by the laws of the Deliverer and follow the same customs and traditions that have prevailed for hundreds of years. The laws state \"no incomers,\" but when Thomas and Molly find a shipwrecked canoe with a boy and girl, barely alive, they are determined not to reject them outright. The effect that the newcomers have on the close-knit community is beyond anyone's predictions."}, {"id": "1520627785", "genre": "Science Fiction & Fantasy", "title": "Two For the Road (The Adventures of Brendan and Deimos)", "description": "For those new to this author or fans of the Brendan and Deimos short stories, this anthology of thirteen light-hearted Fantasy Action/Adventure stories collects newly edited versions of the nine previously published tales, plus three new stories and the new novella \"Are You Lonesome Tonight\". Inside, the hard-traveling heroes chase a wayward wand, brave a fighting arena, and encounter a mysterious inn where perhaps everyone really does know your name. Also included is a bonus time-traveling tale of Bobbitt Pogue, the world's worst-dressed halfling."}, {"id": "0345498003", "genre": "Science Fiction & Fantasy", "title": "True Colors (Star Wars: Republic Commando, Book 3)", "description": "As the savage Clone Wars rage unchecked, the Republic’s deadliest warriors face the grim truth that the Separatists aren’t their only enemy–or even their worst.In the Grand Army’s desperate fight to crush the Separatists, the secret special ops missions of its elite clone warriors have never been more critical . . . or more dangerous. A growing menace threatens Republic victory, and the members of Omega Squad make a shocking discovery that shakes their very loyalty. As the lines continue to blur between friend and enemy, citizens–from civilians and sergeants to Jedi and generals–find themselves up against a new foe: the doubt in their own hearts and minds. The truth is a fragile, shifting illusion–and only the approaching inferno will reveal both sides in their true colors."}, {"id": "1514369958", "genre": "Science Fiction & Fantasy", "title": "Mystery of the Crimson Gear (Gears & Gunfighters)", "description": "Vikings! Cowboys! Airships! Welcome to the Gears & Gunfighters universe, where Gearsmen can defy death and Steamhorses gallop across the frontier! Destruction behind them and pursued by all sides- can Lucas Steele and Calamity Sinclair discover the sinister plot of the Union's enemy before the gears come to a stop? From the ruins of Roulement Ridge to the secluded isle in the far west, Lucas and Calamity make their way through the hardships of the Union and the Sworn Territories as they try to stay ahead of their past and uncover the secrets of the Crimson Gear! Follow your favorite outlaws as they race full steam ahead against the clock to defeat a madman's plot!"}]