[{"id": "B01LYTYNUD", "genre": "Children's Books", "title": "FISHIE, FISHIE - for Babies & Toddlers", "description": "Babies & Toddlers delight in this beautiful, full color book FOR babies & toddlers, NOT about them.  Download to your electrical device and entertain your child every time you have to wait. As a bonus, there is a link inside to another ebook in this series: \"BIG, Little.\""}, {"id": "B00KP05WWQ", "genre": "Children's Books", "title": "Twenty-Four Paul Klee's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Paul Klee's Paintings. Twenty-Four Paul Klee's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "0431137196", "genre": "Children's Books", "title": "My World of Science: Colour Paperback", "description": "This new series introduces the reader to scientific ideas by way of everyday situations and objects that they can recognise in the world around them. Covering a range of basic science topics required by the science curriculum, these books will be a valuable reference resource. The series: - supports the QCA KS1 schemes of work - introduces age-appropriate terminology - presents scientific concepts in a straightforward and logical way - provides activities and questions to encourage the reader to think about the concepts raised"}, {"id": "B01D8ZL6FG", "genre": "Children's Books", "title": "Where Did My Sweet Grandma Go?: A Preschooler's Guide to Losing a Loved One", "description": "“Grandma’s in our hearts, you see.”'Where Did My Sweet Grandma Go?: A Preschooler’s Guide to Losing a Loved One' gently leads little ones and their parents into meaningful conversations about death, grief, and eternal love. This beautiful picture book is filled with watercolor paintings by author Lauren Flake, as well as original artwork by the author's late mother, Dixie Benton Stucky, whom she lost to early onset Alzheimer's disease in 2013, while Lauren was pregnant with her youngest daughter.Questions, activities, Bible passages and resources in the included Parents' Guide reinforce the book’s comforting message of legacy and hope. 'Where Did My Sweet Grandma Go?' is a Mom’s Choice Awards® Gold Recipient and a 2017 Next Generation Indie Book Awards Finalist."}, {"id": "0984497226", "genre": "Children's Books", "title": "Eli's Winter Day", "description": "Eli's Winter Day shows a young boy experiencing winter for the first time, all senses engaged. He helps his grandpa feed the birds, plays in the snow with his family, and warms up with hot chocolate before ending the day with an evening walk by the river."}]