[{"id": "B07744T2YY", "genre": "Science Fiction & Fantasy", "title": "Tyche's Deceit (Tyche's Journey Book 2)", "description": "The enemy is already here.After the encounter with the merciless Ezeroc on Absalom Delta, Grace Gushiken and Nathan Chevell make a run for home. They have a new mission: to warn humanity. Aliens are real. And they are already among us.The crew of the free trader Tyche are hunted by men in black, fearsome fighters who share the Ezeroc’s powers. When the Tyche lands on Earth the ship’s placed on lockdown. Her crew are scattered and on the run. Without their ship or friends, Grace and Nate have no escape.The Republic and its military have been corrupted to the core by the Ezeroc. Humanity’s homeworld is at risk. As hope dwindles, Grace and Nate receive an offer they can’t refuse from an unlikely source. The abhorrent espers of the Old Empire might be their only chance to save humanity. Their devil’s bargain: join us, or die.Out of time and running low on luck, Grace and Nate must gather their scattered crew. Five souls and an old heavy lifter against the might of the Republic and its alien overlords. Will the crew of the Tyche find allies in humanity’s struggle for survival? Or are we doomed to be food for the insects?Tyche’s Deceit is the second book in Richard Parry’s gripping Tyche’s Journey trilogy. If you like page-turning space opera with great dialogue and heart-pumping action, get your copy today!"}, {"id": "0982253087", "genre": "Science Fiction & Fantasy", "title": "A Brilliant Wynde", "description": "What would you do if you found out you were never human?  What would you do if you found out you had special powers, could see the future and would never die?  What would you do if you realized that because of your unique abilities that you would never marry, have children and grow old among friends and family?   Phaedra is a young woman who learns she will have to deal with all these things.  She is blessed with watching history; but cursed never to be a part of it.  For if she exposes her secrets, she will become the hunted, because men never forgive creatures who are better than they are..."}, {"id": "1932442529", "genre": "Science Fiction & Fantasy", "title": "Mutants and Masterminds 2nd Edition", "description": "Mutants & Masterminds has been called \"the best, most exciting superhero RPG in years.\" It sets \"new standards in design and presentation.\" It has won multiple ENnie and Pen & Paper Awards and it appeared on every critic's \"best of\" list for 2002. Now the World's Greatest Super-hero Roleplaying Game is even better! Mutants & Masterminds, Second Edition, takes the best of the original edition and supercharges it to make it the most complete, detailed, and fun super-hero game yet! In this 256-page hardcover with a stunning new cover by Ramon Perez, you'll find a complete roleplaying game that's a perfect starting point for your own comic book adventures. Mutants & Masterminds, Second Edition, has everything you need to create your own super-heroes and villains. It also offers more than a dozen ready-made super-hero archetypes and even more ready-to-use super-villain archetypes, plus two introductory adventures so you can start playing right away. Don't let your super-powers fall behind! Mutants & Masterminds, Second Edition, will take your game (and your heroes) to the next level!"}, {"id": "B01LZ5HEIE", "genre": "Science Fiction & Fantasy", "title": "The Mind Control Assassins (Trigger Locked Book 1)", "description": "A New Breed of Assassins. And They're Called Mind Control AssassinsSet in the urban area of Tokyo in the near future, the story revolves around Touka Kimizuki and her twin brother, Yuuto. Both of them are just like a typical 16-year old high schooler. But they're actually recruited by Public Security Intelligence Agency (PSIA) to become a secret agent due to their ability to kill skilled assassins while they were still in the middle school.Together with their father who is the Head of Special Activities Division in PSIA and his squad, they receive a mission to ensure the safety of the last remaining researcher for Transhuman Development Project, Dr. Nobuhiko Hayama. He's their only hope to unfold the mystery behind the other researchers' deaths.Little they know that their first encounter with Dr. Hayama leads to something they least expect. And this is just the beginning. The Mind Control Assassins is the first book from Sekina Mayu's Trigger Locked series. It's a technothriller, thriller hard science fiction, original English light novel.If you enjoy reading science fiction light novels and love anime like Ghost in the Shell and PSYCHO PASS, then you'll love a series that blends facts and fiction seamlessly.Buy the book to start reading what awaits Touka today!"}, {"id": "1559586176", "genre": "Science Fiction & Fantasy", "title": "1942 The Pacific Air War: The Official Strategy Guide (Secrets of the Games,)", "description": "1942: Pacific Air War is the exciting new WWII air combat simulation that gives gamers a real sense of what naval campaigns were like for Japanese and American pilots. This official guide is a must for readers interested in this period. Included are all the hints, tips, adn tactics needed to become an ace for either side."}]