[{"id": "1468156136", "genre": "Children's Books", "title": "1. Gus the Old Tire- 2. Sylvia & Charlie -3 Joey & the Wolf: Three fun to read stories for 4-8 Year Olds", "description": "Three short stories by Captain Kid-O.  1. Gus the old Tire - Gus loves the school children that ride on his bus. One day Gus learns that the bus driver thinks he is too old and wants to replace him and have him thrown into the fire. Gus must try to escape and find a new home. Rhming 2. Sylvia and Charlie -  A story about true friendship between a caterpillar and a grasshopper. When the chips are down they are always there for each other. Beware of the spider!!! 3. Joey and the Wolf - Joey does not listen to his fathers advice but instead listens to a wolf that tricks him. The wolf leads Joey deep into the woods in search of sweet tasting berries only to leave him lost and all alone. Will Joey follow the advice of a Sheppard? Maybe."}, {"id": "0824968239", "genre": "Children's Books", "title": "The Kids' Book of Weather Forecasting (Williamson Kids Can! Series)", "description": "With experiments, observations and activities children ages seven to thirteen will learn to predict the weather by understanding the science behind it. From foggy mornings to sunny afternoons to our changing seasons, weather forecasting is a year-round, practical science that children will have fun learning about."}, {"id": "1616411104", "genre": "Children's Books", "title": "20,000 Leagues Under the Sea (Calico Illustrated Classics Set 3)", "description": "Jules Verne gives us the classic tale of undersea adventure aboard the Nautilus. When a sea monster begins attacking ships, the world unites to find and destroy the unknown creature. Monsieur Aronnax joins the fight and is tossed from his boat to find himself aboard an amazing vessel. Aronnax's underwater adventures walking on the ocean floor, pearl diving, and exploring with Captain Nemo has been adapted for young readers in the Calico Illustrated Classics adaptation of Verne's 20,000 Leagues Under the Sea."}, {"id": "161429058X", "genre": "Children's Books", "title": "Shantideva: How to Wake Up a Hero", "description": "Readers of all ages will enjoy this retelling of a beloved spiritual classic. Playfully illustrated in traditional Tibetan style, the story of the monk Shantideva frames his inspiring lessons on the way of the bodhisattva superhero.Shantideva: How to Wake Up a Hero is the retelling of Shantideva’s teachings before a surprised audience, who had thought he was useless and could only eat, sleep, and poop. Leading his listeners into a superhero training of different kind, he reveals the secret to perfect bravery and unbounded compassion and shows how anyone can develop them. You don’t need super-strength or magical powers, he says. You just need practice. A dozen illustrations painted in traditional Tibetan style draw in readers to this work that will be treasured not only by Buddhist families but by anyone who aspires to become more kind and wise."}, {"id": "1623870798", "genre": "Children's Books", "title": "1 Corinthians 13 - Coloring and Activity Book: Bible Chapters for Kids", "description": "Bible verses from 1 Corinthians 13 (verses 1-8 and 13), are brought to life in a relatable way for young children, with loads of fun and challenging activities and coloring pages, for your children to enjoy.  For more kids products and free downloads, visit our website at www.icharacter.org"}]