[{"id": "B077BKZXQ1", "genre": "Children's Books", "title": "Thanksgiving Stories for Growing Kids: Collection of 20 Fun Short Stories for the Holidays", "description": "20 Interesting and Hilarious Short Stories Kids LoveDo you love stories that Kids and Parents will both laugh out loud to?  Then you HAVE to check out this series!!Includes: 1.  Ms. Crow's Thanksgiving2.  The Owl Detective3.  The Chatroom (from the Chestnut Elementary Series)4.  Off the Forbidden Planet5.  The Amazing Mr Woodchuck's Magic Show 6.  The Incident at Chestnut Elementary School7.  Ms. Crow's Halloween Party8.  Ms. Crow's Family ReunionAnd 12 more exciting short stories for kids!!!These stories are so unexpected that you will be on the edge of your seat until the last page.  Some of these stories are spooky and might scare you, some are adventurous and take you to outer-space, and some are sweet and teach children valuable lessons.  One thing is for sure...once you start reading you won't want to stop!**This deal won't last long!   Scroll up and click \"Buy Now\" to reserve your copy forever!**"}, {"id": "1481423347", "genre": "Children's Books", "title": "Big Game (FunJungle)", "description": "Teddy Fitzroy returns as FunJungle’s resident zoo sleuth when a rhinoceros is at risk in Big Game, a follow-up to Belly Up and Poached—which Kirkus Reviews called a “thrill-ride of a mystery.”When someone takes aim at Rhonda Rhino, FunJungle’s pregnant (and endangered) Asian greater one-horned rhinoceros, the zoo steps up security measures in order to protect this rare animal and her baby. But the extra security isn’t enough—someone is still getting too close for comfort. Teddy and company start to suspect that whoever is after Rhonda is really after her horn, which is worth a lot of money on the black market. For the first time ever, the head of the zoo enlists Teddy for help—for once, he doesn’t have to sneak around in order to investigate—and the results are even more wacky, and even more dangerous, than ever before."}, {"id": "0998642673", "genre": "Children's Books", "title": "Kulipari: Poison Power! Quoba", "description": "Quoba is working on a spell to safeguard the frog's new home but all of her attempts have been failures. She journeys deep into the Outback to try and work out the secret of the spell for herself ... no matter what!"}, {"id": "B00N20CLXO", "genre": "Children's Books", "title": "Awaken (Book #2) (Daughters of the Sea)", "description": "The sacrifices we make have the power to shift the very fabric of who we are, and ultimately who we are meant to be…After learning of her true destiny as the intended Leader of the Tydes, Anastasia Whitman must now embark on a perilous quest to the Underworld before the age of eighteen in order to plant the seed of immortality and complete her essence to become a true Sea Goddess. But before she can make her legendary journey, an unexpected new student transfers to Lorelei; initiating a sequence of events that will unravel Stasia’s new life, and test the boundaries of her relationship with the mysterious, dark, and sexy Finn Morrison. The line between the Underworld and the Living begins to blur as gruesome ghosts, morbid reveries, and pure evil haunt her waking hours as well as her sanity. Once the details of Finn’s own startling destiny are revealed, the dangerous secrets he’s been hiding will threaten the very love Stasia believed to be indestructible. As time begins to run out, she will be forced to choose between the one she loves and the destiny she cannot escape."}, {"id": "1410905020", "genre": "Children's Books", "title": "1: Nuclear Energy (Energy Essentials)", "description": "This book tells you all about nuclear energy. It explains what nuclear energy is and how it is used in the modern world. It also tells you about the problems of nuclear energy and the disasters it can cause. You will learn whether or not nuclear energy is a safe way of fueling the world. You will also find out about other types of energy we can use in the future."}]