[{"id": "B01CBTQ7M2", "genre": "Children's Books", "title": "Dragon Soup: Picture Book for Children", "description": "When Andy gets sick, his mom makes him a yummy bowl of hot soup. This soup is so nice; Andy can't help but feel sleepy. And the next thing he knows, he's in a land where there is an angry dragon.Find out why this dragon is so angry and what he and Andy have in common.Another favorite Michael Yu children's book!"}, {"id": "1544757263", "genre": "Children's Books", "title": "The Big GREEN Dinosaur (Volume 1)", "description": "Being green has never been so cool! Join, Jake, The Big GREEN Dinosaur and his friends as they teach you ways to take care of your planet while having fun doing it!"}, {"id": "1477772065", "genre": "Children's Books", "title": "Molly Pitcher (Jr. Graphic American Legends)", "description": "The story of Molly Pitcher highlights a side of the American Revolution not often touched upon in history books—the role of women. The legend of Molly Pitcher tells of a woman who has followed her husband to the war and brings water to the soldiers in battle. When her husband is killed, she takes up his station and fires the cannon at the British. Historians think this could be a compilation of many true stories of women who helped out in the war, specifically of Mary Ludwig Hays McCauley or Margaret Corbin. This lesson in history and courage that gives a different perspective on events is a welcome addition to any library collection."}, {"id": "1250157447", "genre": "Children's Books", "title": "Cottons: The Secret of the Wind", "description": "To her neighbors in the Vale of Industry, Bridgebelle is an ordinary rabbit. All day long, she toils at the carrot factory. After a hard day, she returns home to care for her ailing auntie. And whenever she's out, she's watchful of the murderous foxes who prey on her kind.But Bridgebelle is not ordinary―she's a rabbit with talents beyond her own understanding. Using cha, the mysterious fuel that powers her world, she can change everyday objects into thokchas―magical, transforming works of art. Bridgebelle makes thokchas because they're beautiful. But there are those in her world who want to harness her powers and turn her art into a weapon."}, {"id": "B06XYXZT4L", "genre": "Children's Books", "title": "Mother's Day for Beginner Readers [Mom version] (Seasonal Easy Readers for Beginner Readers Book 7)", "description": "Moms have been magic since the beginning of time. This year, let's say why we love them in rhyme!This early reader is the perfect book to share with your Beginner Readers coming up to Mother's Day.It's sure to spark some memorable conversations about what your children love about their Mom.Happy Mother's Day!***NOTE: This version of the Mother's Day reader is written for women called Mom! If you are called Mum, then click on the author name to go to a list of books where you will find the Mum version of this book***"}]