[{"id": "0766085112", "genre": "Children's Books", "title": "Martin Luther King Jr.: Fighting for Civil Rights (Rebels With a Cause)", "description": "Martin Luther King Jr. had a dream that, one day, all people would be viewed equally, no matter the color of their skin. And he fought hard for civil rights for African Americans, eventually even giving his life to the cause. This compelling biography explores Kings early life and his activism in his own words within the context of the Jim Crow American South, along with his victories and the way in which he changed our world. Students will be guided through their reading with a glossary of important terms, a timeline of Kings life and important events in the civil rights movement, and resources for further learning."}, {"id": "1508155283", "genre": "Children's Books", "title": "What Is User Interface Design? (Spotlight on Kids Can Code)", "description": "Have you ever wondered why the play button for most music players is still the same right-facing triangle that was on every cassette player and VCR? User interface (UI) designers try to develop icons and controls that are so obvious they endure through the years and across technologies. For example, iPhone apps often feel so familiar because many designers use the UI toolkit from Apple with standard fonts and icons. Unlike user experience (UX) design, which has to do with the flow of a program, UI is all about the look and feel of software and hardware. With colorful photographs and helpful illustrations, readers will make the most of this essential coding topic."}, {"id": "1549938525", "genre": "Children's Books", "title": "The Pig and the Egg: The Animals of Eden: Book One", "description": "The Pig and the Egg: The Animals of Eden: Book One Once there was a place called Eden, it was a magical land. Eden was for the animals and it was beautiful and GRAND.   This is part one of three books about animals living in the biblical paradise called Eden.  A humour filled rhyming book series, that covers issues such as mental health, fear and relationships, crime and punishment.  This first book in the series is the illustrated rhyming story about a pig that finds an egg, that hatches into a dinosaur. And because the pig is the first thing it sees, thinks Piggle's the pig, is his momma!    The other books in this series  The Pig and the Egg continues the story in The Pig and the Dinosaur, where issues such as fear and bullying are topics covered.  The final book, The Pig and the Hats of Shame covers the topic of punishment for crimes committed, mental health, and repercussions of wrongdoing"}, {"id": "1741663962", "genre": "Children's Books", "title": "100% Hero", "description": "Freddy the werewolf boy must come to the rescue again when his father is captured in wolf form and put in the zoo Freddy Lupin's noble werewolf family is in trouble again. A TV reporter has captured Freddy's dad and put him in the zoo, and strange visitors are snooping around Farfang Castle, looking for the mysterious Blavendoch. Before he can protest, Freddy is packed off to camp. He's looking forward to all the extreme sports adventures—until he's handed pink tights and dainty ballet slippers. Freddy has a choice: face the ghostly blood-sucking demon outside . . . or dance. Great horned toads! How's Freddy going to get out of this one?"}, {"id": "1556523602", "genre": "Children's Books", "title": "Ancient Egyptians and Their Neighbors: An Activity Guide", "description": "Want to speak Hittite? Hold out a glass and ask for “wa-tar.” This unique activity book for children ages nine and up shows what life was like among the Nubians, Mesopotamians, Hittites, and their neighbors the Egyptians from around 3100 B.C., when Upper and Lower Egypt became one kingdom, to the death of Queen Cleopatra under the Romans, in 30 B.C. Projects such as building a Nubian irrigation machine, creating a Mesopotamian cylinder seal out of clay, making kilts like those worn by Egyptian boys and men, and writing in Hittite cuneiform help young readers to connect with these ancient cultures and see how profoundly they have influenced our own."}]