[{"id": "0749644478", "genre": "Children's Books", "title": "Muslim Festivals Through The Year (A Year of Festivals)", "description": "Festivals, with their rich stories and colourful traditions, are an ideal way for children to learn about other cultures. A Year of Festivals introduces the main religious festivals as they occur through the year. The books include prayers, songs, quotations from religious writings, colourful photographs and fun activities to bring the festivals to life and help children join in the celebrations. Endmatter includes a glossary of important terms, a festival calendar for easy reference, a list of books and useful websites for further information and an index"}, {"id": "019272388X", "genre": "Children's Books", "title": "A Big Book of Counting and Chanting Rhymes", "description": "This is a selection of counting and chanting rhymes from the \"First Verse\" and \"More First Verses\" series. These poems have been chosen to support the literacy hour and numeracy hour. They are designed to help young children to learn to count, to explore and develop an understanding of poetry."}, {"id": "0448432129", "genre": "Children's Books", "title": "Day of the Iguana (Hank Zipzer: The World's Greatest Underachiever #3)", "description": "Inspired by the true life experiences of Henry Winkler, whose undiagnosed dyslexia made him a classic childhood underachiever, the Hank Zipzer series is about the high-spirited and funny adventures of a boy with learning differences.  It's science project time in Ms. Adolf's class. This is good news and bad news for Hank-he loves science, but he hates the report part. So Hank turns to TV to take his mind off things. But when the program directory scrolls by too quickly for Hank to know what's on, he decides to take apart the cable box to try to slow down the crawl. Great! Now Hank has found the perfect science project! But what he wasn't counting on was his sister's pet iguana laying eighteen eggs in the disassembled cable box. How is Hank going to get out of this one?  Illustrated by Carol Heyer."}, {"id": "059010294X", "genre": "Children's Books", "title": "Why Mosquitoes Buzz in People's Ears", "description": "\"In this Caldecott Medal winner, Mosquito tells a story that causes a jungle disaster. \"Elegance has become the Dillons' hallmark. . . . Matching the art is Aardema's uniquely onomatopoeic text . . . An impressive showpiece.\"-Booklist, starred review.Winner of Caldecott Medal in 1976 and the Brooklyn Art Books for Children Award in 1977.From the Trade Paperback edition."}, {"id": "1788285166", "genre": "Children's Books", "title": "Color by Numbers: Times Tables", "description": "This book's fresh and fun approach to a classic format features a mixture of simple math activities and funky color-by-numbers puzzles for kids aged 4 and up.To reveal the colors in each illustration, kids must first solve the math problems. Features an array of child-friendly scenes such as cheeky pirates, deep sea creatures, and funny robots.The perfect children's activity book for discovering and reinforcing early math skills!"}]