[{"id": "B004CFAP22", "genre": "Science Fiction & Fantasy", "title": "The Enemy of an Enemy (Lost Tales of Power Book 1)", "description": "Vydor is riding a wave of success, but now his ship, the Dragon Claw, is being sent to investigate a mysterious event deep within the Empire’s space. A secret research colony has fallen silent and the forces sent to investigate were never heard from again. A new enemy has come to the Empire bringing with it dark powers that were abandoned long before the Empire was born. Powers that were thought to be legends and myths.It's up to Vydor to keep this force at bay and protect the Empire, but it may come at the cost of his faith and shake the foundations of the Empire itself.The Lost Tales of Power is an open-ended series of Sci-Fi/Fantasy books set in a vast multiverse featuring a mixture of traditional fantasy and science fiction elements. Lost Tales Series: Volume I - The Enemy of an Enemy Volume II - The Academy Volume III - Rise of Shadows Volume IV - Resurgence of Ancient Darkness Volume V - The Sac’a’rith Volume VI - Spectra’s Gambit Volume VII - Sac'a'rith: RebirthVolume VIII – Mage HunterVolume IX and beyond - TBA"}, {"id": "0559358989", "genre": "Science Fiction & Fantasy", "title": "1: The Lancashire Witches: A Romance of Pendle Forest, Volume I", "description": "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."}, {"id": "B013ZUHWY8", "genre": "Science Fiction & Fantasy", "title": "Pixies, Passages and Possibilities: Collection of Science Fiction and Fantasy short stories", "description": "A collection of science fiction and fantasy short stories. In the first story pixies from a nearby dimension keep losing their pets in our reality. If they aren't found, there could be another species extinction: ours. In Death's Other Kingdom an elderly dying woman dreams of another reality. Or is it a dream?  Reflecting shades of Lovecraft, a woman learns of her true heritage when she reads her grandmother's diary. Sir Phillipe Vamour is a vampire. He became a vampire in 356 fighting with Alexander the Great. It is now 1144 and France is considering a new crusade. That is too much blood letting even for a vampire. Not to mention the problem with the sorcerer. In Choices, Earth has to take sides in an interstellar war. One side are snakes, the other are spiders. Hard to choose which one mankind dislikes the most. Genetic engineering of humans is the focus of DavdII Never Visits. A fairly dark short story. In By Tintagel's Light a couple tries one last time to save their marriage. They just might need a little magic. In Mabel you meet a most unusual ghost. The last story is a novella. A cat must help a fairy find her way home. They need the help of a wheelchair bound elderly lady who lives in a nursing home."}, {"id": "1593937849", "genre": "Science Fiction & Fantasy", "title": "Scribes of Speculative Fiction II", "description": "A collection of interviews from some of the leading and up-and-coming names in genre fiction, including Eduardo Sanchez, William Nolan, Raymond Benson, Jack Ketcham, Raymond Feist, Joe Schrieber, Kevin J. Anderson, and Roger Price.  In this second volume to Scribes of Speculative Fiction: A Collection of Interviews, author Cristopher DeRose’s interviews provide insights into the minds of today’s best authors and an eclectic mix of penetrating insights into their unique worlds. If you’re a fan of James Bond, Rift War, The Blair Witch Project, Star Wars, Logan’s Run, X-Files, Dune, or The Tomorrow People, you’ll discover the unforgettably diverse blend of talents behind these works that thrilled an entire generation and still stimulate the imaginations of  new readers.   “Cristopher writes characters that feel as real as true souls, so there is no better interviewer to get to the creative souls of the writers in this book. May there be a Scribes III.”—Bruce Larson, author of Nightmares and Other Vices and Within and Beyond: The Realms of the Sun."}, {"id": "B01N1UR298", "genre": "Science Fiction & Fantasy", "title": "Voice of Vengeance: The First Flame (Kingdom of Destiny Book 11)", "description": "Voice of Vengeance is the third and final volume of the thrilling fantasy short story series, Kingdom of Destiny. Launching the final volume is the first episode, The First Flame. A recent college graduate finds himself in an alternate world he never knew existed. Dealing with castles, kings, and betrayal, he will have to use his considerable wits if he is going to face his fate in the Kingdom of Destiny.Xander has spent eleven years running from his past. Only to have it circling around on him in a dangerous matching of wits between him and the ruthless emperor of Jaguria. Finding himself appointed as the leader of a rebellion he never meant to start, he must face his past mistakes if he will have a chance to right those long ago wrongs. If he can learn to accept who he is and who he must be, he may become the people’s Voice of Vengeance. With the rebellion’s victory against the Southern Palace still echoing through the land, Xander finds himself face to face with a past he’d told himself was long forgotten. Forced into a difficult confrontation he wasn’t expecting, he scrambles to pull his people together against the merciless emperor. To do that, he must first finish claiming the southern lands of Jaguria."}]