[{"id": "098004443X", "genre": "Children's Books", "title": "Pirates, Manatees and Mermaids (Save Our Seas Adventure Books)", "description": "A Red Alert sets the Worthys off from the island of Abu Al Abyad-near Abu Dhabi in the Persian Gulf-to Florida where manatees are being injured and killed at an alarming rate! Something has changed. The SOS Foundation is sending in their crack A.I. team, Alena and Tyler Worthy and their resourceful dog Brutus, to solve the problem. But a squad of of SeaBombs—small and very fast individual watercraft—is sent out in pursuit of the A.I. team. At the same time, hurricane Sheryl is spinning in, threatening the entire Gulf Coast! The Nous Velons can't out run the jet-skis or the storm. Can the team possibly be resourceful enough to solve the case, escape the storm, and rescue several trapped and injured manatees?"}, {"id": "B00GAL89UQ", "genre": "Children's Books", "title": "Helen Keller's Best Friend Belle", "description": "Many know the story of Helen Keller’s journey to learn to communicate. And many have heard of Anne Sullivan, the brilliant teacher who helped Helen understand. But have you ever heard about Belle the dog? In this new picture book biography of Helen Keller’s early life, readers are introduced to her beloved dog, Belle, who is with Helen every step of the way!This is a fixed-format ebook, which preserves the design and layout of the original print book."}, {"id": "0749633298", "genre": "Children's Books", "title": "China (Picture A Country)", "description": "A profile of China and its people which considers lifestyle, weather, landscapes, countryside and cities. Part of the PICTURE A COUNTRY series, illustrated with colour photographs and maps. Suitable for National Curriculum Key Stages 1/2."}, {"id": "0763614351", "genre": "Children's Books", "title": "I Love Guinea Pigs: Read and Wonder", "description": "\"A wonderful celebration of the attributes of guinea pigs. . . . A popular pet and familiar subject is given new vigor and interest through originality, love, and respect.\" -- THE BOSTON GLOBEI LOVE GUINEA PIGS is an affectionate guide to the most charming of very small animals. Did you know, for instance, that guinea pigs rarely get sick and love to eat? Or that they love one another and have adorable children too? Portrayed in all thier amiable chunkiness, guinea pigs finally recieve the tribute they so richly deserve."}, {"id": "B01MSWO03M", "genre": "Children's Books", "title": "The Tree People", "description": "Ester Rose, a very old person, accidentally turns into a tree and then, maybe, a butterfly. Good to read out loud to very young children. They can read themselves if they are in about third grade to fifth. Some nice graphics. The emphasis is on saving and respecting trees."}]