[{"id": "B01EI7LG12", "genre": "Children's Books", "title": "Aw Yeah Comics! Volume 3: Make Way... For Awesome!", "description": "HERE COMES THE AWESOME! Your favorite superheroes return, led by Action Cat! But what evil will threaten our heroes this time? No doubt Evil Cat will pounce again! And Parallel-O-Ham menaces beautiful downtown Skokie! Follow the continuing adventures of Art Baltazar and Franco’s superhero creations! Collects Aw Yeah Comics #9–#12, with over thirty pages of new material!* All-ages cartoon superhero fun!"}, {"id": "1492659940", "genre": "Children's Books", "title": "I Love My Virginia Valentine", "description": "It's Valentine's Day in Virginia, and I just want to say that I love you SO MUCH, and in SO MANY ways! Experience boundless and unconditional love as you travel around your home state in this sweet and colorful story.  Based on Marianne Richmond's bestselling book I Love You So..., I Love My Virginia Valentine celebrates a parent's love for their child by comparing their love to special characteristics of where they live! This heartwarming book puts into words the often indescribable quality of boundless, steady and unconditional love while using familiar landmarks around them. I Love My Virginia Valentine is the perfect way to share your love with a treasured child this Valentine's Day!"}, {"id": "0694014370", "genre": "Children's Books", "title": "Hanukkah Lights, Hanukkah Nights Board Book", "description": "Celebrate the festival of lights with this board book edition of Leslie Kimmelman's popular picture book. Just right for preschoolers, this charming Hanukkah story beautifully introduces several holiday traditions, including lighting the menorah, reciting blessings, playing dreidel games, and more."}, {"id": "0545942152", "genre": "Children's Books", "title": "A Graphix Book: Wings of Fire Graphic Novel #1: The Dragonet Prophecy", "description": "Not every dragonet wants a destiny ... Clay has grown up under the mountain, chosen along with four other dragonets to fulfill a mysterious prophecy and end the war between the dragon tribes of Pyrrhia. He's not so sure about the prophecy part, but Clay can't imagine not living with the other dragonets; they're his best friends. So when one of the dragonets is threatened, all five spring into action. Together, they will choose freedom over fate, leave the mountain, and fulfill their destiny -- on their own terms.The New York Times bestselling Wings of Fire series takes flight in this first graphic novel edition, adapted by the author with art by Mike Holmes."}, {"id": "1943145245", "genre": "Children's Books", "title": "Tippy and the Night Parade: TOON Level 1", "description": "When Tippy wakes up, there's a peacock in her bedroom, a bird in her hair, and mice dancing on the headboard... Yet all Tippy remembers is falling asleep. In her first book for children, award-winning cartoonist Lilli Carré takes Tippy on a nocturnal adventure up a mountain, down a hole, and back home for endless bedtime enjoyment."}]