[{"id": "B00TX3TZW4", "genre": "Science Fiction & Fantasy", "title": "Break You (Stake You Book 3)", "description": "Devlin O’Mara’s world has been turned upside down time and time again since she first came across a vampire. And it’s not over yet.The vampires may have left her small town alone for a while, but they’ve provoked curfews and martial law in the capital city. The aftermath of their last attacks are still rippling outward, and it soon becomes clear that Emily’s sire is gathering an army.Even though her personal life has fallen apart, Devlin can’t let the vampires win, no matter how much they hurt the people she loves. Death is everywhere, and the only way to win is through joining forces with unusual allies.One final battle is coming. But who will survive?"}, {"id": "B00NO4S94I", "genre": "Science Fiction & Fantasy", "title": "Ellie Jordan, Ghost Trapper", "description": "Ellie Jordan’s job is to catch and remove unwanted ghosts.  Part detective, part paranormal exterminator, Ellie operates out of Savannah, Georgia, the most haunted city in the United States.When a family contacts her to deal with a disturbing presence in the old mansion they’ve recently purchased, Ellie first believes it to be a typical, by-the-book specter, a residual haunting by a restless spirit.  Instead, she finds herself confronting an evil older and more powerful than she’d ever expected, rooted in the house’s long and sordid history of luxury, sin, and murder.  The dangerous entity seems particularly interested in her clients’ ten-year-old daughter.Soon her own life is in danger, and Ellie must find a way to exorcise the darkness of the house before it can kill her, her clients, or their frightened young child.“A brilliantly addictive, insomnia-inducing story following Ellie Jordan, a ghost tracker, who works a hazardous job investigating hauntings. Read before bedtime at your own risk!” -Alexia Purdy, bestselling author of the Dark Faerie Tale and Reign of Blood series\"Ellie Jordan, Ghost Trapper is both really fun and really creepy. It's Ghostbusters meets The Dresden Files.\" -Daniel Arenson, bestselling author of the Song of Dragons and Moth series"}, {"id": "1414334907", "genre": "Science Fiction & Fantasy", "title": "Left Behind: A Novel of the Earth's Last Days", "description": "An airborne Boeing 747 is headed to London when, without any warning, passengers mysteriously disappear from their seats. Terror and chaos slowly spread not only through the plane but also worldwide as unusual events continue to unfold. For those who have been left behind, the apocalypse has just begun. A repackage of the New York Times best-selling novel Left Behind.Now a major motion picture starring Nicolas Cage!"}, {"id": "B077TZVK46", "genre": "Science Fiction & Fantasy", "title": "Hidden: Reverse Harem (Chronicles of Cas Book 2)", "description": "Ever since that night on Gallows Hill, Cas has made it her mission to find her brother. Too bad every time she turns someone—or something—gets in her way.When Cas is summoned to Command, she finds out the truth behind what happened at Stonehenge. With her group of Elite friends, and one new Necromancer, she sets off for the sacred site to help silence the ley line and find Damen. What they encounter there changes the magical world forever.The balance of power has shifted. Cas must fight for survival or risk being lost forever."}, {"id": "1578281245", "genre": "Science Fiction & Fantasy", "title": "Millieu O Campaign: Traveller Role Playing Game", "description": "The Long Night, a period in which the remnants of a once-mighty interstellar empire regressed to barbarism, has passed. Starships once again ply the space lanes, and civilizations are reawakened to the vast interstellar community of worlds. One ambitious world has designs on empire itself, and the growth of the Sylean Empire is in full swing. It is the time of the pocket empires, despots and philosophers, merchant princes and piratical tyrants, an age when the foundations of the next thousand years of history is being laid."}]