[{"id": "B01MPW2K9Y", "genre": "Science Fiction & Fantasy", "title": "Shadow Raiders (Part 2 of 6)", "description": "(Part 2 of 6)Archaeologists David and Julia Hammond have made the find of their careers--a pair of immense, golden doors, buried beneath the glacial ice of Greenland. But instead of leading to some centuries-old, subterranean crypt, the doors instead lead to another world--a world of eternal shadow, populated by blood-thirsty, superhuman barbarians.Rescued by a secret unit of the US Military, the Hammonds soon find themselves working alongside a team of supersoldiers and monsters, investigating the home of the gods, Asgard. Their investigation soon turns into a battle for survival, as the sons of Odin, the All-Father, prepares to march on Midgard and bring Ragnarok to humanity in a cataclysmic showdown between an army of gods and the might of the modern mortal military."}, {"id": "0307382230", "genre": "Science Fiction & Fantasy", "title": "Parlor Games Deck: 50 Amusements and Entertainments for Everyone", "description": "Whether you're a riddler, rhymer, trickster, or anyone who is up for some lively fun, the Parlor Games Deck offers an exquisite compendium of fifty games for you and your friends to play no matter the occasion! Gathered from the merry parlors of a bygone era, this collection of turn-of-the-century entertainments provides hours of amusement for people of all different ages and interests. Each card is illustrated with a delightful engraving from the Victorian era, and the portable format promises a rousing good time wherever you go."}, {"id": "B0727XP4WJ", "genre": "Science Fiction & Fantasy", "title": "Traveler in the Dark (Ex Situ Book 1)", "description": "Sixteen hundred years ago, they fled Earth. Now their long journey may finally be at an end. None of them have ever walked on soil, felt rain, or breathed unrecycled air.Their resources nearly spent, they sent a last exploratory mission to a new planet. It's ideal... but they are not alone. In the struggle for survival, they must make a choice.  Sacrifice another species or accept their own extinction. And time is running out."}, {"id": "1588463699", "genre": "Science Fiction & Fantasy", "title": "Night Horrors Wolfsbane*OP (Werewolf: The Forsaken)", "description": "Those That Hunt The Hunters When the full moon rises, werewolves howl. The rule is simple: hunt, or be hunted. But what does it take to be not the prey, but the predator? What werewolves are strong enough to strike fear into the hearts of their brethren ― and what else hunts the night? A Chronicle Book for Werewolf: The Forsaken * 29 terrors and beasts to plague the Forsaken, or anyone else luckless to become their prey. * Creatures designed for use with Werewolf, and antagonists suitable for bringing the feel of Werewolf to other games. * Details on the idigam, the primordial horrors often whispered of but never before revealed"}, {"id": "1481482653", "genre": "Science Fiction & Fantasy", "title": "1636: The Chronicles of Dr. Gribbleflotz (Ring of Fire)", "description": "A sparkling addition to the multiple New York Times best-selling Ring of Fire alternate history series created by Eric Flint. An alchemist of the 17th century confronts modern science with often amusing results.Phillip Theophrastus Gribbleflotz, the world's greatest alchemist and a great-grandson of Paracelsus—and a Bombast on his mother's side—was a man history had forgotten. But when the town of Grantville was transported by a cosmic accident from modern West Virginia to central Germany in the early seventeenth century, he got a second chance at fame and fortune.  The world's greatest alchemist does not make household goods. But with suitable enticements Gribbleflotz is persuaded to make baking soda and then baking powder so that the time-displaced Americans can continue to enjoy such culinary classics as biscuits and gravy. Applying his superb grasp of the principles of alchemy to the muddled and confused notions the Americans have concerning what they call “chemistry,” Gribbleflotz leaves obscurity behind.  In his relentless search for a way to invigorate the quinta essential of the human humors, Gribbleflotz plays a central role in jump-starting the seventeenth century’s new chemical and marital aids industries—and pioneering such critical fields of human knowledge as pyramidology and aura imaging. These are his chronicles.  About Eric Flint’s Ring of Fire series: “This alternate history series is … a landmark…”—Booklist  “[Eric] Flint's 1632 universe seems to be inspiring a whole new crop of gifted alternate historians.”—Booklist  “…reads like a technothriller set in the age of the Medicis…”—Publishers Weekly"}]