[{"id": "B077WLBJRN", "genre": "Children's Books", "title": "Children's book : Ninjas vs. Monsters: Ninja, Vampire, Werewolf, Witches, Book for kids ages 9 12", "description": "Tyler, Steven, and Larry have been practicing the ways of the ninja since they were ten-years-old, and now at thirteen, their Sensei has entrusted them to take on higher ranked missions. Rumors of a city takedown have spread around the city, and it is the ninja apprentices’ job to handle the situation efficiently and quietly. Believing the culprits to be professionals was a major underestimate, however. These were no professional grownups looking to terrorize the city, these were kids the ninjas’ age who happened to be monsters! Tyler, Steven, and Larry work hard to use their fear of the monsters to make them stronger; however, the monsters are more powerful than the three ninjas could have ever guessed. Will the aspiring ninjas allow their fear to take over them, or will their determination to protect their city prevail?"}, {"id": "0750207485", "genre": "Children's Books", "title": "Sports Skills Soccer", "description": "An explanation of the disciplines, apparatus, rules, skills and tactics of gymnastics, with colour photographs and diagrams to illustrate the techniques and exercises. A title from the new SPORTS SKILLS series."}, {"id": "1632353466", "genre": "Children's Books", "title": "12 Spooky Haunted Places (Scary and Spooky)", "description": "Examines 12 of the most haunted places on Earth. Each spread provides information about a mysterious place and its history paired with interesting sidebars and questions to consider."}, {"id": "B01N6UFDR6", "genre": "Children's Books", "title": "Graveyard Shakes", "description": "Katia and Victoria are sisters and scholarship students at a private boarding school. While Victoria tries to fit in, Katia is unapologetic about her quirks, even though their classmates tease her. After a big fight, Katia runs away from school. And when Victoria goes looking for her, she accidentally tumbles into the underworld of a nearby graveyard. It is inhabited by ghosts, ghouls, and a man named Nikola, who is preparing a sinister spell that's missing one key ingredient.Victoria teams up with adorable Little Ghost and Nikola's kindhearted son, and together they search for Katia. They must find her before she becomes Nikola's next victim!"}, {"id": "0998076309", "genre": "Children's Books", "title": "Cloudgirl", "description": "Meet Sophie. She's a precocious five year old who lives in a secret kingdom on top of the clouds. With the help of her friends, the Faeiry Ballerinas, and a magical unicorn named Marina, Sophie keeps the clouds safe from the evil witch Katrina, who threatens the peace within the Kingdom. From the imagination of a seven year old girl, Cloudgirl tells a story of friendship, overcoming obstacles and the importance of standing up for yourself."}]