[{"id": "B07177BW13", "genre": "Children's Books", "title": "Baby Book: Monkey at the circus : (Beginner Reader Book,Early Learning, Activity, Books For Kids, Children's Books, Toddler Books, Books Online)", "description": "This is a  perfect book for active kids, who have more energy than they can use during the day. Cheeky  monkey will show you a new trick on every page. Your child will learn new  words like juggling, or walking the tightrope. It's the first step to get your child interested in  original activities, but at the same time you can keep an eye on him or her. This book is drawn in a gentle style, with contrasting colours, perfect for little babies. It's created to stimulate a child's imagination and to develop  sensitivity  and creativity."}, {"id": "1538206560", "genre": "Children's Books", "title": "Russia's City of the Dead (Crypts, Tombs, and Secret Rooms)", "description": "It was once said that anyone who entered the Russian village of Dargavs would never leave . . . alive! This community, now called the City of Dead, contains about 100 crypts in the form of tiny white houses, some dating back more than 300 years. This noteworthy volume addresses the legends and myths of this mysterious placeincluding lore that people were sealed into their crypts while still alive. Thoughtful sidebars, carefully selected images, and a thorough timeline are valuable additions to this high-interest text."}, {"id": "0486488640", "genre": "Children's Books", "title": "Crime Lab 101: 25 Different Experiments in Crime Detection (Dover Children's Science Books)", "description": "Do you have what it takes to be a crime scene investigator? Any budding detective with an interest in police work will be fascinated by this inside look at detection and forensic science. A series of Crime Labs focus on practicing specific techniques, and Crime Lab Exercises explore the principles behind the methods of detection.Learn how to record and lift fingerprints, identify a ransom note's ink, and reveal messages on a seemingly blank page. You'll also discover approaches to code cracking; voice pattern analysis; and matching hair, clothing, and tissue samples. A history of forensic science is included in this eye-opening look at crime detection, along with true-life tales of famous sleuths and remarkable cases.\"An entertaining title for junior detectives, recreational readers, and science-fair students.\" — School Library Journal\"Detective wannabes will find a wealth of how-to tips.\" — New York Newsday"}, {"id": "0062288423", "genre": "Children's Books", "title": "Biscuit's Christmas Storybook Collection", "description": "Merry Christmas, Biscuit! This storybook collection brings nine of your favorite Biscuit titles together for the first time ever! The collection includes Biscuit's Snowy Day, Biscuit Gives a Gift, Biscuit's Christmas Eve, Biscuit's Show and Share Day, Biscuit Wants to Play, Biscuit Visits the Big City, Biscuit and the Lost Teddy Bear, Biscuit's Christmas, and Biscuit Goes to School. With full-color illustrations and delightful stories, this Christmas collection is the perfect holiday gift."}, {"id": "1417791012", "genre": "Children's Books", "title": "Dali and the Path of Dreams", "description": "The paintings of Salvador Dali, with their dreamy imagery, have a special appeal to children, who respond to the sense of imagination and whimsy they see. In  Dali and the Path of Dreams,  author Anna Obiols and illustrator Joan Subirana create an adventure story for young Dali inspired by the famous painter's style. Little Salvi, as he's known, rides on a long-legged elephant, encounters a chef who tosses clocks like pancakes, finds a magic key, flies on a floating boat, and does much more in this charming tribute to the seminal surrealist."}]