[{"id": "079453077X", "genre": "Children's Books", "title": "Usborne Big Book of Big Ships (Big Books)", "description": "Presents a history of ships and explores watercraft as floating hotels, working ships, transportation vessels, and warships, in a book with fold-out pages. On board pages."}, {"id": "1250151759", "genre": "Children's Books", "title": "What’s Your Favorite Bug? (Eric Carle and Friends' What's Your Favorite)", "description": "In this companion to What's Your Favorite Animal? and What’s Your Favorite Color?, Eric Carle and fourteen other beloved children's book artists illustrate their favorite bugs and explain why they love them.Everybody has a favorite bug. Some like shiny, colorful beetles or busy ants or soft pale moths best. Others prefer spindly walking sticks or fuzzy caterpillars that turn into bright butterflies. With beautiful illustrations and charming personal stories, 15 children's book artists share their favorite bugs and why they love them. Featuring words and pictures by:Eric CarleJoey ChouEric FanDenise FlemingEkua HolmesTim HopgoodMolly IdleBeth KrommesScott MagoonKenard PakMaggie RudyBritta TeckentrupBrendan WenzelTeagan WhiteEugene Yelchin- GODWIN BOOKS -"}, {"id": "B013IBVL2S", "genre": "Children's Books", "title": "Diary of an Angry Alex: Book 2 [An Unofficial Minecraft Book]", "description": "Alex, the Angry Minded Minecrafter is at it again!Living with Steve has improved quite a bit since last time but Steve manages to make Alex angry again! What did he do THIS TIME? And what is Alex plotting to do to Steve? Find out in the Diary of an Angry Alex 2!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books."}, {"id": "0399550968", "genre": "Children's Books", "title": "Guardians of the Galaxy (Marvel: Guardians of the Galaxy) (Little Golden Book)", "description": "Star-Lord, Groot, Rocket Raccoon, and the other Guardians of the Galaxy race through a universe filled with foes to save the day! Boys and girls ages 2 to 5 will love this action-packed Little Golden Book featuring their favorite out-of-this-world Marvel heroes and villains."}, {"id": "0152019839", "genre": "Children's Books", "title": "Moonbeams, Dumplings & Dragon Boats: A Treasury of Chinese Holiday Tales, Activities & Recipes", "description": "Filled with delectable recipes, hands-on family activities, and traditional tales to read aloud, this extraordinary collection will inspire families everywhere to re-create the magic of Chinese holidays in their own homes. They can feast on golden New Year's dumplings and tasty moon cakes, build a miniature boat for the Dragon Boat Festival and a kite at Qing Ming, or share the story of the greedy Kitchen God or the valiant warrior Hou Yi. This stunning compilation from bestselling cookbook author Nina Simonds and Leslie Swartz of the Children's Museum, Boston, is the perfect gift for families that have embraced Chinese holidays for generations--and for those just beginning new traditions."}]