[{"id": "B012OGOGL6", "genre": "Children's Books", "title": "Alphabet Autos", "description": "An A to Z of classic cars, beautifully brought to life in rhyme and pictures. This wonderfully illustrated eBook will delight children and car-loving parents alike!"}, {"id": "0606054677", "genre": "Children's Books", "title": "Missing Gator of Gumbo Limbo an Ecologic", "description": "Sixth-grader Liza K., one of five homeless people living in an unspoiled forest in southern Florida, searches for a missing alligator destined for official extermination"}, {"id": "0751358916", "genre": "Children's Books", "title": "200 Boredom Busters (Quick & Easy Activity Book)", "description": "An activity book with step-by-step pictures to guide you through craft and cookery to exploration and adventure. Projects range from a quick, simple idea that can be completed in an hour or two to involved projects that may take more than a day to complete."}, {"id": "0875185320", "genre": "Children's Books", "title": "Robert Scott in the Antarctic (Great 20th Century Expeditions)", "description": "Recounts the race between Robert Scott and Roald Amundsen to be the first explorers to reach the South Pole, describing Scott's journey in detail, including his death from exhaustion and exposure"}, {"id": "1547138483", "genre": "Children's Books", "title": "Happy 93rd Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 93 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]