[{"id": "1474737072", "genre": "Children's Books", "title": "Building Bridges (Young Explorer: Young Engineers)", "description": "Uses engaging nonfiction text and hands-on projects to help young readers explore real-life bridge engineering projects, including the science behind how these structures are planned and built."}, {"id": "0826603602", "genre": "Children's Books", "title": "The Teeny Tiny Yarmulka", "description": "Shortly after the owner of a yarmulka store receives a teeny tiny yarmulka, a small girl comes looking for a special one for her doll."}, {"id": "1465429352", "genre": "Children's Books", "title": "DK Adventures: Fast and Cool Cars", "description": "Find out about different cars past, present and future. Explore recent manufacturing and engineering developments with environmentally friendly fuels and investigate their inner workings.DK Adventures is a nonfiction series for kids ages 8-11 featuring visually rich theme spreads, and fascinating facts that help kids build their skills in vocabulary, grammar, comprehension, and critical thinking while developing a love of reading. Designed to keep interest high, build knowledge, and enrich the reading experience with fascinating background information, each title in the DK Adventures series is filled with information yet eminently accessible, and available in a wide range of kid-favorite topics including rain forests, animals, rocks, and shipwrecks."}, {"id": "0375922792", "genre": "Children's Books", "title": "A Whale of a Tale!: All About Porpoises, Dolphins, and Whales (Cat in the Hat's Learning Library)", "description": "Onboard a vessel that would make Jacques Cousteau green with envy, the Cat and Co. take to the high seas in search of whales, dolphins, and porpoises—those aquatic mammals known as cetaceans. While learning how cetaceans stay warm without hair, have teeth or baleen, swim in troops, spyhop, spin, breach, and see via ecolocation, kids are introduced to almost 20 different species—including sperm, right, humpback, and blue whales; Gulf, spectacled, and finless porpoise; and boto, common, hourglass, and bottlenose dolphins. A shipshape selection for summer reading!“The Cat in the Hat’s Learning Library shows young readers that books can be entertaining and educational at the same time. This is a wonderful series!” —Barbara Kiefer, Ph.D., Charlotte S. Huck Professor of Children’s Literature, Ohio State UniversityFrom the Hardcover edition."}, {"id": "B075RRQD13", "genre": "Children's Books", "title": "Car, Car, Truck, Jeep", "description": "This book is bursting with cars, buses, planes, trains, trucks, diggers and many more things that go. Add to that a text that is read aloud to the tune of 'Baa, Baa, Black Sheep' and ... What a combination!Car, car, truck, jeep,have you any fuel?Yes, sir, yes, sir,three tanks full.One for the red bus,one for the train,and one for the pilotin her jumbo jet plane.With bold, colourful illustrations by the instantly recognisable Nick Sharratt and text by talented newcomer Katrina Charman, vehicle-obsessed little ones will never want to put this book down."}]