[{"id": "0545661641", "genre": "Children's Books", "title": "Rescue Princesses #10: The Ice Diamond", "description": "These are no ordinary princesses--they're Rescue Princesses!Princess Maya is delighted to welcome the Rescue Princesses to the Kingdom of Lepari. It's a beautiful land, where the King has sworn to protect the rare snow leopards that live in the mountains.Maya and her new friends are devastated to learn of a plot to harm the animals. The Rescue Princesses and Maya want to save them, but first they must learn to become invisible, with the help of the mysterious Ice Diamond!"}, {"id": "1612443362", "genre": "Children's Books", "title": "Christopher Dragon Goes to the Beach (The Tales of Christopher Dragon Book 3)", "description": "In Christopher Dragon Goes to the Beach, Christopher and his friends spend a day enjoying many seaside activities.  Come along and join them as they have fun collecting seashells, playing beach volleyball, swimming, building a sand castle, parasailing, and having an outdoor barbecue. There is even time for Christopher to make a daring rescue!  This delightful rhyming story continues to prove that love and friendship can exist regardless of color, size and different lifestyles. More adventures to come in The Tales of Christopher Dragon Series."}, {"id": "148671384X", "genre": "Children's Books", "title": "Beauregard in a Box", "description": " Beauregard has always had big dreams. He wanted to travel the world and see all the sights, but how could he possibly go around the globe if he was too scared to fly? With the help of one cardboard box and some amazing new friends, Beauregard goes on the adventure of a lifetime and realizes he is actually pretty brave after all!"}, {"id": "B00NJA038W", "genre": "Children's Books", "title": "My First Montessori Book of Leaf Shapes", "description": "Children are naturally interested in the leaves in their outdoor environment.  In the Montessori Casa, or classroom for three to six year olds, students are introduced to the Botany Cabinet which contains puzzle leaf shapes to compare with nature and trace with a stylus for fine motor control.  Additionally, Leaf Card Set activities strengthen identification and abstraction skills in preparation for reading and writing.  Written by AMI Diploma holder Mary Da Prato and illustrated by Genevieve DeVaney Da Prato, a Museum Art School BFA graduate, My First Montessori Book of Leaf Shapes reinforces classwork and assists parents in helping their child identify and label leaf shapes."}, {"id": "1640289348", "genre": "Children's Books", "title": "Martus and the Cave", "description": "Have you ever wished the Easter Bunny would point your children toward Christ? Martus is a very ordinary rabbit who finds himself in an extraordinary situation when he accidentally becomes trapped in the tomb with Jesus. Martus, whose name means witness, experiences fear, sorrow, and regret. Hungry and afraid, he finally prays that God's will be done. Nothing could have prepared this tiny rabbit for the mighty rush of wind, supernatural fireworks, and awesome demonstration of the power of God's love. Martus becomes a witness to the greatest moment of our collective history. His fortune is not in that the Lord helped him escape by rolling the stone away . . . but in that he was made new.Martus's confession can model for children a simple prayer and admission of need. Martus and the cave is a story about grace: yours and mine. Our circumstances or \"caves\" look different, but our God is the same today and forever. Based on the resurrection story and the biblical truths, \"Do not be afraid for I am with you,\" and \"Let everything that has breath praise the Lord,\" Martus will point your children toward the true joy of Easter, the resurrection of Jesus Christ. "}]