[{"id": "0756605512", "genre": "Children's Books", "title": "The Incredibles: The Essential Guide (DK Essential Guides)", "description": "Readers can follow the story of the Incredibles--a family of undercover superheroes--as they save the world from villains, in a guide to the new Disney/Pixar movie in theaters this holiday season."}, {"id": "0606341560", "genre": "Children's Books", "title": "What Was Ellis Island? (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. From 1892 to 1954, Ellis Island was the gateway to a new life in the United States for millions of immigrants. In later years, the island was deserted, the buildings decaying. Ellis Island was not restored until the 1980s, when Americans from all over the country donated more than $150 million. It opened to the public once again in 1990 as a museum. Learn more about America's history, and perhaps even your own, through the story of one of the most popular landmarks in the country."}, {"id": "0689869983", "genre": "Children's Books", "title": "Colors (Baby Snoopy)", "description": "Introduces preschoolers to the concept of colors as Baby Snoopy and his siblings enjoy a playful day outdoors, running around the green grass under a bright yellow sun that hangs in a clear blue sky."}, {"id": "0394837037", "genre": "Children's Books", "title": "The Truck Book", "description": "Climb behind the wheel of over 50 different types of trucks, from dump trucks and fire trucks to tanker trucks and ice cream trucks! Full of colorful and detailed illustrations and loads of interesting facts, The Truck Book is a must-have for all vehicle fans."}, {"id": "045147113X", "genre": "Children's Books", "title": "A Pocket for Corduroy", "description": "2018 marks the 50th anniversary of Corduroy, Don Freeman's story of a beloved teddy bear and his friend Lisa, which has sold millions of copies and delighted children all over the world. In this sequel to Corduroy, Lisa takes her toy bear to a Laundromat, where he goes on a soapy adventure!    Now, this children's classic is available in board book format, perfect for even the youngest of readers."}]