[{"id": "1600473652", "genre": "Children's Books", "title": "The Practice Room", "description": "There's always been a mystery overshadowing Zoey Browne's life. And then one day, she discovers that she has the ability to travel back in time through the power of music. Before long, Zoey embarks upon a magical journey to uncover the secrets of her past and winds up discovering things about herself she never believed were possible."}, {"id": "B0099QEMR8", "genre": "Children's Books", "title": "George Did It", "description": "Everyone wanted George Washington to be the president. He was responsible, led the army in a fight against the British, and helped write the Constitution. But being the president is a very important job, and George was too nervous. So, to everyone’s surprise, he said no! However, George had many supporters, and with the help of the cheering crowds and loyal advisers and dignitaries, George realized that he didn’t have time to think about how nervous he was, he just had to do his job. With little-known facts and a bit of humor, Suzanne Tripp Jurmain gives readers a glimpse into the more personal side of the first president of the United States."}, {"id": "1629707236", "genre": "Children's Books", "title": "Pop Bios", "description": "Little readers will love these biographies featuring their favorite current stars. Each Pop Bios title will cover the star's early life, their entry into stardom, and what they're up to now. Each title features current photographs, captions, and a timeline. Aligned to Common Core Standards and correlated to state standards. Abdo Kids is a division of ABDO. "}, {"id": "1844271897", "genre": "Children's Books", "title": "Easter Cracked", "description": "Easter Cracked is a vital resource for churches hoping to make the most of the opportunities they have to reach out during Easter. Contains services, craft, drama and more to use with all-ages."}, {"id": "0062110586", "genre": "Children's Books", "title": "Pete the Cat and His Four Groovy Buttons", "description": "An award-winning and bestselling Pete the Cat hardcover picture book!Count down with Pete in this rocking story that makes counting fun! Pete the Cat is wearing his favorite shirt—the one with the four totally groovy buttons.But when one falls off, does Pete cry? Goodness, no! He just keeps on singing his song—after all, what could be groovier than three groovy buttons? The winner of the Theodor Seuss Geisel Honor Award.The fun never stops—download the free groovin’ song!"}]