[{"id": "B00QFFEVR2", "genre": "Children's Books", "title": "Pumpkin Pie ABC Book: Includes all original and additional illustrations.", "description": "This delightful children’s classic consists of 26 short rhymes all relating to the temptingly delicious pumpkin pie waiting to be eaten at the Thanksgiving table. Each letter of the alphabet is used to describe the actions - naughty and nice - of those waiting for their slice. A wonderful holiday book for young children. This edition includes all of the original illustrations from the 1900 edition published by McLoughlin Bros."}, {"id": "0789492695", "genre": "Children's Books", "title": "DK EWD WHALES AND DOLPHINS (Eye Wonder)", "description": "A precursor to DK's award-winning Eyewitness series, Eye Wonder was specially developed for children aged five plus, featuring astonishing photography exhibiting subjects within their natural setting, offering a whole new level of information through powerful images. Each title in the series now contains educational activities including true and false questions, quizzes, matching games, and mazes. Vocabulary is accessible to young readers, with the meanings of new, subject-related words clearly explained. The combination of visuals and informative, accurate text will hook even those children who usually avoid books.Eye Wonder: Whales and Dolphins presents young readers with a wealth of information about these beautiful mammals including where they live, what they eat, how they breed, and the ways in which humans and the environment threaten their very existence."}, {"id": "159598013X", "genre": "Children's Books", "title": "1: The Lost Candy Bar", "description": "The Lost Candy Bar is the true story of a 9-year old boy and his love for his Hershey's candy bar. On a fateful fishing trip with his grandfather, the boat capsizes and the candy bar sinks to the bottom of the Mississippi River. The candy bar is unexpectedly recovered the next day and the young boy devours it just as if it were good as new. This delightful tale entertains both children and adults. The Lost Candy Bar received the Midwest Independent Publishers Association's Merit Award for Humor. It was also named the Book of the Month for Young Readers by the Read On Wisconsin book club."}, {"id": "0431005885", "genre": "Children's Books", "title": "Adventurers: Windsurfing Cased", "description": "Focusing on wind surfing, this is one of a series about outdoor activities. Each book provides background information on the activity, explains its terms, and discusses basic techniques and the use and care of equipment."}, {"id": "B01N75T34S", "genre": "Children's Books", "title": "The Bridge in the Fog: Books for kids: A magical children's fantasy series. (Magora Book 3)", "description": "Holly O’Flanigan’s third year at Cliffony, Academy of the Arts, in the fantasy painting of Magora takes the thirteen-year-old on a quest to find the daughter of the evil Duke of Cuspidor.Along the way, she and her friends Brian, Rufus, and Amanda enter the creepy ward where the dangerous Unfinished are locked up, learn about the mysterious Woodspeople, and discover unbelievable secrets about Holly’s grandfather.In their efforts to find out more about Grandpa Nikolas, they search for the enchanted Bridge in the Fog that has been hidden for years in a secret place.But once they find it, Holly unleashes a nightmare that she never anticipated— a peril that threatens to destroy the entire world of Magora."}]