[{"id": "1611762685", "genre": "Science Fiction & Fantasy", "title": "Dark Blood (Carpathian Novel, A)", "description": "The fates of a warrior reborn and a seductive Dragonseeker are irrevocably entwined in the new Carpathian novel by #1 New York Times bestselling author Christine Feehan, “the queen of paranormal romance” (J. R. Ward). At long last you are truly back with us...Zev Hunter was an elite warrior, a dark-blood dealer of death to rogue Lycans who preyed on mankind. He was a loner, never given to personal attachments, and damned fierce at his job. But Zev begins to question his past and his purpose when he awakens in the darkness of the sacred cave of warriors—and is soothed back to consciousness by the sensuously familiar voice of one woman, the woman who has haunted his fantasies for centuries. She was Branislava, member of the Dragonseeker clan…Mother Earth called the ancients to witness your rebirth… For this half-mage, half-Carpathian temptress, the ritual of awakening Zev to the council of warriors was the only way to save him. Locked away for his own protection, the time has now come for his rebirth, for his blood to stir with that of the ancient warriors before him. He has been assured by Branislava that their fates are entwined, that their spirits are woven together for eternity and that his new purpose in life is beyond imagining.Now, with a blood-sworn vow of honor, mercy and endurance, and under the influence of a siren as bewitching as Branislava, Zev begins to wonder what his purpose is, what it means for the future of the Carpathians and what it is about his rebirth that he has to fear…"}, {"id": "0449208133", "genre": "Science Fiction & Fantasy", "title": "Lucifer's Hammer", "description": "The gigantic comet had slammed into Earth, forging earthquakes a thousand times too powerful to measure on the Richter scale, tidal waves thousands of feet high. Cities were turned into oceans; oceans turned into steam. It was the beginning of a new Ice Age and the end of civilization. But for the terrified men and women chance had saved, it was also the dawn of a new struggle for survival--a struggle more dangerous and challenging than any they had ever known....\"Massively entertaining.\"CLEVELAND PLAIN-DEALER"}, {"id": "B0071OU90O", "genre": "Science Fiction & Fantasy", "title": "The Black Ships", "description": "First in the Black Ships SeriesOur planet was just one small island in the midst of a vast, empty sea. For millennia, its inhabitants thought they were alone – until they took their first tentative steps out of the cradle. As the nations of Earth struggle to establish a fragile colony on the surface of Mars, they suddenly lose all contact with their settlers.In the days that follow, it becomes abundantly clear that humans are not the only ones intent on exploiting the resources of the solar archipelago. In a desperate bid for freedom, Humanity must undergo social and economic changes on a scale previously unheard of. An alien republic, bent on colonization, has seized a foothold on Mars, preparing a forward base for their invasion. Soon, their fleet will be ready to land troops on Earth.In the midst of growing turmoil, the struggle to build an effective defense leads the species to a turning point. The smallest of chances may determine the difference between freedom and eternal subjugation.(Approx 99,000 words)"}, {"id": "B06W2LHFZB", "genre": "Science Fiction & Fantasy", "title": "Pig Dog Creek", "description": "In 1957, 12-year-old Annie Louise Slayton is the victim of an arranged marriage in order to pay a debt owed by her father. She is illiterate and naive in the small town of 250 people in northwestern Tennessee. She is afforded no privileges and is forbidden to leave the home. She bears three children -- one by her husband and two by his stepfather. In the early mornings before the family arises, she sneaks out to the creek behind the home and finds solace in the soothing water, briefly escaping captivity and daydreaming of a better life.Everything changes for Annie on a May morning in 1962 when she witnesses a supernatural occurence in the creek."}, {"id": "0786966181", "genre": "Science Fiction & Fantasy", "title": "D&D Character Sheets", "description": "Inside the pockets of this lavishly illustrated protective folder, you’ll find a full set of fifth edition Dungeons & Dragons character sheets for use in any D&D campaign.This product includes three additional styles of double-sided character sheets giving veteran players options based on their individual play preference and spell sheets for keeping track of their magical repertoire. Each character sheet provides plenty of room to keep track of everything that makes a character unique.Also included is an introductory character sheet designed specifically to help ease new players into the game.Fans can use these character sheets to welcome new players to the world’s greatest roleplaying game or choose a variant that fits their preferences."}]