[{"id": "0764105353", "genre": "Children's Books", "title": "Warships (History Series)", "description": "Describes the types of ships used in battle throughout history, from ancient galleys and Viking longships to modern submarines and aircraft carriers"}, {"id": "B005SMVQA8", "genre": "Children's Books", "title": "Snow White: A Tale from the Brothers Grimm", "description": "Last fall, Sterling republished Charles Santore's critically acclaimed version of The Wizard of Oz. Now, we proudly welcome another of his lavishly illustrated classic tales: Snow White. This exquisitely retold and newly designed edition remains faithful to the Grimms' beloved original. Featuring dreamy vistas, lush forests filled with animals, expressive characters, and an unforgettably beautiful heroine, it weaves a magical spell that will enchant children. "}, {"id": "B01N4LFUIP", "genre": "Children's Books", "title": "The Reluctant Dragon: Illustrated", "description": "In this delightful tale an unnamed boy discovers that there is a dragon living in the downs above his house. But this is no ordinary dragon, this is an erudite, poetry-loving dragon. The boy and the dragon become friends in short order. Unfortunately, the villagers also discover that there is a dragon living in the downs and they send for the great dragon slayer St. George. The boy and the dragon need a plan, a plan that will save the life of this unique and delightful dragon. This edition is illustrated with whimsical dragons throughout. From the author of 'The Wind in the Willows.'"}, {"id": "068981979X", "genre": "Children's Books", "title": "Let My Babies Go: A Passover Story", "description": "While the grownups are busy with Passover preparations, the Rugrat babies get trapped in the attic, in a picture book version of a special episode of the television cartoon series shown on the Nickelodeon cable network. Original. TV tie-in."}, {"id": "0794428657", "genre": "Children's Books", "title": "The Amazing Human Machine: Book with Acetate Body System Cards", "description": "Take a tour of the human body in this fact-filled book that includes six body system acetate cards: muscular, cardiovascular, respiratory, nervous, digestive, and skeletal.Have you ever stopped to think about how amazing your body is? Thousands of parts all operate together like a living machine—more complex than any machine on Earth. Inside this book, kids will learn about many of the systems that make up the body—skin, skeletal, nervous, cardiovascular, respiratory, digestive, and muscular. Body-shaped acetate cards printed with six different body systems help kids see how the systems work together to create a multifaceted learning approach to anatomy."}]