[{"id": "1981350217", "genre": "Children's Books", "title": "Muscovy Duck: Amazing Fun Facts and Pictures about Muscovy Duck for Kids", "description": "Muscovy Duck: Amazing Fun Facts and Pictures about Muscovy Duck for Kids"}, {"id": "B00DPS9D1G", "genre": "Children's Books", "title": "Ninja Meerkats (#7) The Ultimate Dragon Warrior", "description": "Armed to the teeth with ninja know-how, this ultimate fighting force has one goal—to thwart the evil ringmaster's plans for world domination. Ninja-Boom! In Book 7, the Ninja Meerkats are invited to a mysterious island to take part in an elite fighting competition. But everything on the island is not as it seems, and the Meerkats suspect that the Ringmaster is plotting another of his evil plans. Do the Meerkats have what it takes to become champions in the most deadly contest of all—their fight against the Ringmaster?"}, {"id": "B071CHXW2X", "genre": "Children's Books", "title": "Jolly Time Books:  How to Be Cool: A happy story about making new friends by being yourself (Children’s Bedtime Book) (Storytime Book 5)", "description": "Freddy Frog sees a new girl. But how can he meet her? Kelly suggests that Freddy just be himself and say hello. Freddy insists on showing off to catch her attention. BOING! BOING! BOING! Will that work?Jolly Time Books tell exciting stories with positive messages the whole family can enjoy. Jolly Time Books are full of individually hand-drawn vivid and colorful illustrations that will spark the imagination of any child."}, {"id": "1566867657", "genre": "Children's Books", "title": "Nintendo 64 Games Guide, Volume 3 (Totally Unauthorized)", "description": " Totally Unauthorized Nintendo 64 Games Guide, Volume 3 is an update to the extremely successful two volumes of this compendium Volume 3 will cover essential secrets, stats and strategies in detail for the hottest Nintendo 64 titles Currently anticipated titles are Diddy Kong Racing, Bomberman 64, Mace: The Dark Age, Duke Nukem 64, WCW Wrestling, Madden 64 and Mission Impossible "}, {"id": "0823440117", "genre": "Children's Books", "title": "Dinosaurs!", "description": "Dinosaurs ruled Earth for millions of years. Gibbons's simple yet informative text and vividly detailed illustrations depict the most up-to-date information available about these magnificent creatures."}]