[{"id": "0316381004", "genre": "Science Fiction & Fantasy", "title": "Chimera (Parasitology Trilogy)", "description": "The final book in Mira Grant's terrifying Parasitology trilogy. The outbreak has spread, tearing apart the foundations of society, as implanted tapeworms have turned their human hosts into a seemingly mindless mob. Sal and her family are trapped between bad and worse, and must find a way to compromise between the two sides of their nature before the battle becomes large enough to destroy humanity, and everything that humanity has built...including the chimera. The broken doors are closing. Can Sal make it home?ParasitologyParasiteSymbiont ChimeraFor more from Mira Grant, check out:Newsflesh FeedDeadlineBlackoutNewsflesh Short Fiction Apocalypse Scenario #683: The BoxCountdownSan Diego 2014: The Last Stand of the California BrowncoatsHow Green This Land, How Blue This SeaThe Day the Dead Came to Show and TellPlease Do Not Taunt the Octopus "}, {"id": "B074NRBMQK", "genre": "Science Fiction & Fantasy", "title": "29 Science Fiction Short Stories", "description": "The eye in the sky watches as you venture into space, look for safe food, and coexist with humanoids. How long will you be free to leave your pod in your scooter and fly around looking for coffee or even teleporting for pasta? What does the future hold?"}, {"id": "1930709013", "genre": "Science Fiction & Fantasy", "title": "Warrior Beast (Bloodsong Saga, v.3) (Bloodsong Saga Ser. 3)", "description": "Faithfully set in the mystical world of Scandinavian mythology, this is the first book in the exciting saga of the warrior woman Bloodsong, who fought her way up from slavery to lead millions to freedom. In this book, Bloodsong faces the greatest enemy she has ever known--her own son Lokith, the demon of Helheim. Features a spectacular cover painting by Boris Vallejo."}, {"id": "0786449829", "genre": "Science Fiction & Fantasy", "title": "\"Throw the book away\": Reading versus Experience in Children's Fantasy", "description": "Children's literature is an excellent way to educate children, on everything from social behavior and beliefs to attitudes toward education itself. A major aspect of children's literature is the importance of books and reading. Books represent adult authority.  This book examines the role that books, reading and writing play in children's fantasy fiction, from books that act as artifacts of power (The Abhorsen Trilogy, The Spiderwick Chronicles, Harry Potter) to interactive books (The Neverending Story, Malice, Inkheart) to books with character-writers (Percy Jackson, Captain Underpants). The author finds that although books and reading often play a prominent role in fantasy for children, the majority of young protagonists gain self-sufficiency not by reading but specifically by moving beyond books and reading."}, {"id": "1601250797", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Chronicles: Classic Monsters Revisited (Pathfinder Chronicles Supplement)", "description": "Pathfinder and the Rise of the Runelords Adventure Path famously reimagined goblins, detailing their culture, mannerisms, and tactics in a way that made a boring old monster one of the most hotly discussed foes in fantasy roleplaying. Now, the minds that bring you Pathfinder have applied the same method to ten \"classic\" monsters, providing complete ecological discussions and adventure ideas involving orcs, ogres, goblins, hobgoblins, trolls, bugbears, and more in this lavishly illustrated, full-color overview that is both fun to read and fun to use at the gaming table."}]