[{"id": "1932530673", "genre": "Children's Books", "title": "New York Yankees 101 (101 My First Team Board Books)", "description": "New York Yankees 101 is required reading for every Yankees fan! From the great players including Lou Gehrig and Babe Ruth to the fun of watching the grounds crew dance to YMCA in Yankee Stadium, you'll share all the memories with the next generation. Enjoy all the traditions of your favorite team, learn the basics about playing baseball and share your passion for America's pastime!"}, {"id": "1878067885", "genre": "Children's Books", "title": "Changing the Game: The Stories of Tennis Champions Alice Marble and Althea Gibson (Women Who Dared Series)", "description": "Written in a lively, readable style, this book profiles two women who broke new ground in tennis. Alice Marble (1913-1990) became the first woman to play power tennis, and by 1939 had won several Wimbledon titles. Althea Gibson (1927- ) broke the racial color line in tennis by entering many previously white-only tournaments, and became the first black person to win both the U.S. Open and Wimbledon competitions."}, {"id": "1590844661", "genre": "Children's Books", "title": "Human Body (1000 Things You Should Know About...)", "description": "Presents a collection of facts about the human body and its systems. presented in 100 illustrated topic panels, each with ten key facts."}, {"id": "1616207477", "genre": "Children's Books", "title": "The Unbelievable FIB 2: Over the Underworld", "description": "Friends ABE and Pru race to stop the chain of events foretold in Norse myth to lead to Ragnarok--the war that ends the world. It’s been a year since friends ABE and Pru joined Mister Fox’s Fantasy Investigation Bureau to save their hometown from an invasion of Viking gods and giants. Life has been incredibly ordinary ever since. Then the Norse Allfather, Odin, appears with terrible news: Baldur, his favorite son, has been murdered--the first step in a fated chain of events that leads to Ragnarok.Over the Underworld, the second book in the Unbelievable FIB series, takes ABE and Pru on a thrilling new adventure. They outrun trolls, explore Asgard and the Viking underworld, and try to outsmart the Queen of the Dead herself to save the world--and survive seventh grade."}, {"id": "1932333819", "genre": "Children's Books", "title": "Air Pioneers (History Makers (Chrysalis))", "description": "Throughout history there have been people who have inspired others with their innovative minds or leadership qualities. This series reveals the lives of historical figures that have become legends, and describes their enduring legacies. Ages 10+"}]