[{"id": "B0163NLZ8I", "genre": "Children's Books", "title": "Moore Zombies: Zombie World", "description": "Moore Zombies Chapter Book #2Where can zombies mingle amongst humans without being detected?  At Zombie World!  The Moore zombie children are asked by their Pop to help out with some of the attractions.  Gothina and Baby Zom dress up humans into zombies.  Broheimer and Kamper give a tour of the Creepy Show.  However, the kids soon realize they are being followed.  When everyone gets together at the Brain Food Court, things turn up missing.  Who is to blame, and what will be done about it?  Find out at Zombie World!"}, {"id": "0615539815", "genre": "Children's Books", "title": "How Do You Hide a Dinosaur?", "description": "Beautiful illustrations help tell the story of 8 year old Jimmy who, after a bad storm, discovers a baby dinosaur on his way home from school.  Though his parents have told him he is not responsible enough to have a pet, he decides to secretly keep and hide the small dinosaur anyway.  This becomes an enormous problem!  He doesn't count on the dinosaur outgrowing his room, his house, and the entire neighborhood.  When the neighbor, old Mr. Crabtree, threatens to turn Jimmy and his pet into the local authorities for violating zoning laws, Jimmy has to think quickly!"}, {"id": "1772758035", "genre": "Children's Books", "title": "Disney/Pixar Monsters Inc.: The Story of the Movie in Comics", "description": "Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. But when a little girl named Boo wanders into their world, it's the monsters who are scared silly!Give your best scream in this graphic novel adaptation of Disney/Pixar Monsters, Inc., drawn by Disney/Pixar artists."}, {"id": "B06Y14KNJP", "genre": "Children's Books", "title": "Good Sleep After A Long Day: With this book, you and your little one will discover what animals like to eat and how sweet their dreams are at night. (Sweet Dreams Book 1)", "description": "Dear reader, This book will introduce you and your little one to different animals. You will discover what they like to eat and how sweet their dreams are at night. Try showing your baby different objects in the book, pointing at them and pronouncing their names. Eventually, start asking your child to show you one thing or another.We hope you enjoy reading the book!"}, {"id": "1846660939", "genre": "Children's Books", "title": "Wild Animals (Magnetic Story & Play Scene)", "description": "From cheetahs to leopards, flamingoes to elephants, pre-school children will enjoy working out which magnets go in the magnetic spaces on each page, prompted by simple text. Once the magnets have all been stuck down, and the child has reached the last spread, a giant play scene can be folded out from the back. Here, the child can recreate scenes from the safari-themed story, or create ones of their own."}]