[{"id": "0448448394", "genre": "Children's Books", "title": "Who Was Queen Elizabeth?", "description": "Our bestselling series is fit for a queen! The life of Queen Elizabeth I was dramatic and dangerous: cast out of her father?s court at the age of three and imprisoned at nineteen, Elizabeth was crowned queen in 1558, when she was only twenty-five. A tough, intelligent woman who spoke five languages, Elizabeth ruled for over forty years and led England through one of its most prosperous periods in history. Over 80 illustrations bring ?Gloriana? and her court to life."}, {"id": "0062311387", "genre": "Children's Books", "title": "Darkmouth #4: Hero Rising", "description": "“Ghostbusters meets Percy Jackson as written by Terry Pratchett.” —Kirkus Reviews“Incredible.” —Eoin Colfer, New York Times bestselling author of Artemis FowlFinn was born to stop the monsters from invading his town. But he’d really rather not. He dreams of having an ordinary life, and right now, things can’t get any worse. Legends are running riot. Half-Hunters are out of control. And Darkmouth has been taken away from him.But something even more terrifying lurks beneath the surface: an ancient horror threatening both our world and the Infested Side.So scratch that. Things can get worse. Much worse.It’s up to Finn to save Darkmouth. Too bad he’d rather be doing…anything else. Perfect for fans of How to Train Your Dragon, the final book in the Darkmouth series is a hilarious and action-packed adventure filled with beasts of the winged, fanged, and hungry variety."}, {"id": "1474870430", "genre": "Children's Books", "title": "Music and Magic: Over 50 Stickers! (Disney Princess: Beauty and the Beast)", "description": "It's time for some fun and adventure in Disney Princess Beauty and the Beast Music and Magic. It is packed with over 50 stickers, coloring, and activities. Complete the sticker scenes with Lumiere, color in Belle's beautiful dress, and enjoy many more enchanting activities. This book also comes with a free bonus code for a Disney digital storybook."}, {"id": "0152033556", "genre": "Children's Books", "title": "Androcles And The Lion", "description": "Androcles, a runaway slave, is befriended by a lion when he removes a huge thorn from its paw. For years the two live to-gether in the desert, until soldiers capture Androcles and are ordered to throw him to the beasts. Led into the grand arena, Androcles falls to his knees, accepting his fate, but then he looks into the eyes of the lion and recognizes his old friend. Amid cheers from the crowd, Androcles and the lion are set free. The earliest version of the well-known tale, Apion’s eyewitness account, is the source for this dramatic retelling."}, {"id": "1403479062", "genre": "Children's Books", "title": "Tunnels (Building Amazing Structures)", "description": "Explores amazing structures from around the world, looking at their development, techniques and materials used. This work offers information, charts and facts, covering various aspects of the design and construction of structures. It features photographs, and includes experiments to help understanding."}]