[{"id": "0439368308", "genre": "Children's Books", "title": "The Young Man and the Sea", "description": "A story of determination and survival from the acclaimed author of FREAK THE MIGHTY. \"This thrilling and elegant book ... will hold the interest of even the most stalwart landlubber.\" -- PWTwelve-year-old Skiff Beaman's mom just died, and his fisherman dad is too depressed to drag himself off the couch and go to work. So these days Skiff has to take care of everything himself. But when his dad's boat sinks, Skiff discovers it will cost thousands to buy a new engine. Skiff's lobster traps won't earn him enough, but there are bigger fish in the sea -- bluefin tuna. If he can catch one of those monster fish, Skiff just might save the boat -- and his family."}, {"id": "0590871765", "genre": "Children's Books", "title": "The Red-Eyed Tree Frog", "description": "This frog found in the rain forest of Central America spends the night searching for food while also being careful not to become dinner for some other animal."}, {"id": "075697934X", "genre": "Children's Books", "title": "The Silver Locket (Angelina Ballerina (8x8))", "description": "Miss Lilly is having a party, and Angelina wants to look very special. So she borrows her motheras special locket without asking. Angelina has so much fun at the party, but when it is time to leave, she canat find the locket! What will Angelina do?"}, {"id": "0857511076", "genre": "Children's Books", "title": "100% Unofficial Tribute to The Hunger Games", "description": "Packed with info on Panem, from the different Districts to the controlling Capitol, this is your essential unofficial guide to The Hunger Games. Filled with fantastic facts and cool quotes, this unofficial companion has all you need to know about the heroine and heroes of The Hunger Games. Check out the characters, learn all about the cast of the brand new film and discover the ultimate celeb Hunger Games fans. Includes a giant, double-sided poster."}, {"id": "0021170703", "genre": "Children's Books", "title": "1 & 2: McGraw-Hill My Math, Grade 2, Student Edition Package, Volumes 1 and 2 (ELEMENTARY MATH CONNECTS)", "description": "This set provides the consumable Student Editions, Volumes 1 and 2, which contain everything students need to build conceptual understanding, application, and procedural skill and fluency with math content organized to address CCSS. Students engage in learning with write-in text on vocabulary support and homework pages, and real-world problem-solving investigations."}]