[{"id": "1928999107", "genre": "Science Fiction & Fantasy", "title": "Pendragon Tales of Mystic Tournament *OP (King Arthur Pendragon, 2723)", "description": "Revises and reprints three adenvtures from early editions of Pendragon, all set early in Arthur's reign. Also includes info on \"Life at Court\" and \"Dreaming and Dream Magic\".  In \"The Adventure of the Grey Knight\" Merlin prophecies that Gawaine will die at the hands of the vile Grey Knight, with only one chance to save him. There are ancient artifacts of extraordinary, magical power. One of the Thirteen Treasures of Britain is the key to Gawaine's salvation. Arthur proclaims a solemn quest: comb the length and breadth of England to find these treasures before Gawaine and the Grey Knight meet. Set in PHASE TWO (515).  In \"The Tournament of Dreams\" King Belinans, proud ruler of Sugales, proclaims a royal tournament! The knights of Sugales stand ready to prove that their courage and skill at arms are the greatest in Britain. Set in PHASE TWO (516).  In \"The Circle of Gold\" the King of the Circle of Gold presents a challenge. Can anyone meet the knights who guard the way into his mysterious land and defeat each one in a chivalrous combat? Set during PHASE TWO (519+)."}, {"id": "B076MLF2CF", "genre": "Science Fiction & Fantasy", "title": "Purity of Mind", "description": "Everyone in the desert city of Opal has a handful of magic: Enough Water to fill a cup, enough Air to make a breeze, enough Earth to dig a furrow, enough Fire to kindle a hearth, and enough Mind to hear the thoughts of those around them.  It is enough to get by, but not enough to change anyone's life.  Even the wizards are simply people who have trained all their lives.  The man known only as Bishop is one of these ordinary people, but he will discover the hidden world that the Pure would rather everyone remain unaware of....For all are descended from the Pure.  With power to engulf an entire city in flames, should they be a Pure Fire.  A Pure Water can call the flood, Pure Air the storm, Pure Earth the quake.  And a Pure Mind could own everyone within the city walls without them even being aware of it.  It's said they are the gods reincarnated, but they act just as other people.  Should they bear children, that child has but a fraction of their power, and a mixing of their domains: Steamlings are the offspring of Fire and Water, Mudslingers that of Water and Earth.The Pure are hunted: their powers are as coveted as they are dangerous.  But they do not simply hide, not simply react.  They are planning.  Some plan for the betterment of their people.  Others plan only for their survival.  Many plan selfishly, to use their power to gain more power.And some plan to heave everything into the Void."}, {"id": "B00EA9E3FU", "genre": "Science Fiction & Fantasy", "title": "Rotten Row", "description": "Rotten Row is the worst place we’ve made.Humankind can travel to the stars — but only those content to be flung as a datastream through space, flitting from male to female, dark to fair, one random discard body to the next. Those who go are the Upshot, rare individuals subject to their own rigid laws.And then there’s Rotten Row.Outcasts in breach of all codes, in Rotten Row people design their own bodies and sell them on for re-use after. Outlandish bodies: furred and feathered, winged and hooved and worse.duLaine is an artist, but all art is about identity. Where one blurs into the other beyond physical limits and legal restraint, what is art worth and how can anyone be certain who they are?"}, {"id": "0147517575", "genre": "Science Fiction & Fantasy", "title": "Luke Skywalker Can't Read: And Other Geeky Truths", "description": "“Ryan Britt is . . . the Virgil you want to guide you through the inferno of geekery.” —Lev Grossman, author of the bestselling Magician's trilogy Pop Culture and sci-fi guru Ryan Britt has never met a monster, alien, wizard, or superhero that didn’t need further analysis. Essayist Ryan Britt got a sex education from dirty pictures of dinosaurs, made out with Jar-Jar Binks at midnight, and figured out how to kick depression with a Doctor Who Netflix-binge. Alternating between personal anecdote, hilarious insight, and smart analysis, Luke Skywalker Can’t Read contends that Barbarella is good for you, that monster movies are just romantic comedies with commitment issues, that Dracula and Sherlock Holmes are total hipsters, and, most shockingly, shows how virtually everyone in the Star Wars universe is functionally illiterate.    Romp through time and space, from the circus sideshows of 100 years ago to the Comic Cons of today, from darkest corners of the Galaxy to the comfort of your couch. For anyone who pretended their flashlight was a lightsaber, stood in line for a movie at midnight, or dreamed they were abducted by aliens, Luke Skywalker Can't Read is full of answers to questions you haven't thought to ask, and perfect for readers of Chuck Klosterman, Rob Sheffield, and Ernest Cline."}, {"id": "B017RFCRLU", "genre": "Science Fiction & Fantasy", "title": "Revelation (Ancient Hopes Broken Trilogy Book 1)", "description": "In the land of Mundus, the high priests rule with an iron fist, their power stemming from the gods. No one dares to stand against their laws for fear of reprisal.  Until now. In a world where truth is secondary to power but the key to the future, Anne and Galavon, two unlikely individuals, find love. But the pair is thrust into a dangerous world where they find themselves separated and pitted against the gods themselves. Will they embrace and survive their newly discovered powers? Will they overcome the trials that lay before them?  Will love prevail and bring them back together?Grab your sword, ready your spells, and prepare for an adventure once you hear the Revelation."}]