[{"id": "0679729895", "genre": "Science Fiction & Fantasy", "title": "Tales of the Unexpected", "description": "In this collection of stories, Dahl tantalizes, amuses, and sometimes terrifies readers into a sense of what lurks beneath the ordinary. Included in this collection are such notorious gems of the bizarre as “The Second Machine,” “Lamb to the Slaughter,” “Neck,” and “The Landlady.”   Other stories explore: A wine connoisseur with an infallible palate and a sinister taste in wagers. A decrepit old man with a masterpiece tattooed on his back. A voracious adventuress, a gentle cuckold, and a garden sculpture that becomes an instrument of sadistic vengeance. Social climbers who climb a bit too quickly. Philanderers whose deceptions are a trifle too ornate. Impeccable servants whose bland masks slip for one vertiginous instant.    With the inventive power of a Thomas Edison and the imagination of a Lewis Carroll…Roald Dahl is a wizard of comedy and the grotesque, an artist with a marvelously topsy-turvy sense of the ridiculous in life.” –Cleveland Plain Dealer"}, {"id": "B074DVKQTJ", "genre": "Science Fiction & Fantasy", "title": "The Chosen One: Childrens fantasy, witches, dragons, magic, princess, swords, magicians, Merlin, King Arthur (Through the Standing Stones Saga Book 1)", "description": "You’ll love how John Lewis, an ordinary schoolboy from a family of witches, has his magic awakened at Glastonbury. Then he is lured by a mysterious force to a set of standing stones which lead him to another world inhabited by flying men, evil wizards, beautiful princesses and dragons."}, {"id": "1537200887", "genre": "Science Fiction & Fantasy", "title": "The Other", "description": "This YA-adult thriller takes place in the Zion Republic, a remnant of the American partition. Jason is being raised in an institution, the Centre, as a source of spare body parts for an identical twin, who is being groomed for eventual leadership in Zion. Jason grows to manhood, surrounded by cruel Centre keepers, sharing a strange mental bond with his twin, though neither is aware of the existence of the other. Unwilling to submit to an eventual  \"harvest\" by Centre surgeons when his twin becomes ill, Jason plots his escape from the Centre, placing him at odds with a wild and hostile environment, his twin and Zion’s highest authorities."}, {"id": "0810843803", "genre": "Science Fiction & Fantasy", "title": "L. Frank Baum's World of Oz: A Classic Series at 100 (Children's Literature Association Centennial Studies)", "description": "Although L. Frank Baum's The Wonderful Wizard of Oz was published one hundred years ago, literary critics and historians continue to discover new approaches to the fantastic world of Oz. The second in a new series of anthologies sponsored by the Children's Literature Association, this collection of essays represents some of the most interesting of these new approaches.Beginning with a glance back over the entire history of research and commentary on the Oz books, this work is organized in three main sections. Essays in the \"Origins of Oz\" examine Frank Baum's personal history and unlock the mystery of one of the most bizarre episodes in the Oz books. \"The World of Oz\" looks at three very different aspects of Baum's world: its concept of home and family, its sense of humor, and its relationship to its young readers. \"Oz on Screen\" features both the silent films Baum produced himself and MGM's classic movie The Wizard of Oz."}, {"id": "B0789N9PTC", "genre": "Science Fiction & Fantasy", "title": "Dead Men and Dynamite (Epiphany Club Book 5)", "description": "Adventurer Dirk Dynamo finally has all the clues he needs, and is heading into Egypt to find the lost Great Library of Alexandria. But as he sets out on the final leg of his trail, others are there ahead of him, people who would use the knowledge of the Great Library to nefarious ends. As he races spies and criminals through the land of the Pharaohs, Dirk must decide how far he will go for knowledge, and what he really values most in the world – life, love or learning."}]