[{"id": "B06Y4847BK", "genre": "Children's Books", "title": "Mirai: Worst Birthday Ever! (English Version): 001", "description": "Mirai, a young Japanese-Australian girl, is about to have the worst birthday ever! But, if she survives the day, she just might make new friends and have a completely new life!“Mirai: Worst Birthday Ever!” was written by Hamish Downie, the screenwriter of the multi-award winning short film “An American Piano”, which was shown at TIFF Kids 2015. This is his first comic book. He was largely inspired by the first four years he spend living in Japan and the large learning"}, {"id": "B01M4O6AX6", "genre": "Children's Books", "title": "Lana & the Water Carrier (Gemini Book 1)", "description": "Think you're smarter than \"Logical Lana\" McNair?Lana is a clever 13-year-old girl with a lot of issues. She's obsessed with baseball and the color pink. She won't comb her hair. She won't wear dresses. Most of the time, she won't even wear shoes! Plus, no matter how hard she tries, sometimes she just can't control her impulses--especially when she's hungry!She is also on a mission: Her parents have vanished and she needs to find them. And a mysterious package has arrived that just might hold a clue!But first she must help Ganymede, a desperate 14-year-old prince trapped as a servant to the Gods of Mount Olympus. And things are not always as they seem.All of Lana's mental (and physical!) skills are put to the test in this thrilling story. Danger lurks at every turn. Good thing she always thinks a few steps ahead!Come along on this astronomical adventure and test your own sleuthing skills! It'll keep you guessing right up until the very end!"}, {"id": "1554530792", "genre": "Children's Books", "title": "This is Daniel Cook on a Hike", "description": "With his bug spray ready, Daniel's off on a guided walk through the forest in this title in the This is Daniel Cook series. Insects, animals and plants are just a few of the things to learn about on a nature hike. Charmed by his boundless enthusiasm, children will be eager to join Daniel and learn about the world from a kid's perspective. Each book closes with an activity that encourages young readers to create along with Daniel. Kids will be eager to join in the adventures of a little boy who gets to do so many different things. If Daniel can do it, so can they!"}, {"id": "B074MJFGDK", "genre": "Children's Books", "title": "Valentine Shmellentine", "description": "A red paper airplane flies out of a heart-shaped cloud on Valentine's Day, and it's caught by fifth grader Jana Banana, who's on the way to catch her school bus. It turns out to be a magic valentine! The teachers and students at Ron Erhardt Elementary School in Mandan, North Dakota, are about to have a Valentine's Day they will never forget!"}, {"id": "B077XNLQZZ", "genre": "Children's Books", "title": "And Thus There Was Dog...", "description": "This is the mythical story of Amani - a young omega wolf who embarks alone on an epic, treacherous journey through snow-covered mountain ranges to an unknown destination. His chance encounter with an infant of a tribe of stone-age cave dwellers and the resulting emotional bond that forms between them is to change the course of history.A story for wolf lovers, dog lovers and especially, perhaps, their children. It incorporates factual information (canine behavioural and geographical) within the fiction, as well as a few subtle 'hidden issues' which have been left to the speculation of the discerning reader."}]