[{"id": "1981544550", "genre": "Children's Books", "title": "Christmas Sketchbook (Sketchbooks) (Volume 1)", "description": "Get your blank Christmas Sketchbook and start drawing, doodling or sketching your Christmas ideas and turn them into art. This blank sketchbook created by bestseller author Amit Offir was made to get you in the right mode to draw. This book is a part of a series."}, {"id": "B0091NF03Y", "genre": "Children's Books", "title": "Cooking On A Stick: Campfire Recipes for Kids (Acitvities for Kids)", "description": "6 X 8 In 48 pages  48 Full-Color illustrations Ages 7 To 11   With These Sensible and Sensitive Safety-First Recipes, This Upbeat Book Guides Kids Through The Fun and Rewarding Process of Campfire Cooking. Whether They're At A Campground With Other Campers, In The Forest With A Scouting Group, Or Simply In Their Own Backyard With Their Family. They'll Become Familiar With All The Basic Methods For Successful Outdoor Cooking.   Three Cooking Methods Are Explained With Recipes Given For Each:  Cooking On A "}, {"id": "0375866752", "genre": "Children's Books", "title": "Attack of the Shark-Headed Zombie (A Stepping Stone Book(TM))", "description": "New to the Random House list is author Bill Doyle with a tale of monsters, magic, and mayhem.After Keats and Henry lose their bikes, they need money—fast. So the help-wanted ad at the supermarket seems ideal for them. All they have to do is weed Hallway House's garden, find some lightbulbs in the attic, sweep the garage . . . and battle a shark-headed zombie. But no one told them about the giant bookworms in the library, the toe-biting carpet in the halls, and the kitchen sinkhole!"}, {"id": "1847495591", "genre": "Children's Books", "title": "The Adventures of Pipi the Pink Monkey", "description": "Based on an original story by the author of Pinocchio, Pipi the Pink Monkey has been expanded and translated for the first time by Alessandro Gallenzi and illustrated by Axel Scheffler.Pipì isn't like his four brothers or the other young monkeys living in the forest of Hullabaloo: he has bright-pink fur, a mischievous character and a rebellious streak that lands him into all sorts of scrapes. In this story, an expanded version of Collodi's original tale, we see him lose his tail to an ancient crocodile, end up as a valet to a young master, fall into the hands of flying bandits and become emperor of a tribe of apes.Collodi wrote this story immediately after Pinocchio, and the little monkey's adventures present clear similarities, both in terms of themes and characters, with his more celebrated masterpiece. This rediscovered gem of Italian literature, beautifully illustrated by Axel Scheffler and preserving all of Collodi's trademark wit and linguistic crispness, will delight and enthral a new generation of children."}, {"id": "1442473320", "genre": "Children's Books", "title": "U.S. Presidents (Ken Jennings’ Junior Genius Guides)", "description": "Become a presidential pro with this interactive trivia book from Jeopardy! champ and New York Times bestselling author Ken Jennings.With this book about U.S. Presidents, you’ll become an expert and wow your friends and teachers with clever facts: Did you know that Abraham Lincoln made Thanksgiving a national holiday? Or that Jefferson introduced the first French fries at a fancy state dinner? With great illustrations, cool trivia, and fun quizzes to test your knowledge, this patriotic genius guide will have you on your way to whiz-kid status in no time!"}]