[{"id": "1626724369", "genre": "Children's Books", "title": "Little Plane Learns to Write", "description": "The best thing about flight school is that Little Plane gets to learn how to sky-write! He adores practicing ARCS! He excels at practicing DIVES! But not everything is easy and fun. Little Plane loathes practicing LOOPITY-LOOPS. They make him dizzy.Find out what it will take to make Little Plane learn how to write in this little book about big dreams from award-winning author Stephen Savage.A Neal Porter Book"}, {"id": "B013MF3I8U", "genre": "Children's Books", "title": "Duckworth Redux (The Duckworth Chronicles)", "description": "Life just never seems to slow down for Duckworth and his friends.  In this third volume of Duckworth stories, Duckworth makes it rain potato chips (at least, that's what everyone thought), then went searching for the fabled River of Slime, had to get a collar from a big Smith Island cat, met an invisible Mallard, and heard about the time his great grandfather got involved with a Martian invasion in New Jersey.Even flying south isn't any quieter, as Duckworth, Chuck, Danielle Featherby, and Cheesy Quacker find a mysterious land of mechanical animals in the middle if Florida.Yes, Duckworth gets involved in some tricky situations, but as his friends on Pickle Creek will tell you, \"Duckworth always finds a way.\""}, {"id": "1773060163", "genre": "Children's Books", "title": "The Outlaw", "description": "In this spare and powerful story set in the Old West, people in a small town live in constant worry of another visit from the Outlaw. Then the Outlaw suddenly and mysteriously disappears. Time passes, and one day a stranger rides into town. He takes it upon himself to fix everything that is in disrepair — the clapboard schoolhouse, the train station platform. He even builds a horse trough. But when someone recognizes him as the Outlaw, the crowd turns on him. It takes the courage of a small boy to change the course of events … The subtle, beautiful mixed-media art with its nineteenth-century textural references perfectly complements this original story from debut author and illustrator Nancy Vo."}, {"id": "0613164741", "genre": "Children's Books", "title": "Castle Under Seige (Age of Castles)", "description": "This is a study of weird and wonderful sieges of medieval castles between 1000 and 1500 AD. It looks at preparations for defending a castle, methods of attack and defence, rules of sack and pillage, crusades, and the effect of gunpowder, cannons and bombardments. Projects include planning a seige."}, {"id": "0606232028", "genre": "Children's Books", "title": "Shadow Wolf (Turtleback School & Library Binding Edition) (Wolves of the Beyond (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Returning to his clan as a lowest-ranking pack member, disabled wolf pup Faolan is targeted by a jealous peer and framed for a murder that forces him to identify the true culprit in order to clear his name and earn the status of a full-ranking wolf."}]