[{"id": "B00VOK2FDK", "genre": "Children's Books", "title": "The Olive Fairy Book (Xist Classics)", "description": "The Olive Fairy Book is a collection of fairy tales by compiled by Andrew Lang. This collection includes more than twenty classic stories sure to enchant children and adult readers alike.  This Xist Classics edition has been professionally formatted for e-readers with a linked table of contents.  This ebook also contains a bonus book club leadership guide and discussion questions. We hope you’ll share this book with your friends, neighbors and colleagues and can’t wait to hear what you have to say about it.Xist Publishing is a digital-first publisher. Xist Publishing creates books for the touchscreen generation and is dedicated to helping everyone develop a lifetime love of reading, no matter what form it takes  Get your next Xist Classic title for Kindle here: http://amzn.to/1A7cKKl  Find all our our books for Kindle here: http://amzn.to/1PooxLl    Sign up for the Xist Publishing Newsletter here. Find more great titles on our website. "}, {"id": "B00GHNFT50", "genre": "Children's Books", "title": "The Hindered Hand: The Reign of the Repressionist (Illustrated Edition)", "description": "Upon a matter of such tremendous importance to the Americanpeople as is the subject herein treated, it is perhaps due our readersto let them know how much of fact disports itself through thesepages in the garb of fiction.We beg to say that in no part of the book has the author consciouslydone violence to conditions as he has been permitted to view them,amid which conditions he has spent his whole life, up to the presenthour, as an intensely absorbed observer.If in any of these pages the reader comes across that which puts himin a mood to chide, may the author not hope that the wrath arousedbe not wasted upon the inconsequential painter, but directed towardthe landscape that forced the brush into his hand, stretched thecanvas, and shouted in irresistible tones: “Write!”Very respectfully,SUTTON E. GRIGGS.Nashville, Tenn., May, 1905."}, {"id": "0375844449", "genre": "Children's Books", "title": "Runemarks", "description": "Seven o’clock on a Monday morning, five hundred years after the end of the world, and goblins had been at the cellar again. . . . Not that anyone would admit it was goblins. In Maddy Smith’s world, order rules. Chaos, old gods, fairies, goblins, magic, glamours–all of these were supposedly vanquished centuries ago. But Maddy knows that a small bit of magic has survived. The “ruinmark” she was born with on her palm proves it–and makes the other villagers fearful that she is a witch (though helpful in dealing with the goblins-in-the-cellar problem). But the mysterious traveler One-Eye sees Maddy’s mark not as a defect, but as a destiny. And Maddy will need every scrap of forbidden magic One-Eye can teach her if she is to survive that destiny."}, {"id": "0635015471", "genre": "Children's Books", "title": "General George C. Marshall: A Man with a Plan (78) (1000 Readers)", "description": "George Catlett Marshall was the only professional soldier to ever win the Nobel Prize for Peace. He spent most of his life serving in the United States Army. He is most remembered for the \"plan\" to help rebuild a war-torn Europe after World War II.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "1946101346", "genre": "Children's Books", "title": "Not So Scary Jerry", "description": "Monsters don't hug. Or do they? With a little coaching, can a friendly monster learn to be mean and scary? Through fun and quirky dialogue, Boy and Monster discover a lot about each other, but perhaps even more about oneself. A delicious story of friendship and self-acceptance with hilarious twists and turns along the way."}]