[{"id": "0807549029", "genre": "Children's Books", "title": "Mabela the Clever", "description": "A retelling of an African folktale shows how Mabela, the smallest mouse in the village, pays close attention to her surroundings and avoids being tricked by the crafty cat."}, {"id": "1509804781", "genre": "Children's Books", "title": "A Squash and a Squeeze", "description": "Wise old man, won't you help me, please? My house is a squash and squeeze. A little old lady lives all by herself in her house but she's not happy - it's just too small, even for one. Whatever can she do? The wise old man knows: bring in a flappy, scratchy, greedy, noisy crowd of farmyard animals. When she pushes them all out again, she'll be amazed at how big her house feels! The brilliantly funny A Squash and a Squeeze was the first ever picture book written and illustrated by the unparalleled picture-book partnership of Julia Donaldson and Axel Scheffler, creators of The Gruffalo. This edition features the classic story with a stunning, redesigned cover and beautiful finish, making it a must-have addition to the bookshelves of all Donaldson and Scheffler fans - big and small! Also available with redesigned covers are The Gruffalo, The Gruffalo's Child, Room on the Broom, The Snail and the Whale, The Smartest Giant in Town, Monkey Puzzle and Charlie Cook's Favourite Book."}, {"id": "031236878X", "genre": "Children's Books", "title": "The Man Who Walked Between the Towers", "description": "The story of a daring tightrope walk between skyscrapers, as seen in Robert Zemeckis' The Walk, starring Joseph Gordon-Levitt.In 1974, French aerialist Philippe Petit threw a tightrope between the two towers of the World Trade Center and spent an hour walking, dancing, and performing high-wire tricks a quarter mile in the sky. This picture book captures the poetry and magic of the event with a poetry of its own: lyrical words and lovely paintings that present the detail, daring, and--in two dramatic foldout spreads-- the vertiginous drama of Petit's feat.The Man Who Walked Between the Towers is the winner of the 2004 Caldecott Medal, the winner of the 2004 Boston Globe - Horn Book Award for Picture Books, and the winner of the 2006 Carnegie Medal for Excellence in Children's Video."}, {"id": "0152054510", "genre": "Children's Books", "title": "Loving Will Shakespeare", "description": "Poor Anne Hathaway is still living with her callous stepmother, and her prospects for marriage and a home of her own are becoming grim. However, she can’t seem to get charismatic Will Shakespeare out of her mind--even though he is much too young for her. But then one day Will impulsively kisses his childhood friend Anne, changing the course of their lives forever.            Here is the story of the childhoods of and tumultuous romance between the boy who became the world’s most famous playwright and the spirited farmer’s daughter who became his wife. Carolyn Meyer has delivered a riveting historical tale about love, family, the pursuit of one’s dreams--and the price one pays for each."}, {"id": "1467710806", "genre": "Children's Books", "title": "Bmx Street (Extreme Summer Sports Zone)", "description": "Describes the extreme sport of street BMX racing, including the history of the sport, the equipment and gear necessary to compete, and famous athletes competing in the X-Games."}]