[{"id": "0060006501", "genre": "Children's Books", "title": "The Three Witches", "description": " The three bad witches are HUNGRY! \"Let's eat these children,\" they say. They may have teeth that are longer than their lips and they may wear high heels, but they are NO match for two smart children, their brave grandma, three hound dogs, and a fast-running snake.   The Three Witches was first published in every tongue got to confess, the third volume of folklore collected by Zora Neale Hurston while traveling in the Gulf States in the 1930s. It has been adapted for young people by National Book Award winner Joyce Carol Thomas. The vibrant paintings have been masterfully executed by internationally celebrated artist Faith Ringgold. "}, {"id": "1470103087", "genre": "Children's Books", "title": "The Best Colors", "description": "Age level – 3 and up. The primary colors Red, Yellow and Blue compete to be the best color in this fun adventure story where they are surprised to discover friendship and acceptance through color-mixing."}, {"id": "1419713108", "genre": "Children's Books", "title": "In My Heart: A Book of Feelings (Growing Hearts)", "description": "Sometimes my heart feels like a big yellow star, shiny and bright.I smile from ear to ear and twirl around so fast,I feel as if I could take off into the sky.This is when my heart is happy. Happiness, sadness, bravery, anger, shyness . . . our hearts can feel so many feelings! Some make us feel as light as a balloon, others as heavy as an elephant. In My Heart explores a full range of emotions, describing how they feel physically, inside. With language that is lyrical but also direct, toddlers will be empowered by this new vocabulary and able to practice articulating and identifying their own emotions. With whimsical illustrations and an irresistible die-cut heart that extends through each spread, this unique feelings book is gorgeously packaged.           The Growing Hearts series celebrates the milestones of a toddler’s emotional development, from conquering fears and expressing feelings to welcoming a new sibling."}, {"id": "0735813949", "genre": "Children's Books", "title": "Andersen's Fairy Tales", "description": "Originally published in 1991, this stunning collection of classic fairy tales by Hans Christian Andersen, illustrated by internationally acclaimed artist Lisbeth Zwerger, has been expanded with three stories. It is also completely redesigned in the same handsome format as the artist's recently published Alice in Wonderland, A Christmas Carol, and The Wizard of Oz. The artist has selected eleven of her favorite tales-familiar stories such as \"\"The Emperor's New Clothes,\"\" \"\"The Princess and the Pea,\"\" and \"\"The Nightingale,\"\" as well as lesser-known stories, such as \"\"The Sandman,\"\" \"\"The Jumpers,\"\" and \"\"The Rose Tree Regiment.\"\" All are illustrated with Zwerger's signature style-marked by wit, grace, elegant simplicity, and insouciant charm."}, {"id": "153441634X", "genre": "Children's Books", "title": "Fourth Grade Fairy Complete Collection: Fourth Grade Fairy; Wishes for Beginners; Gnome Invasion", "description": "All three books in the Fourth Grade Fairies series are now available together in a collectible boxed set!Willow Doyle only wants three things: to be normal, to fit in at her new school, and to have a best friend. But there’s no way Willow will ever be normal. There isn’t anything normal about her or the Doyle family. Willow comes from a long line of fairy godmothers and she’s expected to be one too when the time comes. Maybe that would be cool if it were like the old days when the humans—known as humdrums—knew fairy godmothers existed and the fairies didn’t have to keep their fairy status secret. Now they’re stuck helping people who don’t even believe in them. Rather than help humans, Willow would rather be human. This paperback collection includes: Fourth Grade Fairy Wishes for Beginners Gnome Invasion"}]