[{"id": "1634726901", "genre": "Children's Books", "title": "Building Squishy Circuits (Makers As Innovators Junior)", "description": "With Squishy Circuits, you can create your own electrical circuits using soft, squishy dough. Through simple text written to foster creativity and problem solving, students will the art of innovation. Large, colorful images show students how to complete activities. Additional tools, including a glossary and an index, help students learn new vocabulary and locate information."}, {"id": "B00I12X2EA", "genre": "Children's Books", "title": "Bilingual Book in English and Greek: Mouse (Learn Greek for Kids 4)", "description": "Can you imagine what it is like to live in a flowerpot and confuse one animal with another? Our chatty little plants Basil, Rosemary and the sisters know all too well the problems and fun it causes. This is for children and others wanting to read a simple text in English and Greek with illustrations. For ease of understanding, the languages are displayed together mostly one or two sentences at a time. The aim was to make the translation as direct as possible but always using everyday language of native speakers. Reading this fun bilingual story will help you learn Greek."}, {"id": "1433959186", "genre": "Children's Books", "title": "Timeline of the Vietnam War (Americans at War: A Gareth Stevens Timeline)", "description": "The Vietnam War was one of the most polarizing wars in American history. Readers explore the wars history and impact in this engrossing volume. A timeline of important military campaigns and political decisions runs throughout the book, while more specific timelines detail the events highlighted in each chapter. These timelines are given life through text designed to explain the historical, military, and social context of the Vietnam War. Readers discover the events that preceded Americas 12-year involvement in the conflict, the major air and land attacks that defined the war, and the images that brought the war into the lives of Americans far from the front lines."}, {"id": "1608862879", "genre": "Children's Books", "title": "Garfield Vol. 1", "description": "Everyone’s favorite lasagna-scarfing cat opens the fridge to an all-new ongoing graphic novel series!Join Garfield as he begins his comic book exploits with Jon, Odie, and the rest of the gang in this all-ages must-read from KaBOOM! THE GARFIELD SHOW writer and comics luminary Mark Evanier teams up with beloved Garfield strip cartoonist Gary Barker to bring you all the laughs (and lasagna) you can handle. With brand new stories featuring everyone’s favorite feline, this graphic novel debut is sure to please Garfield fans new and old alike!"}, {"id": "1448880831", "genre": "Children's Books", "title": "Hanukkah Sweets and Treats (Holiday Cooking for Kids!)", "description": "Families will enjoy celebrating the Festival of Lights with the delicious treats they learn to make in this volume. Readers will be introduced to the Traditional Hanukkah favorites, as well as some exciting new ideas, as they begin making treats. The recipes are presented with fun, easy-to-follow instructions and are accompanied by full-color photographs."}]