[{"id": "1938486307", "genre": "Children's Books", "title": "Colonial Comics: New England: 1620 - 1750", "description": "Colonial Comics is a graphic novel collection of 20 stories focusing on the colonial period from 1620 through 1750 in New England. Stories about Puritans and free thinkers, Pequots and Jewish settlers, female business owners and dedicated school teachers, whales and livestock, slavery and frontiers, and many other aspects of colonial life."}, {"id": "B00WGKH6DQ", "genre": "Children's Books", "title": "Children book: The day the \"a\" went away (first reading book) ; Preschool ;  Beginner Readers", "description": " Great book for first reading and early beginner readers Charlie and Sally are looking for something special. They are looking for the letter \"a”. It has disappeared. Can you find it?In this colorful book, your child will learn to write, read, and, above all, see letters visually by omission and repetition.With easy-to-understand illustrations, this is a new and fun way to learn. How to use this book: 1. Two pictures of an object are given with its spelled out word. The first picture has all letters included while the second picture omits the key letter of the book.2. Showing the child the first picture and the complete word, turn the page to see the missing letter or letters. Have the child write in the letter, checking the prior page to see what is missing.3. Reiterate the picture and the word so he or she can correlate the picture to the word in his or her mind.4. When seeing the book’s letter in other writings, point it out to the child for reinforcement. Play a game searching for the letter in other formats. Scroll up and grab a copy today "}, {"id": "0805210563", "genre": "Children's Books", "title": "The Children's Jewish Holiday Kitchen: 70 Fun Recipes for You and Your Kids, from the Author of Jewish Cooking in America", "description": "In The Children’s Jewish Holiday Kitchen, beloved authority on Jewish cooking Joan Nathan shares seventy child-friendly recipes and cooking activities from around the world. Covering the ten major holidays, here she present a vast array of foods, flavors, and ideas. Included are dishes old and new, traditional and novel—everything from hamantashen to hummus, chicken soup with matzah balls to matzah pizza, fruit kugel to Persian pomegranate punch. Beautifully illustrated, this delightful cookbook will draw the entire family into the spirit and fun of Jewish holiday celebrations."}, {"id": "B01E7GO4KO", "genre": "Children's Books", "title": "Ottoline and the Purple Fox", "description": "Ottoline is back in Ottoline and the Purple Fox, a brand new adventure from Children's Laureate, Chris Riddell. Ottoline and Mr Munroe love puzzles, clues and mysteries. One day, they meet an enigmatic purple fox, who offers to take them on a night-time urban safari. The fox shows them all the hidden animals of the city and Ottoline makes notes on them in her field notebook. Mr Munroe is making notes too - on the anonymous poems he finds stuck to lampposts on their journey. Who is the secretive poet, and how can he and Ottoline help them mend their broken heart? Includes a free fold-up-and-keep fortune teller!"}, {"id": "B00U1SPI0S", "genre": "Children's Books", "title": "Fox and the Goat vulpe și capra Children's Picture Book English-Romanian (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump.Scurta poveste despre o vulpe și o capră. Povestea urmează vulpe excelentă pentru apă și o capră vulpea interacționează cu.Bazat pe fabula de Esop cu folosirea cuvânt de verbe rula, mers pe jos, și să sară."}]