[{"id": "1555601901", "genre": "Science Fiction & Fantasy", "title": "The Grimoire: Manual of Practical Thaumaturgy : 2053 (Shadowrun)", "description": "The Grimoire, Second Edition revises and expands on the original Grimoire, bringing it up to date with the Shadowrun, Second Edition game system. In addition to the revised sections, Grimoire, Second Edition contains a new kind of adept, new physical-adept powers, a new metamagical ability, an expanded spell list, and more fearsome insect spirits."}, {"id": "1565041569", "genre": "Science Fiction & Fantasy", "title": "Midnight Express (Wraith: The Oblivion)", "description": "A journey of mystery and adventure for Wraith: The Oblivion. The light at the end of the tunnel... An unearthly whistle in the distant night signals the arrival of the ghost train known only as the Midnight Express. Cobbled together from the remains of train wrecks spanning the ages, the train provides the only reliable means of safe passage throught the Tempest to virtually any destination in the Shadowlands. ... is the Midnight Express! Controlled by Ferrymen, the Midnight Express winds through the Tempest nightly, bringing wraiths to destinations across the Shadowlands. Its strict neutrality maintained by the Ferrymen, it has become a popular meeting place for members of rival factions within wraith society. But the Ferrymen also use the train as a means of finding those interested in a far different kind of journey -- that toward Transcendence.\nMidnight Express includes: six ready-to-play adventures, ranging from the streets of the Old West to the dining car of the Orient Express; complete descriptions of a dozen Midnight Express cars suitable for integration into your own chronicle; and Nicholas,the enigmatic Ferryman who maintains the Midnight Express."}, {"id": "0786913886", "genre": "Science Fiction & Fantasy", "title": "The Silent Blade (Forgotten Realms:  Paths of Darkness, Book 1)", "description": "When the vile Crystal Shard once again reveals itself, Drizzt must race against his most formidable enemies in hopes of destroying it before it finds the one being that can help it enslave the world: a dark elf named Jarlaxle.Winner of the Origins Award for best game-related novel of 1998, The Silent Blade marked the return of Drizzt to the wind-swept tundra of the Forgotten Realms world. This deluxe reissue features a new Todd Lockwood cover and an introduction from The New York Times best-selling author Philip Athans, who has served as Salvatore's editor for almost a decade, starting with the original release of this book.From the Hardcover edition."}, {"id": "0385721676", "genre": "Science Fiction & Fantasy", "title": "Oryx and Crake", "description": "From the #1 New York Times bestselling author of The Handmaid's TaleOryx and Crake is at once an unforgettable love story and a compelling vision of the future. Snowman, known as Jimmy before mankind was overwhelmed by a plague, is struggling to survive in a world where he may be the last human, and mourning the loss of his best friend, Crake, and the beautiful and elusive Oryx whom they both loved. In search of answers, Snowman embarks on a journey–with the help of the green-eyed Children of Crake–through the lush wilderness that was so recently a great city, until powerful corporations took mankind on an uncontrolled genetic engineering ride. Margaret Atwood projects us into a near future that is both all too familiar and beyond our imagining."}, {"id": "B01N4WF5CS", "genre": "Science Fiction & Fantasy", "title": "The Adventures Of Captain Bob: The Missing Pirate", "description": "The tale of a young boy who loved they idea of being a pirate he lived in a fantasy world with his motley band, whenever he had the chance he would play the part and imagined the world where he had adventures often reading things into a situation, that included his elder brother and sister to a point his mother and father had recently moved the family to a new house and in doing so had left behind Roberts dearest friend."}]