[{"id": "0635033550", "genre": "Children's Books", "title": "The Most Amazing Book of New York Christmas Trivia (New York Experience)", "description": "What could be better than Christmas in New York? Experience the Rockefeller Center tree. . . the ice skating rink . . . the Rockettes . . . the city lights! Find out what the Roosevelts did for Christmas .. . .what the zoo animals get for presents . . . and lots more Christmasy stuff all about…New York!"}, {"id": "0394888669", "genre": "Children's Books", "title": "Pompeii -- Buried Alive! (Step into Reading)", "description": "A Step 4 HISTORY reader. \"The drama of natural disasters provides prime material to entice young independent readers. In this volume, the account of the eruption of Mount Vesuvius describes village life 2,000 years ago, the eruption itself and its aftermath, and the excitement when the buried town is rediscovered centuries later. A lively and factual glimpse of a devastating moment in history, in an accessible, attractive package.\"--Publishers Weekly.  Step 4 Readers use challenging vocabulary and short paragraphs to tell exciting stories. For newly independent readers who read simple sentences with confidence. With full-color illustrations."}, {"id": "0606388583", "genre": "Children's Books", "title": "Where Is Alcatraz? (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Escape from the ordinary and break into Alcatraz, America's most famous prison! The island of Alcatraz has always been a place that's fascinated visitors, from the Native American tribes who believed it was home to evil spirits to the Spanish explorers who discovered the island. In modern times, it was a federal prison for only 29 years, but now draws over a million visitors each year. Learn the history of America's most famous prison, from its initial construction as a fort in the 1800s, to its most famous residents such as Al Capone and \"\"Machine Gun\"\" Kelly. Where Is Alcatraz? also chronicles some of the most exciting escape attempts--even one that involved chipping through stone with spoons and constructing rafts out of raincoats!"}, {"id": "0471571083", "genre": "Children's Books", "title": "Janice VanCleave's Machines: Mind-boggling Experiments You Can Turn Into Science Fair Projects", "description": "How is your forearm like a lever?  * What makes it easy to pull a flag up a flagpole?  * How can a windmill help to do work?   Janice VanCleave's Machines includes 20 simple and fun experiments that allow you to discover the answers to these and many other questions, plus dozens of additional suggestions on how to develop your own science fair project.  Learn how an elevator works using a box, string, a paper cup, and some coins; build a bubble machine with cardboard boxes, Styrofoam, and wire; and much more. All experiments use inexpensive materials and involve a minimum of preparation and clean up.  Children ages 8-12  Also available in the Spectacular Science Projects Series:  * Janice VanCleave's Animals  * Janice VanCleave's Earthquakes  * Janice VanCleave's Electricity  * Janice VanCleave's Gravity  * Janice VanCleave's Magnets  * Janice VanCleave's Molecules  * Janice VanCleave's Microscopes and Magnifying Lenses  * Janice VanCleave's Volcanoes  * Janice VanCleave's Weather"}, {"id": "1607534657", "genre": "Children's Books", "title": "Statues of Easter Island (Ancient Wonders)", "description": "\"Describes the statues of Easter Island, one of the ancient wonders of the world, including theories on how they were built, the people who built them, and what the statues are like today\"--"}]