[{"id": "B077R39PHN", "genre": "Science Fiction & Fantasy", "title": "Chosen: A Fantasy Collection", "description": "Five fantasy authors. Five complete novelettes. All new content.A bard with the power to bring his tales to life. A Victorian-era protectoress of the Lost Ways to Faerieland. A Korean War vet who becomes Mallworld Gatekeeper after a dragon attack. A vision walker who is forced into a portal to another world. And more."}, {"id": "1501094823", "genre": "Science Fiction & Fantasy", "title": "1: Shadowrise (Assassin's Legacy) (Volume 1)", "description": "\"I do not remember my siblings or parents but I do remember the corpses.\" At only five years old, Varani was spirited away from her home amidst the massacre of her House. Taken to safety but tempered by tragedy, the young elf became determined to see no further harm befall her loved ones. Shadowrise chronicles Varani's first thousand years of life, her transition from prey to predator and the sacrifices she made to achieve notoriety."}, {"id": "B01BITFNSK", "genre": "Science Fiction & Fantasy", "title": "Image of the Gods", "description": "It was nearly winter when the ship arrived. Pete Farnam never knew if the timing had been planned that way or not. It might have been coincidence that it came just when the colony was predicting its first real bumper crop of all time. When it was all over, Pete, Mario and the rest tried to figure it out, but none of them ever knew for sure just what had happened back on Earth, or when it had actually happened. There was too little information to go on, and practically none that they could trust. All Pete Farnam really knew, that day, was that this was the wrong year for a ship from Earth to land on Baron IV."}, {"id": "1565046986", "genre": "Science Fiction & Fantasy", "title": "Minds Eye Theatre: Discipline Deck", "description": "The Mind's Eye Theatre Discipline Deck contains almost 100 cards detailing all of the powers from the revised edition of Laws of the Night. At a loss for what one of your Disciplines does? Just keep these small reference cards in your pocket and eliminate the need to flip through - or even carry - a clunky rulebook. Each card provides a full write-up of a Kindred Discipline."}, {"id": "1514622459", "genre": "Science Fiction & Fantasy", "title": "Angel Eclipsed (The Louisiangel Series) (Volume 2)", "description": "Six weeks ago, Angel earned her wings. Six weeks ago, Angel killed an innocent person. Six weeks ago, Angel set Lucifer free. Michael doesn’t accept that Lucifer is alive, let alone free, and he should know – he was the one to kill him. Thankfully, Veronica and the cherubim are on Angel’s side, only they seem more interested in proving Michael wrong than helping put Lucifer back in hell. Then there’s Joshua. Angel is convinced that the best way for her charge to stay alive is for her to stay away. The problem is that Michael is adamant she remain his guardian angel. Can Angel keep her charge and New Orleans safe from the evil that is lurking, or will her own demons be their downfall?"}]