[{"id": "B006LADBTU", "genre": "Science Fiction & Fantasy", "title": "A Weapon to End War", "description": "What if the foremost scientist in the field of nanotechnology and microrobotics used his inventions to take our world leaders hostage and enact his own political agenda? Dr. J. Maurice Carpenter has worked for decades at the Brookhaven National Laboratory on a top-secret government project to develop a terrifying new breed of weaponry. Launching an attempt to take over the world, Carpenter commences his plans by implanting a microscopic robot in the body of the President of the United States. The only hope for stopping Carpenter is an ex-Marine FBI agent named Bill Maddox, who is more suited to working narcotics than handling a global endgame crisis.  In far over his head but determined to prove his worth, Maddox plunges into a labyrinth of danger, matching wits against an intellect far superior to his own. In doing so, he confronts a friend-or-foe femme fatale and a technology potentially more deadly than any the world has ever witnessed, a technology that exists today."}, {"id": "1783292520", "genre": "Science Fiction & Fantasy", "title": "Batman Arkham Knight: The Official Novelization", "description": "THE OFFICIAL NOVELIZATION OF THE MOST EAGERLY AWAITED GAME OF 2015 -- BATMAN: ARKHAM KNIGHT!Gotham City is in chaos as the criminal organizations run wild, seeking to fill the void left by the death of the Joker. When the Scarecrow threatens to unleash a toxin that will kill scores of innocents, the result is uncontrollable panic.TM & (c) DC Comics. (s15)"}, {"id": "B014PN92RO", "genre": "Science Fiction & Fantasy", "title": "Caught in the Glow (Demons of Fame Romances Book 1)", "description": "She'll risk her heart to save his soul...When she was a child, Avery Harmen watched her father die at the hands of a Glower—a breed of demon that feeds on dreams of fame and glory. Now she secretly protects the rising stars of Los Angeles from the demons that prey on them, determined to make sure her clients never suffer the same fate.Then Avery finds herself assigned to Colin Ryder, a young indie rocker who just landed a major label deal. Colin is cocky, rebellious, a brilliant musician, and already in the Glowers' sights. He's also far too hot for Avery to ignore the chemistry between them—especially when she gets to know the tender side behind his celebrity facade. Though Avery knows she's falling too fast, she's willing to risk heartbreak if fanning the flames of attraction distracts Colin from his Glower-tempting antics. But Colin is keeping a secret of his own, one so big it will put both her heart and his soul on the line.The first book in the Demons of Fame Romances, a steamy paranormal romance series.Each book in the Demons of Fame series contains a stand-alone romance, but it is recommended that you read them in order to best appreciate the ongoing subplots.Book 1: Caught in the Glow (Avery's story)Book 2: Caught in the Rush (Fiona's story)Book 3: Caught in the Dream (Mateo's story)Book 4: Caught in the Burn (Sofie's story)"}, {"id": "B00H7MBJYK", "genre": "Science Fiction & Fantasy", "title": "Beyond The Door: Short Story", "description": "When Larry Thomas purchases a cuckoo clock for his wife he finds that he is woefully unprepared for what awaits beyond the door of the clock. Philip K. Dick was an American science-fiction novelist, short-story writer and essayist. His first short story, “Beyond Lies the Wub,” was published shortly after his high school graduation. Some of his most famous short stories were adapted for film, including “The Minority Report,” “Paycheck,” “Second Variety” (adapted into the film Screamers) and “We Can Remember It For You Wholesale” (adapted into the film Total Recall).HarperCollins brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperCollins short-stories collection to build your digital library."}, {"id": "1517054885", "genre": "Science Fiction & Fantasy", "title": "An Antarctic Mystery", "description": "In the year 1839, Mr. Jeorling, whose geological and mineralogical research have led him to the Kerguelen sub-Antarctic archipelago in the Indian Ocean, sets sail on the \"Halbrane\", whose captain Len Guy is obsessed with Edgar Allan Poe's novel \"The Narrative of Arthur Gordon Pym\". --- In that narrative, Poe recounts the adventures of Len Guy's brother William Guy who as captain of the \"Jane\" was persuaded by Arthur Gordon Pym to direct an expedition to the Antarctic. The \"Jane\" vanished on this voyage, though Pym was still able to pass along his diary to Edgar Allen Poe. --- Increasingly persuaded of the truthfulness of the tale, Mr. Jeorling encourages Captain Len Guy to pursue his brother - whom they believe may still be alive - into the Antarctic. --- Aside from the natural perils of the ocean, they must also face down a mutiny of the sailors on the \"Halbrane\"."}]