[{"id": "0807504858", "genre": "Children's Books", "title": "Atomic Ace and the Robot Rampage (Albert Whitman Prairie Books (Paperback))", "description": "It's an ordinary day for Atomic Ace and his family until the evil Roboconqueror accidentally sends his mechanoid army after Ace's son instead of Ace himself. With Ace busy in space diverting a meteor threat, who will be on Earth to save the day?"}, {"id": "075663458X", "genre": "Children's Books", "title": "DK Readers L1: Let's Play Soccer", "description": "At his first soccer practice, Erik learns how to stretch, the rules of the game, and kicking techniques before playing a practice game."}, {"id": "1432952056", "genre": "Children's Books", "title": "Haiti (Countries Around the World)", "description": "Haiti offers complete coverage of this fascinating country, including sections on history, geography, wildlife, infrastructure and government, and culture. It also includes a detailed fact file, maps and charts, and a traceable flag."}, {"id": "B005X2IV0G", "genre": "Children's Books", "title": "COYOTE AND THE COLOR BUGS The Secret Treasure He Found on the Cactus", "description": "Coyote and the Color Bugs is the story of the Zapotec tribe’s struggle against drought, persecution, and Spanish rule, which driven by the persistent driving force of one young boy, and ultimate refusal to live a life of slavery, resulted in the discovery of the red dye that has woven itself neatly through almost every society today. The intimate traditions, values and beliefs of the Zapotec tribe are revealed as they are challenged by the greed and selfishness of the dominant Spanish culture, and ultimate struggle against right and wrong strikes a universal cord, and asks the question, what is really worth fighting for? As the story unfolds, this question is answered, in a most profound way, that nothing is more precious than freedom."}, {"id": "1974191753", "genre": "Children's Books", "title": "Let's Get Weird: Back To School Composition Notebook, 8.5 x 11 Large, 120 Pages College Ruled (Primary Composition Notebook)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}]