[{"id": "B075SJVJLG", "genre": "Children's Books", "title": "The Bookania Quests (3 Book Series)", "description": "From Book 1: Robin and Robert are royal twins. They are the only two to have received a Fairy Godmother gift in nearly a century, an amazing honor. Soon it was clear that their gifts had been switched and a search began to find the Fairy Godmother to right the mistake. When she is finally sighted by a knight, the family learns that the pair must find her for themselves and they only have until their 18th birthday ... only 4 months away. Will they be able to find her in time?  This edition has been completely re-edited from the ground up, so whether you're new to the series, or if you've read it before, don't miss this exciting new edition."}, {"id": "1403485070", "genre": "Children's Books", "title": "Paul Klee (The Life and Work of . . .)", "description": "This new edition asks probing questions. Where was Paul Klee born? What did Paul Klee see in his uncle's café? What did he like to paint pictures of? Read 'The Life and Work of: Paul Klee' to answer these questions and more. Each book in 'The Life and Work of...' series tells the story of a famous artist. You'll learn about their lives. You'll see how the things that happened to them and the people who they met changed the way they made their art."}, {"id": "B01MU2RS5P", "genre": "Children's Books", "title": "No Smoking, No Drinking, No Drugs (Multicultural Children's Books Series About Making Good Choices)", "description": "A smart little mouse, named Mr. Consequences, arrives just in time to stop young Billy from making a bad choice. In the simplest way, the mouse explains the importance of choosing well and what can happen to those who do not when it comes to smoking, alcohol, and drug use. Health, and therefore happiness, can be endangered if one chooses unwisely.This is an important lesson and one that is best learned at a young age.This children’s picture book is part of the wonderful collection of children’s books by Sally Huss."}, {"id": "B071R9FJZ1", "genre": "Children's Books", "title": "The Day I Will Never Forget", "description": "Ezekiel’s homework assignment is quite simple: write an English composition, otherwise known as an essay, on the topic “The Day I Will Never Forget.” There’s only one problem: Ezekiel has no idea what to write. Why? Because the life of this 6 year old boy has been a series of very ordinary, forgettable days.But when his class teacher, the meticulous, rabbit-loving Miss Agbo announces that a prize will be awarded to the student with the best essay, the homework becomes a competition, which Ezekiel and his classmates are determined to win at all costs. As the deadline approaches, Ezekiel’s life is visited by an array of dramatic episodes. Caught in the middle of all the drama is his teacher, Miss Agbo, who despite being a keen romantic has been unlucky in love. Will Ezekiel win? Will Miss Agbo finally find love?This heartwarming tale of primary school life in 1990s Nigeria is witty, nostalgic and unforgettable. This book is perfect for beginning readers, children who love reading funny chapter books and adults who enjoy reading African children’s literature."}, {"id": "0606028412", "genre": "Children's Books", "title": "Spot's First Easter (Turtleback School & Library Binding Edition) (Spot (Prebound))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Spot the puppy joins Helen the hippopotamus in a search for six hidden Easter eggs. Movable flaps conceal portions of the illustrations."}]