[{"id": "1421532530", "genre": "Children's Books", "title": "Dinosaur King, Vol. 1", "description": "The official manga tie-in to the top-rated show from 4KidsTV!R to L (Japanese Style).  BONUS! Trading Cards inside! (Limited quantity available for first printing)Max is obsessed with dinosaurs. He knows his Tapejara from his Pteranodon and can find fossils better than a trained paleontologist. When he discovers a stone tablet that transports him to the age of dinosaurs, it's a dream come true--until it becomes a nightmare. An evil genius named Dr. Z has enslaved the dinosaurs so he can use their hidden powers to take over the world! Now Max has to defeat Dr. Z and his Alpha Gang to save the ancient beasts and life as we know it.  "}, {"id": "B0743MPTHQ", "genre": "Children's Books", "title": "Science (LEGO Nonfiction)", "description": "Did you know that the blue whale could blow up 1,250 balloons in a single breath? Or that the Earth's core is as hot as the surface of the sun?Including information about almost every scientific topic in the universe, readers will find out everything they ever wanted to know about fascinating animals, electricity, energy, weather, our galaxy, technology of tomorrow, and so much more. They'll even meet real-life scientists and read all about their exciting work. Complete with hundreds of stunning photographs, fun facts, mini comics, and building ideas, LEGO Science is the perfect book for young readers curious about science. Includes a buildable scientist minifigure!The LEGO(R) nonfiction series is exceptional as it combines the world's most powerful toy brand with the most trusted name in children's publishing."}, {"id": "0859534642", "genre": "Children's Books", "title": "The Gingerbread Man (Activity Books)", "description": "In this version of the familiar tale, the reader may help the naughty hero elude his pursuers by pushing a movable gingerbread man through the slot in each page."}, {"id": "1935628453", "genre": "Children's Books", "title": "All About Sir Edmund Hillary", "description": "Sir Edmund Percival Hillary was a mountaineer, explorer and philanthropist. Edmund Hillary and Nepalese Sherpa mountaineer Tenzing Norgay became the first climbers to reach the summit of Mount Everest. He was also the first person to reach both the North Pole and South Pole. Edmond served as a navigator for the Royal New Zeeland Air Force during World War II. He had many interests and in addition to being an explorer he spent time as a beekeeper, lecturer, and served his county as a Governor General and a High Commissioner to India. Following his rise to fame as the first to summit Mount Everest, Edmund devoted much of his life to helping the Sherpa people of Nepal through the Himalayan Trust, which he founded. Through his efforts, many schools and hospitals were built in Nepal."}, {"id": "0399558063", "genre": "Children's Books", "title": "1: Even Superheroes Have to Sleep", "description": "“Will ease little readers to restful states.”—Kirkus ReviewsToddlers will feel better about bedtime when they learn that superheroes, cowboys, princesses, and astronauts ALL have to sleep too!   It’s bedtime for superheroes . . . and KIDS! Young ones will enjoy this sweet, short rhyming story that lulls them into bedtime with the promise that all their heroes are getting tucked into bed too. And the book comes with stickers and a reward chart, so good bedtime habits can be reinforced each night when kids brush their teeth, put on their pj’s, and settle down to sleep. It’s a book and sticker package that will help parents achieve bedtime peace each night."}]