[{"id": "B01N6ZRHC7", "genre": "Science Fiction & Fantasy", "title": "Very Dead Indeed: A Herc Braveman Adventure (The Herc Braveman Adventures Book 2)", "description": "When Space Captain Herc Braveman is called to a technologically advanced world, he finds it has reverted to a medieval state. He knows something is wrong — damn wrong.With his trusty robot slave M-ArtIn and his totally hot niece, Lolita, Herc discovers a mysterious obelisk which feeds on technology. Can Herc Braveman defeat the dastardly obelisk without the use of his Space Blaster and Neuronice Space Whip? Will Ambassador Platzhalter's beautiful daughter reject Herc's advances, or will she throw herself at him like most right-minded women?How will M-ArtIn survive?Find out the answers to these questions and more in this exciting installment of the Herc Braveman Adventures! If you like non-PC comedy and fun space adventures, buy now!"}, {"id": "1601257937", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Card Game: Barbarian Class Deck", "description": "Channel your Fury! Barbarians wield massive weapons and their own rage to create a potent and deadly combatant. The Barbarian Class Deck accessory for the Pathfinder Adventure Card Game allows players to bring these unpredictable warriors to any Base Set, including the demon-infested Wrath of the Righteous campaign!The 109-card Barbarian Class Deck contains three new characters—including a new version of the iconic barbarian Amiri—and both new and recognizable allies, weapons, armor, and other boons to support your barbarian through an entire Adventure Path. This deck can also be used in the popular Pathfinder Society Adventure Card Guild organized play campaign.[“Price Includes VAT”] "}, {"id": "0345484266", "genre": "Science Fiction & Fantasy", "title": "Dragonflight (Pern)", "description": "Volume I of The Dragonriders of Pern®, the groundbreaking series by master storyteller Anne McCaffrey On a beautiful world called Pern, an ancient way of life is about to come under attack from a myth that is all too real. Lessa is an outcast survivor—her parents murdered, her birthright stolen—a strong young woman who has never stopped dreaming of revenge. But when an ancient threat to Pern reemerges, Lessa will rise—upon the back of a great dragon with whom she shares a telepathic bond more intimate than any human connection. Together, dragon and rider will fly . . . and Pern will be changed forever."}, {"id": "B0774DWYJT", "genre": "Science Fiction & Fantasy", "title": "Court of Shadows (Blade and Rose Book 3)", "description": "Answers to who killed her family. A trial to death. Is the truth worth the risk?Master Mage Rielle is counting the months to her wedding when an unexpected invitation arrives from Magehold--to compete for magister. The magister's mantle has been her dream for over a decade, but rumors accuse Magehold of shadowy deeds, among them killing families to collect promising young novices.Piracy has been rampant along the Emaurrian coast, and Jon has his hands full with Immortals attacking, his forces spread too thin to handle it all. When Magehold announces the winner of the Magister Trials will be granted one boon, Rielle is determined to ask for an end to the piracy that threatens so many others and harmed her own family... and to investigate whether Magehold was responsible. But when she arrives, she learns that the trials have only one rule: survive.Magehold could easily stamp out the piracy claiming countless lives, and if she wins the trials, Rielle could see it done. But with the other mages competing to kill, strangers hunting her in the shadows, and mysterious factions working behind the scenes, trying to win the test could mean the end of her life. Will the trials give her the answers she seeks and the aid Emaurria sorely needs, or will they be her end?If you like the dark intrigue of the Black Jewels series, the fantasy romance of A Court of Thorns and Roses, the epic adventure of Game of Thrones, and a heroine who never gives up, you'll love this romantic epic fantasy series.Preorder Court of Shadows and dive into a medieval world sensual and dark, full of magic and greed, love and blades, where factions vie for influence and there are no easy choices...             "}, {"id": "0809562456", "genre": "Science Fiction & Fantasy", "title": "Elric Volume 2: The Sailor On The Seas Of Fate (v. 2)", "description": " Leaving his cousin Yrkoon sitting as regent upon the Ruby Throne of Melnibone, leaving his cousin Cymoril weeping for him and despairing of his ever returning, Elric sailed from Imrryr, the Dreaming City, and went to seek an unknown goal in the world of the Young Kingdoms where Melniboneans were at best, disliked. Read by Jeff West. Included is a dramatic introduction over 11 mins in length, read by Michael Moorcock. An 1 disc MP3-CD edition. "}]