[{"id": "B00JROS8I6", "genre": "Science Fiction & Fantasy", "title": "Soul Rebel (Rebel Riders Book 1)", "description": "A vampire took his soul. He wants it back.When 21-year-old Nolan Bishop meets a seductive redhead at a dark club in downtown Shreveport, little does he know that his soul will be gone as soon as she leaves the club. It doesn’t take Nolan long to realize that Eva Sheridan, the succubus who now invades his dreams, has taken something from him. Through the underground network of the supernatural in New Orleans, he discovers he has seven days to destroy Eva before he turns into a sinister and feral vampire himself.In a race against all that is holy, Nolan encounters Eva's identical twin, Charity, who is still very much a human.  As he begs for Charity's help in locating Eva, she realizes that his utmost desire is to kill her sister. Although Eva is a relentless succubus, Charity doesn't want her sister to die. Now, it's up to Nolan to determine his own future. While Charity and Nolan grow closer, he struggles with destroying her sister. Can he choose between his humanity and his heart in a mere seven days? Praise for Soul Rebel:\"Great characters, original and racy. Always left wanting more!\" ~Tim O'Rourke, bestselling author of Vampire Shift\"I thoroughly enjoy stories with a good plot and exciting twist...this book had both.\" ~M. Nesbitt\"CJ Pinard once again rocks my paranormal socks off doing what she does best.\" ~Jenn Green from the Bookworm Betties BlogSoul Rebel is book 1 of the Rebel Riders SeriesREADING ORDER:Soul RebelSoul RedemptionSoul ReleaseKovah: Soul Seeker"}, {"id": "0765327546", "genre": "Science Fiction & Fantasy", "title": "Range of Ghosts (The Eternal Sky)", "description": "Temur, grandson of the Great Khan, is walking away from a battlefield where he was left for dead. All around lie the fallen armies of his cousin and his brother, who made war to rule the Khaganate. Temur is now the legitimate heir by blood to his grandfather's throne, but he is not the strongest. Going into exile is the only way to survive his ruthless cousin.Once-Princess Samarkar is climbing the thousand steps of the Citadel of the Wizards of Tsarepheth. She was heir to the Rasan Empire until her father got a son on a new wife. Then she was sent to be the wife of a Prince in Song, but that marriage ended in battle and blood. Now she has renounced her worldly power to seek the magical power of the wizards. These two will come together to stand against the hidden cult that has so carefully brought all the empires of the Celadon Highway to strife and civil war through guile and deceit and sorcerous power.The Eternal Sky Trilogy#1 Range of Ghosts#2 Shattered Pillars#3 Steles of the Sky"}, {"id": "B0789K74PC", "genre": "Science Fiction & Fantasy", "title": "Zombie Road III: Rage on the Rails", "description": "Book 3 of 3The finale of the Zombie Road tale. It's been a month since the outbreak and the survivors of the zombie apocalypse have started a new life in a walled city.  There are still a few enemies that need to be dealt with, the kind that can think and plan, and they can be more devastating than a horde of the undead."}, {"id": "0983910510", "genre": "Science Fiction & Fantasy", "title": "The Golden Kingdom: Z", "description": "\"Try to save them and get everyone, including yourself, killed\" - Some of Gunny's first words to Sam when he became a Law Martial. But, how could he not try? \"Law Martial\"...  even the name sounded wrong.  Something drummed up by the media to explain Marines without boundaries, no laws holding them back, and only their consciences stopping them from going too far. Sam never had any intention of becoming a soldier, but when these enormous golden domes appeared on every continent, what was he to do? With half of North America encased in a Dome his natural instinct was to help those in need,  to stop the inhuman creatures streaming from the Domes, and to keep the human monsters from taking advantage of a world on the cusp of collapse. Renny, however, never signed up for anything so noble. In fact, she never signed up. She was  just a girl, one who knew right from wrong. Granted, she might be a little impulsive and makes for the worst kind of soldier. But together, she and Sam fight to keep the world from falling. They fight to save their home. They fight to make people's daily lives seem just as mundane and normal as before the Domes ever arrived. But, their story is far from mundane. What they'll learn of the Domes and the wonders inside will become a thing of legends. This is their story - The story of the Martials and The Golden Kingdom - A story which will impact the world for all of time. This is the Second Edition printing of \"The Golden Kingdom: Z\" with new editorial content as well as new cover and interior artwork.  All for a new low price."}, {"id": "0520284925", "genre": "Science Fiction & Fantasy", "title": "Dangerous Games: What the Moral Panic over Role-Playing Games Says about Play, Religion, and Imagined Worlds", "description": " The 1980s saw the peak of a moral panic over fantasy role-playing games such as Dungeons and Dragons. A coalition of moral entrepreneurs that included representatives from the Christian Right, the field of psychology, and law enforcement claimed that these games were not only psychologically dangerous but an occult religion masquerading as a game. Dangerous Games explores both the history and the sociological significance of this panic. Fantasy role-playing games do share several functions in common with religion. However, religion\u0097as a socially constructed world of shared meaning\u0097can also be compared to a fantasy role-playing game. In fact, the claims of the moral entrepreneurs, in which they presented themselves as heroes battling a dark conspiracy, often resembled the very games of imagination they condemned as evil. By attacking the imagination, they preserved the taken-for-granted status of their own socially constructed reality. Interpreted in this way, the panic over fantasy-role playing games yields new insights about how humans play and together construct and maintain meaningful worlds. Laycock’s clear and accessible writing ensures that Dangerous Games will be required reading for those with an interest in religion, popular culture, and social behavior, both in the classroom and beyond."}]