[{"id": "0671666894", "genre": "Children's Books", "title": "C D B!", "description": "N-R-E S N T-S. N-Q = Thank you. S M-T = It's empty. D N S 5 X = The hen has five eggs. It looks like a secret code, but read the letters aloud and solve the puzzle!"}, {"id": "1538327899", "genre": "Children's Books", "title": "Civic Virtue: Honesty, Mutual Respect, and Cooperation (Spotlight on Civic Action)", "description": "The development of the U.S. Constitution was influenced by tenets of a republican government. Civic virtue, or concern for the common good, guides how U.S. citizens go about living their daily lives. This book defines civic virtue and gives concrete examples of civic virtue in practice. Civic virtue requires citizens to put the common good ahead of their own personal desires to make sure that the republican government operates fairly for all citizens. The Constitution stresses the importance of the government existing for the people and being run by the people, which of course heavily relies upon the peoples' interpretation of Civic virtue."}, {"id": "1624037305", "genre": "Children's Books", "title": "Super Simple Camera Projects: Inspiring & Educational Science Activities (Amazing Super Simple Inventions)", "description": "Presents facts about cameras and their history and provides photography-based science experiments."}, {"id": "1405279893", "genre": "Children's Books", "title": "The Babar Collection: Five Classic Stories", "description": "This charming collection of five French illustrated classics follows the adventures of the world’s best-loved elephant, Babar, as he becomes king, builds a city, meets Father Christmas and has many other exciting adventures. One of the most iconic series of animal books in history, Babar has become a household name both as a character in children’s books and on TV. Jean de Brunhoff’s exquisite stories have charmed readers around the world for 80 years."}, {"id": "1410907112", "genre": "Children's Books", "title": "Roberto Clemente (Hispanic-American Biographies)", "description": "Who is Roberto Clemente? What did he accomplish and how? What is his legacy? Learn about the lives of well-known Hispanic Americans who overcame tremendous odds, such as racism and poverty, and went on to leave lasting marks in the world."}]