[{"id": "0807530174", "genre": "Children's Books", "title": "Gordon Parks: How the Photographer Captured Black and White America", "description": "His white teacher tells her all-black class, You’ll all wind up porters and waiters. What did she know? Gordon Parks is most famous for being the first black director in Hollywood. But before he made movies and wrote books, he was a poor African American looking for work. When he bought a camera, his life changed forever. He taught himself how to take pictures and before long, people noticed. His success as a fashion photographer landed him a job working for the government. In Washington DC, Gordon went looking for a subject, but what he found was segregation. He and others were treated differently because of the color of their skin. Gordon wanted to take a stand against the racism he observed. With his camera in hand, he found a way. Told through lyrical verse and atmospheric art, this is the story of how, with a single photograph, a self-taught artist got America to take notice."}, {"id": "1609055101", "genre": "Children's Books", "title": "10 Little Fish (¡Hola, English!)", "description": "Everybody into the water! From one to ten, and from diez to uno, counting is featured in this swimmy, finny underwater concept book. With opposites, short, long / corto, largo; descriptions, yellow, blue/amarillo, azul; action words swim, dive / nadar, saltar; and rhyme, a lot of language arts fill this lively lake.And it all ends . . . with a splash!Teachers and parents of ESL students will cheer when they discover the ¡Hola, English! series, as will those seeking to expose English-speaking kids to Spanish. Ten Little Fish combines numbers with simple adjectives (\"fish above, fish below; seven fish, fast and slow\") and simple verbs (\"swim and dive fish, here are five fish\")."}, {"id": "0142420999", "genre": "Children's Books", "title": "Minerva Louise", "description": "A cheerful reintroduction to the friendly chicken, Minerva Louise! Minerva Louise loves the farmhouse with the red curtains, and one day she decides to explore it from the inside. Children will laugh at her silly antics and love pointing out her mistakes. Stoeke's bright, streamlined art and offbeat text have put the daffy Minerva Louise on the map - and won her a place in children's hearts. This reissue will add a charming new cover to the sweet story that children already love.Book Details:Format: PaperbackPublication Date: 1/19/2012Pages: 24Reading Level: Age 2 and Up"}, {"id": "1433971275", "genre": "Children's Books", "title": "Gross Things on Buses, Trains, and Planes (That's Gross!)", "description": "It's not possible for people to walk, or even drive, to many places. Buses, trains, and airplanes get us where we need to go. Unfortunately, wherever large groups of people gather, there are sure to be a lot of germsand other unpleasant things, too. The more we learn about these things, the more we can keep healthy and adopt behaviors to keep others healthy as well. The gross things hidden from view, or impossible to see with the human eye, on several modes of transportation are discovered through accessible text and engaging, fun facts."}, {"id": "1410908313", "genre": "Children's Books", "title": "1: Boats (Mean Machines)", "description": "What’s the fastest boat in the world? What are different boats used for? Find out as you get behind the wheel of some of the most fascinating vehicles on the planet. This series looks at various types of exciting vehicles, examining how and where they are "}]