[{"id": "B01N9YHNQ8", "genre": "Children's Books", "title": "Children's Books: Tigers Don't Need Friends - Les tigres n'ont pas besoin d'amis. English - French: Bilingual Edition. Livres pour enfants. Anglais - Francais", "description": "A big and imposing tiger considers he doesn't need friends. However, this is about to change! I hope you enjoy this short illustrated story! Un grand et imposante tigre ne croit pas à l'amitié, et pense qu'il n'a pas besoin d'ami.J'espère que vous apprécierez cette courte histoire illustrée!"}, {"id": "B00XX3E05C", "genre": "Children's Books", "title": "iOpener: Robots", "description": "This book about robots gives detailed explanations of all the robots around us, how they're powered, how they move, and what they can do. This title includes diagrams, a glossary, an index, and discussion questions to aid in reading comprehension.Grade: 3Subject: Physical ScienceGenre: Informational TextComprehension Skill/Strategy: Draw ConclusionsDiagnostic Reading Assessment (DRA/EDL): 38/40Guided Reading Level: PLexile Level: 650LDK's iOpeners equip K-6 students with the skills and strategies they need to access and comprehend nonfiction so that they are not only learning to read but reading to learn. The combination of high-interest content and eye-popping photography of iOpeners brings science and social studies topics to life, raises student achievement in reading, and boosts standardized test scores."}, {"id": "1338223534", "genre": "Children's Books", "title": "The Magical Tale of Ben and Holly (Ben & Holly's Little Kingdom)", "description": "Once upon a time, hidden in the flowers and the thorny brambles, there was a magical place called the Little Kingdom. The Little Kingdom was full of tiny elves and fairies who were all friends -- and there were no better friends than Ben and Holly. This keepsake hardcover storybook is the perfect introduction to the enchanted world of Ben the elf, Holly the fairy princess, and their special friend Gaston the Ladybird! Based on the Nick Jr. animated TV show, from the creators of Peppa Pig."}, {"id": "0547745605", "genre": "Children's Books", "title": "Stuck with the Blooz", "description": "What do you do when you're feeling blue--especially when your mood takes the form of a drippy, oozy monster called the Blooz? Do you ignore it? Do you ask it lots of questions? Do you give it an ice-pop and hope it goes away? Through trial and error, the child in this story discovers that while it may not be easy, it's not impossible to shake the Blooz.   With a read-aloud rhythm and whimsical illustrations, this debut picture book helps children talk about emotions--and is perfect for young fans of friendly monsters."}, {"id": "B006YVBE6S", "genre": "Children's Books", "title": "Drawing Poesy : Angel 2", "description": "The poetry work expressed by 38 drawings. Readable in English and Spanish.(Legible en Inglés y Español.)  Everyone has his or her angel. Your angel always want to help you. But, occasionally your angel might be at war with other's angel, and you might be not helped. Here is such a story. Enjoy the world of poesy drawn."}]