[{"id": "0312528124", "genre": "Children's Books", "title": "Alphaprints First Words", "description": "Adding to the stable of bestselling Alphaprints titles, First Words is a must-have word book for babies and toddlers that sits alongside Alphaprints ABC, one of American Baby Magazine's 24 Best Baby Books of All Time.This casebound board book has over 40 first words to learn, accompanied by the quirky Alphaprints animals and objects created using fingerprints and photographs of everyday objects. Each spread is themed―pets, park, vehicles, toys, farm, food, colors and animals―and the fingerprints are embossed for lots of see-touch-feel fun.This is the latest addition to the Alphaprints series, which has sold over 1,000,000 copies in the US alone, and is published around the world in 13 languages."}, {"id": "0736833099", "genre": "Children's Books", "title": "The Royal Mummies: Remains from Ancient Egypt", "description": "Describes royal mummies of Ancient Egypt, including some of the most famous royal mummies. Provides information on how the Ancient Egyptians made mummies, how scientists study them, and what they can teach us about the past."}, {"id": "B072LDSVZP", "genre": "Children's Books", "title": "The Addie Mills Stories (4 Book Series)", "description": "From Book 1: It&rsquo;s Christmastime in 1946, and all Addie wants is a pair of cowboy boots and a Christmas tree Ten-year-old Addie lives in Clear River, Nebraska, population fifteen hundred, with her stoic but loving father and quirky grandmother. Carla Mae is her neighbor and best friend in the fifth grade. Carla Mae&rsquo;s house is different than Addie&rsquo;s&mdash;she has five siblings and another on the way, while Addie is an only child. &#160; It&rsquo;s the week before Christmas, and shopping lists are at the front of the girls&rsquo; minds. Addie&rsquo;s house doesn&rsquo;t have a tree&mdash;her dad says they are a waste of money, and they&rsquo;ll be opening presents at Uncle Will&rsquo;s anyway. Uncle Will has a tree, but to Addie, it doesn&rsquo;t feel like Christmas without a tree of their own. Then she comes up with the perfect plan. Will it make this the best Christmas they&rsquo;ve ever had, or will her father never forgive her?"}, {"id": "088388156X", "genre": "Children's Books", "title": "Christopher Columbus", "description": "Magnificently illustrated from the 1493 and other early editions, with Columbus's own words in large, easy-to-read type in both Spanish and English. Line drawings to color are included."}, {"id": "1432924443", "genre": "Children's Books", "title": "Ancient Africa (Africa Focus)", "description": "Where in Africa can you find the world's largest mud-brick building? Why did the Ancient  Egyptians mummify bodies? Who gave a giraffe to the Sultan of Tunis? Africa Focus offers  fascinating and detailed coverage of a diverse and complex continent. The four titles examine  different aspects of Africa and its interaction with the world."}]