[{"id": "0613356098", "genre": "Children's Books", "title": "The Bookstore Burglar: Level 2", "description": "Someone stole the key to the Black Cat Bookstore! Lucky for the store's owner, Mr. Brown, his clever cat, Cobweb, is on the case. Cobweb has a plan to scare the burglar away, and the ghost who lives in the bookstore is happy to help. There's only one problem-the burglar doesn't believe in ghosts. But maybe he'll change his mind once he meets the special ghost who lives in the Black Cat Bookstore."}, {"id": "1635176239", "genre": "Children's Books", "title": "Vladimir Putin", "description": "Introduces readers to the political career of Russian President Vladimir Putin. Engaging infographics, thought-provoking discussion questions, and eye-catching photos give the reader an invaluable look into Russia and the office of its current leader."}, {"id": "B01N52GZ5P", "genre": "Children's Books", "title": "The Redwood Tree", "description": "Life among the Redwoods is ancient, diverse, beautiful and restorative. Both the minds of visitors and the greater environment of our world are better and healthier because these giants purify and heal. Share the magic of these trees with the young minds of those you love and help them learn to see the wonders in our universe."}, {"id": "1429639407", "genre": "Children's Books", "title": "Dirt Bikes (Full Throttle)", "description": "No other motorcycle can take a beating quite like a dirt bike. These lightweight speedsters combine strong suspension systems with high-powered engines and superb handling. Find out how today’s riders push their tough bikes to new limits in racing, freestyle, and beyond."}, {"id": "B00DU10PUG", "genre": "Children's Books", "title": "The Aeneid for Boys and Girls", "description": "Follow Aeneid as he flees a burning Troy with his family and sets out on a dangerous journey to found what will one day become The Roman Empire. Thrill with him as he gets caught up in conflicts between the gods, all the while striving to complete his own grand destiny. Virgil intended this book to be a sequel to the Iliad and the Odyssey, and as such it takes up with events just after the finish of the Odyssey. Inscribed here are myths and legends and tales of bravery destined to last for all time."}]