[{"id": "0763623075", "genre": "Children's Books", "title": "How Kind!", "description": "What goes around comes around in this farmyard tale about the contagiousness of kindness.Hen gives Pig an unexpected present. \"How kind!\" says Pig. Pig is so touched, in fact, that he decides to do something kind too. So Pig gives Rabbit a gift. \"How kind!\" says Rabbit, who does something kind for Cow, who is kind to Cat, who wants to be kind in turn. Where will all of this kindness lead?"}, {"id": "1612445292", "genre": "Children's Books", "title": "Nettie's Garden", "description": "This book is based on a true story that can bring hope to someone who is grieving the loss of a loved one. It is meant to encourage everyone to trust in God’s perfect timing and wait on Him."}, {"id": "1626721076", "genre": "Children's Books", "title": "Fable Comics: Amazing Cartoonists Take On Classic Fables from Aesop and Beyond", "description": "From classics like \"The Tortoise and the Hare\" and \"The Grasshopper and the Ants\" to obscure gems like \"The Frogs Who Desired a King,\" Fable Comics has something to offer every reader. Twenty-eight fables from different cultures and traditions are wonderfully adapted and illustrated in comics format by twenty-six different cartoonists. Edited by New York Times bestselling Fairy Tale Comics' Chris Duffy, this jacketed hardcover is a beautiful gift and an instant classic."}, {"id": "B00IRJLKJG", "genre": "Children's Books", "title": "Up & Away", "description": "UP & AWAY is a story about a little girl who travels with her grandmother. They travel by plane from Kentucky to Florida. This is Michele's first time flying. Her Gamma helps her learn a few things about air travel, from navigating airport security to explaining turbulence."}, {"id": "157658934X", "genre": "Children's Books", "title": "Paul Brand Audiobook: Helping Hands (Christian Heroes: Then & Now)", "description": "The son of missionary parents, Paul Brand did not plan on becoming a doctor. After training as a builder, he was called by God into medicine and spent a lifetime treating leprosy and restoring hope to thousands of sufferers.  Dr. Paul Brand became the first surgeon in the world to use reconstructive surgery to correct the deformities of leprosy in the hands and feet. He strove to eliminate the stigma of the disease and rebuild the lives of those destroyed by it. A humble, brilliant servant, he influenced faith and medical communities around the world, reminding us that all people are created in the image of God. (1914-2003) Audiobook: CD format (4 CDs) Running Time: Approximately 4:59 hours. Read by Tim Gregory. Ages 8-10 to Adult"}]