[{"id": "0140817549", "genre": "Children's Books", "title": "A Passage to India (Penguin Student Editions)", "description": "After a mysterious incident during their visit to the Marabar Caves, the charming Dr Aziz is accused of assaulting Adela Quested, a naive young Englishwoman. His trial exposes the fragile structure of Anglo-Indian relations and the racism inherent in colonialism is exposed. \"A Passage to India\" compellingly depicts the fate of individuals caught between the great political and cultural conflicts of the modern world."}, {"id": "0778733742", "genre": "Children's Books", "title": "Wedges in My Makerspace (Simple Machines in My Makerspace)", "description": "Children will enjoy this creative book which uses the principles of Makerspace to introduce them to the wedge. Simple text describes the structure and uses of wedges, and clear, step-by-step instructions show children how to make one. Readers are then provided with stategies to start their own creative projects using the wedge they made. Along the way, tips and helpful hints guide children on how to brainstorm and solve problems working as a team."}, {"id": "153214086X", "genre": "Children's Books", "title": "A Chasing Tail Part Three 3 (Guardians of the Galaxy: Rocket Raccoon)", "description": "After narrowly escaping Devin-9 and an epic space battle against a battalion of Rocket's ex-girlfriends, Rocket meets with Macho's boss Funtzel to track down his imposter. Aligned to Common Core Standards and correlated to state standards. Spotlight is a division of ABDO."}, {"id": "0997306556", "genre": "Children's Books", "title": "The Adventures of Super Bear: The Quest for Pie", "description": "Even super heroes can’t resist pie.As soon as Theodore Bear smells what Mama Bear is baking in the kitchen, he has an idea. He puts on his magical cape and becomes… Super Bear! Sneaking into the kitchen is easy when you’re invisible, but Super Bear soon learns even super heroes need protecting sometimes. Good thing Mama Bear has an idea too. She needs help keeping her family safe, and it looks like just the right job for Super Bear!The Super Bear book series is aimed toward helping children learn about safety, friendship, the value of family and other important life lessons. Super Bear’s parents are fun-loving and encouraging. They support Super Bear’s imagination and his belief that he is a super hero and use his love of make-believe to help guide him toward doing the right thing."}, {"id": "1402751176", "genre": "Children's Books", "title": "Sterling Point Books®: Abraham Lincoln: Friend of the People", "description": "This Newbery Honor Book\u0097from a three-time Newbery Honor author\u0097paints an indelible portrait of the prairie president. Clara Ingram Judson presents Lincoln in all his gauntness, gawkiness, and greatness: a backwoods boy who became President and saved the Union. Judson’s careful reading is enlivened by her visits to his home and vivid descriptions of the Lincoln family’s pioneer life. She reveals the unforgettable story from his boyhood and days as a shopkeeper and lawyer, to Lincoln’s first elected offices and his election as president, the Civil War, and assassination."}]