[{"id": "1454927747", "genre": "Children's Books", "title": "Time for a Trip (Snuggle Time Stories)", "description": "What time is it? It’s TIME FOR A TRIP!   Little Bunny’s all packed and ready to go—and imagining the many ways his family might travel. Will they board a bus or a choo-choo train? Sail on a ferry or blast off on a plane? In the end, everyone piles in the car and they visit the best place of all: Gramps and Granny’s house! What fun."}, {"id": "0399250743", "genre": "Children's Books", "title": "The Way Back Home", "description": "From the illustrator of the #1 smash hit The Day the Crayons Quit comes an imaginative tale of friendship in a world where what makes us different isn't nearly as important as what makes us the same.When a boy discovers a single-propeller airplane in his closet, he does what any young adventurer would do: He flies it into outer space! Millions of miles from Earth, the plane begins to sputter and quake, its fuel tank on empty. The boy executes a daring landing on the moon . . . but there’s no telling what kind of slimy, slithering, tentacled, fangtoothed monsters lurk in the darkness! (Plus, it’s dark and lonely out there.) Coincidentally, engine trouble has stranded a young Martian on the other side of the moon, and he’s just as frightened and alone. Martian, Earthling—it’s all the same when you’re in need of a friend."}, {"id": "1609589084", "genre": "Children's Books", "title": "Mini Mysteries (Revised): 34 Tricky Tales to Untangle", "description": "Perfect fun for super sleuths! There's a mystery lurking in all 34 bite-sized stories. Once you crack the cases, you can open the ?Detective's Doors\" inside the front and book covers of the book to check your answers."}, {"id": "0375968989", "genre": "Children's Books", "title": "Crime Wave! (DC Super Friends) (Step into Reading)", "description": "Join Superman, Batman, Aquaman, and the rest of the DC Super Friends as they fly off on a new adventure in this Step into Reading leveled reader for boys ages 5-8. When the mysterious Black Manta steals the world's largest pearl, the Super Friends rush in to save the day—but they will have to face the twisting tentacles of the Black Manta's giant octopus first!"}, {"id": "0312492510", "genre": "Children's Books", "title": "Wipe Clean: Letters (Wipe Clean Learning Books)", "description": "Help your child learn to write letters with this amazing wipe-clean book. The outlines to complete and activities to do make writing practice simple! The special pen included allows letters to be written again and again―simply wipe them away with a cloth."}]