[{"id": "B007BJEDGK", "genre": "Children's Books", "title": "Puppy and Molly: Go To Holland", "description": "In real life Puppy the fox terrier, and Molly the black and white cat, are best friends. In this short book, Puppy and Molly visit Holland with their Pop. They have exciting adventures and see windmills, canals and tulips, and eat interesting Dutch food. The pets become lost, but Puppy saves the day. This is a story about friendship and having fun.This book, directed at young readers, is told in a series of rhyming verses."}, {"id": "1478962585", "genre": "Children's Books", "title": "Blake Griffin: Library Edition (Great Americans in Sports)", "description": "A portrait of the #1 draft pick, Rookie of the Year, Slam Dunk Contest winner and leading NBA power forward discusses his early athletic years, the injury that challenged his first pro season and his achievements on the court. Simultaneous."}, {"id": "0746024509", "genre": "Children's Books", "title": "Passing and Shooting (Soccer School)", "description": "Fully illustrated with exercises and example s, this book covers all the skills and techniques needed to make a successful pass or shot at goal. '"}, {"id": "1942875304", "genre": "Children's Books", "title": "The Early Cretaceous Volume 1: Notes, Drawings, and Observations from Prehistory (Ancient Earth Journal)", "description": "What it would be like to see a living, breathing dinosaur? The Early Cretaceous brings readers closer to prehistoric life than ever before. By combining the latest paleontological findings with highly detailed, intimate drawings of wildlife from the Early Cretaceous, readers will look into the eyes of some of the most fascinating creatures to ever inhabit the earth. Written and illustrated in the style of a naturalist's notebook, the viewer will be given a first-hand account of what it is like to stand alongside everything from the first birds to flying dinosaurs to some of the largest creatures ever to walk the earth."}, {"id": "1840329890", "genre": "Children's Books", "title": "Bear Stories: Threadbear, One Bear at Bedtime, Bear", "description": "This is a gorgeous audio compilation of Mick Inkpen's classic bear stories, including Threadbear, One Bear at Bedtime, and Bear. Mick Inkpen is one of the top-selling picture book artists and writers in the world whose stories have sold millions worldwide. He is a winner of the British Book Award for the best illustrated book, for Lullabyhullabaloo, and the Children's Book Award for Threadbear. Kipper won a BAFTA for best animated children's film in 1998."}]