[{"id": "B00G2CLHK2", "genre": "Science Fiction & Fantasy", "title": "The Werewolf of Camelot", "description": "Return to Arthurian romance, magic, secrets, surprises and danger. In this bawdy sequel to Merlin’s Charge, in Camelot (a land where they say lovers can turn into swans) new horrors befall as shapeshifting chaos unleashes a violent werewolf monster into the wintry land. Will order be restored and the curse lifted in time for King Arthur to stop the invading Saxons? Or is the real danger entirely a family affair."}, {"id": "0060791276", "genre": "Science Fiction & Fantasy", "title": "Companion to Narnia, Revised Edition: A Complete Guide to the Magical World of C.S. Lewis's The Chronicles of Narnia", "description": "Step into the WardrobeThis peerless companion has served as an adventurer's passport to the land of Narnia for twenty-five years and was used by the cast and crew of the major motion picture The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe. From Aslan, the Great Lion, to Zardeenah, the mysterious lady of the night, this comprehensive, accessible book contains hundreds of alphabetically arranged and indexed entries covering all the characters, events, places, and themes that Lewis brilliantly wove into his timeless and magical world.For readers of all ages, this is the perfect guide for the enchanted world of C. S. Lewis's The Chronicles of Narnia."}, {"id": "1556348053", "genre": "Science Fiction & Fantasy", "title": "Gurps Zombies, 4th Edition", "description": "Braaains! Zombies have shuffled into mainstream cinema, television, and digital games. They've even crept into the news! And now, thanks to the power of GURPS, they've battered down the walls of horror roleplaying. GURPS Zombies covers a horde of shamblers and infected freaks, from the ritually drugged slaves, through flesh-eating ghouls, to fantasy undead... and beyond! Curses, plagues, magic, mad science: if it turns people into mindless monsters, it's here. Zombies helps the Game Master design and deploy zombies in any genre, while giving the players the advice they need to tackle the roles of hard-boiled survivors. Whether zombies are a one-off encounter or a world-destroying apocalypse, GURPS Zombies can bring any campaign back from the dead."}, {"id": "0973118474", "genre": "Science Fiction & Fantasy", "title": "Gift of Gamman", "description": "A 243-year young astronaut and a beautiful lieutenant traverse the Void of Cosmos at 85% of the velocity of light. Extraordinary! And then they meet people advanced 150,000 years beyond the human race. You will laugh and you will cry, but most of all, you will be amazed. Perhaps, flabbergasted! It will stretch you imagination to outer limits, and beyond.   The next gigantic step in human evolution! As surprising as it is unexpected. Staggering! Incredible! This book has everything. Love, suspense, mystery, surprise, danger, enigmatic aliens, explanation of ancient myths, and much, much more…"}, {"id": "0143123629", "genre": "Science Fiction & Fantasy", "title": "Shadow of Night (All Souls Trilogy, Bk 2)", "description": "The #1 New York Times–bestselling sequel to A Discovery of Witches, book two of the All Souls Trilogy—“as enchanting, engrossing, and impossible to put down as its predecessor” (Miami Herald) J. K. Rowling, Stephenie Meyer, Anne Rice—only a few writers capture the imagination the way that Deborah Harkness has with her New York Times–bestselling All Souls trilogy. A Discovery of Witches introduces reluctant witch Diana Bishop, vampire geneticist Matthew Clairmont, and the battle for a lost, enchanted manuscript known as Ashmole 782. Picking up from A Discovery of Witches’ cliffhanger ending, Shadow of Night takes Diana and Matthew on a trip through time to Elizabethan London, where they are plunged into a world of spies, magic, and a coterie of Matthew’s old friends, the School of Night. As the search for Ashmole 782 deepens and Diana seeks out a witch to tutor her in magic, the net of Matthew’s past tightens around them, and they embark on a very different—and vastly more dangerous—journey."}]