[{"id": "B002UZDTD8", "genre": "Children's Books", "title": "101 Dalmatians (Puffin story books)", "description": "The book that inspired the animated movie classic!When Dearly's Dalmatians have their first litter of pups—fifteen in all—everyone is delighted. But their joy is shortlived, for the pups are kidnapped! Scotland Yard is baffled, but the keenest canine minds are on the case—and on the trail of Cruella de Vil, the most fiendish person to ever covet a fur coat.Pongo and Missis would give everything they have to bring their puppies safely home... but will they succeed in rescuing them from the cluthes of the evil Cruella de Vil?\"A tale full to overflowing with those prime requisites of a good story—warmth and humor, imagination and suspense.\"—Chicago Sunday Tribune\"Superb reading. The puzzle of the hundred and one is delightful.... Highly recommended.\"—SLJ"}, {"id": "1482439654", "genre": "Children's Books", "title": "20 Fun Facts About Baseball (Fun Fact File: Sports!)", "description": "Baseball is known as Americas pastime, and it has plenty of history to explore. Readers will love learning wacky facts about baseball and discover who holds some of its most elusive records, like the rare unassisted triple play! The longest game in Major League history and some of its most amazing seasons are also explored with exciting photographs and engaging graphics to help chronicle these feats. This fast-paced book delivers readers fact after factjust like the hardest fastball pitchers pound the strike zone with ease."}, {"id": "0375910433", "genre": "Children's Books", "title": "Hooray for Hanukkah!", "description": "In a new and very different approach to the traditional Hanukkah story, one family’s celebration of the joyous Jewish winter holiday is seen from the perspective of the family menorah! From the first night and the first candle, the menorah describes how the family celebrates and how it feels to glow with more light each night. The emphasis on light gives the story of this family holiday an especially warm tone."}, {"id": "B075G4CKPQ", "genre": "Children's Books", "title": "Howl like a Wolf!: Learn to Think, Move, and Act Like 15 Amazing Animals", "description": "What does it feel like to “see” with your ears like a bat or go through a full body transformation like a frog? Can you wriggle in and out of tight places like an octopus, camouflage yourself like a leopard, or do a waggle dance like a honeybee? This creative and beautifully illustrated interactive guide makes learning about animals fun for children ages 6 and up. Sixteen animals explain their amazing feats and invite kids to enter their world by mimicking their behavior — an imaginative approach to learning that fosters curiosity, empathy, and dramatic play."}, {"id": "0982068697", "genre": "Children's Books", "title": "P-i-c-k-l-e-s Spells Pickles", "description": "P-i-c-k-l-e-s Spells Pickles is the first in a series of Mama says…picture books dedicated to supporting child readers and strong family bonds.  The book is a fun, easy to read story which captures children’s attention through the main character, Pickles, a gray tabby kitten who navigates adventures in family life.  Pickles overcomes the obstacle of learning to read and teaches children how to think positively.  The book is devoted to reinforcing solid family values and promoting literacy and core academic standards.  It is appropriate for preschool and early elementary education students and appeals to all learners."}]