[{"id": "150263287X", "genre": "Children's Books", "title": "Warriors of the Southwestern Tribes (Native American Warfare)", "description": "The southwest tribes include the Apache, Navajo, and Pueblo. These tribes are known for their art, architecture, and fierceness in battle. This exciting book captures the richness of these tribes' cultures and provides an in-depth look at the warriors and wars that shaped them."}, {"id": "0142427268", "genre": "Children's Books", "title": "Slaves of Socorro (The Brotherband Chronicles)", "description": "The fourth installment in the New York Times bestselling Brotherband series, for fans of Lord of the Rings and Game of Thrones Hal and his fellow Herons have returned home to Skandia after defeating the pirate captain Zavac and reclaiming Skandia's most prized artifact, the Andomal. With their honor restored, the Herons turn to a new mission: tracking down an old rival turned bitter enemy. Tursgud—leader of the Shark Brotherband and Hal's constant opponent—has turned from a bullying youth into a pirate and slave trader. After Tursgud captures twelve Araluen villagers to sell as slaves, the Heron crew sails into action . . . with the help of one of Araluen's finest Rangers!"}, {"id": "B00IOVU9NA", "genre": "Children's Books", "title": "childrens books : I Wish I Were a Squirrel (Great Book for Children) (Ages 4 - 9)", "description": " Darla : \"Cute book\"   Fawn Nielsen :\" It was funny\"   Fawn Nielsen :\" It was funny\"   Grady Harp : \"`If I could be anything.....' ** Amazon Prime Members can download this book for FREE! **  Meet an ELEPHANT who wants to be a Squirrel This is Taylor. Taylor is an elephant. He is 7 years old, some people would call her a small elephant. But Taylor doesn't want to be a elephant . He would prefer to be a SQUIRREL.He wants to have all the advantages that SQUIRRELS have. So, let’s join him on his dream.  For more books of Dan Jackson,  write  Dan Jackson  in the search bar  Visit : http://landofchildrensbooks.blogspot.com for more Great Books  Authors ? Promote your book at my blog "}, {"id": "B00IRB5IR4", "genre": "Children's Books", "title": "Chinook the Ferret: T'was the Night Before Christmas", "description": "On Christmas Eve night, while the family remains asleep, Chinook the Ferret awakens to noises outside his house. Looking out the window, he sees St. Nicholas in an air-borne sleigh pulled by eight reindeer. This delightful tale of \"T'was the Night Before Christmas\" takes on a new twist through the eyes of the family pet, Chinook the Ferret."}, {"id": "B00UVLDLS6", "genre": "Children's Books", "title": "JV Superstar: A Christian College Odyssey", "description": "Picking up where Homeschool Sex Machine left off, the adventure through 90s Christian culture brings us to that notorious institution of chaos and debauchery:The Christian college.Step into a world of acoustic guitars, group dates, jean skirts, WWJD bracelets, and mandatory church attendance.  A world where your goal is to acquire a spouse, and if absolutely necessary, a diploma."}]