[{"id": "1558589988", "genre": "Children's Books", "title": "Wynken, Blynken, & Nod", "description": "\"\"This classic bedtime poem appears in a newly illustrated edition. . . . Westerman's minutely detailed watercolors depict a Dutch landscape where three children, dressed in nightclothes, and a cat set sail in a wooden shoe. The luminosity of the moonlit sea is captured in muted shades of blue that create a soothing mood for the dramatic verse\"\".--\"\"School Library Journal\"\"."}, {"id": "0990640116", "genre": "Children's Books", "title": "Hornswoggle", "description": "Eden finds a mysterious shop in the orchards where she acquires a dragon egg. All attempts to help the dragon learn to fly fail as she discovers that not everyone's gifts are the same, and a deep friendship is born. Jeremiah 29:11"}, {"id": "1481447092", "genre": "Children's Books", "title": "Fur, Feather, Fin―All of Us Are Kin", "description": "Come along on a rhyming tour through the amazing animal kingdom—from mammals to millipedes and everything in between—with this engaging picture book about how all creatures are connected!There are so many wild and wonderful animals in our world. Some have fur, some have feathers, some have fins, but all are connected. This fact-filled rhyming exploration of the diversity of the animal kingdom celebrates mammals, birds, insects, fish, reptiles, amphibians, and more! It’s a perfect match for budding naturalists and animal enthusiasts everywhere."}, {"id": "0893462586", "genre": "Children's Books", "title": "Adventures of the One Inch Boy (Heian's Japanese Fairy Tale)", "description": "Tired of being picked on because of his small size, Issun Boshi, only as tall as a finger decides to travel to the capital, where he saves a princess from a fierce demon."}, {"id": "1524759562", "genre": "Children's Books", "title": "Rad American Women A-Z Postcards", "description": "Celebrate the radical heroines who shaped America's history with twenty-six portraits--to send to your senator or save for yourself--originally from the New York Times bestselling book Rad American Women A-Z published by City Lights Books. Bound in a hardcover binding, each of these 26 brightly-colored postcards features the image of an American feminist on the front and, on the reverse, a small fact about the heroine with room to write an original greeting."}]