[{"id": "149921880X", "genre": "Science Fiction & Fantasy", "title": "Adventure Quarterly #5 (PFRPG)", "description": "The Adventure Quarterly Relaunch! Welcome to the latest issue of Adventure Quarterly, now with new hand drawn cartography by Tommi Salama and all original art to help createencounters and stories you want to be a part of. Where creative designers cut their teeth, or continue to sink seasoned canines, into the meat of what makes an enjoyable adventure. Ruins Perilous, Level 3, The Sensodrome:Immerse yourself in the Sensodrome. At one time this magnificent subterranean concert hall that has been transformed in to puzzle traps for all your senses A location adventure for 3rd level PCs that tests the mettle of adventurers by Mike Welham. Legacy of the Fishermage: A unique new quest adventure for 9th level characters from Michael Allen, The Salmon of Wisdom who ate the acorns that fell from the Tree of Knowledge has spawned again and the ogre, Grenneck Shieldfist, is close to finding it and succeeding where the Fishermage who long sought for it, failed. Paradox: this gauntlet of combat and temporal conjecture, throws the PC into the midst of a disintegrating multiverse, can the PCs set things right or will all they have adventured for be for nothing? A great capstone adventure for long running campaigns and 18th level characters by Bret Boyd"}, {"id": "B00PB7JTHC", "genre": "Science Fiction & Fantasy", "title": "1636: The Barbie Consortium (Ring of Fire Book 18)", "description": "Prequel to 1636: The Viennese Waltz. The Barbies are rising. After their West Virginia town is transported to 1630s continental Europe, a group of teenage girls discover that bringing future technology and future business practices to a backward Europe just emerging from the Middle Ages can be very lucrative indeed—and might even change the course of empire.At the publisher's request, this title is sold without DRM (Digital Rights Management)."}, {"id": "1491022884", "genre": "Science Fiction & Fantasy", "title": "Concealed Power (The Healers of Meligna)", "description": "               \"There was an illness much worse than anything I had ever seen, and that was the sickness of my country.\" Fourteen year old Adenine is blind and isolated in her small attic bedroom. The last carrier of the Death Plague -- that wiped out thousands of her country's people twenty-five years ago -- she must avoid contact with the outside world.  When her mother fails to bring her food Adenine begins to starve. Driven by her hunger, Adenine ventures into the house discovering her mother bedridden and sick. Despite her terror of infecting others, Adenine fumbles her way onto the streets of Borrelia in search of the town's doctor. Soon, she is surrounded by new friends... and enemies she never knew existed. Adenine's mother is keeping dark secrets, her friends are lying to her and when threats arise she must decide who to trust."}, {"id": "3836660067", "genre": "Science Fiction & Fantasy", "title": "The Role of Science Fiction", "description": "In \"The role of Science Fiction in selected works of Isaac Asimov and Kurt Vonnegut\" the author elaborates upon important similarities and differences between the use of science fiction motives in selected works of Isaac Asimov and Kurt Vonnegut. The analysis includes Asimov's Foundation and Robots and Empire and Vonnegut's Sirens of Titan and Galapagos."}, {"id": "1470838494", "genre": "Science Fiction & Fantasy", "title": "An Almond for a Parrot: Library Edition", "description": "In prison, accused of murder, Tully Truegood begins to write her life story. A story that takes her from a young girl in the backstreets of eighteenth century London to her stepmother Queenie's Fairy House--a place where decadent excess is a must.Trained by Queenie to become a courtesan, and by Mr. Crease--a magician who sees that Tully holds similar special powers to his own--Tully soon becomes the talk of the town.But as Tully goes on a journey of sexual awakening, she falls in love with one of her clients and the pleasure soon turns to pain. Especially when the estranged husband she was forced to marry by her father suddenly seeks her out. Now Tully is awaiting her trial for murder, for which she expects to hang ... and her only chance of survival is to get her story to the one person who might be able to help her.Delaney's incredible tale of a young woman's journey out of the depths of despair is shocking, haunting, and evocative. Part historical fiction and part magical realism, this juicy, jaw-dropping story will linger long after the last page is turned."}]