[{"id": "1633360288", "genre": "Children's Books", "title": "Time Capsule: A seriously awesome kid's journal", "description": "For the child who's curious to discover how mighty his own story can be. Invite your child to explore his creativity and discover how mighty the pen can be by diving deep into what sparks his interest. With this time capsule journal, he will record awesome adventures, achievements, and milestones as he improves his penmanship. The engaging prompts encourage him to write and doodle stories—both serious and silly—while building self-esteem. He can even add interesting photographs and memorabilia. Let master storycatcher Katie Clemons help your child assemble the perfect treasure chest of youth . . . his story! For ages 8 and up."}, {"id": "B0198Y0RYW", "genre": "Children's Books", "title": "Deleting Files", "description": "Molestation happens in every country on any given day.  This storyline is based on factual events of one young girl and her trials of molestation, starting at age eight. Dina, who is now a bright 13 year old, will take you through her life of being molested.   This book is perfect for younger folks, as well as adults. It is a great learning tool for victims and/or those who have had similar experiences.There are two women you will meet, Sadie and Marbella, who absolutely adore Dina and sense distress. However, they also have their issues and stories to tell. Please read this with your sons and daughters. Remind them how special they are and deserving of a safe happy life. Help them learn what to do if this dreadful act happens and how to prevent it.Lastly, there is a plethora of useful information including government agency phone numbers, how to detect if your child is being molested, and what to do about it. And always, always, tell someone if it happens!"}, {"id": "1844436616", "genre": "Children's Books", "title": "Sound: Listen Up (Science in Your Life) (Science in Your Life)", "description": "What sounds cannot be heard? How do bats find their way in the dark? What animal makes the loudest sound of any on Earth? Take a closer look at the science we use every day! From the moment we get up in the morning and all through the day and night, find o"}, {"id": "1590181891", "genre": "Children's Books", "title": "Family Violence (Lucent Overview Series)", "description": "Examines issues related to child abuse, battered wives, and other family violence concerns, how they affect families and society, and what can be done about them."}, {"id": "0399539514", "genre": "Children's Books", "title": "Scooby-Doo Mad Libs", "description": "A timeless Mad Libs based on the kids classic Scooby-Doo! It's no mystery why fans love our new Scooby-Doo Mad Libs, featuring 21 original stories inspired by the classic animated television series. Play along with Fred, Daphne, Velma, Scooby, and Shaggy by filling in the blanks of all the hilarious stories."}]