[{"id": "0723258902", "genre": "Children's Books", "title": "How to Find Flower Fairies", "description": "“Children, the knowledge that I am passing to you is precious and must be carefully guarded…” After centuries of being hidden from human sight, the Flower Fairies allowed Cicely Mary Barker a glimpse into their enchanted fairy world in Fairyopolis. Now you can continue the adventure with this spectacular new novelty book where every page unlocks the secrets behind the magical places the fairies call home. Five eye-popping spreads include intricate three-dimensional pop-up images of flowers and trees that magically open up to reveal the secret homes of the fairies. Lift-the- flaps, booklets, maps and other ephemera provide interactive fun on every page leading up to a stunning surprise on the final spread. Choking Hazard (1); Not for children under 3 years.For full text of warning label click here."}, {"id": "1426320663", "genre": "Children's Books", "title": "National Geographic Kids Guide to Photography: Tips & Tricks on How to Be a Great Photographer From the Pros & Your Pals at My Shot", "description": "In the age of smartphones and selfies, why not learn from the pros how to take great photos to share with friends and family! Here's a fun, fact-filled, kid-friendly guide that is jam-packed with all the essentials for budding photographers. From how to set up a shot and stage the lighting and from the best software to short assignments, you'll learn all the important photographic concepts and basics of equipment, lighting aperture, lenses, depth of field, and more. This wide-ranging book also has sections devoted to composition and photographing different subjects (animals, people, sports, landscapes). Before and after shots offer visual explanations while tips and photographs from National Geographic photographers are featured throughout, making this the best photography guide out there today for children (and adult beginners too!)."}, {"id": "1978193041", "genre": "Children's Books", "title": "Chicken Race: Diary of a Running Chicken (Adventure Stories for Kids)", "description": "A race, a chicken jockey, and a reason to live. These elements make this brief story a joy to read.  Brynn is a zombie boy, an irregular one, because he is the only zombie kid that rides a chicken every day. His chicken, Chick Norris, and he participate in an event that should have been fun and fast, but instead, they get lost in the wild, unable to find their way home. A giant bear, a friend, and more adventurous happenings cross his path before he finds a solution to it all. Quickly start reading about this chicken jockey who found his way home and became victorious."}, {"id": "0310750466", "genre": "Children's Books", "title": "The Purpose Driven Life Devotional for Kids", "description": "The Purpose Driven Life Devotional for Kids includes 365 devotions that tie to the themes and ideas found in the bestselling The Purpose Driven Life by pastor Rick Warren. Written especially for children ages 8 and up, and featuring a ribbon marker, each devo includes a Scripture, short message, and prayer or thought for the day to help kids discover who they are in God’s eyes. Capturing the hearts of the new generation means ensuring they know their purpose and grow up confident of their value in God and their relationship to Christ.God created each of his children with a purpose in mind … the time is now to, thoughtfully and prayerfully, start the incredible journey to finding that reason."}, {"id": "1505557720", "genre": "Children's Books", "title": "1: The Retrievers of TerraUna (Volume 1)", "description": "Ten year old Justin Siridean expected to come home from school and meet his dad for a fun night of food and sports. When Justin arrived home, he found out that his father, Stanley Siridean, was missing from his work. Justin was shocked to find out that his father's job was not what Justin thought it was. Justin was then summoned by the TerraUna, the secret World Government, to help find his father. Justin Siridean would be thrown into a world that he didn't know existed in order to save his father. Will Justin succeed? Stuart Ackerman MSc.Ed,.B.A. is a certified teacher, television host, and author."}]