[{"id": "B01IPSETNW", "genre": "Children's Books", "title": "How Sensors Work (Connect with Electricity)", "description": "Have you ever seen lights turn on automatically when you step into a room? Or have you ever wondered how a garage door knows to not close when someone is standing beneath it? What these and countless other electronic devices have in common is a sensor. But how do sensors work? What are they used for? Discover how robotic and electronic sensors can be programmed to work as our five senses do. Learn how sensors are used to save energy, keep us safe, and sometimes make life a little more convenient!"}, {"id": "1602707375", "genre": "Children's Books", "title": "The Spoiled Sport (The Adventures of Marshall & Art)", "description": "When Marshall and Art join a soccer team, their teammate Chad talks only about winning and not about having fun, and the brothers teach both him and his father about good sportsmanship."}, {"id": "B00YSIUCZI", "genre": "Children's Books", "title": "How Goose Got Ready for Winter", "description": "One morning Goose smells winter coming in the breeze. So he jumps up to go  get ready. But then, “Honk!” he says. “Oh, golly-olly! I don’t remember how!”      Follow our well-meaning but absent-minded little friend Goose. He has perfectly good intentions but an imperfect memory, as he bustles about trying to remember how to get ready for winter.       As the child learns the value of friendship and family, so does Goose. His friends Bear and Rabbit do their best to help him, to no avail. But when his cousin Duck drops by for a visit, it all comes together for Goose.    This story connects with kids through the innate touchstone of the child as a member of the natural world, as well as a member of the social world of friends and family. Check out the Spanish-language version (“De cómo Ganso se preparó para el invierno”), on Amazon now. "}, {"id": "8854412538", "genre": "Children's Books", "title": "Bronto's Search for Dad: 4 Friends and Their Jurassic Adventures (Baby Dinosaurs)", "description": "Meet Baby Brontosaurus and Watch Him Grow!  Where, oh where can Bronto’s daddy be? He went out early in the morning and disappeared! Bronto is VERY worried—but, fortunately, his friends are there to help him search. Terri flies over the forest, while Trixie and Rex look for clues. Together, can they follow dad’s footsteps and solve the mystery? The adorable art and charming story will reassure every child who has felt anxious about a missing parent."}, {"id": "0439559650", "genre": "Children's Books", "title": "Cat and Mouse in a Haunted House (Geronimo Stilton, No. 3)", "description": "Enter the world of Geronimo Stilton, where another funny adventure is always right around the corner. Each book is a fast-paced adventure with lively art and a unique format kids 7-10 will love.Who Is Geronimo Stilton?That's me! I run a newspaper, but my true passion is writing tales of adventure. Here on Mouse Island, my books are all best-sellers! What's that? You've never read one? Well, my books are full of fun. They are whisker-licking good stories, and that's a promise!The Case of Curlypaw Cannycat's CastleI was lost in a dark, spooky forest! Until I stumbled upon Curlypaw Cannycat's Castle. The castle was completely empty, or so I thought. But I quickly discovered that it was haunted - by cats! Let me tell you, this was one case where curiosity almost killed the mouse!"}]