[{"id": "0756619696", "genre": "Children's Books", "title": "My First Tractor Board Book (My 1st Board Books)", "description": "Introduces young children to the many different types of tractors and heavy machinery, including forklifts, front-end loaders, and more."}, {"id": "0822500744", "genre": "Children's Books", "title": "F. Scott Fitzgerald: Voice of the Jazz Age (Lerner Biographies)", "description": "Traces the troubled life of writer F. Scott Fitzgerald, from his spoiled, yet insecure childhood through his difficult marriage and writing career to his early death."}, {"id": "1786925702", "genre": "Children's Books", "title": "Classic Stories (Five-minute)", "description": "A range of treasuries of well-loved tales, perfect for shared reading time. Including artwork by Kate Toms, Stuart Lynch, Sarah Baker, Dawn Machell, and Katie Saunders, each tale is brought to life in bright and engaging style."}, {"id": "1974649938", "genre": "Children's Books", "title": "Farmer's Journal For Kids: Farmers Notebook (Farming Books For Kids)(V1)", "description": "Capture Your Farming Memories Keepsake JournalFarmers have the best stories to tell and this farmer’s notebook is the perfect place to capture them. At 6x9 and 108 lined pages it fits nicely on the back of the toilet beside the latest equipment magazine.Makes the perfect farmers gift for kids who love farming and the adults who raise them. Just imagine reading all the stories Grandpa used to tell when you can no longer see him.We have made the interior prompt free so you can write what you want where you want.Start recording those farming memoirs today and pass on your awesome wisdom and advice for generations to come.Whether you raise chickens, cows, pigs, goats or grain you will never forget the important dates and details with your new farmer’s journal.Scroll and grab a gift for the farmer you love today."}, {"id": "1592498507", "genre": "Children's Books", "title": "Penguin's Family / La familia del pinguino - Smithsonian Oceanic Collection (English/Spanish bilingual hardcover book) (Smithsonian Oceanic Coleccion) (English and Spanish Edition)", "description": "As penguin grows older, his mother and father take care of him. They protect him from hungry sea birds and provide him with food. Now they must teach him how to swim. Reviewed by the Smithsonian Institution for accuracy, Penguin s Family is a fun and informative story with beautifully detailed illustrations. This unique bilingual edition features both English and Spanish text on each page, for a unique language-learning experience!Book Features:- An informative storyline and colorful illustrations- English and Spanish text on each page - 32 pages- Appropriate for ages: 3-9- Hardcover dimensions: 11 15/16 x 8 3/4 inches"}]