[{"id": "1410987078", "genre": "Children's Books", "title": "Hop on the Pirate History Boat (Pirates!)", "description": "A strong sea breeze and a ship on the horizon! Aye, it'll be a good day to be a pirate. Have you ever wonderd why pirates became pirates? Read on to know why."}, {"id": "0486822788", "genre": "Children's Books", "title": "SPARK Dinosaurs Coloring Book (Dover Coloring Books)", "description": "Kids will definitely dig these dinosaurs! Thirty playful illustrations feature a friendly array of famous prehistoric creatures in all kinds of fun settings, from Triceratops on tropical islands to T. rex and his pterosaur pals as well as the ever-popular allosaurus, ankylosaurus, diplodocus, and many others. Features perforated pages printed on one side only for easy removal and display plus a bonus \"Draw Your Own Dinosaur Design\" page. Dinosaurs Coloring Book and other Spark titles offer a wide variety of engaging activities that will foster creativity in children ages 6 to 10."}, {"id": "0022967389", "genre": "Children's Books", "title": "Spotlight on Music, Grade 3, Electronic Student Edition (ELEMENTARY SPOTLIGHT ON MUSIC)", "description": "The electronic version of the Student Edition includes all aspects of the print Student Edition and provides teachers increased flexibility to share student edition pages in whole-class instruction."}, {"id": "1580898386", "genre": "Children's Books", "title": "Olive the Sheep Can't Sleep", "description": "Olive the Sheep is having trouble falling asleep--she'd rather stay up and play. Backed up by sleep science, this gentle story shares practical tips for how to make bedtime go smoothly as Olive falls asleep.Adorable Olive had a long day with her friends and is tired. She has a warm bath, is wrapped in a soft towel, rocks with her mom, stretches, and settles in for a good night's sleep. Using techniques based in neuroscience to help children relax, fall asleep, and stay asleep, author and child psychologist Clementina Almeida presents a charming and practical story for parents and children to share together."}, {"id": "B01N4HXPHI", "genre": "Children's Books", "title": "Books For Kids: Adventures Of The Clumsy Ninja: Hilarious Adventure Kids Ages 6 - 12", "description": "Adventures Of The Clumsy NinjaFrom The Back CoverHe was going to give the flowers to her. But here?! In front of everyone? Again doubt entered his mind. He was still in a quandary when he didn’t notice and tripped over something and fell face down on the floor.A shot of laughter rose up in the corridor. Tony turned around instinctively to see what had caused him to trip. What he saw made his blood boil: leering and sticking out his foot was Toby Duhamel. Toby. He was an eighth grader who had had an axe to grind with Tony ever since Tony beat him in a game of ping pong.“Oops,” he sneered. “Maybe you’ll watch where you are going next time.”Tony got up angrily, red in the face. His eyes instinctively looked for Emma. She wasn’t there. Good, maybe she didn’t see that. That jerk, Toby.Grab Your Copy Today!-------"}]