[{"id": "B076XS8LQQ", "genre": "Children's Books", "title": "Finn and the Fish (Finn the Hero Book 2)", "description": "Every hero starts out as a boy. Finn McCool, the great warrior from Irish mythology is no exception. Finn accidentally breaks a promise to his friend. In Finn and the Fish, he is afraid his friend will be mad at him and hopes he will forgive him. He might be a hero, but he has the same problems any kid would have. You can read this book yourself to find out what happens!Finn the Hero is a collection of three All By Myself! books for children just beginning to read. Children will love reading this series, with its simple text and colorful illustrations, all by themselves, again and again. Because they can!"}, {"id": "0545875730", "genre": "Children's Books", "title": "A New Class (Star Wars: Jedi Academy #4)", "description": "Victor Starspeeder is psyched to be starting school at the Jedi Academy. His sister, Christina does not share an enthusiasm for Victor's newfound educational path. She's horrified that her annoying baby brother will be there to cramp her style. While Victor means well, his excess energy leads him to spend a lot of time in detention with the little, green sage, Yoda. Yoda wants to channel Victor's talents, so he makes the young Padawan join the drama club. Victor is not pleased. \"Learn to control your anger, you must! Successfully manage their emotions, a good Jedi can. Box step and jazz hands ... hee hee ... young Padawan will!\" Victor will have to make new friends, get on his sister's good side, learn to use the force, and hope the year's drama club performance (\"Wookiee Side Story\"? \"Annie Get Your Lightsaber\"?) goes off without a hitch!"}, {"id": "B01I4FPHNW", "genre": "Children's Books", "title": "What Will Fat Cat Sit On? (The Giggle Gang)", "description": "What will Fat Cat sit on? The pig? (Oink!) The chicken? (Cluck!) How about the dog? (Grrrr.)      Everyone in this bumbling animal gang (understandably) hopes the victim will be someone else! Leave it to Mouse to come up with a brilliant solution that satisfies everyone, even Fat Cat himself. Filled with hilarious asides and an interactive question-answer format, this irreverent young picture book will delight toddlers who love to shout \"NO!\""}, {"id": "0778748731", "genre": "Children's Books", "title": "Joshua Wong: Student Activist for Democracy (Remarkable Lives Revealed)", "description": "Joshua Wong was born in Hong Kong less than one year before China took back control of the city from the United Kingdom. While the handover was peaceful, Hong Kongs citizens lost their right to fully democratic elections. Joshua's leadership as an activist came to international attention in 2014, during pro-democracy protests in Hong Kong. The protest became known as the Umbrella Movement. Although Joshua and his student organization called Scholarism promoted peaceful protest, he was jailed for his participation. Undiscouraged, Joshua continues to advocate for full and free elections in Hong Kong. He has been the subject of a documentary called Joshua: Teenager vs. Superpower, and has been recognized for his work with many awards including TIME magazines 25 Most Influential Teens."}, {"id": "0991480805", "genre": "Children's Books", "title": "Sunne's Gift: How Sunne Overcame Bullying to Reclaim God's Gift", "description": "Sunne is a magical being or \"magbee\". God imbues Sunne with the power of the sun. Sunne's straight-haired siblings, Earth, Watre, and Winde have unique powers of their own. When Sunne is teased and bullied by siblings because of Sunne's natural, kinky, curly, \"nappy\" and spirally afro-textured hair, Sunne desperately tries to change. Join Sunne as Sunne learns that there is beauty and power in difference. Sunne's Gift's message of self-love and bullying prevention, coupled with its sci-fi imagery, make it hit with people of all ages. The book contains Forest Stewardship Council Certified Paper."}]