[{"id": "1979700079", "genre": "Children's Books", "title": "Sharks Coloring Book 1 (Volume 1)", "description": "The perfect coloring book for every child that loves sharks. 40 coloring pages filled with nothing but sharks. Art is like a rainbow, never-ending and brightly colored. Feed the creative mind of your child and have fun! Each picture is printed on its own 8.5 x 11 inch page so no need to worry about smudging."}, {"id": "B071K9GJMK", "genre": "Children's Books", "title": "Henry the Green Engine (Thomas & Friends Engine Adventures)", "description": "This is a story about Henry the Green Engine. Henry was often ill and couldn't work. But then he tried some special Welsh coal, and got the chance to show everyone just what he could do…"}, {"id": "1524718572", "genre": "Children's Books", "title": "The Amazing Planet Earth (StoryBots) (Step into Reading)", "description": "The wacky robots from the award-winning apps, videos, and Netflix show, Ask the StoryBots, now star in their own early readers. This one is about our little corner of the solar system!Fans of the StoryBots will recognize the colorful art from their popular outer-space video, “A Beautiful, Beautiful World” (The Earth Song), on YouTube. There are eight planets in our solar system, but the most beautiful is the one we call home. This rhyming Step 1 Science Reader will entertain while imparting simple facts about everyone’s favorite planet.    Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story.Accolades for the StoryBots digital media: Appy Award for Best Book AppTeacher's Choice Award Editor’s Choice—Children’s Technology Review Family Choice Award Parents’ Choice AwardCynopsis Kids !magination Award for best educational mobile app "}, {"id": "0439568900", "genre": "Children's Books", "title": "Napoleon & Josephine: The Sword And The Hummingbird", "description": "Acclaimed authors Gerald and Loretta Hausman weave together the stories of Napoleon and Josephine and their turbulent love affair in this lavish and beautifully written novel.As Josephine grows up on the tropical island of Martinique, she dreams of moving to Paris to live a life of glamour. An arranged marriage to a French nobleman brings her to Paris, but not to the lifestyle she dreamt of. After a divorce and a terrible time during the French Revolution, she holds a party that Napoleon, the general who has grown famous after a series of military victories, attends. A tumultuous relationship develops that is filled with separations and fights and the most passionate declarations of love ever uttered."}, {"id": "B00AKR3M08", "genre": "Children's Books", "title": "Curious George Says Thank You Book and Stationery Kit", "description": "An elegant book and stationery kit that teaches kids the importance of saying thank you with the help of Curious George. When George receives a thank-you card in the mail, he decides to deliver his own thank-you cards to all of his friends, especially the mail carrier. Will he be able track her down without making too much trouble along the way? In addition to the paperback book Curious George Says Thank You, this handcrafted kit includes 10 colorful note cards and matching envelopes, an address book, and more than 150 fun stickers for decorating the cards and sealing each envelope! Children will love to read about George’s adventure and then use the kit to create their own thank-you cards—the perfect way to show appreciation to family and friends."}]