[{"id": "1561457914", "genre": "Children's Books", "title": "Planting the Wild Garden", "description": "A farmer and her son carefully plant seeds in their garden. In the wild garden, many seeds are planted too, but not by farmers hands. Different kinds of animals transport all sorts of seeds, often without knowing it. Sometimes rain washes seeds away to a new and unexpected location. And sometimes something extraordinary occurs, as when the pods of Scotch broom burst open explosively in the summer heat, scattering seeds everywhere like popcorn. Kathryn Galbraith's lyrical prose seamlessly combines with Wendy Halperin's elegant, crisp illustrations to show that many elements-some unexpected-work together through the seasons to create and sustain the wild meadow garden."}, {"id": "1841937282", "genre": "Children's Books", "title": "The War on Terror (Timelines)", "description": "Chronologically describes terrorist events around the world from the mid-1960s through 2006 and discusses their impact on American policy toward terrorism."}, {"id": "0874833434", "genre": "Children's Books", "title": "Race With Buffalo and Other Native American Stories for Young Readers (American Storytelling)", "description": "The stories in this collection are vessels of century-old Native American lore, some of them perhaps brought to this continent by the original Native American settlers over 12,000 years ago. These stories include tales about ancient times, young heroes, tricksters, magical beasts and much more."}, {"id": "1942875428", "genre": "Children's Books", "title": "John Paul Jones: The Pirate Patriot (Great Leaders and Events)", "description": "A classic biography of John Paul Jones for young readers in a new, illustrated edition."}, {"id": "0996331522", "genre": "Children's Books", "title": "Kenny's (Short Little, Very Long) Prayerbook", "description": "If you're a kid (actually, even if you're a grown-up), it can be easy to find things to be grumpy about - life can be down right tough, sometimes! But, with the help of her mom, Kenny is determined to list all of the wonderful things she has to be thankful for in her Short Little, Very Long Prayerbook. Enjoy reading Kenny's 'thankful list' and then write your own. You may run out of paper, just like she did!"}]