[{"id": "0811854574", "genre": "Children's Books", "title": "Finger Puppet Holiday 8c Clip Strip: Little Reindeer (Finger Puppet Book)", "description": "An adorable finger puppet peeks through a die-cut hole on each page making this book an excellent way to read and play."}, {"id": "0761302689", "genre": "Children's Books", "title": "Butternut Hollow Pond", "description": "The wonders of nature are captured in this colorful tale as an array of creatures from a North American pond go about their daily business gathering food, caring for their young, building a home, and more."}, {"id": "1426304366", "genre": "Children's Books", "title": "Abe Lincoln Goes to Washington: 1837-1865", "description": "Now with an updated paperback cover, Abe Lincoln Goes to Washington paints a vivid picture of the Springfield, IL years, when Abe met and married a pretty Kentucky woman, and made his name as a lawyer and politician. Cheryl Harness gives readers a moving account of Lincoln’s rise and the tensions that dragged the nation into conflict; brilliantly detailed maps and battle scenes deepen our understanding of the Civil War; and the book’s richly imagined illustrations recreate the life of the man who will always be regarded as one of our greatest presidents.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "1585844780", "genre": "Children's Books", "title": "The Dirty Thirty (Gold mined collection)", "description": "Bath time has been your least favorite activity lately?  Now you want to take 3 baths a day, you say?  Imagine learning  fascinating science lessons while you're taking your bath!  This  bubbly book is packed with splashing scientific experiments to turn  your bathroom into a sassy science lab!  So...Find your supplies, Fill  your tub, and Feel the Fun!  Enjoy 30 exciting hands-on science  experiments that will make bath time a fun learning experience!"}, {"id": "0822563827", "genre": "Children's Books", "title": "Jane Addams: A Life of Cooperation (Pull Ahead Books Biographies)", "description": "Presents the life of the woman who founded Hull-House, a settlement house in Chicago, to help immigrants and the poor."}]