[{"id": "B00H6TFB7U", "genre": "Children's Books", "title": "Summer in Sweden / Verano en Suecia", "description": "A bilingual English and Spanish book for children.Stephan goes on vacation to Sweden with his mom.Here he experiences the simple delights of the swedish country side and family.  Following the story of challenge and triumph, children will be exposed to common sentences in english and spanish."}, {"id": "0698116240", "genre": "Children's Books", "title": "Shh! We're Writing the Constitution", "description": "Go behind the scenes at the Constitutional Convention, thanks to award-winning author Jean Fritz's words!This factual gem that's written with Newbery Honor author Jean Fritz's humorous touch chronicles the hot summer of 1787 where fifty-five delegates from thirteen states huddled together in the strictest secrecy in Philadelphia to draw up the constitution of the United States!Includes a copy of the Constitution and those who signed it!\"An informative, interesting, and immensely readable account of the Constitutional Convention of 1787 . . . An excellent choice for introducing young readers to the complexities of the constitution.\"—School Library Journal"}, {"id": "0395978254", "genre": "Children's Books", "title": "Angels Sweep the Desert Floor: Bible Legends About Moses in the Wilderness", "description": "Rabbis in ancient times believed that the answers to all questions could be found somewhere in the Bible. \u0093Turn it and turn it, for everything is in it,” they said. Each answer the rabbis found became a type of story, a midrash. Miriam Chaikin examines familiar midrashim, or stories from the Old Testament. This collection of eighteen moving and lyrical tales follows Moses and the Israelites as they wander the desert, sate their hunger with manna bread, receive the Ten Commandments, and, ultimately, reach the Holy Land. Glowing paintings capture the majesty of heaven and the grace of angels who watch over the Israelites during their difficult journey. Biblical notes, bibliography."}, {"id": "B00H9GUPAS", "genre": "Children's Books", "title": "Easy Reader Biographies: Betsy Ross", "description": "Guided Reading Level I. Learn the story of Betsy Ross and the first American flag in this full-color storybook! Includes historical facts, a picture comparison of the first flag and today's American flag, and a glossary!"}, {"id": "0761156984", "genre": "Children's Books", "title": "Indestructibles Wiggle! March!", "description": "Announcing a brand new idea in publishing books for babies: the completely durable, completely safe Indestructibles. Published on the same paper-like material used in shipping envelopes, Indestructibles are 100% baby-proof: chew-proof, drool-proof, and rip-proof. That's because Indestructibles not only will not tear or turn gummy with teething, but they are also completely washable.Indestructibles are also energetic, beautiful, and created just for baby. The printing material reproduces color artwork with uncommon depth, and with no residual inkiness; the artwork, paintings by Kaaren Pixton and reminiscent of Eric Carle, is happy, each page a simple, colorful image of an animal or bird or insect against a rich, textured background. The effect is 3D-like and completely visual. There are no words, making each perfect for parents and babies to look at together, with mom or dad telling the story.Three titles launch the series: Creep! Crawl! about animals that crawl, Flutter! Fly! about animals that fly, and Wiggle! March! about farm animals―books babies can really sink their teeth into."}]