[{"id": "0965257959", "genre": "Children's Books", "title": "Water Safety (Adventures in the Roo World, Young Roo Series, 5)", "description": "Teaches children the importance of water safety, and what they can do to be safe when playing in or around water."}, {"id": "0152060812", "genre": "Children's Books", "title": "Mr. Putter & Tabby Smell the Roses", "description": "Mr. Putter wants Mrs. Teaberry’s birthday to be extra special this year. So how about a trip to the Conservatory to see the beautiful trees and plants and flowers? It will be heavenly. And it is! Mr. Putter and Tabby and Mrs. Teaberry and Zeke sniff the air. They smell the roses. They learn the plant facts. It’s the perfect celebration . . . until Zeke finds the banana tree. The Mr. Putter & Tabby early reader series has been long beloved by children, parents, and teachers. This volume is as funny and endearing as ever."}, {"id": "1944903224", "genre": "Children's Books", "title": "The Great Chicken Escape", "description": "Good morning, Chickens. Chickens run! Chickens roam. Chickens go home. Chickens, good night. This simple and spare picture book about four chickens fleeing their coop for the day in the Alaska wild features Nikki McClure’s signature cut-paper artwork and a beautiful die-cut cover."}, {"id": "B01L9DKO3O", "genre": "Children's Books", "title": "The Mad Apprentice: The Forbidden Library: Volume 2", "description": "The dark and thrilling sequel to the book Kirkus called, \"Harry Potter, Alice in Wonderland, and Inkheart all rolled into one\"When Alice's mysterious Uncle Geryon sends her to help capture a rogue apprentice--a boy who has the same ability Alice has to Read himself into stories--she knows to expect a wild and unpredictable trip. But even though Alice has visited the magical realms inside libraries before, this adventure is far more dangerous. Because Torment, the magic creature holding this library together, has gone mad.But he might also have information about Alice's missing father."}, {"id": "1780555008", "genre": "Children's Books", "title": "The Kids' Book of Mazes 1 (Buster Puzzle Books)", "description": "Kids of all ages will love to lose themselves in this bumper book of mazes. With hundreds of twists and turns, the a-maze-ing mazes get increasingly tricky, from simple, square mazes to brain-boggling \"bridge\" labyrinths across four levels of difficulty. This pocket-sized book is the perfect travel companion and is sure to delight kids and adults alike."}]