[{"id": "078641393X", "genre": "Science Fiction & Fantasy", "title": "Edgar Rice Burroughs and Tarzan: A Biography of the Author and His Creation", "description": "Like millions of other readers and moviegoers, as a youngster the late Robert W. Fenton loved swinging through the jungle with Tarzan. As an adult his interest was revived when he bought Tarzan creator Edgar Rice Burroughs' original office-estate in Tarzana, California, and began writing a book about Burroughs. That 1967 work, originally titled The Big Swingers, in effect a biography both of ERB and of Tarzan, was the first full-scale, commercially published account of Burroughs' life and work.Fenton's biography is now back in print as a wonderful source for a new generation of readers: letters, documents, synopses, lists of characters, and plots and themes that Burroughs used. The book also reveals ERB's ready observations on such issues as women's suffrage, prohibition, morality in Hollywood, and the Scopes trial in Tennessee.A new foreword by George T. McWhorter and new photographs - there are 66 in all - are included."}, {"id": "1548677590", "genre": "Science Fiction & Fantasy", "title": "2: Explosions: The Yesterday Doctor Series (Volume 2)", "description": "“Bully Resistance is a duty!” Robin Snow thinks her life is set—family, home, career—until she realizes that her daughter will be safe only when Abby is beyond her father’s reach. Robin now knows her husband is as dangerous as a cheetah that toys with its prey. They run, but…  Is she erasing her tracks quickly enough to protect her daughter?  To save an unborn baby, she also soul-travels to Vesuvius, 79 AD. If the volcano explodes before she returns, she and Abby could be erased in the present time. Vesuvius will blow in 2 days. And Robin must not warn her mother or grandmother that they are about to die. Robin is catapulted to an ancient desert village on the day her Syrian father leads her away from her mother. Robin has always trusted that soul-travel heals. But where is he taking her ancient self? And when will she see her mother again? While in the present, Robin’s husband, now aware that she has fled, is on the hunt."}, {"id": "0786939184", "genre": "Science Fiction & Fantasy", "title": "Player's Handbook II (Dungeons & Dragons d20 3.5 Fantasy Roleplaying) (Bk. 2)", "description": "The Player’s Handbook II builds upon existing materials in the Player’s Handbook. This is the first direct follow up to the best-selling and most used D&D rulebook. It is specifically designed to expand the options available for players by both providing new material and increasing the uses for existing rules. Included are chapters on character race, background, classes, feats, spells, character creation, and character advancement. New rules include racial affiliations that make race matter as a character advances in level, new character classes and alternate class features for existing classes, new feats, tools for rapid character creation, and additional organization and teamwork benefits -- an option first introduced in Dungeon Master’s Guide II and Heroes of Battle."}, {"id": "1905850034", "genre": "Science Fiction & Fantasy", "title": "RuneQuest Glorantha: The Clanking City", "description": "The city of Zistorwal is part-factory, part-fortress and instrumental to the Zistorite God Learners in their efforts to further their unique magical ends. Under smoking towers, the citizen workers stride among machinery built upon stolen Mostali secrets and enhanced by the vision of God Learner magicians and engineers. Through the streets, a giant automaton, the avatar of Zistor, strides proudly through the city named for him. In underground surgeries, God Learners replace their weak mortal flesh with alchemically-treated mechamagical implants, rising from blood-stained tables bearing metal limbs powered by sorcery and clockwork joints. This is the Machine City, known as the Clanking City for the noise its thousand engines make, and it stands defiant against a great siege mounted by the Empire of Wyrm's Friends and their allies of convenience. The Clanking City allows Games Masters and players to walk the streets of this infamous city in its golden age, shaping their own plots and campaigns in the towering structures and dark smoke-clogged alleys of this magical-technological nightmare metropolis."}, {"id": "1589944801", "genre": "Science Fiction & Fantasy", "title": "Warhammer Fantasy Roleplay: Career Compendium", "description": "Heroes rise from all walks of life in Warhammer Fantasy Roleplay. From the lowly peasant or meager rat catcher to the wealthy noble or questing knight, fate might snare anyone in its fickle web. The Career Compendium is designed as the ultimate, comprehensive career reference for both players and Game Masters, and explores the many different paths heroes may take during their adventures. The Career Compendium features more than 220 official careers spanning the entire breadth of the Warhammer Fantasy Roleplay line, and includes eight brand-new careers, expanded career entries, revised character creation charts and references, hundreds of new adventure seeds and plot hooks, and Master Indices, plus updates, official errata, and clarifications for previously published careers."}]