[{"id": "0993284760", "genre": "Children's Books", "title": "The Shakespeare Timeline Wallbook: Unfold the Complete Plays of Shakespeare―One Theater, Thirty-eight Dramas!", "description": "WILLIAM SHAKESPEARE'S plays are presented as never before, with all thirty-eight masterpieces simultaneously performed in front of you on a 6-foot fold-out timeline set in the iconic Globe Theatre. Spot the ghosts, hunt for the murderers, discover the poison, and revel in Elizabethan romance as each play unfolds. Concise plot summaries, key textual quotes, and carefully illustrated scenes help pinpoint the action. Developed in partnership with the Shakespeare Birthplace Trust , the timeline also features essential moments in Shakespeare's life providing a unique narrative context to the works of the world's favourite bard.  The Shakespeare Timeline Wallbook also includes an easy-to-read chronicle that reports on more than forty seminal moments from the timeline in the style of a newspaper. Other features include a page of letters to the editor, a fifty-question quiz, and pocket magnifier. Perfect for 6-14 year olds but equally fascinating for all curious adults too."}, {"id": "0375847324", "genre": "Children's Books", "title": "Horse Diaries #1: Elska", "description": "Iceland, circa AD 1000Elska is a silver dapple Icelandic filly. She spends summers frisking about the countryside and winters in the farmyard, where the girl human Amma takes special care of her. But when a powerful neighbor notices Elska, her contented life suddenly changes. Here is Elska’s story . . . in her own words."}, {"id": "B077F6VNV7", "genre": "Children's Books", "title": "Pancho Bandito and the Sugarcane Hurricane", "description": "Pancho Bandito and the Sugarcane Hurricane is an epic tall tale adventure set on a speeding train.  When the Amarillo Armadillo is kidnapped by greedy Gordito, Pancho must fight his way through a train full of desperadoes to save his friend.  But the cowboy meets his match in the mountainous and mysterious Gordito, who may hold a key to Pancho's past.This tall tale picture book is a hoot to read aloud, with language you can chew like a toothpick.  The stunning art features incredible landscapes and shots straight out of movie Westerns.  The book is recommended for all ages, but ideal for ages 6-8.  Click the buy button to whoop and holler along with your youngsters as Pancho rides again!"}, {"id": "B014LOTAJC", "genre": "Children's Books", "title": "No-No, Charlie!", "description": "No-no, Charlie is a rhyming picture book about a day in the life of a rambunctious toddler and his frazzled mother.  From playing baseball in the garden, to making friends with a wayward skunk, Charlie explores his world with the boundless energy that only a 2-year-old child can muster. Although her son’s antics test her reflexes (and her sanity), Charlie’s mom takes it all in stride, realizing at the end of a hectic day, her reward is the adoration of her little boy.No-No, Charlie is a story that plays out in living rooms and shopping malls all over the world that can just barely contain the adventurous spirits of the average two year-old.  This book’s lilting rhymes and humorous pictures will be sure to elicit a giggle from parents and children alike. Curious toddlers, lively preschoolers, and tired mommies everywhere will recognize parts of their own busy days, while delighting in Charlie’s energetic and mischievous antics."}, {"id": "1595825223", "genre": "Children's Books", "title": "Cardcaptor Sakura Omnibus, Book 1", "description": "Fourth-grader Sakura Kinomoto found a strange book in her father's library — a book made by the wizard Clow to store dangerous spirits sealed within a set of magical cards. But when Sakura opened it up, there was nothing left inside but Kero-chan, the book's cute little guardian beast, who informs Sakura that since the Clow cards seem to have escaped while he was asleep, it's now her job to capture them!"}]