[{"id": "B00E9B3O1I", "genre": "Children's Books", "title": "#20 Play It Again, Mallory", "description": "Mallory is excited about the six-week arts electives program at Fern Falls Elementary—until she gets stuck in her last-choice class, band. To make matters worse, she is assigned to the tuba, and when she plays, it sounds more like passing gas than music. She dreads the showcase at the end of the program. But with some good guidance from her mom and her band teacher, Mallory learns the meaning of \"practice makes perfect\" and that, in fact, making music can be lots of fun!"}, {"id": "1979051232", "genre": "Children's Books", "title": "Elephant Facts for Kids: Interesting Facts About Elephants (Facts About Animals) (Volume 5)", "description": "Elephants might all look the same at first glance, but two species of elephants actually live on the earth. Elephants are amazing animals. They are the biggest and heaviest land animal on earth - strong and powerful yet also sensitive and intelligent. Get interesting facts about Elephants you never knew!!!"}, {"id": "1481419544", "genre": "Children's Books", "title": "Toes, Ears, & Nose!: A Lift-the-Flap Book (Lap Edition)", "description": "Play peekaboo with Baby in this bestselling lift-the-flap concept book, now available in a lap-size board book edition!Inside my mittens I’ve got...fingers! Baby is bundled in a mountain of clothes! As little ones lift the large, sturdy flaps to find out what’s underneath each piece of clothing, they’ll love playing and learning with this fun peekaboo book again and again! Now available in an oversize board book, this bestselling title from Marion Dane Bauer and Karen Katz is perfect for sharing."}, {"id": "193391629X", "genre": "Children's Books", "title": "I Know Where the Freighters Go", "description": "Do you remember the first time that you saw a freighter out on the Great Lakes? Did you try to imagine where it was headed and what it had on board? From cargo to destination, from the crew's jobs to buying groceries, all of our questions are answered in this engaging, lyrical and delightfully illustrated story."}, {"id": "0756935318", "genre": "Children's Books", "title": "The Princess & the Pauper", "description": " I opened the door the following evening to find Princess Carina standing there with her hair all pushed up under a cap and her face hidden by a pair of oversized sunglasses.  \"Princess,\" I said flatly.  \"Pauper,\" she replied.  Julia Johnson isn't like the other students at the Rosewood School. She takes a bike to school, not a BMW. She goes home every night to a run-down apartment that she shares with her mom and her cat. While the other girls obsess over the upcoming visit from some princess, Julia is trying to find the money to keep a roof over her family's heads.   Then Carina, the Crown Princess of Vineland, shows up at Rosewood for a speech, and Julia finds her answer. The thing is, Julia's a dead ringer for Carina. And when Carina offers her ten thousand dollars to switch places for one day, Julia can't say no.   But when the real princess doesn't come back from her day off, Julia finds herself on a plane to Vineland. How long before her cover gets blown? What will Carina's almost-fiancé, Markus, say when he finds out she's been lying to him? And how in the world is she going to explain all this to her mother?"}]