[{"id": "B009515ZE6", "genre": "Children's Books", "title": "The River (The Adventures of Pokey and Sparky Book 2)", "description": "The River is the first published Adventure of Pokey and Sparky. All of the characters are introduced and then the adventure starts. A picnic at the rivers turns out to be one challenge after another. A deserted cabin, a swamp, alligator, turtle, wolves, a terrible storm and a waterfall make for the first exciting Adventure of Pokey and Sparky.The River is a fun read for both young and old."}, {"id": "0152054170", "genre": "Children's Books", "title": "Monster Goose", "description": "Old Monster Goose has turned Mother Goose's world of nursery rhymes inside out! Here she presents twenty-five deliciously disgusting poems, filled with rodents and maggots, zombies and ghouls, spiders, and of course, monsters."}, {"id": "0843107588", "genre": "Children's Books", "title": "Super Silly Mad Libs Junior", "description": "Nobody knows silly better than we do. And with Super Silly Mad Libs Junior, younger readers are introduced to the crazy world of Mad Libs."}, {"id": "B00EZF607I", "genre": "Children's Books", "title": "B'ar Yarns: Florida Pioneer Stories", "description": "B'ar Yarns (Bear Yarns) is a collection of memories of a boy growing up in North Florida in the early 1900's. Eugene Pitts left these stories of pioneer life for those who follow him. He and his brothers experienced adventures children today can only dream of. He thought nothing of riding off into the swamp in the dead of night to hunt raccoons or alligators, and he didn't hesitate to jump on his Texas cow pony and take out after a 2000 pound bull armed with a 12 foot bullwhip. He loved animals and respected nature, leaving these lessons for his descendants and other children who read his story."}, {"id": "1404819088", "genre": "Children's Books", "title": "Pull, Lift, and Lower: A Book About Pulleys (Amazing Science: Simple Machines)", "description": "Cranes, flagpoles, elevators, and window blinds ― all of these are pulleys. From award-winning author Michael Dahl, Pull, Lift, and Lower: A Book About Pulleys provides an introduction to one of the most important machines humans rely on. With fun facts and bright illustrations, find out how people use pulleys at construction sites, farms, and even in their own homes."}]