[{"id": "1474892043", "genre": "Children's Books", "title": "Discovery Stem Stars Women Who Rocked Medicine", "description": "STEM Stars Who Rocked Medicine is a wonderfully inspiring book for budding doctors or scientists who need awesome girl role models. From the earliest female doctors, to pioneering geneticists, to amazing transplant surgeons . . . Discover the inspiring stories of 19 of the most awesome female scientists, inventors, and health-care providers who have dedicated their lives to healing the world!"}, {"id": "1570616280", "genre": "Children's Books", "title": "Wheedle on the Needle", "description": "Deep in the woods of the Pacific Northwest lives a quiet old creature named the Wheedle. When humans move into his forests, bringing their loud city noises, Wheedle flees to the rocky peaks of Mount Rainier, and then to the very tip-top of Seattle's Space Needle.A national bestseller, the beloved Wheedle on the Needle had much of its Seattle-centric storyline stripped from later editions. This glorious 35th anniversary keepsake edition brings back the book's original charm, inviting a new generation of readers to delight in the Wheedle's adventures."}, {"id": "1511831545", "genre": "Children's Books", "title": "1-3: The Battle for Darracia: Books I - II - III", "description": "The Battle for Darracia Books I, II, and III, are now combined into one epic novel! On the planet Darracia, an ever-widening social gap between its inhabitants is causing turmoil that is fracturing a once peaceful world. Struggling with his identity, nineteen year old Prince V'sair must harness the power of the elusive Fireblade, the secret to a warrior's heart, in order to overcome his uncle Staf Nuen's lust for supremacy. Will the energy of the Elements guide the young prince to his true destiny or will Staf Nuen conquer Darracia?"}, {"id": "0635000008", "genre": "Children's Books", "title": "Tennessee Wheel of Fortune! (1) (Tennessee Experience)", "description": "The Wheel of Fortune GameBook is reproducible and allows kids to guess on geography, hypothesize on history, explore economics, speculate on civics and bet on biographies. The Wheel of Fortune GameBook can be used by an individual or by teams who tally their own scores. Having a wheel to spin to establish point values for questions adds a fun element to the game. This book covers fascinating state facts and meets state standards. The book includes game instructions, a pattern for making a Lazy Susan Wheel and prize suggestions."}, {"id": "B00CP7DUGW", "genre": "Children's Books", "title": "About Crocodiles", "description": "Can you remember curling up on a sofa with a good picture book when you were young? No matter what the subject was about the pictures brought it to life in a way that just plain old text can never do, no matter how well it is written.This crocodile picture book will help your child to imagine the world that these fascinating animals inhabit. The carefully selected images are enriched by the crocodile facts which accompany them, educating your child in a fun way that doesn’t seem like learning at all. Although the pictures are in full color they look fine in black and white.If your youngsters are anything like mine they’ll have a short attention span. That’s why the book has a simple quiz and a “spot the difference” puzzle.These fun pages do have another purpose other than to amuse and entertain. By answering questions and interacting it’s likely that your child will retain more of the information that is contained in the book.The words used and the structure of the book is simple enough for most children who are beginning to read for themselves although there are a few more difficult words and concepts introduced to further their vocabulary. This is where you come in! Reading through the book with your child will be more fun and you can help them with any words they don’t know. Maybe you’ll find out some facts about elephants you didn’t know!One of a seriesThis book is the first in a series of similar titles that will feature other popular creatures that share our planet."}]