[{"id": "B00C2IMFR4", "genre": "Children's Books", "title": "My First Bilingual Book-Sports (English-Russian)", "description": "Guaranteed to enrich a toddler’s vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting more complex concepts that go beyond colors and numbers, titles in the series feature jobs, music, opposites, and sports. This collection combines photographs, bright illustrations, and dual-language words in clear, bold text. Suitable for both individuals and groups, these books are a child’s perfect introduction to exploring other cultures."}, {"id": "1632292041", "genre": "Children's Books", "title": "Miraculous: Origins", "description": "Every story has a beginning. Discover how Marinette and Adrien, two high school students practically like everyone else, became Ladybug and Cat Noir, and why Hawk Moth is their sworn enemy. This is the PERFECT jumping on point for new readers!  Based on the Animated Series by Zag Entertainment  Adapted by Cheryl Black and Nicole D’Andria"}, {"id": "1420501100", "genre": "Children's Books", "title": "The John F. Kennedy Assassination (Crime Scene Investigations)", "description": "Examines the fascinating world of the criminal investigator and other professionals who are on the frontline of solving notorious crimes with the help of technological advances in the field."}, {"id": "0789313898", "genre": "Children's Books", "title": "This Is Texas: A Children's Classic", "description": "Following the runaway bestsellers This is New York and This is Paris, Universe is pleased to reissue another title from M. Sasek's beloved and nostalgic children's travel series. Like the other Sasek classics, This is Texas is a facsimile edition of his original book that is still timely and current in every way. The stylish, charming illustrations, coupled with Sasek's witty, playful narrative, make the book a perfect souvenir that will delight both children and their parents, many of whom will remember it from their childhood. The brilliant, vibrant illustrations have been meticulously preserved, remaining true to his vision more than forty years later and, where applicable, facts have been updated for the twenty-first century, appearing on a \"This is ... Today\" page at the back of each book. In This is Texas, first published in 1967, M. Sasek rides high in the saddle, lassoing all the color and colossal span of Texas as he tours the state from Dallas, Houston, and Austin to the Alamo. From its cattle, coyotes, and cowboys to its oil wells, rodeo and rattlesnakes, everything in the biggest state is bigger than anywhere else."}, {"id": "B00S5OJUEU", "genre": "Children's Books", "title": "Party Croc!: A Folktale from Zimbabwe", "description": "In this retelling of a Shona folktale from Zimbabwe, a girl promises a crocodile he can come to a party in exchange for a favor, but since crocodiles aren’t allowed in the village, she doesn’t expect she’ll have to keep the promise.This is a fixed-format ebook, which preserves the design and layout of the original print book."}]