[{"id": "1580897312", "genre": "Children's Books", "title": "Alphabet Boats", "description": "Set sail and learn the ABCs with a boat for each letter!Discover twenty-six types of vessels, from the more common--canoe and motorboat--to the unusual--umiak and Q-boat. Just like in Alphabet Trucks and Alphabet Trains, colorful art includes the letters of the alphabet hidden (and not-so-hidden) in supporting roles in the illustrations."}, {"id": "1780554656", "genre": "Children's Books", "title": "Off With Their Heads!: All the Cool Bits in British History (Buster Reference)", "description": "Bursting with the best-bits from British history, this book seeks to inspire a love of history that can last a lifetime. Including rules to remember the rulers of Britain, getting to grips with the gunpowder plot and clueing-up on the cruel fate of all six of Henry VIII's wives. Complete with light-hearted illustrations by Andrew Pinder, Off With Their Heads is the perfect treat for any young history lover."}, {"id": "0836873076", "genre": "Children's Books", "title": "Arab Americans (World Almanac Library of American Immigration)", "description": "Provides a brief history of the Arab world, explaining why some Arabs chose to move to the United States and the challenges they faced when they arrive, and describes what challenges still face immigrants today."}, {"id": "0544953436", "genre": "Children's Books", "title": "Back from the Brink: Saving Animals from Extinction", "description": "The acclaimed author of Sniffer Dogs details the successful efforts of scientists to bring threatened animals back from the brink of extinction, perfect for animal lovers and reluctant nonfiction readers. With full-color photography.How could capturing the last wild California condors help save them? Why are some states planning to cull populations of the gray wolf, despite this species only recently making it off the endangered list? How did a decision made during the Civil War to use alligator skin for cheap boots nearly drive the animal to extinction?Back from the Brink answers these questions and more as it delves into the threats to seven species, and the scientific and political efforts to coax them back from the brink of extinction. This rich, informational look at the problem of extinction has a hopeful tone: all of these animals' numbers are now on the rise. "}, {"id": "0791056783", "genre": "Children's Books", "title": "Jeremy Mayfield (Race Car Legends Ssries)", "description": "Describes the racing career of the driver who won the Automobile Racing Club of America's Rookie of the Year title in 1993 and raced in his first Winston Cup race that same year"}]