[{"id": "0935607099", "genre": "Children's Books", "title": "Discovering Great Artists: Hands-On Art for Children in the Styles of the Great Masters (Bright Ideas for Learning)", "description": "Featuring more than 150 activities, this guide teaches the styles, works, and techniques of the great masters—Van Gogh, Michelangelo, Rembrandt, and more."}, {"id": "1541512111", "genre": "Children's Books", "title": "Who Invented the Television?: Sarnoff Vs. Farnsworth (STEM: Smackdown)", "description": "It's something many people use every day, but do you know who invented the television? David Sarnoff, the powerful radio executive, is often thought of as the Father of Television. But the story might not be so straightforward. What if a simple farm boy, Philo T. Farnsworth, deserves the credit? Follow along in the race as an underdog inventor takes on a high-profile executive in a battle that would last more than a decade and cost millions of dollars. You'll never look at television the same way again!"}, {"id": "B00BQ9PNJC", "genre": "Children's Books", "title": "Top of the Order (4 for 4)", "description": "Jackson’s mom is dating. Gig’s dad is going to serve in the Middle East. Isaac might be going to a new school. Diego spends his spare time working. These four friends lead different lives, but on the baseball field, they’re a strong team—the top of the order. As their last year of elementary school ends, the boys want to have their best baseball season ever. But this year, they might not even have enough players to stay in the league. Then a great player volunteers to join the team. But it’s a girl! And she plays with a pink glove! Now the team is coming apart at the seams. Will this end up being the worst season ever?"}, {"id": "0525421734", "genre": "Children's Books", "title": "Fearless: The Story of Racing Legend Louise Smith", "description": "When Louise Smith started racing cars, most girls weren't even allowed to drive. From her first wild adventure behind the wheel of her daddy's Ford to the dangers and thrills of stock-car tracks across the country, Louise fearlessly paved the way for women in racing and became a NASCAR legend! It takes a lot of courage to be the first, but when you fearlessly follow your dreams, anything is possible."}, {"id": "0208025065", "genre": "Children's Books", "title": "Flying Higher: The Women Airforce Service Pilots of World War II", "description": "Observes the contributions made by the Women Airforce Service Pilots during World War II, as they trained new pilots for combat, delivered new planes to military bases, and tested other aircraft while male pilots were on duty."}]