[{"id": "0689874219", "genre": "Children's Books", "title": "America the Beautiful (Limited Edition): A Pop-up Book", "description": " Master paper engineer Robert Sabuda has interpreted the classic American anthem \"America the Beautiful\" in dazzling dimension. From the Golden Gate Bridge to Mount Rushmore to the Statue of Liberty, America has never looked more spectacular. This stunning keepsake masterpiece will be shared and admired by generations to come; indeed it is a national treasure in and of itself.  This book is one of a special edition of 26, lettered A to Z, retained by the author, or one of a signed and numbered edition of 250."}, {"id": "0756932416", "genre": "Children's Books", "title": "Dinosaur Hunter (I Can Read Books: Level 4)", "description": "Fossil collectors!  In 1880s Wyoming, Ned Chapman dreams of finding a dinosaur skeleton. When he discovers some old bones on his father's ranch, Ned is thrust into the world of bone hunters -- men so competitive that they will do anything to bring back the best fossils!"}, {"id": "194125182X", "genre": "Children's Books", "title": "Edd the Frisky Feline", "description": "The mischievous Edd is just about everywhere he shouldn’t be, and even when he’s behaving, you can’t help but wonder what he’s plotting for the future.  This delightful book was inspired by one of the author’s grandkids, who told Grandma that he didn’t like Edd jumping on his bed . . . and so began the story."}, {"id": "0849958423", "genre": "Children's Books", "title": "Small Gifts in God's Hands", "description": "Set in Biblical times, brings to vivid life one of the most loved stories from the Bible--the feeding of the multitudes--told from a young boy's perspective. By the author of Just in Case You Ever Wonder. "}, {"id": "1856975509", "genre": "Children's Books", "title": "I Wonder Why the Pyramids Were Built: and Other Questions about Egypt", "description": "Browsers and young students alike will enjoy these lively question and answer books with their unique mix of realistic illustration and engaging cartoons. The enticing questions will amaze, amuse and inspire, while the highly visual format encourages kids to keep reading."}]