[{"id": "149655762X", "genre": "Children's Books", "title": "DC Super Heroes Animal Jokes (DC Super Heroes Joke Books)", "description": "Why won't Wonder Woman's worst enemy fight fair? Because she's a Cheetah! With 75+ ANIMAL jokes featuring Batman, Superman, and Wonder Woman, readers will go wild for this official DC Comics joke book! Full-color art and enhanced back matter make this a surefire hit for fanboys and fangirls alike."}, {"id": "0780783573", "genre": "Children's Books", "title": "Uncle Jed's Barbershop", "description": "In the segregated South of the 1920s, Uncle Jed was the only black barber in a county of sharecroppers. He always dreamed of owning his own barbershop, but his generous heart and some bad luck during the Depression forced him to defer that dream for years. Finally, on his 79th birthday, Uncle Jed opened the doors of his new shop. A Coretta Scott King Honor Book. An ALA Notable Children's Book."}, {"id": "0516209388", "genre": "Children's Books", "title": "Just Like Me: Stories and Self-Portraits by Fourteen Artists", "description": "This remarkable collection highlights the art and inspirational paths of 14 outstanding artists who, over the course of 20 years, have shared their art and lives with children. Each spread comprises a self-portrait, as well as the artist's personal story and reflections on what their art means to them. Color photos."}, {"id": "0749607025", "genre": "Children's Books", "title": "The Middle East: Gulf Crisis (Hotspots)", "description": "Looks at the background to the present-day crisis precipitated by Iraq's invasion of Kuwait in August 1990. It also covers the Arab-Israeli conflict and the search for a solution to the Palestinian problem. The book shows how the Middle East's oil deposits have made it a world hotspot."}, {"id": "069811647X", "genre": "Children's Books", "title": "The Earth under Sky Bear's Feet: Native American Poems of the Land", "description": "\"A thoughtful collection that eloquently bears out the theme of unity of all creatures.\" —School Library JournalNative American elders will tell you there is as much to see in the night as in the familiar light of day, and here Abenaki storyteller and American Book Award recipient Joseph Bruchac offers twelve unforgettable stories of the living earth seen from the sky.\"From the Mohawk and Missisquoi peoples of the Northeastern United States to the Pima, Cochiti Pueblo, and Navajo people of the Southwest to the Subarctic Inuit, these pieces reflect an awe and appreciation of the natural world. Locker's deeply hued paintings burst with the beauty of night.\" —The Horn Book"}]