[{"id": "1600142699", "genre": "Children's Books", "title": "Motorcycles (Blastoff! Readers: Mighty Machines) (Blastoff Readers. Level 1)", "description": "Pop a wheelie! Motorcycles are exciting vehicles used for many purposes from traveling to racing. Young readers will learn about the different parts of a motorcycle and the various kinds of motorcycles."}, {"id": "0439316324", "genre": "Children's Books", "title": "Ocean Life (Scholastic Science Readers)", "description": "A thrilling exploration of the many extraordinary creatures that live in the sea, including small coral shrimp, huge squids, whales, sharks, and dolphins, is filled with interesting information and exciting close-up pictures. Original."}, {"id": "0763698741", "genre": "Children's Books", "title": "Pop-up Shakespeare: Every play and poem in pop-up 3-D", "description": "Learn about all of Shakespeare's plays in one book!Read about William Shakespeare's plays, sonnets, and poems as you never have before in an entertaining pop-up book collaboration between the internationally known comedy troupe the Reduced Shakespeare Company and best-selling illustrator Jennie Maizels. Featuring five interactive spreads filled with dramatic pop-ups, fun foldouts, hilarious summaries, and fascinating commentaries, this is the perfect introduction to one of the world's greatest playwrights and his enduring works."}, {"id": "178603087X", "genre": "Children's Books", "title": "Ella Fitzgerald (Little People, Big Dreams)", "description": "Discover the lives of outstanding people, from designers and artists to scientists. All of them achieved incredible things, yet each began life as a child with a dream.  Meet Ella Fitzgerald, one of the most influential jazz singers of all time. This mini biography charts Ella's life, from her early singing days on the streets of Harlem, to her success as a jazz legend, with the message: 'It's not where you come from, but where you're going that counts.' This inspiring story of the First Lady of Song features a facts and photos section at the back."}, {"id": "1448806720", "genre": "Children's Books", "title": "What Do You Know About Light? (20 Questions: Physical Science)", "description": "Provides answers to questions related to the nature and qualities of light, including information on light waves, rainbows, and refraction."}]