[{"id": "0312492545", "genre": "Children's Books", "title": "Dinosaur A-Z: For kids who really love dinosaurs!", "description": "-Ideal for children aged 3 years and up.-Features 26 one-of-a-find dinosaur models from Allosaurus to Zephyrosaurus specially commissioned from experts in the field."}, {"id": "1887307109", "genre": "Children's Books", "title": "Aimi Adventures: The Startling Screech", "description": "Once upon a time there was a little girl named Aimi. Grami promised to take Aimi on an adventure to celebrate Aimi's birthday. And finally, that day came…   Come along with Aimi on her zoo adventure meeting people and birds in this beautifully illustrated children's book. Your child or grandchild is sure to enjoy the color pictures on every page, learning about life and people in the process."}, {"id": "0618250743", "genre": "Children's Books", "title": "Carry On, Mr. Bowditch", "description": "Readers today are still fascinated by “Nat,? an eighteenth-century nautical wonder and mathematical wizard. Nathaniel Bowditch grew up in a sailor?s world—Salem in the early days, when tall-masted ships from foreign ports crowded the wharves. But Nat didn?t promise to have the makings of a sailor; he was too physically small. Nat may have been slight of build, but no one guessed that he had the persistence and determination to master sea navigation in the days when men sailed only by “log, lead, and lookout.? Nat?s long hours of study and observation, collected in his famous work, The American Practical Navigator (also known as the “Sailors? Bible?), stunned the sailing community and made him a New England hero."}, {"id": "0749674504", "genre": "Children's Books", "title": "Hearing: Bk. 2 (Reading Roundabout)", "description": "Non-fiction reading books with around 70 words per book, ideal for newly independent readers"}, {"id": "0763696463", "genre": "Children's Books", "title": "Big Brown Bear's Cave", "description": "What will Bear do when he fills his cave so full of stuff that there's no room at all — even for his friends?Big Brown Bear finds a lovely new home, a dark and empty cave just right for a bear. Then one day he wanders into the city and discovers that humans also have caves, which they call garages and fill with all sorts of stuff! Bear decides he must do the same — but soon there is no room in his cave to stretch or scratch or do any of the things that Big Brown Bear likes to do, including seeing his friends. Maybe it's time for all the stuff to go!"}]