[{"id": "1422232298", "genre": "Children's Books", "title": "Mexican Facts and Figures (Mexico: Leading the Southern Hemisphere)", "description": "Mexicans today are proud of their rich heritage and their beautiful land, but they also recognize that their nation has many problems, including widespread poverty, unemployment, illiteracy, and drug-related violence. Many of Mexicos ongoing problemssuch as illegal immigration, environmental issues, and drug traffickingalso affect its northern neighbor, the United States. Mexican Facts and Figures is an overview that will tell you about Mexicos past and its present, while also providing statistical information about the countrys 31 states and its federal district."}, {"id": "1403488169", "genre": "Children's Books", "title": "The Ancient Chinese (History Opens Windows)", "description": "How did the people of Ancient China live? What were their social, economic, political, and cultural lives like? How did their values and attitudes help shape our world? This title answers these questions and more with informative text, colorful photographs and original source materials, and clear maps and diagrams to show readers what life was like in ancient civilizations."}, {"id": "054454112X", "genre": "Children's Books", "title": "The Lightning Dreamer: Cuba's Greatest Abolitionist", "description": "“I find it so easy to forget / that I’m just a girl who is expected / to live / without thoughts.” Opposing slavery in Cuba in the nineteenth century was dangerous. The most daring abolitionists were poets who veiled their work in metaphor. Of these, the boldest was Gertrudis Gómez de Avellaneda, nicknamed Tula. In passionate, accessible verses of her own, Engle evokes the voice of this book-loving feminist and abolitionist who bravely resisted an arranged marriage at the age of fourteen, and was ultimately courageous enough to fight against injustice. Historical notes, excerpts, and source notes round out this exceptional tribute."}, {"id": "0310705037", "genre": "Children's Books", "title": "NIV Discoverer's Bible", "description": "Formerly titled the Young Discoverer’s Bible, this revised edition has been updated with a new cover and 30 new full-color tip-in pages. The NIV Discoverer’s Bible offers the full-text of the NIV translation—just like the one Mom and Dad use—in an easy-to-read, large print type. Encourage children ages 8 to 12 as they launch into a deeper exploration of God’s Word with a Bible that’s all their own.Special features include: · Large-Print—12-point typeface for easier reading· 30 full-color tip-in pages—featuring a combination of photography and illustration by Uldis Klavins· Dictionary-Concordance to key Bible words for quick reference· Timelines—provides a visible timeline of events that occurred in the Old and New Testaments · Color maps—for easy visualization of key Bible places· Presentation pages"}, {"id": "B01D5M6TKY", "genre": "Children's Books", "title": "Renaissance & Reformation Lapbook STUDY GUIDE ONLY", "description": "The era of the Renaissance & Reformation was an exciting time. Use this hands-on tool to learn more about this time in history. Create booklets to place inside the Lapbook folders, and improve retention of the information. Includes a Study Guide that can be used for teaching the topic. This product can stand alone or be used as a supplement to any other curriculum.  This ebook format includes a downloadable PDF file.  Just follow the instructions, cut, fold, glue, and create!  Print as many as you need for your own household. Use the coupon on the last page to download a free PDF version of the lapbook in order to print pages."}]