[{"id": "1627176438", "genre": "Children's Books", "title": "The Internet (How It Works)", "description": "Where would we be without the Internet? How would you research a school project or look for things you want to read about or buy online? This book details just what the Internet is; how it works, the hardware, protocol, and the World Wide Web, as well as tips on how to stay safe by having your parents control just what you can find and see in this ever-changing world of instant access to information. So, be safe and happy surfing! This book will allow students to ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through the development of a new or improved object or tool."}, {"id": "1465435468", "genre": "Children's Books", "title": "Complete Children's Cookbook", "description": "Delicious dishes kids will really want to make. More than 150 fabulous recipes, divided into nine themed chapters (Breakfast, Soups and Salads, Light Bites, and more) will have you and your child in the kitchen and cooking in no time. From French toast to rainbow salad, vegetable lasagna to tomato soup, and ice cream to mini muffins, Complete Children's Cookbook has a recipe for every occasion. And with beautiful full-color photography, simple instructions, and a focus on safety, each one makes an ideal cook-together project that will have children excited to try the new flavors in the dishes they helped make. The step-by-step instructions are easy to follow and feature a picture for every step, so children can see clearly just what to do as they build basic cooking skills, safe kitchen practices, and adventurous palates."}, {"id": "0763696013", "genre": "Children's Books", "title": "We're Going on a Bear Hunt: Changing Picture Book", "description": "Bear lovers rejoice! Pull the tabs and watch the pictures transform in an interactive edition of the award-winning classic.Follow and join in the family's excitement as they wade through the grass, splash through the river, and squelch through the mud in search of a bear. Pull the tabs to change the pictures along the way — we're going to catch a big one!"}, {"id": "1849634211", "genre": "Children's Books", "title": "Archie the Airplane arrives at Whistlewind Airport", "description": "It's Archie the Airplane's first day at Whistlewind Airport. But his job isn't going to be an easy one - he's got to get a whole crowd of travellers to Spain on time, and with strong winds and missing passengers, it's going to take a lot of luck, and some new friends, to get them there and back safely!"}, {"id": "B01BKR46RY", "genre": "Children's Books", "title": "Bitty Bot", "description": "“Told in jaunty, rollicking rhymes that are enlivened by colorful, humorous digital illustrations, this robot version of a bedtime story demonstrates that, no matter how energetic a little ‘bot’ may be, there inevitably comes a time when ‘batteries are running low!’” —Kirkus Reviews A little robot would rather go on an intergalactic adventure than go to sleep in this rhyming romp that breaks all the bedtime rules.In a busy robot town bots begin to power down. All except for Bitty Bot! Feeling sleepy? Maybe not!  Charming text in rhyming verse tells the story of energetic Bitty Bot, who, instead of going to bed decides to build a rocket and go on a space adventure! Sweet and fun to read aloud, this bedtime book is perfect for tots and bots of all varieties."}]