[{"id": "1785989456", "genre": "Children's Books", "title": "Never Touch a Dinosaur", "description": "You must never touch a dinosaur . . . except in this book!This dinosaur-themed, touch-and-feel book is perfect for young children. Little ones will love reading the funny rhyme that warns of the dangers of touching a dinosaur--and of ignoring the advice! Innovative silicone touches are featured throughout the book, with a different texture for children to discover on every spread.This tactile book offers plenty for young children to enjoy, helping to promote an early love of reading."}, {"id": "B004Q3RIPM", "genre": "Children's Books", "title": "5 Children's Stories", "description": "This download contains five short stories to read aloud to your child. One is about a canary, one about a mouse family and the other three about children and their cats.Suitable for children about age 5-8."}, {"id": "1785088580", "genre": "Children's Books", "title": "My First Bilingual Book–Friends (English–Bengali)", "description": "Guaranteed to enrich a toddler's vocabulary, this simple and fun series of bilingual board books is ideal for helping children discover a foreign language. Highlighting more complex concepts that go beyond colors and numbers, titles in the series feature animals, fruit, home, and vegetables. This collection combines photographs, bright illustrations, and dual-language words in clear, bold text. Suitable for both individuals and groups, these books are a child's perfect introduction to exploring other cultures."}, {"id": "B00BQBC6N6", "genre": "Children's Books", "title": "Gretchen Groundhog, It's Your Day!", "description": "It's almost Groundhog Day, and the town of Piccadilly is all a-buzz because Gretchen Groundhog will not Go Out. Her Great-Uncle Gus is too old to look for his shadow anymore--now it's Gretchen's turn. But she's too shy."}, {"id": "1338117556", "genre": "Children's Books", "title": "Tenney (American Girl: Tenney Grant, Book 1)", "description": "Tenney's biggest dream is to share what's in her heart through music. Little does she know, she's about to get the opportunity of a lifetime. In this first book, Tenney gets invited to perform solo at Nashville's famed Bluebird Cafe and the pressure is on to write the song that will show what she's made of. But then Tenney's parents decide that she's too young to perform professionally, leaving her future hanging in the balance. What if this is Tenney's only chance to make her dreams come true?"}]