[{"id": "B0047T7FXU", "genre": "Children's Books", "title": "Kurt and Captain Annie: A Novel", "description": "School baseball hero, Kurt Kelton, immediately befriends the new girl in town...and soon develops a crush on her. But Annie isn’t interested in crushes, or boys for that matter. She’s an amazing athlete. So amazing that Kurt invites her to try out for the boy’s school baseball team. Well, the boys are in for a rude awakening. Annie is good. So good that she’s better than all of them. So what’s a school to do when their best athlete is a girl? Easy. They make her captain.**Acclaim for the novels of J.R. Hargrove**\"Kurt and Captain Annie is a wonderful, heart-warming story. Mr. Hargrove is a fabulously talented writer who captures the exuberance of youth and the spirit of adventure. I've set this one aside to read again.\"—Elaine Babich, author of You Never Called Me Princess and Relatively Normal\"A book to be enjoyed by the whole family. A fun, fun story. I love this!\"—J.R. Rain, author of Moon Dance and The Body Departed\"What a sweet story! Highly recommended!\"—Lani Bennett, author of False Dichotomy"}, {"id": "1435827295", "genre": "Children's Books", "title": "Lionel Messi (World Soccer Stars / Estrellas Del Futbol Mundial) (Spanish and English Edition)", "description": "Introduces the life and career of Argentine soccer player Lionel Messi, who was born with a condition that affected his height, which his family could not afford to treat, until a Spanish team offered to pay for it."}, {"id": "1435275411", "genre": "Children's Books", "title": "America's Wetlands: Guide to Plants and Animals", "description": "Full-color illustrations and lively descriptions help in identifying wetland types (swamp, marsh, or pond), plants, and animals."}, {"id": "0007510616", "genre": "Children's Books", "title": "The Octonauts Explore the Great Big Ocean", "description": "A brand new classic picture book in an exciting new format featuring the global sensations, The Octonauts by Meomi. With lots of surprises and fun - this is the ultimate book for Octonauts-crazy children!"}, {"id": "1503820408", "genre": "Children's Books", "title": "Animal High Jumping Stars (Animal Olympics)", "description": "Which animal athletes would win the gold, silver, and bronze medal in a high jumping competition: the klipspringer, jumping spider, or red-eyed tree frog? Explore the animal kingdom's best jumpers and compare how their skills rate against one another. Additional features include fun facts, captivating photos, a phonetic glossary, an index, and sources for further research."}]