[{"id": "0884483525", "genre": "Children's Books", "title": "Before We Eat: From Farm to Table", "description": "* MOONBEAM GOLD AWARD ** GROWING GOOD KIDS AWARD FOR EXCELLENCE IN CHILDREN'S LITERATURE, AMERICAN HORTICULTURAL SOCIETY AND NATIONAL MASTER JUNIOR GARDENER PROGRAM * Milk doesn't just appear in your refrigerator, nor do apples grow in the bowl on the kitchen counter.Before we eat, many people must work very hard―planting grain, catching fish, tending animals, and filling crates. In this book, vibrantly illustrated by Caldecott Medalist Mary Azarian, readers find out what must happen before food can get to our table to nourish our bodies and spirits. Fountas & Pinnell Level L Color Woodcuts"}, {"id": "0990610608", "genre": "Children's Books", "title": "Puddles My Pet Duck", "description": "\"PUDDLES is based on a true story about a little girl named Shirley and her pet duck \"Puddles.\" We sincerely hope our little readers and their families will enjoy the adventures of \"Puddles.\" Our grandchildren have loved the story so we thought we would bring it to life. We have more adventures of \"Puddles\" to share in the future. Thank you for reading our book.\" --Shirley and Jerri"}, {"id": "B00ET5AX22", "genre": "Children's Books", "title": "Abandoned Together - Making new friends", "description": "--The crash of thunder outside of their den was enough to make the tiny porcupine shiver with fear. “It's just some bad weather Spike,” she told him lovingly. His mother cradled him gently in her arms and smiled.  “Bad weather always passes by.” Her words helped the porcupine to calm down, but he still clung tightly to her as another rumble of thunder shook their den. He had heard thunder before but this was the strongest storm he had ever experienced. Suddenly a flood of water rushed into their den and washed over all of their things. His mother tried to hold him up high out of the water..."}, {"id": "1588380254", "genre": "Children's Books", "title": "Johnnie Carr: A Life of Quiet Activism (African American Profiles for the Young)", "description": "This series introduces children (ages 9-12) to the lives of African Americans who have made their marks in the arts, law, politics, sports, science, business, and other fields."}, {"id": "B001Q3M6XY", "genre": "Children's Books", "title": "Amelia And Eleanor Go For A Ride", "description": "One evening in April 1933, Amelia Earhart and Eleanor Roosevelt stole away from a White House dinner, commandeered an airplane and took off on a glorious adventure over Washington D.C. - while still dressed in their glamorous evening gowns! This picture book celebrates the courage and pioneering spirit of two great friends and American heroes."}]