[{"id": "0843198990", "genre": "Children's Books", "title": "Dreidel, Dreidel, Dreidel", "description": "Dreidel, dreidel, dreidel, I made you out of clay. And when you're dry and ready, then dreidel I shall play! Every kid knows the dreidel song, but now they can play along! With adorable art and a pop-up of a spinning dreidel at the back of the book, singing along to this classic holiday tune is more fun than ever!"}, {"id": "0874835240", "genre": "Children's Books", "title": "Greek Myths, Western Style: Toga Tales With An Attitude", "description": "When she was a young girl, Barbara McBride-Smith was introduced to the ancient Greek myths but she didn't quite hear right. When her teacher told her they lived in the cradle of western civilization, young Barbara thought she said Western civilization - as in central Texas, around about Waco, where they seemed to fit right in. Ol' Man Zeus, after all, was a gun-totin' Big Daddy, sort of the J.R. Ewing of Mount Olympus. You know Aphrodite, the school basketball queen or Pandora the debutante, the best guitar picker around was Orpheus - Tom T. and wasn't Medusa the one who started the fashion trend known as Big Hair? With her incurable Texas drawl, feminist sympathies, and cheerleader's do-right attitude, master storyteller Barbara McBride-Smith spins the Greek myths as you've never heard them before. "}, {"id": "1547209240", "genre": "Children's Books", "title": "Happy 6th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 6 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0766091848", "genre": "Children's Books", "title": "Investigating DNA and Blood (Crime Scene Investigators)", "description": "Bloodstains provide clues as to how a crime had been committed. When a speck of blood falls on a surface, it leaves a shape and stain. This is called bloodstain evidence. Each individual carries DNA that is unique to him or her, except for identical twins. With the help of bloodstains and saliva, as well as fingernails, an investigator can recover enough evidence to confirm whether a defendant is guilty or innocent of a crime. This book includes sidebars that further expand on the topic, as well as a further reading list and career information for readers interested in this intriguing STEM field."}, {"id": "0007116675", "genre": "Children's Books", "title": "Get Off My Back!: Level 2: Poems About Bullying (Collins Soundbites)", "description": "Soundbites is a graded series of readers aimed at reluctant readers in Key Stage 3, with accompanying teaching resources.  - Soundbites has three progressive stages of readers. Get Off My Back! is a stage 2 title with a reading age of 7-8) and around 35 words per page. Six different level 1 books are available in a pack (0003230848).  - The book includes poems about bullying, as well as basic PSHE concepts.  - Specialised, difficult or technical vocabulary is explained on the page, plus a one-page glossary at the end.  -The topics covered address the KS3 English and PHSE curricula.  - Photocopiable teaching resources, containing a range of literacy-boosting activities, are available in the Soundbites Bumper Pack (ISBN 0 00 323086 4) or individually (0007116926)."}]