[{"id": "0692518533", "genre": "Children's Books", "title": "Gutsy Girls: Strong Christian Women Who Impacted the World: Book One: Gladys Aylward (Volume 1)", "description": "Girls need heroes. Why not introduce them to women who are smart, bold, courageous, and who love Jesus? -Amy L. SullivanBook One in the Gutsy Girls: Strong Christian Women Who Impacted the World series introduces readers to real-life missionary, Gladys Aylward, the ultimate gutsy girl. Gladys wanted to tell the people of China about Jesus, but others said she was \"too old\" and \"not smart\" and that China was \"far too dangerous\". Gladys ignored these words, relied on God, and set out on an adventure.Young readers are invited to jump aboard the Trans-Siberian Railway and experience Gladys' story which told with engaging text and stunning illustrations."}, {"id": "1530936748", "genre": "Children's Books", "title": "Baby Zeke: Apocalypse: The diary of a chicken jockey, book 9 (an unofficial Minecraft autobiography) (Baby Zeke the Chicken Jockey) (Volume 9)", "description": "Book 9: Apocalypse!  Zeke and his friends have barely recovered from the battle with Herobrine's minion.  The Ender King promised to return to help defeat Herobrine, but he is nowhere to be found.  What is going on?  What is Herobrine up to?  And what does a crazy old villager have to do with it all?  Read Book 9 and find out.  Scroll up and grab your copy now!"}, {"id": "1587280353", "genre": "Children's Books", "title": "I Wish I Were...A Cowboy", "description": "The perfect make-believe books to help inspire childhood dreams. Kids will love the stories, photographs, drawings, and activities that help put themselves into the role of a cowboy. Plus, there are easy-to-make crafts and fun fact that help children learn about cowboys through pretending."}, {"id": "1631378090", "genre": "Children's Books", "title": "Maintaining a Positive Digital Footprint (Information Explorer Junior)", "description": "Learn how to avoid developing a bad reputation or revealing too much personal information on the internet. This book will challenge students' prior knowledge of Internet safety and help them adopt better habits, both academically and personally. By learning these foundational skills so early, students will be able to build upon them as technology inevitably advances."}, {"id": "0374301859", "genre": "Children's Books", "title": "A Unicorn Named Sparkle: A Picture Book", "description": "When Lucy sees an ad in the newspaper for a unicorn, she sends in her twenty-five cents and waits four to six long weeks for her very own unicorn to arrive. She imagines the flowers that she'll braid into his beautiful pink mane, and she even picks the perfect name for him: Sparkle. But when Sparkle arrives, his ears are too long, his horn is too short, he smells funny--and oh, he has fleas. Lucy isn't pleased, but in the end she warms up to Sparkle and realizes that even though he wasn't exactly the unicorn she wanted, he might be just the one she needs."}]