[{"id": "B00J3B6ORK", "genre": "Children's Books", "title": "Children's Books: Coyotes! Fun Facts on Animals in Nature.", "description": "** For Kids Only** Written in a simple Language that Kids will understand.An amazing children's book on Coyotes. The pictures are great and the information herein is awesome for kids of 4 and Up!This book contains Coyotes illustrations that look beautiful on the kindle device and depicts the habits and behavior of the Coyotes.I loved writing this children's book and learned a great deal along the way about Coyotes.Buy this Children's Book at Amazon's Exclusive price and I am sure your child will love and appreciate this Coyotes eBook."}, {"id": "0892391383", "genre": "Children's Books", "title": "In My Family / En mi familia", "description": "Following the best-selling Family Pictures, In My Family/En mi familia is Carmen Lomas Garza's continuing tribute to the family and community that shaped her childhood and her life. Lomas Garza's vibrant paintings and warm personal stories depict memories of growing up in the traditional Mexican-American community of her hometown of Kingsville, Texas."}, {"id": "B072C4FSGD", "genre": "Children's Books", "title": "The Secret of Mermaid Island (The Mermaid Island trilogy Book 1)", "description": "Bonnie Campbell vows to make the best of a summer spent away from her school friends while her mother studies wildflowers on remote Mermaid Island.  Things get more interesting when Bonnie discovers the island is the private home of a famous celebrity, but as time passes she begins to suspect that Mermaid Island may hold a bigger secret.  Is it possible the island has a real mermaid?"}, {"id": "B077QBTQQZ", "genre": "Children's Books", "title": "Children: Animals", "description": "Children:  Animals is a Haiku Poem/Haiku Poetry e-book.It is a5-7-5 haiku Short Form Qualities/Quality."}, {"id": "0736864970", "genre": "Children's Books", "title": "Elizabeth Blackwell: America's First Woman Doctor (Graphic Biographies)", "description": "Tells the story of Elizabeth Blackwell, the first woman to earn a medical degree in the United States. Written in graphic-novel format."}]