[{"id": "0766031322", "genre": "Children's Books", "title": "The 1930s Decade in Photos: Depression and Hope (Amazing Decades in Photos)", "description": "Poignant photos and high-interest text are used to illustrate how the Great Depression hit America like a mighty storm. Millions of workers lost their jobs. Families were forced to scrounge for food. It was the worst economic tragedy in American history. The nation forged ahead. A new president promised a New Deal for America. Franklin D. Roosevelt told Americans that they had nothing “to fear but fear itself.” He fought tirelessly to end the Great Depression. Meanwhile in Germany, Adolf Hitler and the Nazis seized power. Warlike military officers did the same in Japan. Read about the 1930s and what lay ahead."}, {"id": "039480077X", "genre": "Children's Books", "title": "Horton Hatches the Egg", "description": "Generations of children have fallen in love with Horton the elephant!  “I meant what I said, and I said what I meant. . . . An elephant’s faithful, one hundred per cent!” Horton is kind and trustworthy, but unfortunately, the lazy bird Mayzie takes advantage of his good nature when she leaves Horton to watch her unhatched egg. Told with Dr. Seuss’s signature rhymes and trademark illustrations, this is a tale that will be enjoyed over and over, by reader and listener alike. And don’t miss another delightful tale about this beloved pachyderm: Horton Hears a Who!"}, {"id": "0618154248", "genre": "Children's Books", "title": "Curious George Four Board Book Set", "description": "Curious George, the beguiling little monkey, is one of the most beloved of all children’s book characters. Now this collection of four board books featuring Curious George is available in a sturdy, reusable, carry-along box. Brightly colored and suitably scaled for the youngest readers, the books feature art from the original storybooks by H. A. Rey. "}, {"id": "1406362255", "genre": "Children's Books", "title": "The Marzipan Pig", "description": "\"There is,\" said the marzipan pig, \"such sweetness in me!\"From the inimitable team of Russell Hoban and Quentin Blake, the pair behind Captain Najork and The Twenty Elephant Restaurant, comes an enchanting story of a little pig made of marzipan. Fallen behind the sofa, nobody hears the lost marzipan pig's cries for help. And, after many months, a mouse discovers him and eats him up, having never known such sweetness. But a longing to be loved passes from the marzipan pig to the mouse ... and so begins a curious chain of events featuring a dancing owl, a glowing taxi meter, a buzzing bee and a pinky-orange hibiscus flower - all triggered by the little lost marzipan pig. Each encounter more wonderful and more romantic than the last, just how far will the marzipan's sweetness travel?"}, {"id": "1946101443", "genre": "Children's Books", "title": "Finn Finds A Friend", "description": "Finn is not your typical lemon shark. He likes to frolic and have fun in the water. But his brothers’ and sisters’ idea of fun is lying completely still on the ocean floor - BORING! While out searching for new friends, Finn encounters a sea turtle who hides in a rock cave. Clearly, he must want to play hide and seek. Then he comes across some humans who scream, “SHARK!!!” when he approaches. Obviously, they must be excited to see him. Will Finn ever find a friend who can see beyond his sharky appearance?"}]