[{"id": "1772780421", "genre": "Children's Books", "title": "Small Things", "description": "In this wordless graphic picture book, a young boy feels alone with his worries. He isn't fitting in well at school. His grades are slipping. He's even lashing out at those who love him.Talented Australian artist Mel Tregonning created Small Things in the final year of her life. In her emotionally rich illustrations, the boy's worries manifest as tiny beings that crowd around him constantly, overwhelming him and even gnawing away at his very self. The striking imagery is all the more powerful when, overcoming his isolation at last, the boy discovers that the tiny demons of worry surround everyone, even those who seem to have it all together.This short but hard-hitting wordless graphic picture book gets to the heart of childhood anxiety and opens the way for dialogue about acceptance, vulnerability, and the universal experience of worry. (Publisher)"}, {"id": "0152051465", "genre": "Children's Books", "title": "Tomas Rivera (Green Light Readers Level 2)", "description": "Tomás Rivera wants to tell stories, just like his grandpa. But first he needs to visit a very special place where he can get lots of good ideas--the library. The text is based on a true story."}, {"id": "B0097X0EY8", "genre": "Children's Books", "title": "Search for the Pirate's Treasure", "description": "Enjoy this newly unique interactive book that has been created for children between the ages of 2 to 5 years old.The book's Alternative Storyline Pathways concept allows You to actually Select where you want the story to go! Each turn of the page invites you to select the next story pathway. You just touch your finger to the chosen pathway icon and turn the pages!Imagine the joy of a young child as they guide the path of an Adventure, as it is being read to them!Now, do you dare to climb the ladder or go through the secret door? ... The Adventure awaits!"}, {"id": "1408302136", "genre": "Children's Books", "title": "Sophie and the New Baby (Anholt Family Favourites)", "description": "From the authors of 'Going to Playgroup' and 'The New Puppy' comes this warm, reassuring picture book about the birth of a new baby and the effect this has on a young sibling."}, {"id": "0062306294", "genre": "Children's Books", "title": "I'm Cool!", "description": "For fans of all things snow and ice comes the latest addition to this hilarious read-aloud series from Kate and Jim McMullan, the popular creators of I Stink! and I'm Dirty!—now a streaming animated series.Perfect for any young hockey player, this book is all about the ice-cold Zamboni machine! When the ice is full of cuts and ruts, only one machine has the GUTS to clean it up. But can this slow-movin' ice fixer smooth the grooves before the next period? Or will he lose his COOL? The timer's ticking! BUZZZZZZ!"}]