[{"id": "B00BJYMJG4", "genre": "Science Fiction & Fantasy", "title": "Robert Asprin's Myth Adventures Volume 2", "description": "Robert Asprin's Myth Adventure Series continues in this collection including M.Y.T.H. Inc. Link, Myth-Nomers and Im-Pervections, M.Y.T.H. Inc. In Action, Sweet Myth-tery of Life, Myth-ion Improbable and Something M.Y.T.H. Inc. Includes illustrations by Phil Foglio."}, {"id": "1566630185", "genre": "Science Fiction & Fantasy", "title": "After Many a Summer Dies the Swan", "description": "A Hollywood millionaire with a terror of death, whose personal physician happens to be working on a theory of longevity-these are the elements of Aldous Huxley's caustic and entertaining satire on man's desire to live indefinitely. With his customary wit and intellectual sophistication, Huxley pursues his characters in their quest for the eternal, finishing on a note of horror. \"This is Mr. Huxley's Hollywood novel, and you might expect it to be fantastic, extravagant, crazy and preposterous. It is all that, and heaven and hell too....It is the kind of novel that he is particularly the master of, where the most extraordinary and fortuitous events are followed by contemplative little essays on the meaning of life....The story is outrageously good.\"―New York Times. \"A highly sensational plot that will keep astonishing you to practically the final sentence.\"―The New Yorker. \"Mr. Huxley's elegant mockery, his cruel aptness of phrase, the revelations and the ingenious surprises he springs on the reader are those of a master craftsman; Mr. Huxley is at the top of his form.\" ―London Times Literary Supplement."}, {"id": "1941110614", "genre": "Science Fiction & Fantasy", "title": "Downdrift: A Novel", "description": "Narrated by an Archaean, a 3.8 billion year old species, the oldest on earth, Downdrift is a work of speculative eco-fiction that describes the impact of ecological pressures on animals that are adopting human behaviors, with droll and sometimes alarming, results. The book follows a year of changes and the travels of a housecat and a lion who are inexplicably driven towards a rendezvous. At first, a few isolated harbingers of change appear, but they quickly escalate. Squirrels take up manic knitting, wild hares steal earth-moving equipment, rats go in for disco music and form-fitting metallic leisure-ware. Data-sorting abilities appear among urban populations of birds, and frenzied domestic pets seek celebrity careers. Droll, melancholic, and poetic, the tale is crammed with witty vignettes and poignant reflections on the ways the pressures on the once-natural world are accelerating mutations in behaviors among the animals. Genetic material alters. The differences between animals blur. Odd mutant forms appear–goat-chicks and dog-flies, fish-birds and flying lizards–as if some mad rush is propelling genetic code to propagate across every form of flesh and living matter. As large-scale infrastructure projects make their appearance, each of the animals takes the role appropriate to its disposition―or not. Melancholic rather than apocalyptic, the book is a celebration of species as well as a mourning of the damage done in our time. Throughout, the emergent voice and character of the Archaean extremophile records events as well as a slow coming to consciousness about its own identity as a hyper-organism."}, {"id": "1944946144", "genre": "Science Fiction & Fantasy", "title": "Lab 42: Feenix Rising (Bug Hunters in Space) (Volume 3)", "description": " Preppers, Colonists, and the voracious Feenix Bug which one doesn’t belong? Entomologist Dr. Gwen Finn is feeling like a lab rat herself. She’s had a reporter shadowing her for a week and now a researcher in the Cube’s social psychology department wants to interview her. Enough is enough. Gwen is anxious to head back into the field where the dangers can be thwarted with a well-placed blaster shot.  A group of preppers from Earth is forced to take drastic measures when their compound in a remote area is destroyed by an out of control spaceship. Colonists from the planet Crystal that was destroyed by a deranged Alue, have found a new home on New Regulus, a remote planet that the League’s Bureau of Colonization lists as uninhabited.Feenix Rising is the third book in a series of fast-paced sci-fi adventures. If you like strong female characters, relatable aliens, and stories of family struggles, you’ll love this entry in Jo Carey’s Bug Hunters in Space series. Buy Feenix Rising to continue the exciting adventure today! "}, {"id": "1250170141", "genre": "Science Fiction & Fantasy", "title": "Godsgrave: Book Two of the Nevernight Chronicle", "description": "The second thrilling installment of the Nevernight Chronicle, from New York Times bestselling author Jay Kristoff.In a land where three suns almost never set, a ruthless assassin continues her quest for vengeance against the powers who destroyed her family.Mia Corvere has found her place among the Blades of Our Lady of Blessed Murder, but many in the Red Church hierarchy think she’s far from earned it. Plying her bloody trade in a backwater of the Republic, she’s no closer to ending the men who destroyed her familia; in fact, she’s told directly that Consul Scaeva is off limits. But after a deadly confrontation with an old enemy, Mia's suspicions about the Red Church’s true motives begin to grow.When it’s announced that Scaeva will be making a rare public appearance at the conclusion of the grand games in Godsgrave, Mia defies the Church and sells herself to a gladiatorial collegium for a chance to finally end him. Upon the sands of the arena, Mia finds new allies, bitter rivals, and more questions about her strange affinity for the shadows. But as conspiracies unfold within the collegium walls, and the body count rises, Mia will be forced to choose between love and revenge, and uncover a secret that could change the very face of her world."}]