[{"id": "1416941215", "genre": "Children's Books", "title": "Mommy Hugs (Classic Board Books)", "description": "Mommy and Baby's day is filled with lots of hugs and love!   Mommy and Baby can now count and cuddle as they hug and read about Baby's day of fun in this book ideal for even the youngest reader!"}, {"id": "1564026043", "genre": "Children's Books", "title": "The Pig in the Pond", "description": "Pigs don't swim, or so it's said. But on one of the hottest days of the summer, the pig on Neligan's farm sits by the pond feeling envious of the ducks and the geese floating in the cool water. Finally, when she can endure the heat no longer—splash!—this sweltering pig takes a dive, throwing the entire farm into an uproar. It isn't long, however, before the refreshing idea catches on, and the pig finds that she's got company! This spirited tale with its exuberant illustrations is sure to be a hit with all those young and old who ever wanted to take the plunge."}, {"id": "1897066643", "genre": "Children's Books", "title": "How Hockey Works (How Sports Work)", "description": "Author Keltie Thomas and illustrator Greg Hall team up to look at hockey in a new way: from the perspective of science. Their book explores the all-important science of explosive moves (the slapshot) and maximizing a player’s chance of scoring; the science of speedy, powerful skating; the puck, stick, mask, and other equipment; the properties of ice and how skating surfaces are maintained; and the science of fitness and healing injuries. How Hockey Works includes personal stories from the inspirational (the stunning careers of Bobby Orr and Wayne Gretzky) to the hilarious (the puck’s origins as an India rubber ball reshaped by a frustrated rink owner). Informative sidebars, a \u0093Rules and Regs” section, and a glossary help make any reader an expert on the game. From casual to obsessed every hockey fan can find something in How Hockey Works."}, {"id": "1444919571", "genre": "Children's Books", "title": "Quick Quack Quentin", "description": "From the creators of the bestselling Oi Frog! Frog comes an hilarious tale about one duck's quest for a missing vowel!Quentin was a duck with a very quick quack. 'QUCK!' said Quentin. 'What's wrong with me?'Quentin's quack has lost its A. Do any of the other animals have one to spare? Not likely! APES don't want to be PES. SNAKES don't want to be SNKES. PANDAS don't want to be PNDAS or even PANDS. Will Quentin be stuck with a very quick QUCK?!Brilliant for reading out loud and teaching children about vowels and animals.Praise for Oi, Frog! also by Kes Gray and Jim Field: 'An absolute treat.' - Daily MailKes is one of the Independent's TOP TEN children's authors and winner of the Red House Children's Book Award. Jim's first picture book Cats Ahoy! won the Roald Dahl Funny Prize."}, {"id": "0007180896", "genre": "Children's Books", "title": "Fab Friendship", "description": "Everyone needs friends. Find out how Mary-Kate and Ashley get on with their best buddies in this fab mini box all about friendship. What kind of friend are you? Find out with this Fab Friendship Mini Box, packed with quizzes, hints and tips, and lots of fun things to do. Mary-Kate and Ashley give advice on friendship DO'S and DONT'S, and there is a problem page for all those friendship dilemas. So join the girls and have lots of fun with your friends! VAT Split GBP5.99 retail including vatGBP5.30 retail excluding vat Of the GBP5.30: GBP3.94 = vatable amount (74.3 per cent) GBP1.36 = non vatable amount (25.7 per cent) GBP5.30"}]