[{"id": "1921417617", "genre": "Children's Books", "title": "Sky High (Zac Power)", "description": "Another high flying adventure for Zac Power A piece of top-secret GIB technology has been stolen, and Zac Power has to get it back. Blasting off toward a secret hide-out in the sky, he faces his strangest enemy yet."}, {"id": "1927244587", "genre": "Children's Books", "title": "Hungry Tiger and Clever Rabbit: A Tale from Korea (Story World)", "description": "Hungry Tiger and Clever Rabbit is a 16 page retelling of a traditional tale from Korea. The \"flip\" side of the book is Tiger Talk. Tiger Talk contains 8 pages of information about Korea and the tiger as a symbol of the Korean people and Korean culture. Contents: Tiger Tales, Sights of Seoul, The Hahoe Maskdance Festival, The Tiger (a poem). Supported by FREE Inquiry Learning Teacher's Notes."}, {"id": "B00OAZCKM2", "genre": "Children's Books", "title": "The Fairy King's Halloween", "description": "A bit of magic is in store when the fairy king visits the local neighborhood on Halloween night. What spells will he cast to make it a happy Halloween for everyone? This picture book, written in verse, celebrates the light, fun side of Halloween."}, {"id": "1442485213", "genre": "Children's Books", "title": "Bunnicula in a Box: Bunnicula; Howliday Inn; The Celery Stalks at Midnight; Nighty-Nightmare; Return to Howliday Inn; Bunnicula Strikes Again; Bunnicula Meets Edgar Allan Crow (Bunnicula and Friends)", "description": "Lock up your veggies and get out your garlic—the complete Bunnicula collection is now available as a boxed set!Something wicked this way hops... Join Harold, Howie, Chester, and of course, Bunnicula for seven thrilling adventures—all together for the first time in one fur-raising boxed set! This complete collection includes paperback editions of Bunnicula, Howliday Inn, The Celery Stalks at Midnight, Nighty-Nightmare, Return to Howliday Inn, Bunnicula Strikes Again, and Bunnicula Meets Edgar Allan Crow."}, {"id": "B005M4MZMA", "genre": "Children's Books", "title": "The Ten-Year Century: Explaining the First Decade of the New Millennium", "description": "Remember worrying about the Y2K bug in 1999? Or life before Twitter? Ten years ago, September 11 was just another day, Facebook didn't exist, and Barack Obama was a little-known state senator. Some have called the jam-packed first decade of the new millennium the \"ten-year century\" for all of the history-making, life-changing developments it's contained. Now, James Sutherland explores these influential years for the audience that's grown up in it, putting history in context and explaining how the world is smaller, faster, and more connected than it's ever been-and why it matters."}]