[{"id": "1589475208", "genre": "Children's Books", "title": "Pencil-Pal Preschool (Pencil-Pal Software)", "description": "Meet Sherman Sheep and the rest of the barnyard buddies! They can't wait to show off the exciting activities behind each barn door. Down on the farm children will play an educational game packed with colors numbers shapes and more. Let Rodney T. Rooster wake up creativity with coloring fun. Or watch 12 of Garrison Goat's favorite films. A silly filly tells jokes and riddles. This friendly Preschool Barnyard teams up with a colorful 64-page workbook to help children prepare for school success. (Ages: 3-5 | 128 Pages |1 CD-ROM | Dimensions: 11x8.5in)"}, {"id": "B017X1DTWY", "genre": "Children's Books", "title": "The Hammer & the Serpent (The Corbis Saga Book 1)", "description": "All thirteen-year-old Corbis Callum wants for his summer break is to be left alone with his books. But when a mysterious hammer falls into his backyard, his plans are quickly changed. Torn from his home in small-town Haber's Brook, Wisconsin, Corbis fights to find a hint of normalcy wherever possible. Making the situation worse, the hammer can communicate telepathically with him. Its message? A warning that the world-destroying Ravager is coming for Earth, and his first stop is Haber's Brook.The Hammer and the Serpent is the first installment of The Corbis Saga."}, {"id": "1471829618", "genre": "Children's Books", "title": "10-Minute Maths Tests Workbook Age 8-10", "description": "Develop your Year 5 pupils' Maths skills with this essential workbook, designed to address all 6 strands of the Maths curriculum in short 10-minute tests. Give pupils the best chance of success in Pre-Tests and 11+ exams with varied and thorough maths skills practice. This write-in workbook for pupils aged 8-10 provides extensive practice with 70 topic tests including 10 mixed topic tests, plus pull-out answers. - Practise recalling facts and procedures - Identify weak topics and improve skills - Build confidence with regular testing Topics covered: Number, Calculations, Problem-solving, Pre-algebra, Shape, Space and Measures and Handling Data Also available from Galore Park www.galorepark.co.uk: -10-Minute Maths Tests Workbook Age 9-11 - Mental Arithmetic Workbook Age 8-10 - Mental Arithmetic Workbook Age 9-11"}, {"id": "168052125X", "genre": "Children's Books", "title": "Who: Peek-a-Flap Board Book", "description": "Peek and explore in the forest! You'll meet all sorts of animal friends. Each scene features a pair of lift-a-flaps with peekaboo surprises. Inside the flaps, you'll find fun facts about the animals in the artwork."}, {"id": "B071CJZZB8", "genre": "Children's Books", "title": "Pocket Full of Colors: The Magical World of Mary Blair, Disney Artist Extraordinaire", "description": "Amy Guglielmo, Jacqueline Tourville, and Brigette Barrager team up to tell the joyful and unique story of the trailblazing Disney artist Mary Blair.Mary Blair lived her life in color: vivid, wild color. From her imaginative childhood to her career as an illustrator, designer, and animator for Walt Disney Studios, Mary wouldn’t play by the rules. At a time when studios wanted to hire men and think in black and white, Mary painted twinkling emerald skies, peach giraffes with tangerine spots, and magenta horses that could fly. She painted her world."}]