[{"id": "B06XFWMDVY", "genre": "Children's Books", "title": "#3: A New Friend (Tales of Sasha)", "description": "In book three of the Tales of Sasha series, Sasha makes friends with one of the flying horses, but will she forget about her better-than-best friend Wyatt?Sasha and her better-than-best friend Wyatt have successfully made the journey beyond the trees that line their valley to discover Crystal Cove, a land where other flying horses live! Sasha is very excited to get to know these flying horses, and she makes friends with a spunky flying horse named Kimani. But Kimani is unsure of Wyatt since he doesn't have wings, and Wyatt is anxious to get home to Verdant Valley. Can Sasha figure out a way to make her friends get along?"}, {"id": "0836853474", "genre": "Children's Books", "title": "Great Moments in Hockey (Great Moments in Sports)", "description": "Recounts ten high points in the history of hockey, including the 1942 Stanley Cup win for the Toronto Maple Leafs, the 1980 Olympic gold medal game between the United States and Russia, and the career of Hall of Famer Mario Lemieux."}, {"id": "B00DOMWVSK", "genre": "Children's Books", "title": "Girls Can't Play", "description": "“If I was a boy, you’d let me play,” grumbled Gertrude.“Yeah,” Flynn agreed.  “But you’re not a boy.  You’re a girl.”Gertrude wants to play footy.  But the coach of the school footy team won’t let her play and the boys just laugh at her.If she were a boy, things would be different.  So Gertrude decides to become a boy – just to play one game of footy.When a medical certificate keeps Gertrude away from school, “Gav”, the new kid, arrives.  He quickly makes friends and the footy team.For Gertrude, the Friday footy game is not all she thought it would be.  For the coach, Gav is his star player.  Gav decides to hang around for the rest of the school term.Gertrude is treading a fine line as she desperately tries to hide her secret.  She gets to play footy, but she also has two lots of homework to do!When she is hurt at training one night, the truth comes out.  Gertrude is in trouble with the coach, the school principal and her parents.  Worse than any of that was the look on her best friend Flynn’s face.  Has she lost his friendship forever?"}, {"id": "B01N42KZ31", "genre": "Children's Books", "title": "Bikes and Boards (Science Readers: A Closer Look)", "description": "Readers will be amazed to discover that every time they climb onto bicycles and ride like the wind, they are defying gravity! This book explains the physics and history behind bicycles, skateboards, and surfboards. Readers learn what happens from the simplest movement of rolling forward to more complex tricks and stunts of jumping and spinning. Readers will never look at bikes, skateboards or surfboards the same way again."}, {"id": "1620105233", "genre": "Children's Books", "title": "Mermin Vol. 5: Making Waves", "description": "The battle between Mer and Atlantis begins! And while Mermin the merman is at his father's side, the rest of his friends and family are scattered around the battlefield, trying to help in any way they can. Except for Pete, who's about to stage a jailbreak out of Atlantis with a team of Mer-prisoners! Will they make it to Mer in time to stop the war? The thrilling conclusion to the Mermin series!  "}]