[{"id": "1421592665", "genre": "Children's Books", "title": "Castle in the Sky Picture Book", "description": "Enjoy the films of Studio Ghibli with scene-by-scene illustrations and character dialogue.Studio Ghibli picture books capture the magic of the legendary studio’s animated films with easy-to-read text, full-color pictures direct from the film, and a family-friendly oversized hardcover format.  The legends were true! Somewhere high in the clouds, human beings have again set foot on the floating island of Laputa, for centuries a peaceful, parklike ruin, tended only by its silent, faithful robots. But just behind Pazu and Sheeta are soldiers from the aerial dreadnought Goliath—who have captured Dola and her pirate crew, and are now looting the gold and jewels of the Castle in the Sky for themselves! But the man who guided them there, Muska, has his eyes on power, not money—and he alone knows how to activate the castle’s ancient superweapons that could make him master of the world! Can Pazu and Sheeta stop his sinister plan? Includes scene-by-scene illustrations and character dialogue from the film."}, {"id": "1402773129", "genre": "Children's Books", "title": "Classic Starts™: Greek Myths (Classic Starts™ Series)", "description": "From Icarus's legendary flight to Orpheus's trip to the underworld, this stunning edition brings to life 15 classic Greek myths. Easy to read and beautifully illustrated, it includes Heracles' mighty tasks, Pandora's box, King Midas's golden touch, and more! "}, {"id": "0823411699", "genre": "Children's Books", "title": "Christopher: The Holy Giant", "description": "A celebrated illustrator presents his interpretation of the legend of St. Christopher, who originally had been a giant named Reprobus out to serve the world's most powerful king, a ruler he finds when he carries the young Christ across a river."}, {"id": "160058229X", "genre": "Children's Books", "title": "Fashion Design Workshop: Stylish step-by-step projects and drawing tips for up-and-coming designers (Walter Foster Studio)", "description": "This delightful guide offers budding artists the perfect introduction to the fundamentals of fashion figure drawing. Showcasing the hip, girly artistic style of Stephanie Corfee, the step-by-step projects cover a range of looks—from sophisticated and elegant to cool and casual. The book also contains tips on accessorizing with purses, shoes, hats, and more. And for those who are serious about style, Fashion Design Workshop includes a glossary of fashion terms and a collection of model templates so readers can develop their own line of clothing!  "}, {"id": "0756662893", "genre": "Children's Books", "title": "One Million Things: Space", "description": "There are millions of stars in the sky and millions of things to learn about the universe, and One Million Things: Space serves up imagery and information about all things cosmic: from planets, moons, and comets, to black holes, nebulae, distant solar systems, and more."}]