[{"id": "0894905732", "genre": "Children's Books", "title": "Alex Haley: Author of Roots (People to Know)", "description": "A biography of the author whose research into his own family background changed the public perception of African-American history recounts his struggle for success as a writer, and discusses the controversies that his works have aroused"}, {"id": "1548936286", "genre": "Children's Books", "title": "David Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "0545854415", "genre": "Children's Books", "title": "Trilogy Box Set (Star Wars: Jedi Academy)", "description": "This set includes all three books from the NY TIMES BESTSELLING SERIES Star Wars: Jedi Academy. Created by award-winning author/illustrator Jeffrey Brown, this series is a hit for readers of all ages. Whether you're familiar with Star Wars or if you're new to the galaxy, this heartfelt and hilarious adventure follows middle grader Roan as he navigates being a Jedi and dealing with bullies, aliens, robots, and even school dances."}, {"id": "1492657042", "genre": "Children's Books", "title": "Don't Push the Button! A Christmas Adventure", "description": "A holiday companion to Don't Push the Button!It's almost Christmas and Santa is coming, so whatever you do―DON'T PUSH THE BUTTON!!Well, maybe just once can't hurt...uh oh!"}, {"id": "0545782309", "genre": "Children's Books", "title": "Ruby Lee and Me", "description": "Everything's changing for Sarah Beth Willis. After Robin's tragic accident, everyone seems different somehow. Days on the farm aren't the same, and the simple fun of riding a bike or playing outside can be scary. And there's talk in town about the new sixth-grade teacher at Shady Creek. Word is spreading quickly--Mrs. Smyre is like no other teacher anyone has ever seen around these parts. She's the first African American teacher. It's 1969, and while black folks and white folks are cordial, having a black teacher at an all-white school is a strange new happening. For Sarah Beth, there are so many unanswered questions. What is all this talk about Freedom Riders and school integration? Why can't she and Ruby become best friends? And who says school isn't for anybody who wants to learn--or teach? In a world filled with uncertainty, one very special teacher shows her young students and the adults in their lives that change invites unexpected possibilities."}]