[{"id": "B003YL4HFQ", "genre": "Science Fiction & Fantasy", "title": "Sen'giza", "description": "Faced with a threat from the stars, magical creatures are forced to resurface from a realm of myths and legends. But will the humans they abandoned so long ago prove ally or enemy?The might of twenty-first century science will clash against the arcane magic of faeries, and in the middle is Kelli Ingram, a young sorceress imprisoned by a creature that is neither human or faery.Sen'giza is a unique adventure blending hi-tech science fiction with traditional sword-and-sorcery. Pidgin-speaking surfers learn how cast spells while magical elves learn about sniper rifles and guided munitions, but that's just the beginning. A galaxy-crossing ship holds the key to Earth's future... if the humans and faeries can keep from killing each other."}, {"id": "B00CNU73E6", "genre": "Science Fiction & Fantasy", "title": "2-4 Cavalry Book 9: Weeds of Gold (Military Scifi)", "description": "In this military science fiction short story the unit is sent to the planet Lisbon, which is suffering from a labor dispute.  The question is, will the unit have to fight the workers or will they leave peacefully? Based off of the scenario at http://www.hammers-slammers.com.  It is not a Hammers Slammers story due to the fact that it is my own universe, and the story is told in that way.And please while I would appreciate reviews of my book, please read it before making a review, thank you."}, {"id": "1872372473", "genre": "Science Fiction & Fantasy", "title": "Warhammer 40, 000 Codex: Chaos", "description": "Codex Chaos describes the dark Chaos Gods and their followers in the Warhammer 40,000 universe, most notably the Chaos Space Marines of the Traitor Legions. We've tried to make this book as complete as possible, and although it concentrates primarily on the Chaos Space Marine armies that raid out of the Eye of Terror, we've also included enough additional background information and army lists to allow players to fight many kinds of different battles involving the forces of Chaos. The Book is divided into four main sections: 1) The Realm of Chaos, which describes the background and history of Chaos in the Warhammer 40,000 universe. 2) The Forces of Chaos, which has descriptions and rules of all the different followers of the Chaos Gods and their weaponry. 3) Slaves to Darkness, contains the Chaos Space Marine army list and special characters 4) The Lost and The Damned, where we cover a number of things related to Chaos in the Warhammer 40,000 universe, but which aren't included in the main rules or background. The book also includes two color sections: 16 pages of 'Eavy Metal and, at the back of the book, 16 pages of Wargear cards, Vehicle cards and Chaos Reward cards."}, {"id": "0385539835", "genre": "Science Fiction & Fantasy", "title": "Bats of the Republic: An Illuminated Novel", "description": "\"Archetypes of the cowboy story, tropes drawn from sci-fi, love letters, diaries, confessions all abound in this relentlessly engaging tale. Dodson has quite brilliantly exposed the gears and cogs whirring in the novelist’s imagination. It is a mad and beautiful thing.”--Keith Donohue, The Washington PostWinner of Best of Region for the Southwest in PRINT’s 2016 Regional Design AwardsBats of the Republic is an illuminated novel of adventure, featuring hand-drawn maps and natural history illustrations, subversive pamphlets and science-fictional diagrams, and even a nineteenth-century novel-within-a-novel—an intrigue wrapped in innovative design.     In 1843, fragile naturalist Zadock Thomas must leave his beloved in Chicago to deliver a secret letter to an infamous general on the front lines of the war over Texas. The fate of the volatile republic, along with Zadock’s future, depends on his mission. When a cloud of bats leads him off the trail, he happens upon something impossible...     Three hundred years later, the world has collapsed and the remnants of humanity cling to a strange society of paranoia. Zeke Thomas has inherited a sealed envelope from his grandfather, an esteemed senator. When that letter goes missing, Zeke engages a fomenting rebellion that could free him—if it doesn’t destroy his relationship, his family legacy, and the entire republic first.     As their stories overlap and history itself begins to unravel, a war in time erupts between a lost civilization, a forgotten future, and the chaos of the wild. Bats of the Republic is a masterful novel of adventure and science fiction, of elliptical history and dystopian struggle, and, at its riveting core, of love."}, {"id": "0425274268", "genre": "Science Fiction & Fantasy", "title": "Captive Prince (The Captive Prince Trilogy)", "description": "From global phenomenon C. S. Pacat comes the first novel in her critically acclaimed Captive Prince trilogy—includes an exclusive bonus story! Damen is a warrior hero to his people, and the rightful heir to the throne of Akielos. But when his half brother seizes power, Damen is captured, stripped of his identity, and sent to serve the prince of an enemy nation as a pleasure slave.Beautiful, manipulative, and deadly, his new master, Prince Laurent, epitomizes the worst of the court at Vere. But in the lethal political web of the Veretian court, nothing is as it seems, and when Damen finds himself caught up in a play for the throne, he must work together with Laurent to survive and save his country.For Damen, there is just one rule: never, ever reveal his true identity. Because the one man Damen needs is the one man who has more reason to hate him than anyone else..."}]