[{"id": "1471118991", "genre": "Children's Books", "title": "Violet and the Smugglers", "description": "Meet Violet Remy-Robinson, an amateur Sherlock Holmes in the making, in this “Agatha Christie-esque mystery…[that’s] quirky and charming” (The Guardian)—perfect for fans of Chris Riddell and Robin Stevens’s Wells & Wong mysteries.Uncle Johnny has invited Violet and her friends to spend the summer with him on a sailing adventure around Europe and Violet couldn’t be more excited! But when she suspects that the captain of a boat nearby might be up to no good, Violet needs to put her detective skills into action. Could he be the head of an international smuggling ring? Beautifully designed and filled with gorgeous two-color illustrations throughout, everyone is bound to fall in love with Violet and the colorful characters that make up her world."}, {"id": "0553520571", "genre": "Children's Books", "title": "Oh, Baby, the Places You'll Go!", "description": "An introduction to the world of Dr. Seuss—for babies and babies-to-be!   Artfully adapted almost entirely from Ted Geisel’s work, this introduction to the world of Dr. Seuss is a must for expectant parents and new babies! In simple rhymed verse, author Tish Rabe extolls the joys awaiting newborns when they meet the Cat in the Hat, Horton the Elephant, Yertle the Turtle, the Great Birthday Bird, the Grinch, and twenty-five other beloved Seuss characters. Written to be read aloud to babies and babies-to-be (yes, babies in utero!), the book includes a brief introduction by Mrs. Dr. Seuss—Audrey Geisel—revealing how she and Ted were fascinated by the idea that babies could hear sounds while still in the womb—and might actually respond to the voices of their parents. A perfect gift for baby showers and newborns, Oh, Baby, the Places You'll Go! is the ideal way to nurture a love of reading and Dr. Seuss in the very youngest children!"}, {"id": "197432883X", "genre": "Children's Books", "title": "Creativity Journal: Writing & Creativity Journal (Creativity Journal For Kids & Adults)(Mindfulness Journaling)", "description": "Awesome creativity journal notebooks for all your ideas, stories and song writing!Do you love expressing your creativity through journaling? This 6x9, 108 lined page journal with vibrant images is perfect for everything your imagination can muster up.This creativity journal can help boys and girls explore their innermost feelings and adults to write down that breakthrough idea.Works great for:Idea Notebook JournalCreative Writing Practice WorkbooksSong Writing JournalNotebook For StudentsBack To School NotebooksBlank Journal For KidsAnd much more…..Makes the perfect:Birthday GiftMother’s Day GiftChristmas GiftsBack To School GiftTeacher SuppliesGrab your copy today by scrolling up and hitting the buy button today!"}, {"id": "0340911158", "genre": "Children's Books", "title": "Everyone I See Is Luckier Than Me: Poems About Being Jealous (Poemotions)", "description": "Ideal for ages 3-7, these simple poems get to the heart of childhood emotional experience. They are hugely entertaining in their own right and wonderfully supplemented by the witty and humorous illustrations, thus making them ideal for literacy work. They also make a great starting point for discussion about feelings and behavior."}, {"id": "0736423796", "genre": "Children's Books", "title": "Finding Nemo: School Days", "description": "Fish school is in session and Nemo and his friends are learning about colors, numbers, shapes, and opposites. This clear plastic sea-through carry-along box holds four colorful board books, each teaching a different early learning concept. Little learners will get a look right into Nemo’s underwater world as the books show through the box for a fun threedimensional look. Children will dive right in and love taking their undersea friends with them wherever they go!"}]