[{"id": "1545374767", "genre": "Children's Books", "title": "Kawaii Alpacas and Unicorns: A Super Cute Coloring Book Filled with Magic for Kids, Teens, and Adults (Adorable Anime, Manga and Kawaii Coloring Sheets) (Volume 1)", "description": "A Super Cute Coloring Book Filled with Unicorns and Alpacas!  If you are looking for the cutest, most irresistible, aww-worthy kawaii coloring book, you have found it! Kawaii Alpacas and Unicorns is an adorable coloring book for both kids and adults filled with hours of fun!  What's Inside  30 Kawaii Coloring Sheets Large 8.5 x 11 inch Pages Single Sided Printed Coloring Sheets to Prevent Bleed Through and Make Framing Easy TWO Sets of EVERY Illustration Included (Perfect for Coloring with Friends) TWO Coloring Test Pages   This is the perfect gift for anime, manga, kawaii and anything cute lovers! Perfect for all ages, this kawaii coloring book is a wonderful way to relax, unwind, relieve stress and have fun!  Scroll up and order now to get started!  TAGS: kawaii, cute, unicorns, magic, fantasy, alpaca, llama, mythical animals, fairy tale, coloring books"}, {"id": "1933794240", "genre": "Children's Books", "title": "Bring Your Racquet: Tennis Basics for Kids", "description": "Steven White brings twenty-five years of tennis teaching experience to focus on the fundamentals of the game for the young, the beginning, and the improving player. The book allows young readers to learn the basic strokes of tennis from easy-to-follow text, written with a combination of simple and more complex sentences and carefully introducing new vocabulary. The Manga characters not only provide an interesting looking book but the figures illustrate the various strokes and positions the author is describing. This book is a must for the many children who want to learn the fundamentals of the game and those who are constantly striving to improve their game."}, {"id": "077873370X", "genre": "Children's Books", "title": "Inclined Planes in My Makerspace (Simple Machines in My Makerspace)", "description": "Children will enjoy this entertaining book which uses the principles of Makerspace to introduce them to the inclined plane, or ramp. Simple text describes the structure and uses of inclined planes, and clear, step-by-step instructions show children how to make one. Readers are then provided with stategies to start their own creative projects using the ramp they made. Along the way, tips and helpful hints guide children on how to brainstorm and solve problems working as a team."}, {"id": "1562942018", "genre": "Children's Books", "title": "Arabs, The (Peoples of the Past)", "description": "Examines the origins and basic beliefs of Islam, the social and cultural traditions of Muslim societies and Muslim art, intellectual life, and political power between the eighth and thirteenth centuries."}, {"id": "1584152710", "genre": "Children's Books", "title": "John Steinbeck (Classic Storytellers)", "description": "Tells about the life of the author who wrote \"The Grapes of Wrath\" and \"Of Mice and Men,\" and includes comments about the influences on his writings, background information on other people and the times, and a time line."}]