[{"id": "B000C4SWK4", "genre": "Children's Books", "title": "The Day the Animals Came: A Story of Saint Francis Day", "description": "Ria hates New York. She misses her friends, and the warm Puerto Rican sun; most of all she misses the animals she left behind. Then, one day, Ria's neighbor Mrs. Blum takes her on a surprise trip: to a big cathedral-it's the festival of St. Francis Day, when everyone brings their pets to be blessed! At first, Ria is disappointed. She doesn't have a pet of her own for blessing. But a mishap with a mischievous duck leads to Ria being asked to join the magnificent Procession of Animals, right into the church! With Groucho the duck in her arms as she dances with elephants and turtles, snakes and dogs, Ria begins to realize that she's not so far from home after all. This story of a special New York tradition has universal appeal for animal lovers of all ages, everywhere. Illustrated by Loren Long."}, {"id": "0794523684", "genre": "Children's Books", "title": "1001 Things to Spot at Christmas", "description": "Presents thirteen picture puzzles involving humorous Christmas scenes with lists of hidden objects to find throughout each image."}, {"id": "B0778VDYHR", "genre": "Children's Books", "title": "The ABC's of the Mars Zoo", "description": "An alphabet of fantastical creatures await at the Mars Zoo! Children of all ages will enjoy this creative approach to learning their ABCs while enjoying a menagerie of animals from outer space."}, {"id": "1546886826", "genre": "Children's Books", "title": "Maddox's Trip to the Chiropractor", "description": "Maddox loves her weekly visit to see her chiropractor! She knows that it helps keep her body healthy! If she stays healthy, she doesn't have to miss out on any playtime! Join Maddox on her fun trip to the chiropractor! Cheerful and bright illustrations will make this book a family favorite! Maddox makes learning more about health and the body more fun!"}, {"id": "B0115CAEKW", "genre": "Children's Books", "title": "101 Facts:  Renewable Energy", "description": "The cars we drive, the electricity we use, and the industries around us, all run on fossil fuels. But these fuels are polluting and their use is increasing the rate at which climate change is occurring. The alternative to fossil fuels is renewable energy. Learn about renewable sources of energy, their past and present, and the ways—big and small—by which we can protect the earth. Discover how you can be a good citizen of the earth!"}]