[{"id": "0756965020", "genre": "Children's Books", "title": "Groundhog Day (Rookie Read-About Holidays (Pb))", "description": "The popular Rookie Books expand their horizons - to all corners of the globe! With this series all about geography, emergent readers will take off on adventures to cities, nations, waterways, and habitats around the world…and right in their own backyards."}, {"id": "1545563691", "genre": "Children's Books", "title": "Sonic The Hedgehog Coloring Book for Kids: Coloring All Your Favorite Sonic The Hedgehog Characters", "description": "Welcome to Sonic The Hedgehog Coloring Book for Kids: Coloring All Your Favorite Sonic The Hedgehog Characters (Unofficial Sonic Book)  This coloring book has 50 detailed Sonic The Hedgehog related drawings, all are stress relieving patterns that can lead you to a wonderful fantasy world. If you love Sonic and would like to color Sonic, this book is a must-buy!  Pages are perforated and printed on one side only for easy removal and display.  Every coloring page is designed to help relax and inspire.  You can use any coloring tool (pencils, pens, markers, crayons)you like to have your own drawing style.  You will have the joy of coloring and reduce stress!  This book can also help calm kids down and make them be patient and peaceful!    SCROLL to the top of the page and select the Add to Cart button to have one"}, {"id": "1465435506", "genre": "Children's Books", "title": "LEGO Star Wars Character Encyclopedia: Updated and Expanded", "description": "A New York Times bestseller and USA Today Best-Selling Book, this updated guide to the LEGO® Star Wars™ universe comes with an exclusive Boba Fett minifigure and 72 new pages of minifigures and facts.StarWars.com says, \"DK Publishing's fan-favorite tome on the minifigures of LEGO Star Wars is back—with some Han Solo-worthy special modifications.\"LEGO Star Wars Character Encyclopedia: Updated and Expanded profiles more than 270 minifigures from the complete Star Wars saga. Discover incredible LEGO Star Wars facts, such as which minifigure is the rarest and which can be found in the most LEGO sets.LEGO Star Wars Character Encyclopedia: Updated and Expanded brings together the full collection of LEGO Star Wars minifigures into a fun and fact-filled book.LEGO, the LEGO logo, the Brick and Knob configurations and the Minifigure are trademarks and/or copyrights of the LEGO Group. ©2015 The LEGO Group. All rights reserved. Produced by DK Publishing under license from the LEGO Group.© & TM 2015 LUCASFILM LTD. Used Under Authorization"}, {"id": "B0756L1R95", "genre": "Children's Books", "title": "Storm-Wake", "description": "Moss has grown up on the strangest and most magical of islands. Her father has a plan to control the tempestuous weather that wracks the shores. But the island seems to have a plan of its own once Callan -- a wild boy her age -- appears on its beaches. Her complex feelings for Callan shift with every tide, while her love for the island, and her father, are thrown into doubt...And when one fateful day, a young man from the outside world washes up on the beach, speaking of the Old World, nothing will ever be the same. A dark reflection of Shakespeare’s The Tempest, Storm-wake is one girl’s voyage of discovery -- a mesmerizing tale of magic, faith, and love."}, {"id": "0750218398", "genre": "Children's Books", "title": "Autumn (Seasonal Crafts)", "description": "Giving information on how festivals and events in winter are celebrated around the world, this book gives step-by-step instructions on craft ideas related to these festivals and events. It is part of a series which gives information on festivals and special events in each season of the year."}]