[{"id": "1628280956", "genre": "Science Fiction & Fantasy", "title": "The Odin Inheritance", "description": "Ariana Trevelyan, Cambridge mathematics student and deft mechanical tinkerer, thinks keeping her parents in the dark about her position as a navigator on an amateur airship is the wisest course of action. She can’t admit to them she throws darts in pubs on the weekends to raise money for her airship habit, for Heaven’s sake! When a nasty German fellow tries to abduct her from a Cambridge library and her delightfully cryptic Great Aunt Miranda discovers her airship secret… her life becomes even more complicated. As Ariana finds herself on the run from mechanically Enhanced ruffians and surrounded by people with magical powers, she discovers that there’s far more to her dead-eye aim than she initially thought. Now an evil man wants Ariana in his power to wreak havoc on the world – can she escape his clutches without losing her life?"}, {"id": "B01M4G89RV", "genre": "Science Fiction & Fantasy", "title": "MindSighted: BlackWing Pirates, Book 1", "description": "In or out of the Alliances, sorcerers and necromancers are considered a myth--until a single, shadowy figure brings those myths to life.In or out of the Alliances, nobody is prepared for that...The BlackWing Pirates, a fleet of space cruisers that form a secret branch of the Alliance Security Detail, discover what a myth-come-to-life is capable of doing when this sinister aberration begins a slow and deliberate attack against the upcoming Joint Alliances Conclave.In the ensuing chaos, where deaths are unexplained and the impossible becomes possible, the BlackWing Pirates' most effective weapon turns out to be a blind clairvoyant, who sees better than anyone when his eyes are closed...MindSighted--BlackWing Pirates, Book 1"}, {"id": "1640780092", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Path: Ruins of Azlant 6 of 6", "description": "The insidious veiled masters who sunk Old Azlant beneath the treacherous ocean in ancient times mobilize their forces against the heroes’ allies, even as the adventurers themselves close on their enemies for a final confrontation. After preparing their allies for the impending assault, the heroes must fight their way through the submerged ruins of an ancient weapons facility packed with dangerous guardians and unstable magic to stop their monstrous foes before the veiled masters unleash a devastating eldritch attack to exterminate humanity and plunge the world into darkness just as they did when they brought Azlant to ruin so long ago.  “Beyond the Veiled Past” is a Pathfinder Roleplaying Game adventure for 15th-level characters. The adventure concludes the Ruins of Azlant Adventure Path, a search for lost lore and ancient treasures in the ruins of a shattered empire. A selection of new monsters, suggestions on how to expand your Ruins of Azlant campaign, a look into the sinister plots of the veiled masters, and guidance on how to play a campaign in historical Azlant round out this volume of the Pathfinder Adventure Path.  Each monthly full-color softcover Pathfinder Adventure Path volume contains an in-depth adventure scenario, stats for several new monsters, and support articles meant to give Game Masters additional material to expand their campaign. Pathfinder Adventure Path volumes use the Open Game License and work with both the Pathfinder RPG and the world’s oldest fantasy RPG. "}, {"id": "0786928808", "genre": "Science Fiction & Fantasy", "title": "Complete Warrior (Dungeons & Dragons d20 3.5 Fantasy Roleplaying)", "description": "Forge your name in battle!The Complete Warrior provides you with an in-depth look at combat and provides detailed information on how to prepare a character for confrontation.This title was not only compiled from various D&D sources, but contains new things as well, including new battle-oriented character classes, prestige classes, combat maneuvers, feats, spells, magic items, and equipment. The prestige classes included have been revised and updated based on player feedback, and there are rules for unusual combat situations. The Complete Warrior will assist all class types, including those classes not typically associated with melee combat. There are also tips on running a martially focused campaign and advice on how to make your own prestige classes and feats.To use this accessory, a Dungeon Master also needs the Player’s Handbook, Dungeon Master's Guide, and Monster Manual. A player needs only the Player's Handbook."}, {"id": "0812977866", "genre": "Science Fiction & Fantasy", "title": "Super Sad True Love Story: A Novel", "description": "A NEW YORK TIMES NOTABLE BOOK   SELECTED ONE OF 10 BEST BOOKS OF THE YEAR BY MICHIKO KAKUTANI, THE NEW YORK TIMES   NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The Washington Post • The Boston Globe • San Francisco Chronicle • The Seattle Times • O: The Oprah Magazine • Maureen Corrigan, NPR • Salon • Slate • Minneapolis Star Tribune • St. Louis Post-Dispatch • The Kansas City Star • Charlotte Observer • The Globe and Mail • Vancouver Sun • Montreal Gazette • Kirkus ReviewsIn the near future, America is crushed by a financial crisis and our patient Chinese creditors may just be ready to foreclose on the whole mess. Then Lenny Abramov, son of an Russian immigrant janitor and ardent fan of “printed, bound media artifacts” (aka books), meets Eunice Park, an impossibly cute Korean American woman with a major in Images and a minor in Assertiveness. Could falling in love redeem a planet falling apart?"}]