[{"id": "1635175062", "genre": "Children's Books", "title": "Stegosaurus", "description": "Explores what scientists have uncovered about Stegosaurus. Colorful photos and illustrations help bring each dinosaur to life as easy-to-read text guides readers through important discoveries about its appearance, diet, and habitat."}, {"id": "0340956917", "genre": "Children's Books", "title": "I Want My Mummy", "description": "This is the story about the day, a baby blue egg came out to play.First came one leg, then the other, then it yelled, \"I want my mother!\"Join Baby Blue Egg on his search for his mother. The other dinosaurs are happy to help as long as the Egg stops making such a noise. They don't want to wake the scary Tyrannosaurus Rex! This story has a great read-aloud rhythmic text and is perfect for introducing small children to new colors in a fun and engaging way!"}, {"id": "1530055776", "genre": "Children's Books", "title": "The Great Leprechaun Chase: A St. Patrick's Day Picture Book for Children about a Leprechaun chase", "description": "\"Daniel knew that today would be his opportunity to try and catch a leprechaun.\" \"Daniel chased the leprechaun over hills.\" \"The leprechaun simply laughed.\" Daniel has heard that if he can successfully catch a leprechaun he will be granted three wishes. One day Daniel spots a leprechaun and sets off to catch him. Will Daniel be able to catch this fast and playful creature? Find out in this non-wordy and festive tale that is perfect for holiday read alouds and storytimes. This book combines graphic illustration and photography for a fun and unique visual effect. Visit the Author Page at: www.Deesignery.com"}, {"id": "078627753X", "genre": "Children's Books", "title": "Princess in Training", "description": "Volume VI in The Princess Diaries seriesA New York Times Bestseller Princess for President - student body president, that is. It's all the fault of Princess Mia's power-mad best friend and campaign manager, Lilly, who nominates her in the first place. This is not how Mia imagined kicking off her sophomore year, even if Grandmère thinks ruling her high school makes good practice for ruling Genovia someday."}, {"id": "1422200078", "genre": "Children's Books", "title": "Crisis at Home And Abroad: The Great Depression, World War II, And Beyond, 1929-1959 (How Canada Became Canada)", "description": "Discusses Canada in the first half of the twentieth century, including the On-to-Ottawa Trek during the Great Depression, how Canada was affected by World War II, and Canada's role in the founding of the United Nations and NATO."}]