[{"id": "1908164115", "genre": "Children's Books", "title": "Eggs (5 Crafty Ideas)", "description": "Five creative projects inspired by a simple egg shapeClearly illustrated step-by-step instructions guide children through making delicious chocolate eggs, creating spring greeting cards, making a hen and egg mobile, and more egg-themed crafts."}, {"id": "1623701848", "genre": "Children's Books", "title": "Book-O-Hats: A Wearable Book (Wearable Books)", "description": "A fun, interactive board book of six wearable HAT masks! With bright illustrations and catchy rhymes, kids of all ages will enjoy this laugh-out-loud read-along. Includes die-cut mask holes."}, {"id": "B072P5SL8R", "genre": "Children's Books", "title": "Animals Can Sing: A Forest Animals Adventure and Children's Picture Book", "description": "Animals Can Sing is a fun story where the reader goes on a short adventure in the woods. You'll visit with the bees, a wolf pup and other animals as you go deeper into a mystical forest. Told in rhyme, this delightful and fun children's picture book comes to life with a musical score printed on the last page that you can sing to, while enjoying the beautiful landscape illustrations of natural scenery that enhance your literary journey and captivate the imaginations of young readers."}, {"id": "1547137193", "genre": "Children's Books", "title": "Happy 33rd Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 33 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0316181013", "genre": "Children's Books", "title": "The Thankful Book", "description": "I am thankful for music because it makes me want to dance.I am thankful for my feet because they help me run and play.I am thankful for kisses because they make me feel loved.Todd  Parr's bestselling books have taught kids about unconditional love, respecting the  earth, facing fears, and more, all with his signature blend of playfulness and  sensitivity. Now, The Thankful Book celebrates all the little things children  can give thanks for.  From everyday activities like reading and bathtime  to big family meals together and special alone time between parent and  child,  Todd inspires readers to remember all of life's special  moments.  The perfect book to treasure and share, around the holidays  and throughout the year."}]