[{"id": "076365650X", "genre": "Children's Books", "title": "MoshiMoshiKawaii: Where Is Strawberry Mermaid Moshi?", "description": "For children who love to search and find-- and adore that cute Japanese kawaii style -- here comes another pair of fun activity books about Moshi Town.Strawberry Mermaid Moshi has been invited to a magical wedding under the sea. Children are invited to join her on an underwater adventure with her friends, but are their eyes sharp enough to help her find her friends first?"}, {"id": "1547137320", "genre": "Children's Books", "title": "Happy 46th Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 46 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B00YAKLAVY", "genre": "Children's Books", "title": "The Adventures Of Fart Man – The Beginning", "description": " Minecraft : The Adventures Of Fart Man – The Beginning★ Read this book for FREE on Kindle unlimited - Download Now! ★ Discover The Origins Of The Greatest Superhero Ever – Fart Man!Minecraft Steve has a problem. He farts. He farts like no one has ever farted. He farts so badly that it’s hard for him to make friends or even hold a job. However when the village he lives in is threatened by the nefarious Enderman Steve starts to see his farting curse as a potential gift. Read this story and witness as he transforms himself from mild mannered Steve into the mighty Fart Man! ACT NOW!  Click the orange BUY button at the top of this page!"}, {"id": "B00ECZPECI", "genre": "Children's Books", "title": "Let's Learn About Fire Trucks", "description": "Children will learn through words and pictures about fire trucks.  Full color high-resolution images show trucks, ladders, tools, as well as different colors and sizes.  Targeted for children ages 2-8."}, {"id": "0545120942", "genre": "Children's Books", "title": "Dash (Breyer Stablemates)", "description": "This new book in the bestselling Stablemates series has an American Quarter Horse!When Jenny discovers barrel racing, she cannot wait to give it a try. Luckily, Jenny's dad has the perfect horse, Dash. Dash is very fast, but Jenny must learn to control him around all the tight turns in the barrel racing course. Even with help from her new friend, Hope, and her trainer, Sam, will Jenny and Dash be ready in time for the upcoming rodeo?With fun facts about American Quarter Horses, this easy-to-read chapter book is perfect for any girl who loves horses!"}]