[{"id": "1608641023", "genre": "Science Fiction & Fantasy", "title": "Skin Deep Magic: Short Fiction", "description": "Magic is more than skin-deep. It hides in the folds of a haunted quilt and illuminates the secret histories of Negro memorabilia. Magic reveals the destiny of a great storyteller and emanates from a sculpture by an obscure Harlem Renaissance artist. Magic lurks in the basement of an inner-city apartment building and flourishes in a city park. Magic is more than skin-deep; it shimmers in the ten stories in this collection."}, {"id": "B00AROMV42", "genre": "Science Fiction & Fantasy", "title": "Adrian's Eagles Large Print EBook (Life After War Large Print EBooks 2)", "description": "This Fantasy tale is set at 20 pt font for those who want a large print ebook. Most are published in 12 or 14, meaning this fantasy novel will start out 4-5 times larger than average. Then, it can be increased even further by using your magnifications settings.Six of SevenThree months after the war that turned America into a post-apocalyptic wasteland, Safe Haven has made it from California to South Dakota. Adrian now has six of the seven gifted descendants sent to ensure the survival of their country. Will it be enough?The enemy only wants one thing—America.Will Adrian be able to keep his people out of Cesar’s evil control long enough to finish the training he’s begun? The enemy numbers are over 300 and growing. There are currently 64 Eagles. Maybe, if Marc can come up with the right plan and his witch can tell him when to use it. He’ll also need Samantha to warn him when Nature is attacking. John will look out for their health, but Kenn will be banished if he can’t let go of Angie, who has found something she really wants to do. The Survival of America is Adrian's dream. Everyone works for a common goal and everyone lives. However, not everyone can handle Adrian’s version of safety, including some of his closest people.Adrian’s Eagles. Book 2 of the Life After War series. Won’t you join us?This adventure includes:Deleted ScenesSneak PeeksCharacter ProfilesAn Eagle Team ListA Note from the AuthorThe next book in this series is Nuclear Ashes, Life After War book 3."}, {"id": "B00HL8BGXY", "genre": "Science Fiction & Fantasy", "title": "Worlds Unbound: Book 5 (Future Jumper Series #5)", "description": "It started with physics, and ended the earth.Aiden and Jess thought they were only doing experiments with light. They had no idea what would happen when they broke its laws while bouncing a laser off the moon. Using jumps through time Aiden tried to fix what he broke and save humanity, only to draw others into his ruined future. Each jump pulled another victim caught in Aiden's bubbles of time.Jane, her life of torment driving her to suicide.Casey, an adventure seeker, living life for the thrills.Francis, always on the run, the fires she starts, her closest friends.And Aiden's girlfriend Jess, the reason for him to continue trying even after humanity turns against him.Is this Aiden's final cycle, can another jump fix the wrongs, or will the worlds become forever unbound."}, {"id": "B00VZIET3U", "genre": "Science Fiction & Fantasy", "title": "Rain Wilds Chronicles (4 Book Series)", "description": "From Book 1: &#8220;Robin Hobb is one of our very best fantasy writers.&#8221;New York Times bestselling author Kevin J. AndersonWith Dragon Keeper, Robin Hobb, critically acclaimed, New York Times bestselling &#8220;master fantasist&#8221; (Baltimore Sun), begins a breathtaking&#160; new series about the resurgence of dragons in a world that both needs and fears them&#8212;the world Hobb&#8217;s readers most recently visited in her immensely popular &#8220;Tawny Man&#8221; trilogy. Volume One of the Rain Wilds Chronicles, Dragon Keeper is yet another magnificent adventure from the author of&#160; The Soldier Son and Farseer Trilogies, confirming the Contra Costa Times of California&#8217;s assessment of Hobb as &#8220;one of the most important writers in 21st century fantasy.&#8221;"}, {"id": "1625671350", "genre": "Science Fiction & Fantasy", "title": "The Assassins of Altis (Pillars of Reality) (Volume 3)", "description": "Trapped within the dead city of Marandur, Master Mechanic Mari and Mage Alain must escape both merciless barbarians and the pitiless Imperial Legion. Beyond those dangers lie the mightiest and most unforgiving powers in the world of Dematr: the Great Guilds that rule the world with iron fists. Mari's Mechanics Guild and Alain's Mage Guild have always been enemies, but they are united in wanting to kill their rogue members before Mari can fulfill the ancient prophecy of being the one who will finally overthrow their power. Mari and Alain must risk those dangers because halfway across their world lies a place where truth has long been hidden. A place that could explain why their world's history begins abruptly, with no hints of what came before. A place where they might learn how the Mechanics Guild came to control all technology and how the Mages manage to alter reality temporarily. A place that might tell them how to achieve a task that appears to be impossible. Never before have a Mage and a Mechanic worked together, and their combined talents offer their only hope. But she and Alain must first survive the deadly and implacable Assassins of Altis."}]