[{"id": "1681873680", "genre": "Children's Books", "title": "Good Time Dogs: Treats to Treasures", "description": "Today is the day that Leo and Flossi say no to another lazy stay-at-home-being-bored-kinda day. The Good Time Dogs score big in more ways than one as they go from treats to treasures."}, {"id": "168048818X", "genre": "Children's Books", "title": "Laura Ingalls Wilder: Children’s Author (Britannica Beginner Bios)", "description": "Laura Ingalls Wilder's stories about growing up on the frontier have inspired and enthralled young readers for generations. \"Little House on the Prairie,\" and her other books chronicled her experiences surviving on the nineteenth-century American frontier. This accessible biography of Laura Ingalls Wilder follows the real events of her life from her early childhood spent in a log cabin to her later years as an acclaimed author. Readers will be captivated by Wilder's determination and staunch spirit in overcoming obstacles in that bygone era. Vocabulary and fact boxes provide readers with additional opportunities to engage their minds and satisfy their curiosity."}, {"id": "B015OWZRYC", "genre": "Children's Books", "title": "Fun Learning Facts About Lizards: Illustrated Fun Learning For Kids (Ninja Kids Book 1)", "description": "Welcome to the Ninja Kids Book Series!Bestselling children's author Tony Michaels presents \"Fun Learning Facts About Lizards\". This book uses captivating images and expertly written words to teach children about \"Lizards\".Perfect reading for any occasion and especially ideal for bed times, long journeys or for bonding with your child. Fun Filled Learning for Your Child (and you!)Every one of our books is lovingly researched, illustrated and put together to outstand, awe and inspire the reader. Our beautiful images help explain and enlighten each well-written fact.We loved compiling this book and even learned a few things along the way and hopefully you will too.Get this book at this SPECIAL PRICE exclusive to the Amazon Store.*** Your child will love it - this is guaranteed.***PLEASE Leave an honest review after reading this booK! It REALLY helps us to understand what you would like to see and read about! Thank you."}, {"id": "1941367089", "genre": "Children's Books", "title": "EVEN SUPER HEROES SLEEP (DC Super Heroes)", "description": "After busy days flying around the world, chasing villains, and keeping people safe, DC's beloved super heroes need to go to sleep. Super heroes in training will definitely relate to this charming bedtime book.Like the other bestselling DC Super Heroes board books (ABC 123, Colors and Shapes, Opposites, Busy Bodies, My First Book of Super Villains, and My First Book of Girl Power), Even Super Heroes Sleep uses DC's classic art to illustrate fan favorite characters getting ready to re-charge. Batman knows his brain works best after he's gotten a good night's sleep (Goodnight Gotham City!). Green Lantern needs his Power Battery, and Superman's super-strength fizzes out at the end of the day. Budding super heroes will appreciate that they, too need a good night's sleep if they're going to grow big and strong..."}, {"id": "1547138513", "genre": "Children's Books", "title": "Happy 95th Birthday: Birthday Gifts For Men, Birthday Journal Notebook For 95 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]