[{"id": "0062427768", "genre": "Children's Books", "title": "Marty Pants #1: Do Not Open!", "description": "“Funny and engaging. Marty Pants is a surefire hit!”—Lincoln Peirce, author of the Big Nate seriesMove over, Wimpy Kid. Here comes the imaginative, the inquisitive, the unstoppable Marty Pants!Marty Pants is different from your typical middle schooler. He has the soul of an artist, and as an artist, he notices things–except when he doesn’t.When Marty discovers a note suggesting an alien is watching him, this is something he can’t ignore. But no one, not his friends, his family, his arch-enemy, nor the chief of police, can see what he sees. So, it’s up to Marty to save the world—his way!This hilarious new series follows the endearing, frazzled, embarrassed, and ultimately fearless footsteps of literature’s most unlikely hero: Marty Pants. "}, {"id": "159197593X", "genre": "Children's Books", "title": "John Cabot (Explorers Set 1)", "description": "A biography of the Italian explorer who made several voyages of discovery for England including the discovery of the North American mainland in 1497."}, {"id": "015201702X", "genre": "Children's Books", "title": "Moon Rope/Un lazo a la luna", "description": "Fox wants to go to the moon. Mole does not--at least not until he hears about the huge worms waiting up there for him to eat. So the two of them set off on their adventure, with a little help from a rope of grass and their friends the birds. The bilingual text and bold art showcase Lois Ehlert at her captivating best."}, {"id": "1633626903", "genre": "Children's Books", "title": "Discover Jellyfish (21st Century Basic Skills Library, Level 3)", "description": "This Level 3 guided reader introduces basic facts about jellyfish, including their physical characteristics, diet, and habitat. Simple callouts ask the student to think in new ways, supporting inquiry-based reading. Additional text features and search tools, including a glossary and an index, help students locate information and learn new words."}, {"id": "0803729995", "genre": "Children's Books", "title": "Why Do Birds Sing? (Easy-to-Read, Dial)", "description": "A fun and fact-filled book provides interesting and useful information about the history, characteristics, and behavior of many types of birds, and includes dozens of full-color photographs and drawings. Simultaneous."}]