[{"id": "1406317438", "genre": "Children's Books", "title": "Classic Poetry: An Illustrated Collection (Walker Illustrated Classics)", "description": "Walker Illustrated Classics is a new series which brings together some of the best-loved stories ever told, illustrated by some of today's finest artists. These exquisitely designed books, with their magnificent words and glorious pictures, are a pleasure to read - and re-read. The classics have never looked so good!Over eighty of the most memorable poems written in the English language, from William Blake's \"The Tyger\" to Lewis Carroll's \"Jabberwocky\". Selected by Children's Laureate Michael Rosen, accompanied by his lively biographical sketches and notes, with Paul Howard's astonishingly varied illustrations, this is indeed a classic collection."}, {"id": "B00HUSO254", "genre": "Children's Books", "title": "Football ABC (SI Kids Rookie Books)", "description": "When it comes to football, A is for Action, of course! Each letter in this football-themed alphabet book presents a fun look at a different football term. With a subject like football, Football ABC is a sure to be a winner."}, {"id": "1860070035", "genre": "Children's Books", "title": "Tudor & Stuart Life", "description": "A short history of life in the 16th and 17th centuries under the Tudor and Stuart monarchs. This book covers events that changed the course of history, including Henry VIII's divorce and establishment of the Church of England, the colonisation of America and the Civil War between Roundheads and Cavaliers."}, {"id": "B009NPJCJS", "genre": "Children's Books", "title": "When Mr. Jefferson Came to Philadelphia: What I Learned of Freedom, 1776", "description": "What did I know of freedom, of all the wild talk of independence that summer of 1776?  Ned is just a boy helping his mother run their boardinghouse the summer that a tall, thin man named Mr. Jefferson comes to stay. He and other important colonists are there for the Congress in Philadelphia, to debate their charges against King George in England, which have erupted into a violent war.   As Mr. Jefferson spends night   after night writing in his room, Ned forgets the simple things he wants, like a new cap, and thinks instead about the extraordinary idea everyone is starting to talk about -- freedom -- and the incredible changes it might soon bring to their lives.   With hauntingly beautiful words and historically accurate paintings, when mr. jefferson came to philadelphia combines the fictional character of Ned with authentic details about Thomas Jefferson's lodging during the writing of the Declaration of Independence to create a powerfully moving portrait of the spirit that fueled our nation's birth. "}, {"id": "1434222969", "genre": "Children's Books", "title": "Drive Along (Truck Buddies)", "description": "Tow Truck copies everything Green Truck (a garbage truck) does. However, there is one thing that Green Truck can do that Tow Truck cannot do."}]