[{"id": "B004G08WHI", "genre": "Science Fiction & Fantasy", "title": "A Ballad of Rogelle Climberson", "description": "A peek into the history of These United States of America finds a yorn focus on Rogelle Climberson, Jr., the self-important heir to the empiric Climberson Climbing Company.The year is 1789, and Rogelle has become enchanted with the beautiful Harmony Milloy, a f--king hot peasant girl who works bagging leaves in the neighboring estate's corn fields.In order to gain an audience with her, Rogelle feigns to have acquired the deadliest of diseases, the most fatal Penchant Fleu.P'tay!As Rogelle's web of lies grows and Harmony reveals her own mysteries, Master Climberson gets confused, and learns lessons, and the well gets poisoned, and he falls in love, and etc.A Ballad of Rogelle Climberson is a 13,000 word colonial romance novella. lol"}, {"id": "1461062594", "genre": "Science Fiction & Fantasy", "title": "Harvester: Ascension", "description": "The Harvester appears in the night sky as a new star in Orion; a remnant of an alien race whose world it had just destroyed. As it approaches Earth, its purpose becomes clear: to assimilate Earth and become its one true god. The future for the American way of life appears grim as the machine that would fancy itself a god destroys New York City and subsequently lands an alien force there. America is prostrate and unable to defend her people as cable news pundits and special interest groups seek to undermine all that can be done to stop the invasion. Populated with a diverse cast of characters, this novel teaches us how to put aside our differences and come together against a common enemy for the sake of the common good. Full of scientific discovery, political intrigue, and a cast of wonderful characters Harvester: Ascension is a story of courage, faith, love, and redemption."}, {"id": "0981987443", "genre": "Science Fiction & Fantasy", "title": "Realms of Cthulhu (REB20001, Savage Worlds)", "description": "Whether you seek action and adventure battling cultists in sun-drenched jungle temples, a shadowy milieu of dark words and impossible deeds, or a twisted mixture dredged up from the darkest recesses of imagination and nightmare, you will find the rules you need and the inspiration you desire within these pages.     Four distinct styles impact how physical damage and mental anguish are handled. This allows you to effortlessly shape and direct the focus of your campaign, from the pulpiness of Heroic Horror to the grim desolation of the Dark Spiral. Insight and advice are offered to the Keeper concerning magic, modifying monsters, and creating adventures, as well as a detailed roster of supporting cast members, and a comprehensive bestiary. For Savage Worlds."}, {"id": "1515900711", "genre": "Science Fiction & Fantasy", "title": "1-2: The Reality Dysfunction (Night's Dawn Trilogy)", "description": "In AD 2600 the human race is finally beginning to realize its full potential. Hundreds of colonized planets scattered across the galaxy host a multitude of prosperous and wildly diverse cultures. Genetic engineering has pushed evolution far beyond nature's boundaries, defeating disease and producing extraordinary spaceborn creatures. Huge fleets of sentient trader starships thrive on the wealth created by the industrialization of entire star systems, and throughout inhabited space the Confederation Navy keeps the peace. A true golden age is within our grasp. But now something has gone catastrophically wrong. On a primitive colony planet a renegade criminal's chance encounter with an utterly alien entity unleashes the most primal of all our fears. An extinct race which inhabited the galaxy aeons ago called it the \"Reality Dysfunction.\" It is the nightmare which has prowled beside us since the beginning of history."}, {"id": "B01MS3RCE0", "genre": "Science Fiction & Fantasy", "title": "The Sun God's Heir: Return Book One", "description": "For three thousand years a hatred burns. In seventeenth century France two souls incarnate, one born the child of a prosperous merchant, the other, determined to continue a brutal incarnation begun long ago. In ancient Egypt, there were two brothers, disciples of the pharaoh, Akhenaten. When the pharaoh died, the physician took the knowledge given and went to Greece to begin the mystery school. The general made a deal with the priests and became pharaoh. One remembers, one does not.The year is 1671. René Gilbert’s destiny glints from the blade of a slashing rapier. The only way he can protect those he loves is to regain the power and knowledge of an ancient lifetime. From Bordeaux to Spain to Morocco, René is tested and with each turn of fate he gathers enemies and allies, slowly reclaiming the knowledge and power earned centuries ago. For three thousand years a secret sect has waited in Morocco.  After ages in darkness, Horemheb screams, “I am.” Using every dark art, he manages to maintain the life of the body he has bartered for. Only one life force in the world is powerful enough to allow him to remain within embodiment, perhaps forever. Determined to continue a reign of terror that once made the Nile run red, he grows stronger with each life taken. "}]