[{"id": "1486708048", "genre": "Children's Books", "title": "See How They Work & Look Inside Big Rigs (World of Wonder)", "description": "Come along with us and take a Look Inside Machines to learn what makes your favorite machines tick! From diggers, to farm equipment, to big rigs, to fire trucks, this series has awesome trucks waiting around every turn. From the oversized and unusual, to equipment you see everyday, this engaging and entertaining series will teach you a load about your favorite machines that you never knew before. Now dive into Big Rigs to see all the incredible things machines can do, from lifting heavy materials on construction sites to transporting heavy loads on long journeys, and learn just how cool big rigs are!"}, {"id": "1681521474", "genre": "Children's Books", "title": "From Grapes to Jelly (Who Made My Lunch?)", "description": "Ice cream might be your favorite dessert, but do you know how it's made? This new series explains just that. Come along on the journey as common household foods travel from farm to factory to table. Learn how grapes are made into jelly and peanuts are made into peanut butter. With clear process explanations and charming illustrations, this series answers the questions of curious and hungry kids. A child wonders where jelly comes from and learns about the jobs of a grape farmer and workers in a jelly factory. This illustrated narrative nonfiction book includes a map of where Concord grapes are grown, glossary, and further resources."}, {"id": "B01N0I5KR9", "genre": "Children's Books", "title": "The Dog That Taught Me Tennis", "description": "This book covers the Most Important Aspects of Tennis – Focus, Intensity, Attitude, Strategy, Patience, Competition, Form, and Fun.By observing the techniques and abilities of an extraordinary Blue Heeler named Gracie, certain aspects of the game of tennis, normally considered complex, are made easy and doable.  Anyone who plays tennis will appreciate seeing a tennis ball through the eyes of champion – one who knows how to focus, concentrate, create intensity, overcome impatience, stay positive, and remain joyful regardless of the score. The champion, of course, is Gracie, who never once gives herself a second thought. A valuable concentration exercise is offered at the end of the book. It is worth the attention of anyone who wants to concentrate on anything!   "}, {"id": "1421530554", "genre": "Children's Books", "title": "Pokémon Adventures, Vol. 2 (2nd Edition)", "description": "Adventures inspired by the best-selling Pokémon video games!All your favorite Pokémon game characters jump out of the screen into the pages of this action-packed manga! Red's Pokémon training journey is full of exciting challenges... Join Red as he competes with his rival Blue, travels through the dangerous Safari Zone, battles gym leaders for badges, and discovers the secret of a mysterious Eevee! And watch out for Team Rocket, Red... They're hunting you!"}, {"id": "1785356747", "genre": "Children's Books", "title": "The Princess Gardener", "description": "The Princess Gardener is the story of a young girl who is a princess by accident of birth. Her passion lies outside the castle, tending the gardens. But castle duties call more and more often, and her parents insist she learn what she calls \"the princess business.\" Reluctantly, she curtseys and bows and smiles her way through the empty rituals of the kingdom, but every day she longs for the smell of the earth. A chance encounter causes the princess to switch lives with a young farm girl, who is her exact likeness. When people begin to fall ill, the girls learn that the source of the sickness is covered-up pollution in the water supply. Will they discover their true capabilities and save the kingdom, or are the girls' lives about to become very complicated?"}]