[{"id": "1408889846", "genre": "Children's Books", "title": "Little Baby Books: Bathtime (Bloomsbury Little Black and White Baby Books)", "description": "Enjoy reading first words to your baby, with beautiful illustrations of the daily bathtime routine. Black and white  board books are perfect for helping your baby to identify first objects  and their very first words. The eye catching foil design will ensure  these books will continue to be well loved throughout their first few  formative years.  Words included: Duck Soap Bubbles Towel Pyjamas  Your baby will love the shiny coloured foil on every page, as they learn the words for this daily routine."}, {"id": "0590203207", "genre": "Children's Books", "title": "Frida (English Language Edition)", "description": "When her mother was worn out from caring for her five sisters, her father gave her lessons in brushwork and color. When polio kept her bedridden for nine months, drawing saved her from boredom. When a bus accident left her in unimaginable agony, her paintings expressed her pain and depression - and eventually, her joys and her loves. Over and over again, Frida Kahlo turned the challenges of her life into art. Now Jonah Winter and Ana Juan have drawn on both the art and the life to create a playful, insightful tribute to one of the twentieth century's most influential artists. Viva Frida!"}, {"id": "B06X9KY92J", "genre": "Children's Books", "title": "Minecraft Chronicles: The Legend of Herobrine", "description": "Chase and Hailey are typical kids who go to school, play, and love video games.  This regular routine is interrupted as Chase truly becomes engrossed in his Minecraft game and is teleported into the game after chasing the mysterious Herobrine.  Chase begins a quest to try and find his way out of the game, but he finds himself facing the Ender Dragon instead.  Hailey's search for her brother takes a turn when she sees his iPad is illuminated with Minecraft running.  Hailey grabs her iPad, logs into Chase's realm and begins her search for her brother."}, {"id": "0439774136", "genre": "Children's Books", "title": "Easy Reader Biographies: Susan B. Anthony: Fighter for Women's Rights", "description": "Engaging 16-page books on must-know, inspiring Americans. Features lively text, captions, realistic illustrations, glossaries, diagrams, and more. Correlate with Guided Reading Levels I and J. For use with Grades K–2."}, {"id": "B075DDL6Q5", "genre": "Children's Books", "title": "Ana and the Cosmic Race #1", "description": "Mysterious media mogul megaquadrillionaire Dr. Laslo issues a challenge to the best and brightest students in the Scholastic Federation to a cosmic scavenger hunt. The grand prize – his vast empire. But the clues are hidden across time and space, and only the best and brightest will be able to find them.Thirteen year old super studious Ana, on a scholarship at Dalton Phillips Prep, is determined to win, for herself and her struggling family back at home. She teams up with the school’s 2nd best student, the eccentric alien shapeshifter, Zyxyx. But the stakes heat up when the competitors from their rival schools enter the race—handsome Keio and the enigmatic Ekene. Their behavior is confusing—are they competing against her or trying to help? And why? Suddenly the competition becomes a lot more complicated…"}]