[{"id": "B01HRHZXEQ", "genre": "Science Fiction & Fantasy", "title": "By Bizarre Hands (Dover Horror Classics)", "description": "\"Lansdale is an immense talent.\" — Booklist. Small-town juvenile delinquents, Pentecostal snake-handlers, zombies, psychopaths, and assorted freaks populate these witty and gritty tales of horror by a master of the genre. The suspenseful, action-packed tales range from visions of a post-apocalyptic world (\"Tight Little Stitches in a Dead Man's Back,\" \"On the Far Side of the Cadillac Desert with Dead Folks\") to alternative histories (\"Trains Not Taken,\" \"Letter from the South, Two Moons West of Nacogdoches\"). A dozen other stories of gruesome violence and utter depravity include \"The Pit,\" in which car trouble develops into a life-or-death struggle; \"Night They Missed the Horror Show,\" involving an encounter with ornery rednecks; and \"Hell Through a Windshield,\" in which a drive-in movie provides a one-way ticket to another dimension.By Bizarre Hands, Joe R. Lansdale's debut collection of short stories, was nominated for a Bram Stoker Award for Best Fiction, and two of its tales have received Stoker awards. Lansdale's novella Bubba Ho-Tep was adapted into a 2002 film, and his Hap and Leonard detective stories inspired the Sundance Channel television series. This edition features an Introduction by science-fiction novelist Lewis Shiner and an Afterword by horror fiction author Ramsey Campbell. Suggested for mature readers."}, {"id": "1508974322", "genre": "Science Fiction & Fantasy", "title": "Animal", "description": "Ava has spent her life running from the monsters that lurk in the shadows, always the prey. She finally thinks she can settle down, have a normal life, and work on not being so scared of the world around her. That is until she runs into her worst fear. He has finally found the potential family he has always wanted. All he has to do is make his little bird sing. Will Ava escape with her humanity intact?"}, {"id": "B0723GH463", "genre": "Science Fiction & Fantasy", "title": "Hostel Fantasies (13 Book Series)", "description": "From Book 1: The sweet spell was cast on beautiful Sonia, when she locked fingers with Talia, the voluptuous Hostel Manager. It begins to grow wild as Sonia discovers hidden desires in the remote corners of her heart. Sonia gets struck by surreal dreams from time to time. Divine emotional tremors send her shrieking in ecstasy as she indulges in one fetish after another.  The lines between dreams and reality shrink when Sonia realizes that she has lost her entire heart and being to a beautiful woman.  Talia was the sweet thief.  Join Sonia on her unbelievable odyssey as she explores 'beyond superficial' relationships in the company of four lovely girls--Pam, Lisa, Kim, and Mary--sharing her apartment.  Keep your fingers under control as you start reading all her juicy secrets!"}, {"id": "148097286X", "genre": "Science Fiction & Fantasy", "title": "2: Superheroes of Germanic and Latino Cinema / Superheroes of the World Order", "description": "Superheroes of Germanic and Latino Cinema 2 and Superheroes of the World Order is a compartmental portion of the total Superheroes from a previously published book. It includes ideas from other nations or groups of nations to come up with their own film Superheroes. This is a nice collection from about 102 new Superheroes. The author hopes you enjoy these new schemes, ideas, and stories. About the Author   As Juan A. Mejias Jr. told the readers in the first book, he is an American born in Puerto Rico, living in the territorial United States of America for thirty-five years. He has been reading a lot about science. Mejias hopes you enjoy this book. "}, {"id": "1841491497", "genre": "Science Fiction & Fantasy", "title": "Queen of Camelot", "description": "On the night of Guinevere's birth, a wise woman declares a prophecy of doom for the child: she will be gwenhwyfar, the white shadow, destined to betray her king, and be herself betrayed. Years pass, and Guinevere becomes a great beauty, riding free across Northern Wales on her beloved horse. She is entranced by the tales of the valorous Arthur, a courageous warrior who seems to Guinevere no mere man, but a legend. Then she finds herself betrothed to him and, like the knights that follow him, swiftly falls under Arthur's spell ...At the side of King Arthur, Guinevere reigns strong and true. Yet she soon learns how the dark prophecy will reveal itself - she is unable to conceive. Arthur's only true heir is Mordred, offspring of a cursed encounter with the witch Morgause. Now Guinevere makes a fateful choice: to raise the child as her own, to teach him to be a ruler and to honour Camelot. Mordred will be her greatest joy - and the key to her ultimate downfall.  Find out more about this title and others at www.orbitbooks.co.uk"}]