[{"id": "1940516080", "genre": "Children's Books", "title": "Every Picture Tells a Story, Volume One: Bereishis (Hebrew Edition) (Hebrew and English Edition)", "description": "A picture is worth a thousand words. Accompanied by words, it's worth millions, and when it comes to illustrate and to bring to life the words of the Torah, it is priceless. Vividly hand-illustrated with colorful portrayals of Torah personalities and events, the Every Picture Tells a Story series brings the weekly Parsha to life with illustrations, Torah verses, and descriptive commentary based on Midrash and other sources. The books are written in Hebrew and English. Volume One: Bereishis (Genesis) contains illustrations of the weekly Torah readings from beginning of Creation through to the end of Ya'akov's days. Appealing to readers of all ages, it is a delightful storybook for young readers, a wonderful book to read to children, educational for Baalei Teshuvah, and a wonderful addition to any book collection. Companion coloring books also available."}, {"id": "0439283566", "genre": "Children's Books", "title": "1: I, Freddy", "description": "Move over Stuart Little, there's a new mouse in town. Except this mouse is a hamster. And not just any hamster. He is a Mesocricetus auratus, a golden hamster of the highest order.Freddy is dissatisfied w/ his monotonous treadmill life at the pet store. He endures countless indignities in order to get himself adopted so he can lead a more civilized life. After a series of funny misadventures (including encounters w/ a fierce tomcat & 2 guinea pigs who speak in Shakespearean couplets) he teaches himself to read & write & pens a witty & heartwarming autobiography a/b his journey towards self-improvement. Written in jaunty, fast-paced prose w/ deadpan humor & hilarious plot turns, this brilliant novel & the irresistible Freddy will win your heart on the first page."}, {"id": "B008OAS0W8", "genre": "Children's Books", "title": "Castles: Picture Book (Educational Children's Books Collection) - Level 2 (Planet Collection 73)", "description": "Are you interested in expanding your child's vocabulary?As a part of the Planet Collection, \"CASTLES\" offers facts, descriptions and thought inspiring questions alongside amazing photographs of the different castle structures. Toddlers and babies will love looking at the photos, while the older children will be able to grow their minds through reading the passages.Early education sets up your child for success.  We are a green company and a portion of each sale is donated to charity."}, {"id": "B00FY2WOIU", "genre": "Children's Books", "title": "One Heart: A Valentine Counting Book (Valentine Counting Books)", "description": "An adorable counting book for Valentine's Day--with valentine cards to share!It's finally Valentine's Day, and a kindergartener is eager to hand out the special valentines she's made. Count along from 1 to 10 as she gives out hearts to everyone she loves!With simple rhyming text and illustrations filled with eye-catching collage valentines, this counting book is a wonderfully fun read-aloud story. It also includes six punch-out valentine cards for children to share with friends and family!"}, {"id": "0486330036", "genre": "Children's Books", "title": "Sesame Street Big Bird's Yellow Stickers (Sesame Street Stickers)", "description": "Big Bird is not the only thing that's yellow. Bananas and corn are yellow too! So are bees, lemonade, the sun, rubber ducks, submarines, and school buses. These bright stickers will help kids discover a whole world of yellow objects. Includes 24 stickers."}]