[{"id": "1843653141", "genre": "Children's Books", "title": "The Saga of Erik the Viking", "description": "Join Erik and the crew of The Golden Dragon on their journey as they go in search of adventure in \"the land where the sun goes at night.\" Along the way their courage, skill, strength, stamina, and wit will be tested to the extremes. This book was commended for a Greenaway Medal upon its publication in 1983, and was the basis of a 1989 fantasy film directed by Terry Jones and starring Tim Robbins."}, {"id": "1606060120", "genre": "Children's Books", "title": "The Incredible Voyage of Ulysses", "description": "After defeating the Trojans in an intense, ten-year war, the Greeks' courageous leader, Ulysses, king of Ithaca, begins the voyage home with his soldiers. There his faithful wife, Penelope, and his young son, Telemachus, await him. Ulysses never imagines that the journey home will be another ten-year quest in which he must confront all kinds of terrifying obstacles, including giant cannibals, one-eyed monsters, an enchantress who turns his men into pigs, and the tempting song of sea nymphs who try to lure him and his men to their death. But Ulysses is a daring and clever man, willing to take on all that life and the gods put in his path in order to reach his home. This retelling of the Greek poet Homer's epic tale is accompanied by beautiful and bold illustrations reminiscent of ancient Greek art. The graphic-novel-like style of the book, in which text and illustrations are tightly interwoven, creates a compelling world filled with drama and mystery certain to draw in young readers. Ages nine to twelve."}, {"id": "061318758X", "genre": "Children's Books", "title": "How Would You Survive as an Ancient Roman?", "description": "In this book, the reader is transported down a \"time tunnel\" to Roman times, asked to choose an identity and given information on all aspects of life in that time in an original, interactive way. A rating is given at the end of the book to see whether the reader really would have survived. A colour poster is included inside the jacket. This book is part of a series created and designed by David Salariya. A wide range of titles is planned for the series which will bring new life and interest into history for readers of all ages."}, {"id": "0761361170", "genre": "Children's Books", "title": "Formula One Race Cars on the Move (Lightning Bolt Books)", "description": "Its engine roars. Its tires squeal. This Formula One race car is on the move! What are Formula One race cars? And who builds these amazing autos? Read this book to find out! Learn all about mighty machines in the Vroom-Vroom series--part of the Lightning Bolt Books(TM) collection. With high-energy designs, exciting photos, and fun text, Lightning Bolt Books(TM) bring nonfiction topics to life!"}, {"id": "1338158953", "genre": "Children's Books", "title": "Peppa Goes Apple Picking (Peppa Pig)", "description": "Peppa, George, Mummy Pig, and Daddy Pig celebrate the start of fall by going on a trip to the apple orchard. They will bake the apples into a delicious pie for Granny and Grandpa Pig--and Daddy Pig knows a special trick for getting the juiciest, most delicious apples! This storybook is based on the hit animated TV show, as seen on Nick Jr."}]