[{"id": "B0711GSD71", "genre": "Children's Books", "title": "Girl Running", "description": "* \"A bright salutation of a story, with one determined woman at its center.\"--Kirkus Reviews, starred reviewThe inspiring story of the first female to run the Boston Marathon comes to life in stunningly vivid collage illustrations.&nbsp;&nbsp;&nbsp;&nbsp; Because Bobbi Gibb is a girl, she's not allowed to run on her school's track team. But after school, no one can stop her--and she's free to run endless miles to her heart's content. She is told no yet again when she tries to enter the Boston Marathon in 1966, because the officials claim that it's a man's race and that women are just not capable of running such a long distance. So what does Bobbi do? She bravely sets out to prove the naysayers wrong and show the world just what a girl can do."}, {"id": "0746020740", "genre": "Children's Books", "title": "Papier Mache (Usborne How to Guides)", "description": "As part of the \"How to Make\" series, this title provides step-by-step instructions in various papier mache projects. It includes handy tips on how to achieve the right effects, what equipment to use and what household rubbish can be used to create models of all shapes and sizes."}, {"id": "1974670023", "genre": "Children's Books", "title": "What Do You Do with a Doodleoo?", "description": "Looking for something new to do?  Just grab a doodleloo!  Don’t have one?  Oh, yes, you do!  A doodleloo is what’s left after you’ve finished a roll of paper towels, but it is definitely not trash. Before you throw away a doodleloo, peak inside this book and see just some of what it can do. For more sample spreads than what is available in the \"Look Inside\" here, visit LoriFettner.com  Lori and Michael Fettner’s first picture book, No Place Like Earth, introduces the planets to young children, but also reminds us that Earth really is the only place we can call home. This follow-up illustrates one simple thing kids can do to help save our planet…reuse items instead of throwing them away. Who knew saving the planet could be so much fun, while saving you money as well!"}, {"id": "1483831183", "genre": "Children's Books", "title": "100 Third Grade Skills (100 Skills)", "description": "Help your child build classroom confidence, one skill at a time! 100 Third Grade Skills offers 256 pages of grade-appropriate practice in math and language arts. Skills include fractions, estimating, rounding, adverbs, plurals, and more.The 100 Skills series extends classroom learning by breaking down skills into simple instructions and exercises, making it easy for children to practice at home. Each book prepares your child for higher-level thinking and analytical skills by strengthening understanding of foundational concepts"}, {"id": "B072FVSXWV", "genre": "Children's Books", "title": "Alice's Adventures in Wonderland and Through the Looking Glass", "description": "Tumble down the rabbit hole with Alice for a fantastical adventure from Walt Disney Pictures and Tim Burton. Inviting and magical, ALICE IN WONDERLAND is an imaginative new twist on one of the most beloved stories of all time. Alice (Mia Wasikowska), now 19 years old, returns to the whimsical world she first entered as a child and embarks on a journey to discover her true destiny. This Wonderland is a world beyond your imagination and unlike anything you've seen before. The extraordinary characters you've loved come to life richer and more colorful than ever. There's the Mad Hatter (Johnny Depp), the White Queen (Anne Hathaway), the Red Queen (Helena Bonham Carter), the White Rabbit (Michael Sheen) and more. A triumphant cinematic experience -- ALICE IN WONDERLAND is an incredible feast for your eyes, ears and heart that will captivate audiences of all sizes."}]