[{"id": "0823423050", "genre": "Children's Books", "title": "Shades of People", "description": "Cocoa, tan, rose, and almond-people come in lots of shades, even in the same family. This exploration of one of our most noticeable physical traits uses vibrant photographs of childen and a short text to inspire young children both to take notice and to look beyond the obvious. "}, {"id": "1554989817", "genre": "Children's Books", "title": "Blue Rider", "description": "On a gray and crowded city sidewalk, a child discovers a book. That evening, the child begins to read and is immediately carried beyond the repetitive sameness of an urban skyscape into an untamed natural landscape. The child experiences a moment of true joy, and as if in response to that single blissful moment, people seem to come alive in all the other rooms of the apartment block. Thanks to the power of one book, an entire society is transformed.In creating this book, Geraldo Valério was inspired by the German Expressionist group known as Der Blaue Reiter (The Blue Rider), which formed in Munich in 1911 and included painters Franz Marc and Wassily Kandinsky. These artists sought to find the spiritual significance in art, with an emphasis on form and color. In turn, Valério has created a wordless book that speaks volumes about how art can transform us beyond the sometimes-dreary world of the everyday."}, {"id": "0763698946", "genre": "Children's Books", "title": "The World-Famous Book of Counting", "description": "A stylish lift-the-flap, pop-up, pull-out book about numbers with a magic themePrepare to be amazed by this fabulously clever lift-the-flap, pop-up, pull-out book about numbers. Sarah Goodreau's magic-themed illustrations add a touch of nostalgia and vintage glamour to this fun and elegant counting book. With spectacular sorcery and sensational illusions, there's something here for magic lovers of all ages."}, {"id": "0606370013", "genre": "Children's Books", "title": "The Story Of Facebook (Turtleback School & Library Binding Edition) (Built for Success (Paperback))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. A look at the origins, leaders, growth, and innovations of Facebook, the online social networking service that was founded in 2004 and today has hundreds of millions of users worldwide."}, {"id": "1534914005", "genre": "Children's Books", "title": "The Titanic for Kids: The English Learning Tree (The English Reading Tree) (Volume 1)", "description": "Introducing the Titanic for Kids The 'For Kids' series has been produced for children of seven and over. It is the perfect answer to move your child away from simple picture books to start enjoying and learning from more challenging reading material. Every book in the series is an exciting factual story that will boost reading confidence and introduce active and motivating vocabulary. Parental support is necessary to get the best out of the English Reading Tree Series. All of the books are fast-paced and designed to keep children engaged. There is also a fun quiz that can be played to give you an accurate idea of how much he or she has learnt. What people are saying Excellent book that not only improves reading ability but educates Goodreads Very well presented and I particularly enjoyed the quiz at the end: Post Online Simple, easy to read and full of interesting facts. What more can a parent ask for? : Island EBooks"}]