[{"id": "1930900732", "genre": "Children's Books", "title": "Colors of the Wind: The Story of Blind Artist and Champion Runner George Mendoza", "description": "George was one of those kids. You know, the kind that never stays still. And then one day, the doctor said he was going blind. Did that slow George down? Not for a single second. In fact, he was so fast, he went on to break a world record for blind runners. And now he is breaking more barriers because ironically, George Mendoza, blind painter, paints what he sees.  George Mendoza started going blind at age 15 from a degenerative eye disease. It wasn't the sudden onset of blindness that many people experience. George lost his central vision and started seeing things that weren't there--eyes floating in the air, extraordinary colors, objects multiplied and reflected back. George describes this condition as having \"kaleidoscope eyes.\" He triumphed over his blindness by setting the world record in the mile for blind runners, and later competing in both the 1980 and 1984 Olympics for the Disabled. Now a full-time artist, Mendoza's collection of paintings, also titled Colors of the Wind, is a National Smithsonian Affiliates traveling exhibit."}, {"id": "B076QL898B", "genre": "Children's Books", "title": "How to Have a Happy Hanukkah!", "description": "How to Have a Happy Hanukkah is a simple, secular introduction to this fun holiday for children of all religions or spiritualities. Teach young children or their non-Jewish friends about the story of Hanukkah and it's common traditions."}, {"id": "1682542742", "genre": "Children's Books", "title": "The Adventures of Hop-hop and the Great Flying Rabbit", "description": "Did you ever see something so strange, you just couldn't believe your eyes? Hop-Hop and friends find out anything is possible in The Adventures of Hop-Hop and the Great Flying Rabbit. They discover things aren't always as they seem, and that imagination is a great thing to have."}, {"id": "1943147302", "genre": "Children's Books", "title": "The Girl Who Thought in Pictures: the Story of Dr. Temple Grandin (Amazing Scientists)", "description": "If you’ve ever felt different, if you’ve ever been low,if you don’t quite fit in, there’s a name you should know…Meet Dr. Temple Grandin―one of the world’s quirkiest science heroes!When young Temple was diagnosed with autism, no one expected her to talk, let alone become one of the most powerful voices in modern science. Yet, the determined visual thinker did just that. Her unique mind allowed her to connect with animals in a special way, helping her invent groundbreaking improvements for farms around the globe!The Girl Who Thought in Pictures: The Story of Dr. Temple Grandin is the first book in a brand new educational series about the inspirational lives of amazing scientists. In addition to the illustrated rhyming tale, you’ll find a complete biography, fun facts, a colorful timeline of events, and even a note from Temple herself!"}, {"id": "0613436202", "genre": "Children's Books", "title": "Freddy and the Bean Home News", "description": "It all started in 1927 when a group of animals on a farm in Upstate New York decided to travel to Florida in search of warmer weather --and faithful fans of the Freddy books have been joyously lapping up each book in the twenty-six book series ever since! Why is Freddy such a popular pig? Most readers will tell you it's because he's a pig for all seasons--a detective, a pilot, a magician, an explorer, a poet, a politician . . . you name it, and Freddy will give it a shot!In Freddy and the Bean Home News, Freddy's friend Mr. Dimsey, the editor of the Guardian, is ousted for publishing news of Bean Farm in the local newspaper. To ensure that those who are interested might still learn of all the goings-on, Freddy takes it upon himself to found a newspaper of his own and calls it The Bean Home News, the basis for the current Freddy fan club newsletter. It turns out that being a newspaperman isn't quite as easy as Freddy thought it might be, but with typical aplomb he manages to burn the wires!"}]