[{"id": "B01JDULT8O", "genre": "Children's Books", "title": "Royal Dogs: Penelope & Beatrice", "description": "Penelope and Beatrice: a girl, a bear, and a library card. Penelope is a lucky girl. She has a best friend named Beatrice who happens to be a teddy bear and loves to accompany her on all of her travels in history. Come with Penelope and Beatrice to find out about the true history of Royal Dogs. You will see a golden retriever wedding in India, meet a sad princess and her pug in France, and even find out the mystical fairy history of corgis. This is a wonderful way to introduce history to your children in a richly illustrated bedtime book. Ages 4-10."}, {"id": "B019JKICJ2", "genre": "Children's Books", "title": "A Gaggle of Geese: A Flora N. Fauna Discovery Book (Flora N. Fauna Discovery Books 1)", "description": "Flora N. Fauna, that spunky grandmother, loves animals.  In this book, she guides readers to discover the names for groups of animals.  Gaggle, prickle, smack, leap, and cyclone are all names for groups of animals; but what type of animal goes with each one? While she runs, scuba dives, and paddle boards, Flora N. Fauna seeks out animals throughout the world and she shows that older women can be adventurous, knowledgeable, and fun.The book challenges readers by first showing an animal’s habitat in beautifully illustrated watercolors along with its group name (“A gaggle of…”). The animals are shown only in silhouette. The following page reveals the complete scene and the group name is revealed (“A gaggle of … geese”)."}, {"id": "0679900896", "genre": "Children's Books", "title": "American Tall Tales", "description": "Illus. in full color. Upstarts like Davy Crockett, giants like Paul Bunyan, and gentle souls like Johnny Appleseed are among the nine \"tall\" heroes featured in this exuberant collection of traditional American folk tales. \"McCurdy's intricate wood engravings set these larger-than-life folk on majestic landscapes brimming with energy, rich with wildlife and local color. The author's thoughtful introduction and notes round out this superlative offering.\"--(starred) School Library Journal.  "}, {"id": "0689810385", "genre": "Children's Books", "title": "So Say The Little Monkeys", "description": "A rhyming retelling of an Indian folktale from Brazil recounts the plight of the tiny, playful monkeys who have too much fun during the day to build a shelter to protect them from the dangers of the night."}, {"id": "1682128903", "genre": "Children's Books", "title": "Let's Explore the Australian Outback", "description": "The great Australian Outback has been the popular theme used in several movies and stories. The wide expanse of land features peoples and animals that are truly fascinated. Open the pages of this picture book to learn about quick facts that could help build a trove of rich and diverse information. Order your copy today!"}]