[{"id": "092023691X", "genre": "Children's Books", "title": "50 Below Zero", "description": "Jason’s dad falls asleep everywhere \u0085 except in his own bed. All night long, Jason gets woken up by strange noises that lead him to find his dad in the most unexpected places\u0097from on top of the refrigerator to the freezing cold woods outside his house. In order to finally get a good night’s sleep, Jason musters up all of his resources and comes up with a most unexpected solution\u0097tying his dad’s toe to the bathroom doorknob to keep him in place."}, {"id": "1515347192", "genre": "Children's Books", "title": "Charlie and the Creature", "description": "\"They weren't used to outsiders in town. No one ever did much coming or going.\" What happens when a travel-loving creature enters a small-town diner? Will he frighten the townsfolk or inspire them to seek out adventures of their own? \"Charlie and the Creature\" is an endearing story about taking chances and being open to new people and places. A perfect book for inspiring young travelers!"}, {"id": "B06WLJ6DHJ", "genre": "Children's Books", "title": "Jane's Big Ideas: How the Unicorns Missed the Ark", "description": "What did unicorns look like?Where did they go?Jane thinks she knows! Listen-in on her adorable explanation in this funny and colorful story. Jane explains to her mom how she thinks the unicorns missed the ark. Mom explains to Jane that God made sure at least two of every animal entered the ark. Although the biblical unicorn might not be the way she imagines it, two unicorns were on the ark."}, {"id": "0761473149", "genre": "Children's Books", "title": "How It Works: Science and Technology 20 Volume set", "description": "Attractively bound in red and black, these slim volumes present fairly lengthy articles (generally 1 to 4 pages) explaining technology and scientific principles and phenomena in terms that young adults (grades 6-12) can understand. The alphabetically arranged entries cover more than 800 subjects ranging from the very basic to topics as sophisticate"}, {"id": "078575492X", "genre": "Children's Books", "title": "Amzat & His Brothers", "description": "Five delightful Italian tales include the stories of clever  Amzat and his wife outwitting his greedy brothers, five animals who  join forces against a wolf, and a poor mother and son who end up living  in luxury. Reprint. C. K. "}]