[{"id": "141092825X", "genre": "Children's Books", "title": "Living in the Sahara (World Cultures)", "description": "Why are the Tuareg also known as the Blue People? Why is salt so important in the desert? Why do the Tuareg always pour three cups from a teapot? Not so long ago, the Tuareg traveled with large numbers of camels transporting salt, gold, and even slaves across the desert. You will read about the way they live now and how their lives center around the many desert oases."}, {"id": "B072XXBMZ5", "genre": "Children's Books", "title": "The Princess and the Cafe on the Moat", "description": "Once upon a time there was a very busy castle. And in that castle lived a king, a queen, a young princess, and all their courtiers and attendants. Everyone was very busy. The king conferred with his knights. The queen was occupied with her ladies-in-waiting. And the rest of the palace staff was doing their daily chores. Everyone was working. Everyone but the princess, who wanted very much to be engaged like the others. But it seemed nobody wanted or needed her help. Determined to be useful, the kindhearted princess sneaked away to the countryside to look for opportunities to help others. What did she find outside the castle walls? This feel-good story reminds us all about the importance of reaching out and taking time to connect with one another."}, {"id": "B00EHMSRXY", "genre": "Children's Books", "title": "10 Amazing Slenderman Stories", "description": "Just before Jack Goldstein and Jimmy Russell published their last book about Slenderman, 101 Amazing Slenderman Facts, they were both found dead in suspicious circumstances. The book was published in their memories. What was not known at the time however was that two packages were making their way through the Royal Mail service. One was from Jimmy and addressed to Jack, the other from Jack addressed to Jimmy. Both packages contained worrying documents detailing the history of Slenderman, and including some terrifying stories.This grisly collection of documents is offered to the reader in the hope they can make some sense of the killings, as well as finding out further information regarding the slim being.Proceed with caution."}, {"id": "1519636016", "genre": "Children's Books", "title": "The Legend of the Mermaids", "description": "Oceana was a normal thirteen year old until a storm washes her out to sea, where she meets dolphins that talk and mermaids that might hint to her real family. When the evil mermaid, Queen Juniper, tries to destroy her, will Oceana find a way to save herself, and the mermaid kingdom of Sealla?"}, {"id": "1612286828", "genre": "Children's Books", "title": "The Experience of Israel: Sights and Cities (Voices from Israel: Set 1)", "description": "This series gives kids from other parts of the world insight into various aspects of life in Israel today. Written and crafted by three authors currently living in Jerusalem, this series is the first of its kind to bring such insight to children. With stunning full-color photography, The Experience of Israel: Sights and Cities is a delight for readers of all ages. Author Gil Zohar, a licensed Israeli tour guide, takes the reader to visit some of his favorite places in the holy land."}]