[{"id": "B00PTNKTZE", "genre": "Science Fiction & Fantasy", "title": "Gateway: The Hayle Coven Destinies: Book Five", "description": "A Haunting NightmareI weep, even as the ground below me splits wider, the roots of the oak tree pulling me underground, jerking me into the moist depths, smothering me with the cool pressure of earth. I smell fabric softener and feel the touch of soft cotton even as voices cry out to me, voices I know as well as my own. Who are they? The fiery one, the one of the earth with the heart of green. The cool, white one with the logical mind… they fade away as a single, crisp voice breaks through, though not the one I was expecting. Not Liam’s.Syd. Her desperation is obvious, clear and poignant. I open my eyes and find Alison Morgan, my dead best friend, hovering before me. Go home.I gape at her, heart pounding. I can’t. I just can’t. I’ve left it all behind—SYD. She flies backward, voice a wail as the dark swallows her. GO HOME.Syd’s time with the drach has given her the respite she needed, the peace she’s craved for so long. But, frustrated by her inability to locate further pieces of Creator, she is driven back to the plane of her origin. Can she retain the calm she’s fought so hard for, given up her past to achieve, or will she be drawn once again into the turmoil of her old life?"}, {"id": "B005K8NC8Y", "genre": "Science Fiction & Fantasy", "title": "Smile: A Short Story", "description": "While Tammy, a teenage soccer star and budding writer, contemplates her adolescent problems and waits for her flaky mom to pick her up from practice, a stranger takes a secret picture of her. Tammy shivers as the camera captures her image, but she doesn’t notice anything else out of the ordinary until the next day, when the stranger starts to develop his film. Then her life begins falling apart. Piece by piece, the things that make her Tammy are parceled out to other girls, and she starts to feel more and more invisible, fading from real life as her image comes into focus on the stranger’s light-sensitive paper. \"Smile\" first appeared in The Cynic Online Magazine, volume 10, issue 10, October 2008 and Bewildering Stories, issue 335, May 2009."}, {"id": "1250163854", "genre": "Science Fiction & Fantasy", "title": "Gods, Monsters, and the Lucky Peach", "description": "\"Gods, Monsters, and the Lucky Peach is a tour-de-force, with nuanced characters in a masterfully conceived world of stunning, mind-bending eco-tech.\" ―Annalee NewitzExperience this far-reaching, mind-bending science fiction adventure that uses time travel to merge climate fiction with historical fantasy. From Kelly Robson, Aurora Award winner, Campbell, Nebula, and Theodore Sturgeon finalist, and author of Waters of VersaillesDiscover a shifting history of adventure as humanity clashes over whether to repair their ruined planet or luxuriate in a less tainted pass.In 2267, Earth has just begun to recover from worldwide ecological disasters. Minh is part of the generation that first moved back up to the surface of the Earth from the underground hells, to reclaim humanity's ancestral habitat. She's spent her entire life restoring river ecosystems, but lately the kind of long-term restoration projects Minh works on have been stalled due to the invention of time travel. When she gets the opportunity take a team to 2000 BC to survey the Tigris and Euphrates rivers, she jumps at the chance to uncover the secrets of the shadowy think tank that controls time travel technology."}, {"id": "B00JD49QN6", "genre": "Science Fiction & Fantasy", "title": "712.9", "description": "712.9 was never supposed to exist. Programmed directly into the universe by a mysterious machine, 712 is not without faults. His mind was split into seven parts, each representing a part of his personality. In the aftermath of the war between them, three emerge and take control. They make a pact to free 712.9 from his physical prison--and maybe, his mental one. A tale of self-discovery and the rise and fall of a man, \"712.9\" explores the depths of the human consciousness in a way rarely seen."}, {"id": "1462402313", "genre": "Science Fiction & Fantasy", "title": "Washington Park", "description": "The Porters were an average American family living in a quiet Southwest Missouri town. They had no idea that their family tragedy would involve them, years later, in the crime of the century in Springfield. In a place where family values are more important than wealth or fame, it was inconceivable that a judge could be involved in the events that stunned the entire city. On a peaceful September day, a family law judge is missing. The daring attack was carried out by a secret society devoted to protecting the public from injustices committed by the leaders in the community. The investigation by the local authorities was struggling until someone, quite unexpectedly, steps up to assist them in their search. In a most unusual way, this crime is turned into a story of faith and redemption that no one thought was possible. Washington Park is a story about how we can overcome the challenges we face. With God's help, great things can be accomplished in our lives when we least expect it."}]