[{"id": "0967816750", "genre": "Children's Books", "title": "Polliwog", "description": "Polliwog's transformation forces her to enter an unknown world outside the pond where she must accept her new life as a frog. A bilingual (English/Spanish) picture book for all ages."}, {"id": "B003XT5R30", "genre": "Children's Books", "title": "Heroes of the Revolution: with Fine Portraits", "description": "This short juvenile history book was published some time in the 1840's and covers the lives of:George WashingtonRoger ShermanJohn HancockGen. Israel PutnamThaddeus Kosciusko"}, {"id": "0713673613", "genre": "Children's Books", "title": "Singing English (Book + CD): 22 Photocopiable Songs and Chants for Learning English (Singing Languages)", "description": "SINGING ENGLISH - A must-have collection of fun new songs and chants for practising vocabulary and phrases when learning English. Ideal for those learning English as an additional or second language in the UK and anyone learning English abroad. These catchy songs and chants help pupils memorise words and phrases. Intended for 7-11 year olds but the upbeat backing tracks will appeal to all. Each song and chant includes teaching activities providing fun and exciting ways to develop language and photocopiable song lyrics."}, {"id": "087226615X", "genre": "Children's Books", "title": "Prehistory", "description": "The Art and Civilization of Prehistory reproduces stunning works of art, artifacts, and artwork reconstructions to explain human prehistory, from our origins in Africa to the birth of cities and writing."}, {"id": "1742373291", "genre": "Children's Books", "title": "Jasper & Abby: And the Great Australia Day Kerfuffle", "description": "Follow the adventures of the Prime Minister's pet cat and dog, as they try to avert one disaster after another during Australia Day celebrations at The LodgeIt was a special day at the Lodge. There was going to be a party. A big party. Abby the dog was there. Jasper the cat was there. But so was a scruffy little dog. The Prime Minister receives many letters and emails from children asking about Jasper and Abby, and he often tells his friends, colleagues, and staff stories of the antics of his family pets. Having heard these stories, Rhys Muldoon—who has been friends with Kevin Rudd for many years—encouraged the Prime Minister to write a children's book. Proceeds from this book go to The Center for Community Child Health, at the Royal Children's Hospital in Melbourne."}]