[{"id": "0785796908", "genre": "Children's Books", "title": "Rabbit Makes a Monkey of Lion: A Swahili Tale (Picture Puffins)", "description": "Rabbit, aided by her friends Turtle and Bush-rat, sets out to outwit Lion in order to feast on the honey in lion's calabash tree"}, {"id": "B071R25XQZ", "genre": "Children's Books", "title": "LOL: A Load of Laughs and Jokes for Kids", "description": "What do you get when you cross a wacky, jam-packed joke book with a kid who loves to LOL? A load of laughs and jokes for kids in this perfect book for young comedians!What winter sport do trees participate in? Al-pine skiing! What do construction workers use to block traffic in winter? Snow cones! What did one telephone give the other telephone on Valentine’s Day? A ring! LOL: A Load of Laughs and Jokes for Kids is crammed full of the wildest, wackiest jokes ever! Covering a range of topics from Animals to Zippers and everything in between, it will have your jokesters howling with laughter."}, {"id": "1575052644", "genre": "Children's Books", "title": "Wilma Rudolph", "description": "Introducing new readers to some of history's most interesting and important people, these biographies focus on the pivotal episodes that show what kind of person the subject is (or was) and how he or she came to be famous. Although written in a story format, these books are not fictionalized accounts. A chronology of major events follows the story, along with a brief summary of the subject's life."}, {"id": "1338193074", "genre": "Children's Books", "title": "A Girl Named Rosa: The True Story of Rosa Parks (American Girl: A Girl Named)", "description": "The A Girl Named series tells the stories of how ordinary American girls grew up to be extraordinary American women. Rosa Parks refused to give up her bus seat to a white passenger in 1955, but how did she come to be so brave? A Girl Named Rosa describes the defining moments that made up her childhood and adolescence with full-color illustrations throughout. In addition to stories and facts about Rosa's upbringing and accomplishments, the book includes a timeline and a glossary, plus a profile of a noteworthy and contemporary American girl following in Rosa's monumental footsteps to stand up for equal rights, even in the face of adversity."}, {"id": "B007JI67CQ", "genre": "Children's Books", "title": "The Adventures of Bennie the BeltMouse Book One", "description": "The BeltMouse stories are written for the child in everyone. They are as much fun to read aloud and to listen to as to read to one's self. Bennie appeals to everyone's desire to be a hero, hidden though that desire might be. At the same time, each of us has a shy little mouse inside, that struggles to overcome and succeed."}]