[{"id": "1554884373", "genre": "Children's Books", "title": "Your Time, My Time", "description": "Moving with her mother from Vancouver to Wells, British Columbia, Elizabeth Connell longs for the excitement of the city and her father, brother, and friends left behind. While she is in the peaceful graveyard of nearby Barkerville she finds a small gold ring that has very special powers. By twisting the ring on her finger, Elizabeth is transported to the nineteenth century during the heyday of the gold rush. Caught between her present life with family and friends and a love in the past, Elizabeth learns more than history."}, {"id": "1626175233", "genre": "Children's Books", "title": "The Titanic Disaster (Black Sheep: Disaster Stories)", "description": "As one of the most devastating shipwrecks in history, the sinking of RMS Titanic killed more than 1,500 passengers. There were only enough lifeboats for about one third of the people on board! Learn more about the tragedy in this riveting graphic novel for growing readers."}, {"id": "0142414824", "genre": "Children's Books", "title": "Revolting Rhymes", "description": "Did you think Cinderella married the prince and lived happily ever after, or that the three little pigs outsmarted the wolf? Think again! Master storyteller Roald Dahl adds his own darkly comic twists to six favorite tales, complete with rambunctious rhymes and hilarious surprise endings."}, {"id": "0431039283", "genre": "Children's Books", "title": "Wild Britain: Badger Hardback", "description": "This is one of a series that focuses on animals found within the UK. Each book examines an individual animal, explaining what that animal looks like, where it lives, what type of home it lives in, what it eats, mating, young and growing up. The books introduce readers to the issues of endangerment and conservation. A map shows the distribution of the animal throughout the UK. This volume explores the badger, a nocturnal and very shy animal."}, {"id": "1460239385", "genre": "Children's Books", "title": "Ana's Day", "description": "Ana's Day is about a four year old girl, who accompanies her mother on a series of errands in a small town in Mexico. Ana's world comes to life through the colorful clay sculptures made by artisans living in Ocumicho in the state of Michoacán, México.  Sobre el libro: El dia de Ana es el cuento de una niña, de cuatro años, que acompaña a su mamá en los mandados cotidianos en un pueblo pequeño en México. El mundo de Ana lleva una vivacidad a través de las esculturas policromadas de barro hechas por los artesanos que viven en el pueblo de Ocumicho en el estado de Michoacán."}]