[{"id": "1432932942", "genre": "Children's Books", "title": "Hot or Cold (Properties of Materials)", "description": "How can we tell if something is hot or cold? In 'Hot or Cold,' children learn which materials can be heated or cooled and that materials can change when they are hot or cold."}, {"id": "0979533201", "genre": "Children's Books", "title": "The Adventures of Pink Elephant Vol. 1", "description": "What do you call a creature that falls from the sky, hatches in a pool, and is pink and psychic? Mandy and Christie Evans's new friend is not from Earth, and he has no clue how to get back home! Before they can uncover the secret to Pink Elephant's past, the three must learn to work with one another to keep him hidden and battle problems at school and at home. The two sisters have no idea that meeting Pink Elephant is only the beginning of the adventure of a lifetime."}, {"id": "1521906084", "genre": "Children's Books", "title": "Diary Of A Legendary Ice Bird (Animal Diary)", "description": "One of the most iconic birds is coming to you exclusively right here...    Every Creature is unique in its own way, each have their own untold stories and mysterious characteristics, but not a lot of them are being revealed!     These one-of-a-kind monsters are so hard to find and learn about, so it’s no surprise that I intend to make Arctic the Legendary Ice Bird's debut appearance special for my readers. Expect more legendary monsters to appear right here in this journal!"}, {"id": "0878392939", "genre": "Children's Books", "title": "Mayhem on the Mississippi Mile: A Doc and Tweed History Mystery", "description": "And to think it all started with a skateboard. Doc and Tweed are at it again. In this mystery, set along the Mississippi Mile, the two friends set out to prevent a kidnapping and discover a bit of history along the way."}, {"id": "098195426X", "genre": "Children's Books", "title": "The Oprah Winfrey Story: The First Oprah Winfrey Comic Biography (Great Hero Series)", "description": "The first Oprah Winfrey Comic Biography.\"Even in the darkness with no end in sight, I believe my future in shining bright.\"An illegitimate baby born into all of the world's prejudices becomes the most influential figure in all of media.In this eye-opening, one of a kind graphic novel is the story of an inspirational heroine who rises from the depths of despair to the heights of immeasurable success. Working hard to changethe world for the better, a wandering child grows to fight against the very abuse and poverty that defined her childhood. Come along on the heart-moving journey of Oprah Winfrey's life as she overcomes hardship with open-heartedness, courage, and hope."}]