[{"id": "0873492544", "genre": "Science Fiction & Fantasy", "title": "Scrye Collectible Card Game Checklist and Price Guide", "description": "This is the first book to catalogue every collectible card game ever released. From thousand-dollar Magic: The Gathering and Pokemon cards to more obscure games - they are all here. More than 400 releases for over 100 games! That's an amazing 60,000 cards listed and priced. Plus, your customers will appreciate complete set descriptions, more than 600 photos and colourful text written by gaming experts describing each game. No collector, no player, no kid - absolutely no-one - has been able to determine if they have all the cards for some games - until now. The information has been scattered and hard to find until Scrye Magazine's experts put it all in this one easy-to-use book. Appendices include foreign card games, popular not quite-collectible card games, and all-important cross-references for Magic: The Gathering and Pokemon games. Plus your card game collecting and playing customers will depend on the set, box and unopened pack prices when making trades and purchases."}, {"id": "0991634217", "genre": "Science Fiction & Fantasy", "title": "Pixies, Passages and Possibilities: A collection of science fiction and fantasy short stories", "description": "Collection of science fiction and fantasy short stories. Stories include a professor who finds pixies' lost pets; an elderly dying woman dreams of another reality; a diary helps a woman understand who she really is;  a vamphyre tries to stop a crusade; Earth must decide between two alien species who come to Earth offering great riches and wondrous technology; what might happen if genetic engineering of humans becomes common; a couple trying to save their marriage get a little magic help; a very special ghost and her cat; and a novella about a fairy who is lost and needs a bit of help finding her home."}, {"id": "1441402608", "genre": "Science Fiction & Fantasy", "title": "1: Tapestry, Volume I: Collected Threads", "description": "Before there was a Reckoning...before there was The War of Succession that ripped the soul from the land and bled the populace of the Basin for five long years, there were two centuries worth of history that traced the Kingdom's rise from the ashes of the Old Empire. From the humblest beginning imaginable, a band of frightened refugees forged a new Kingdom from their own blood and sweat, and endured hardships nearly too numerous to name in the pursuit of the idea of building a good and just Kingdom. A place they were proud to call home. Between the Flight and the Founding of their Kingdom, and the start of the War of Succession, there are stories. Histories. Legends. Discover them here."}, {"id": "0765376717", "genre": "Science Fiction & Fantasy", "title": "One Year After: A John Matherson Novel", "description": "Months before publication, William R. Forstchen’s One Second After was cited on the floor of Congress as a book all Americans should read. This thrilling follow-up to that smash hit begins one year after One Second After ends, two years since nuclear weapons were detonated above the United States and brought America to its knees. After months of suffering starvation, war, and countless deaths, the survivors of Black Mountain, North Carolina, are beginning to recover technology and supplies they had once taken for granted. When a “federal administrator” arrives in a nearby city, they dare to hope that a new national government is finally emerging.  Progress is halted when the young men and women in the community are drafted into the “Army of National Recovery.” Town administrator John Matherson and the people of Black Mountain protest vehemently. But “the New Regime” is already tyrannizing one nearby community, and it seems that Matherson’s friends and neighbors will be next.This edition of the book is the deluxe, tall rack mass market paperback."}, {"id": "0991360591", "genre": "Science Fiction & Fantasy", "title": "Tinkermage (GnomeSaga) (Volume 2)", "description": "The enemy exposed! Nikselpik Nur has become the city of Hightower’s staunchest—albeit unwilling—ally. He’s hardly learned to cope with his debilitating bugging addiction, much less take on the duties of being the city’s First Wizard. Can he embrace this new path? And will he? Meanwhile, Stena Wavebreaker is pulled from her seafaring duties by the Precisor General and given command of a raggedy airship to scout the ultraworldly enemy from the skies above the Southern Reaches. Her mission: gain the support of the unpredictable elves. Lastly, Niksabella Nur has set off from Hightower at the behest of the grim stonekin leader, Jontuk. The gnomestress must unlock the full potential of her invention, the recursive mirror, and her own powers, to bear what might be the heaviest burden of all. What will she discover along the way? And will Jontuk be able to keep her alive long enough to save them? This is book two of Kenny Soward's epic \"gnomepunk\" fantasy, GnomeSaga!"}]