[{"id": "151872468X", "genre": "Science Fiction & Fantasy", "title": "Fantasies out of this world!: “Lewis’s Mysterious Imaginary World”", "description": "This is a science fiction novel featuring three separate fantasies generated from my imaginary thoughts. The first two stories are linked (part I and Part II) and the last story in the book reveals another one of my numerous other strange imaginary fantasies."}, {"id": "0330460994", "genre": "Science Fiction & Fantasy", "title": "Dogfellow's Ghost (New Writing)", "description": "A new century has begun and new fields of science are shaking man’s longest-held beliefs. And on a tropical island, somewhere in the Pacific, new kinds of creature have been conceived. Yet the Master who made them has disappeared, and for one of his creations the loss is unbearable: neither entirely man nor wholly animal, DogFellow is both more and less than the sum of his parts. Pitifully conflicted, his loyalty to a lost creator is at war with other, more human desires. And DogFellow alone can unlock the secrets of a strange and terrible past. Gripping and poignant, philosophical and fantastic, DogFellow’s Ghost is a timely allegory on freedom, slavery, and the wildness of the human spirit."}, {"id": "0765382121", "genre": "Science Fiction & Fantasy", "title": "The Dinosaur Knights (The Dinosaur Lords)", "description": "THE DINOSAUR KNIGHTS is the second in Victor Milan's lush, exotic tale about knights. Knights riding dinosaurs.Paradise is a sprawling, diverse, often cruel world. There are humans on Paradise but dinosaurs predominate: wildlife, monsters, beasts of burden, and of war. Armored knights ride dinosaurs to battle legions of war-trained Triceratops and their upstart peasant crews. Karyl Bogomirsky is one such knight who has chosen to rally those who seek a way from the path of war and madness. The fact that the Empire has announced a religious crusade against this peaceful kingdom, the people who just wish to live in peace anathema, and they all are to be converted or destroyed doesn't help him one bit.Things really turn to mud when the dreaded Grey Angels, fabled ancient weapons of the Gods who created Paradise in the first place come on the scene after almost a millennia. Everyone thought that they were fables used to scare children. They are very much real.And they have come to rid the world of sin...including all the humans who manifest those vices.The Dinosaur Lords Series#1 The Dinosaur Lords#2 The Dinosaur Knights#3 The Dinosaur Princess"}, {"id": "0671319728", "genre": "Science Fiction & Fantasy", "title": "1632 (Ring Of Fire)", "description": "FREEDOM AND JUSTICE -- AMERICAN STYLE   1632 And in northern Germany things couldn't get much worse. Famine. Disease. Religous war laying waste the cities. Only the aristocrats remained relatively unscathed; for the peasants, death was a mercy.  2000 Things are going OK in Grantville, West Virginia, and everybody attending the wedding of Mike Stearn's sister (including the entire local chapter of the United Mine Workers of America, which Mike leads) is having a good time.  THEN, EVERYTHING CHANGED....  When the dust settles, Mike leads a group of armed miners to find out what happened and finds the road into town is cut, as with a sword. On the other side, a scene out of Hell: a man nailed to a farmhouse door, his wife and daughter attacked by men in steel vests. Faced with this, Mike and his friends don't have to ask who to shoot. At that moment Freedom and Justice, American style, are introduced to the middle of the Thirty Years' War.  Comprehensive Teacher's Guide available."}, {"id": "B01MSJ69DC", "genre": "Science Fiction & Fantasy", "title": "Conflict (Crossover Series)", "description": "While working on a dude ranch in present day Montana, Joe Kuruk saves a young girl from a club-wielding warrior. His confusion is intensified when he realizes that the girl, Alta, has crossed over from another time and place.And the only way to reunite her with her family is to cross back with her.Accompanied by a few friends, Joe crosses into Alta's world only to find her home destroyed by a savage war chief.Then the gate closes behind them.Stranded in the Eleventh Century, on the present day Susquehanna River, Joe and his band fight to create a safe home for the refugee they've gathered.And to prepare for future European contact."}]