[{"id": "8497646452", "genre": "Children's Books", "title": "Atlas histórico del mundo islámico (Atlas históricos)", "description": "This informative and attractive collection provides an in-depth look at some of the most provocative civilizations and religions in history. With photographs, maps, and colored illustrations this text provides an understanding of the politics and culture of ancient civilizations, and the origins of world religions. Con un texto atractivo, mapas, fotgrafías e ilustraciones, esta colección descubre la profunidad de algunos de los espisodios mas transcendentes de la humanidad. Estos libros se adentran en los antiguos politícos y las culturas de Grecia, de Roma y de las civilizaciones precolombianas y descubren con un riguroso tratamiento histórico el origen y significado de las religiones, del Islam y de los lugares biblicos."}, {"id": "B0776K92DH", "genre": "Children's Books", "title": "Alphabet Boats", "description": "Set sail and learn the ABCs with a boat for each letter!Discover twenty-six types of vessels, from the more common--canoe and motorboat--to the unusual--umiak and Q-boat. Just like in Alphabet Trucks and Alphabet Trains, colorful art includes the letters of the alphabet hidden (and not-so-hidden) in supporting roles in the illustrations."}, {"id": "059069328X", "genre": "Children's Books", "title": "Truck Talk: Rhymes on Wheels", "description": "A lively rhyming book considers what different kinds of trucks might say if they were able to talk and is filled with images of such familiar vehicles as tow trucks, fire trucks, and garbage trucks."}, {"id": "1786030454", "genre": "Children's Books", "title": "A World Full of Animal Stories: 50 favourite animal folk tales, myths and legends", "description": "Discover a menagerie of animals with this book that brings together 50 best-loved tales from all around the world! Meet the Big Bad Wolf, the Ugly Duckling, and many other favorite characters from classic stories, myths, and legends in these fresh and vibrant re-tellings. Perfect for reading aloud!"}, {"id": "1534417249", "genre": "Children's Books", "title": "Silverlake Art Show (The Adventures of Sophie Mouse)", "description": "In this thirteenth charming book of The Adventures of Sophie Mouse series, Sophie hosts the very first Silverlake Art Show!Sophie has a brilliant idea: she’s going to host the very first Silverlake Art Show! After all, she loves to draw and paint and she likes looking at art too. With the help of Hattie Frog and Owen Snake, Sophie puts together the whole event. And when the big night comes, she expects to be the star of the show. But she gets a surprise when she realizes…she’s not! Who is this mystery artist that everyone is chirping and buzzing about? With easy-to-read language and illustrations on almost every page, the Adventures of Sophie Mouse chapter books are perfect for beginning readers."}]