[{"id": "1596875127", "genre": "Children's Books", "title": "An Alphabet of Dinosaurs", "description": "Here are twenty-six dinosaurs as they have never been seen before. Dramatic paintings and fascinating new information provide young dinosaur lovers with the latest facts about familiar dinosaurs such as Maiasaura, Stegosaurus, and Tyrannosaurus rex, and introduces newly discovered creatures such as Quaesitosaurus, Riojasaurus, Xenotarsosaurus, and Zephyrosaurus. Running, fighting, jumping, slashing, nesting, and sleeping--these are the dinosaurs in all their glory."}, {"id": "1492659975", "genre": "Children's Books", "title": "I Love My South Carolina Valentine", "description": "It's Valentine's Day in South Carolina, and I just want to say that I love you SO MUCH, and in SO MANY ways! Experience boundless and unconditional love as you travel around your home state in this sweet and colorful story.  Based on Marianne Richmond's bestselling book I Love You So..., I Love My South Carolina Valentine celebrates a parent's love for their child by comparing their love to special characteristics of where they live! This heartwarming book puts into words the often indescribable quality of boundless, steady and unconditional love while using familiar landmarks around them. I Love My South Carolina Valentine is the perfect way to share your love with a treasured child this Valentine's Day!"}, {"id": "1571450750", "genre": "Children's Books", "title": "Adventures of Winnie Wolf (Peek and Find (PGW))", "description": "Children and parents adore these cleverly crafted interactive adventures. Kids get to turn flaps to reveal pop-up surprises on every page; each book also ends with an entire pop-up scene. Maurice Pledger's artwork is painstakingly detailed and resonates with a warmth and joy. Kids will want to explore the natural world with these lovable characters again and again. Series includes: An Adventure with Billy Bunny, An Adventure with Bobby Bear, An Adventure with Charlie Chick, An Adventure with Morris Mouse, An Adventure with Olivia Owl, An Adventure with Oscar Otter, An Adventure with Polly Polar Bear, and An Adventure with Winnie Wolf. Look for Maurice Pledger's Sticker Books and Nature Trail Books."}, {"id": "B000WMINLO", "genre": "Children's Books", "title": "Nursery Rhymes (Nursery Collection Books)", "description": "The Nursery Collection books are enhanced by special touches such as flocking and embossing on the cover and pages. Charming illustrations and soft, pastel colors distinguish the entire collection of traditional nursery rhymes, fairy tales, and lullabies. Nursery rhymes are a traditional part of early childhood. This beautifully illustrated book is filled with well-loved rhymes cherished by generations including One Two Buckle My Shoe, Three Blind Mice, and Little Miss Muffet."}, {"id": "163322418X", "genre": "Children's Books", "title": "GOA Kids - Goats of Anarchy: Polly and Her Duck Costume: + The true story of a little blind rescue goat", "description": "From the Goats of Anarchy farmyard comes Polly and Her Duck Costume! Children and parents will fall in love with this adorable goat and have their hearts warmed by her true story of finding a home.Polly and Her Duck Costume tells the true story of Polly, a little blind goat who was rescued by Leanne Lauricella, rescuer of farmyard animals and founder of the immensely popular Instagram account The Goats of Anarchy. Polly has some trouble adapting to her new life until her new mom gives her a warm and fuzzy duck costume, which turns out to be the perfect fit! Follow along with Polly as she finds love with her new family, gains confidence, and makes new friends with other goats, pigs, and many more animals around the yard. The perfect tale to inspire and delight animal lovers, and to teach children about disabilities and acceptance, Polly and Her Duck Costume pairs beautiful illustrations with a truly heartwarming tale readers of all ages will adore."}]