[{"id": "B000MV8HDY", "genre": "Children's Books", "title": "The New Yellow Bulldozer", "description": "Lift the flaps, pull the tabs, turn the wheels it s motorized fun in a book!Children love large vehicles! Presented here in a sturdy book overflowing with both fun and solid information is one of children s favorite heavy machines a bulldozer. How much more fun children will find viewing a construction site, knowing how a bulldozer works from shovel to gearshift and dipstick to wheels. Using the interactive features in these books, children will gain an immediate understanding of the inner workings of this massive machine."}, {"id": "1406376922", "genre": "Children's Books", "title": "Red and Lulu", "description": "From Matt Tavares comes a heart-tugging story combining all the cheer of Christmas, all the magic of New York City, and the real meaning of the festive season: how important it is to be surrounded by love. Red and Lulu make their nest in a beautiful evergreen tree. It shades them in the hot months and keeps them cosy in the cold months, and once a year the people who live nearby string lights on their tree and sing a special song: O Christmas Tree, O Christmas Tree. But one day, something unthinkable happens, and Red and Lulu are separated. It will take a miracle for them to find each another again. Luckily, it's just the season for miracles..."}, {"id": "0008266042", "genre": "Children's Books", "title": "Maths Puzzles Ages 7-8 (Collins Easy Learning KS2)", "description": "Children will have hours of fun solving these maths puzzles and brain teasing activities. Written to support the primary curriculum, each puzzle is designed to test their problem-solving skills and logical thinking. This fun and motivating maths puzzles book: • Covers key areas of maths that children are required to learn at school.• Includes guidance for parents and answers.• Provides hours of holiday fun."}, {"id": "B005E885ZK", "genre": "Children's Books", "title": "Beast Quest #14: The Dark Realm: Skor the Winged Stallion", "description": "Step into the Dark Realm--home to the most dangerous Beasts yet!As Tom and Elenna navigate the horrid terrain of Gorgonia, they quickly realize that nothing is what it seems to be. Each step brings them to another dangerous encounter. But Tom won't give up. Not when Epos the Winged Flame is being held captive somewhere in the Dark Realm and Malvel has created a wicked winged Beast of his own. With the help of his friends, Tom is determined to chase down the evil wizard and return all of the good Beasts back to Avantia."}, {"id": "1594748969", "genre": "Children's Books", "title": "Kid Artists: True Tales of Childhood from Creative Legends (Kid Legends)", "description": "Hilarious childhood biographies and full-color illustrations reveal how Leonardo da Vinci, Beatrix Potter, Keith Haring, and other great artists in history coped with regular-kid problems. Every great artist started out as a kid. Forget the awards, the sold-out museum exhibitions, and the timeless masterpieces. When the world’s most celebrated artists were growing up, they had regular-kid problems just like you. Jackson Pollock’s family moved constantly—he lived in eight different cities before he was sixteen years old. Georgia O’Keeffe lived in the shadow of her “perfect” older brother Francis. And Jean-Michel Basquiat triumphed over poverty to become one of the world’s most influential artists. Kid Artists tells their stories and more with full-color cartoon illustrations on nearly every page. Other subjects include Claude Monet, Jacob Lawrence, Leonardo da Vinci, Vincent van Gogh, Pablo Picasso, Frida Kahlo, Beatrix Potter, Yoko Ono, Dr. Seuss, Emily Carr, Keith Haring, Charles Schulz, and Louise Nevelson."}]