[{"id": "0785119337", "genre": "Science Fiction & Fantasy", "title": "Essential Official Handbook Of The Marvel Universe Volume 1 TPB", "description": "A picture's worth a thousand words, and there have always been top supplies of both in the ever-moving manuals of marvels and miscreants! Now, witness first-hand the series that started it all in Mark Gruenwald's original fifteen issues worth of secrets, super-powers and schematics! About the best, by the best! Collects OHOTMU #1-15."}, {"id": "152362082X", "genre": "Science Fiction & Fantasy", "title": "The Chrononaut", "description": "The future. Millennia of scientific discovery have led to mankind’s greatest feat: the invention of time travel, a technology with a potential for learning and scientific advancement rivaled only by its potential catastrophic consequences. To prevent such outcomes, the world government has carefully restricted the technology, limiting its use and study to a selected few. Dr. Amelia Lewis is a temporal historian charged with uncovering humanity’s greatest unsolved historical mysteries during her voyages into the timestream. It is on one of these missions that she witnesses something more terrifying than anything mankind has ever encountered—a monstrous entity that exists outside of time itself. Amelia’s journeys into the past have drawn its gaze, and now it seeks to devour her. As she desperately seeks a way a to save herself, Amelia discovers that everyone she cares about is being erased from existence. The fabric of her life is beginning to unravel. Soon, there may not be anything to go back to. BONUS, ALTERNATE ENDING INCLUDED!"}, {"id": "1588466000", "genre": "Science Fiction & Fantasy", "title": "Orpheus", "description": "'This is Radio Free Death  the Voice of the Afterlife. Science thinks its shattered the barrier between life and death, but its only opened the floodgates. Stop meddling with the affairs of ghosts and close the doors before something follows you back through. You should have left some secrets buried, because now they wont go back to sleep without a fight.'  I See Dead People  Its called projecting, the ability to separate the soul from the body and interact with ghosts. Its a multi-billion dollar enterprise for companies like Orpheus Group, which offers its services to public and private interests. Its also a portent of dark things to come. Orpheus is a new type of game, a ghost story for ghosts told in a six-book limited series. Hardcover. Core Book."}, {"id": "1626466971", "genre": "Science Fiction & Fantasy", "title": "The Outrider", "description": "Jake used to be someone once, before the incident that sent him to prison. Now he's back, his existence split between a mysterious spiritual quest within the dreamlands, and the tedium of pumping gas for minimum wage...until the Smilers showed up. This tale goes beyond dark urban fantasy into the realm of occult noir. C. R. Jahn is a bold new voice exploring uncharted territory with this nightmarish depiction of supernatural terror."}, {"id": "1786518848", "genre": "Science Fiction & Fantasy", "title": "The Scorpion's Heart (The Abrasaxon’s Daughter) (Volume 1)", "description": "The dangerous quest to find her father and fix her shattered world brings Brianna more than she ever expected.Brianna is determined to elicit help from her elusive Abrasaxon father, Hakon, to conquer the evil Tyban, Zelig, who has invaded her world. But her journey to the Crystal Castle is full of perils that she and her newfound companions are ill equipped to overcome. Danger comes in many forms—tiny vengeful Nixets, a resurrected Yabix and ruthless Tyban who have crossed into the mortal world.As they surmount each challenge, Brianna wonders if she will ever get control of her newly blossoming—and daunting—magical abilities, and how to handle her growing attraction to her new companion, Amon. Her resentment toward her father for failing to prepare her for the inheritance of her ‘gift’ flares again when a young woman they save from death, Issah, claims to be her sister. But there is no time for ill feeling with the heart of the Abrasaxon existence, the Crystal Castle, dying, and Hakon and his fellow Direktorate members missing. The two girls combine their untested magical abilities to rescue their father and save the twin lands of Okana and Okiyarra from destruction."}]