[{"id": "1596435518", "genre": "Children's Books", "title": "Broxo", "description": "A NEW YORK TIMES BESTSELLERIn this wildly entertaining fantasy debut we meet Broxo, the only surviving member of a tribe of barbarians who once occupied a now-desolate mountain. All alone in the world, Broxo spends his time on the mountain hunting and avoiding the man-eating walking dead that periodically drag themselves out of a fetid lake. Everything changes when Zora, a foreign princess, arrives on the mountain seeking Broxo's lost tribe. Can the two young warriors together defeat the living dead? With accessible and beautiful art, killer fight scenes, and a story that mixes humor, romance, and classic high fantasy, Broxo is a tale you're sure to enoy."}, {"id": "B06XC94NT4", "genre": "Children's Books", "title": "Do You Know Shapes? Do You Know Sizes? Put them Together to Build the World - Baby & Toddler Size & Shape Books", "description": "Let’s build the world with shapes and sizes! Having this understanding will help promote your child’s preparedness for math. Shapes and sizes create a foundation that will be difficult to forget. That is why it is important that you use the right resources today to better form your child’s academic future. Secure a copy now!"}, {"id": "1847804519", "genre": "Children's Books", "title": "Beatles", "description": "How did four cheeky lads from Liverpool ? John, Paul, George and Ringo ? become the greatest rock band in the world? Mick Manning and Brita Granström tell the amazing story of The Beatles with captions and strip pictures for fans of all ages. The story begins? John Lennon?s Liverpool childhood, his Auntie Mimi, his school band The Quarrymen; the developing friendships with Paul McCartney and George Harrison and the forming of The Beatles together with Stu Sutcliff and Pete Best. From amusing adventures in Hamburg to the arrival of manager Brian Epstein and record producer George Martin. Then Ringo Starr joins the group; fame and screaming fans; the famous tour to the USA; the making of the albums, key hit songs and early films? then the later years, with the gigantic Sgt Pepper album, their visit to India, the making of Magical Mystery Tour. Finally the break-up of the band and the new beginnings of solo careers for the Fab Four."}, {"id": "1541913167", "genre": "Children's Books", "title": "Why Were Monasteries Important in the Middle Ages? Ancient History Books | Children's Ancient History", "description": "There were a lot of interesting facts, people and places during the Middle Ages. Among these were the monasteries. You know monasteries as places of meditation and peace. In the old times, they served additional purposes too. In those times, monasteries were as important as any other structure you see. Discover the truths about monasteries. Grab a copy today!"}, {"id": "B015MDJX48", "genre": "Children's Books", "title": "99 Monkeys on a Bus", "description": "One day Bobby saw a bunch of monkeys on a bus. He knew they were real, but his family thought he was just imagining things. Bobby searched everywhere. The pet shop, the vet, even the zoo. Would he be able to find the monkeys and show everyone they really existed?  Suggested age range for readers: 4-7"}]