[{"id": "1936381141", "genre": "Children's Books", "title": "What Kind of Turtle Am I?", "description": "Izzy knows she is a turtle, but has no idea what kind of turtle she is.  Is she a turtle?  Is she a tortoise?  Or is she a terrapin?  In quest of an answer, she roams the land, asking everyone she meets this question: \"What kind of turtle am I?\" [Children's Picture Book (G) released in full color in 2011 from Dragonfly Publishing, Inc. www.dragonflypubs.com | Available in Hardback, Paperback, and PDF eBook]"}, {"id": "0826601219", "genre": "Children's Books", "title": "Bat Mitzvah Reader", "description": "The Bat Mitzvah reader is a compilation of inspirational readings for the Bat Mitzvah girl. The reader includes selections from Scripture, Jewish Law and Chasidic philosophy that were carefully chosen to educate and inspire the young Jewish girl as she approaches Jewish womanhood."}, {"id": "1563976218", "genre": "Children's Books", "title": "Cherry Tree", "description": "Boyds Mills Press publishes a wide range of high-quality fiction and nonfiction picture books, chapter books, novels, and nonfiction"}, {"id": "0778742903", "genre": "Children's Books", "title": "Martin Luther King, Jr. Day (Celebrations in My World)", "description": "Introduces Martin Luther King, Jr. Day, and discusses discrimination against African Americans, Dr. King's life and accomplishments, the origins of the holiday, and the different ways people observe it throughout the United States."}, {"id": "1933241535", "genre": "Children's Books", "title": "Grade 3 Addition & Subtraction (Kumon Math Workbooks)", "description": "Most grade-school workbooks try to cover the full range of topics in one workbook, and as a result do not dedicate enough pages to important mathematical concepts. Kumon's research has found, however, that children find learning easier when they tackle one skill set at a time. With these findings in mind, we designed our newest line of workbooks to help children with one particular mathematical skill set per book."}]