[{"id": "1602209774", "genre": "Children's Books", "title": "Chinese Zodiac Animals", "description": "Children will love to learn all about their Chinese zodiac animal with this great multicultural book for kids.Which Chinese zodiac animal are you? A clever rat? A brave tiger? A hardworking ox? Or an energetic dragon?In ancient China, each sign marked a different year in a 12-year calendar. Over time, people believed that a person's character and destiny were somehow decided by his or her zodiac animal. Chinese Zodiac Animals explains the traits of each animal sign and what luck the future might hold for the person born under that sign. Chinese Zodiac Animals is a fun and informative way to learn about an important part of Chinese traditional culture."}, {"id": "B00NAN9EXI", "genre": "Children's Books", "title": "The Great Big Scary Monster", "description": "Sillier than scary and more little boy than big monster, The Great Big Scary Monster follows a four year old through his daily exploits. In between stepping on flowers and stomping through mud, he somehow finds the time to avoid blowing his nose. The story is told by a mother who, despite living with a creature who “never takes a bath,” knows her great big scary monster is smart, kind, and caring and finds his less civilized traits endearing."}, {"id": "0805002987", "genre": "Children's Books", "title": "The Cow-Tail Switch: And Other West African Stories", "description": "The stories of West Africa are about men and animals, about kings, warriors, and hunters. They tell about clever people and stupid people, about good ones and bad ones, about how things and animals got to be how they are. Some stories in this book will make you think. Some will make you laugh. All of them are retold with folk spirit full of generosity and vitality."}, {"id": "0531116700", "genre": "Children's Books", "title": "Martin Luther King, Jr.: A Man With a Dream (Book Report Biographies)", "description": "Describes the struggles and accomplishments of the Baptist minister who became one of the most important civil rights leaders in the 1950s and 1960s, from the Montgomery bus boycott through the March on Washington to his assassination."}, {"id": "0750297689", "genre": "Children's Books", "title": "The Dalai Lama", "description": "In 1937, a vision led the high lamas of Tibet to an old house in the mountains, with a turquoise roof. Here lived 2-year-old Lhamo Dhondrub, who would go on to become the 14th Dalai Lama. But how did this toddler grow into one of the world's most important religious figures? And why has he been forced into exile?The Dalai Lama looks at his extraordinary story, from his education by monks, deep in the Tibetan mountains, to how he became leader of Tibet aged just 15. The Chinese invasion of Tibet, that forced him to flee his homeland, and begin a new life and government in exile in India, is explained, as is the plight of ordinary Tibetans. The Buddhist faith, and exactly what it means to be a Buddhist, is explored, as is the role it plays in the lives of people around the world. The book also looks at the Dalai Lama's work as a teacher and a leader, and at some of the issues he campaigns for - particularly his environmental activism, and his work to promote religious cooperation and interfaith dialogue."}]