[{"id": "B06XQXZ3W7", "genre": "Children's Books", "title": "The 1919 Winnipeg General Strike", "description": "A city, Winnipeg, in chaos. Manitoba's newly arrived immigrants, seeking better living conditions. Returning WWI soldiers suffering. Humanity's mixture, its desire to thrive. My night table, springing and popping to life. A sequence of events, its story unfolding. Winnipeg's story. Another one of my weird dreams!"}, {"id": "B073ZMSS7L", "genre": "Children's Books", "title": "Mysteries of Machu Picchu (Ancient Mysteries (Alternator Books ™))", "description": "In 1911 an American explorer came across an ancient city hidden high in the Andes Mountains of Peru. Since then, explorers, archaeologists, and tourists have been fascinated by this beautiful and mysterious city known as Machu Picchu. The city appears to have been carefully constructed—every stone is perfectly cut and placed. The Inca people built Machu Picchu at the height of their empire, but no one knows for sure how or why they created it. Read all about the myths and theories surrounding Machu Picchu and its history, as well as the science archaeologists are using to understand this ancient city."}, {"id": "1423142160", "genre": "Children's Books", "title": "African Cats: Sita the Cheetah (Disney Nature African Cats: Level 2)", "description": " This paperback early reader is inspired by the story of the cheetahs in the film. Kids will love the beautiful pictures of a mother cheetah and her cubs, taken as the filmmakers follow their journey. With simple text and full-color images, this level two reader is perfect for newly independent readers."}, {"id": "1619132761", "genre": "Children's Books", "title": "Donkeys (Animal on the Farm)", "description": "Donkeys can hear each other braying from more than 7 miles (11 kilometers) away. They can drink more than 6 gallons (22 liters) of water each day. These engaging facts and more are waiting to be discovered in Donkeys, an Animals on the Farm book."}, {"id": "1429692197", "genre": "Children's Books", "title": "La historia de un pato bebé/A Baby Duck Story (Animales bebé/Baby Animals) (Multilingual Edition)", "description": "Pick and preen. Fluffy feathers fall out. Sleek feathers grow in. What's it like for ducklings to grow up?"}]