[{"id": "185304170X", "genre": "Children's Books", "title": "Garfield's Night Before Christmas", "description": "Full of witty and delightful surprises, Garfield's version of this beloved Christmas poem is sure to be a favorite with fans of the famous fat cat who boasts 13 animated television specials, 13 Emmy nominations, and 4 Emmy Awards."}, {"id": "1426331428", "genre": "Children's Books", "title": "Absolute Expert: Volcanoes", "description": "Get expert insights from National Geographic explorer and volcanologist Arianna Soldati in this lava-hot book, exploding with the latest, most up-to-date geological intel straight from the field.Plunge deep beneath Earth's crust to find out how volcanoes form. Get up close to clouds of ash and molten lava. Learn about the biggest, most extreme volcanic eruptions to date. On the hunt for incredible volcanoes, you'll travel around the globe, dive into the depths of the oceans, journey into space...and so much more!History's most famous volcanic eruptions are all included: Vesuveus, Mauna Loa, Stromboli, Mount Etna, Olympus Mons, and more. With special features, sidebars, wacky trivia, and more, it's the ultimate book to help YOU become an absolute expert on one of your favorite subjects."}, {"id": "B003ZK53HC", "genre": "Children's Books", "title": "Children's Islamic Bedtime Stories 1", "description": "Muslim heritage is rich with stories meant to inculcate Islamic morals and virtue in both children and adults, these however have not been widely available in the english language, until now . This series is a collection of the best of these stories, translated for english readers and is perfect for reading at bedtime to kids."}, {"id": "B06XC19SGM", "genre": "Children's Books", "title": "The Mayflower and Thanksgiving History | Pilgrims Edition | 2nd Grade U.S. History Vol 1", "description": "You celebrate Thanksgiving every year, but do you know why? It’s important to understand the historic background of widely-celebrated festivities so as to fully appreciate them. Thanksgiving is not just about coming together to eat roasted Turkey. It’s a symbolic celebration of good harvest, which helped our ancestors survive in the early 1600s. Open this book to find out more about Thanksgiving!"}, {"id": "0399182012", "genre": "Children's Books", "title": "Minecraft: Guide to Exploration", "description": "The official Minecraft: Guide to Exploration will help you survive. Learn how to find resources, craft equipment and protect yourself from hostile mobs.The world of Minecraft is waiting to be explored. But danger lurks around every corner and survival can prove difficult for even the bravest adventurer. With insider info and tips from the experts at Mojang, this is the definitive guide to exploration for new Minecrafters."}]