[{"id": "0766013987", "genre": "Children's Books", "title": "Mahatma Gandhi and India's Independence in World History", "description": "Traces India's struggle to gain independence, highlighting the life and leadership of Mohandas Gandhi whose tactics of nonviolent protest have become a goal of resistance movements worldwide."}, {"id": "B06XXR7G2T", "genre": "Children's Books", "title": "Books for Kids: Foxes Eat Bugs", "description": "Can I tell you about foxes? Would you like to know what we eat?Foxes Eat Bugs is an illustrated picture book perfect for reading to young children. Your child will love interacting with the fox as he tells readers about himself. This book is geared to children ages 1-5 and acts great as a short bedtime story."}, {"id": "B077YR5ZWG", "genre": "Children's Books", "title": "2-1-2: Christmas: Children", "description": "Title:  2-1-2 Christmas: Children.It is a Haiku Poem (poetry).This is a 2-1-2 Haiku Short Form Qualities/Haiku Short Form Quality.It has eight haiku."}, {"id": "1494389703", "genre": "Children's Books", "title": "From Where Do We Come?: Revisiting Our Past While Paving the Way Forward", "description": "Sophia's curiosity about her identity takes her and big brother, Elijah, on a storytelling journey back to their roots with the help of Big Mama & Grandpa Noah. During their remarkable journey back in time, they are overwhelmed with pride upon discovering how their ancestors used their resilience, intelligence, faith and courage to overcome slavery."}, {"id": "B016PCQFOG", "genre": "Children's Books", "title": "Mayan King: A Young Mayan Searches for His Past in the Harsh Tropical Rain Forrest, Encountering Adventure, Romance & Ancient Warriors.", "description": "A Young Mayan learns that he is a descendant of one of the Mayan Kings.  He goes on a search to bring his people back together again.  He teaches how he survives by foraging in the harsh tropical rain forest.  On his way he encounters adventure and spirits from his ancestors."}]