[{"id": "155748189X", "genre": "Children's Books", "title": "Young Readers Christian Library: Elijah", "description": "Follow Elijah as he bravely serves the living God and confronts Ahab's wicked kingdom. Discover how a dangerous challenge pits Ahab's entire kingdom against one fearless prophet. Who will prevail?."}, {"id": "B06Y1GL2D4", "genre": "Children's Books", "title": "Harper's Young People: February 21, 1882 - An Illustrated Weekly", "description": "This vintage publication from 1882 has been digitally converted to downloadable format with original illustrations. A great classic for the home or classroom, an interesting old-fashioned reference book, and an outstanding find.  "}, {"id": "B01EZMZORW", "genre": "Children's Books", "title": "Story Mode: The Secret Diary Of Jesse: Episode 3: The Last Place You Look (Minecraft Story Mode Book 5)", "description": "I am Jesse, my friends and I have to find Soren and get his \"super TNT \"called Formidi-bomb, the only hope for all of us to destroy the Mega Wither Storm!But what we found in Soren's armoury was deceit and treachory. Locked in a dark chamber deep in Soren's mountain, as the Order of the Stone rides towards certain doom, we must ask ourselves... Can we find a way out of this dark tomb...? Is there any way to cure Gabriel's wither sickness? Would we find a way to defeat the Wither Storm? Or we would remain trapped as it continues its ravenous ramage across the entire world? Only time will tell...Story mode series adapt to the choices you make. The story is tailored by how you play.This is my story AND I made it into a diary."}, {"id": "1460205278", "genre": "Children's Books", "title": "1 Goat, 2 Goat, 3 Goat, 4", "description": "This book was inspired by Doris' neighbor boy, Braden LLoyd, who always walked his goats and shared the arrival of goat babies to her.  The pleasure of watching him out her window walking his goats was always fun.  Thus, the title of this story."}, {"id": "0763611395", "genre": "Children's Books", "title": "Chameleons Are Cool: Read and Wonder", "description": "The ability to change color, a sharp-shooting tongue, and skin covering your eyes -- now THAT is cool.Read and Wonder books tell stories, take children on adventures, and reveal how big and WONDER-full the natural world really is.Back matter includes an index."}]