[{"id": "1426304145", "genre": "Children's Books", "title": "World History Biographies: Anne Frank: The Young Writer Who Told the World Her Story (National Geographic World History Biographies)", "description": "Anne Frank takes young readers back to the dark days of World War II through the story of the famous young diarist. Like teenagers everywhere, Anne wrote about friends, family, movies, her greatest joys, and her deepest fears. Through her vivid, tender entries we experience Anne’s changing world as persecution, hiding, and betrayal become part of daily life in Nazi Europe.Ann Kramer’s superbly illustrated book also celebrates the enduring legacy of Anne Frank. Her story, now known to millions, is an inspiration for young readers—and writers—everywhere. This attractive volume will bring a new generation to a story which should never be forgotten.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "079227072X", "genre": "Children's Books", "title": "In Search of Lemurs", "description": "An experienced naturalist offers a personal account, including colorful illustrations based on field drawings, of her research in Madagascar studying lemurs, the fascinating, strange, and utterly beguiling ancestors of primates, and other unusual creatures, including mongooses and civits."}, {"id": "1567111114", "genre": "Children's Books", "title": "Building America - Statue of Liberty", "description": "The 14-vol. set of Building America chronicles the massive undertakings that mark some of the greatest triumphs of human engineering. These projects are a testament to the boldness of human ingenuity and a tribute to the brave spirit of the American people. It is that special spirit that is now captured in the pages of Building America. Included in these volumes are:   40-45 photos Chronology Glossary Further Reading Section Source Notes  Index"}, {"id": "1429676493", "genre": "Children's Books", "title": "Weapons, Gear, and Uniforms of World War I (Equipped for Battle)", "description": "World War I was one of the messiest and bloodiest wars ever seen. Soldiers often fought from trenches and used gas warfare, grenades, and machine guns. The war also saw great advancements in vehicles and other tools of war. Learn about the uniforms, amazing weapons, and unique gear used by the Central and Allied powers."}, {"id": "0736857354", "genre": "Children's Books", "title": "Rock Climbing: making it to the top (High Five Reading - Blue)", "description": "Provides an introduction to the sport of rock climbing. Includes information on the equipment used, and the different types of climbs."}]