[{"id": "B0776KHG8G", "genre": "Science Fiction & Fantasy", "title": "Terminus Project: Jupiter (Child Prodigy SciFi)", "description": "The Solar System is in civil war. The crew of the Retribution, sent to forcibly re-establish order among the outer planets, is captured and learning the tales of those who turned traitors to Earth. The story of Peter Gabell continues as he and his crew reach Jupiter and take their first command on Europa. As Pluto Cohort attempts to control and defend the colony they find their presence unlooked for and unwanted. How can they defend their post against attack when they face the threat of rebellion from within?"}, {"id": "B075FWF44G", "genre": "Science Fiction & Fantasy", "title": "00 Mayan Thief (The FBI Paranormal Casefiles)", "description": "In her free time, kicking and screaming, she is forced to weed, garden, or teach young apprentice mages – but her collaboration with FBI’s Paranormal Defense Intelligence Unit is what makes Cleo’s blood throb. When somewhat annoying and irritatingly handsome Special Agent Bryan seeks her help to find the band of wayward mages who are stealing priceless Mayan artifacts from museums across the country, she jumps at the chance to risk life and limb for meager pay.Little does she know that the quest would take her from Washington to Ireland and to the temple of mage Scott who is seeking a way to breach the barriers and reach into another universe? Should he succeed, the aftermath of such a portal would be disastrous for the country, perhaps even the continent. Cunning and mute obstinacy may be the only traits she needs to succeed against grave odds, but what she risks are the two things she loves above all: her job and the commune she considers her home."}, {"id": "0786959908", "genre": "Science Fiction & Fantasy", "title": "Cathedral of Chaos - Dungeon Tiles: A 4th Edition Dungeons & Dragons Accessory", "description": "This set of dungeon tiles is unusual in that it includes 4 sheets of dungeon terrain tiles and 2 sheets of tokens to represent spell effects, magical traps, and elemental hazards. Dungeon Masters can use these tiles and tokens to quickly and easily create locations within elemental and settlements, including drow cities.These tiles and tokens are suitable for any Dungeons & Dragons campaign and are compatible with past and future Dungeon Tiles sets. This set gives Dungeon Masters additional location-building options."}, {"id": "151476993X", "genre": "Science Fiction & Fantasy", "title": "Constitution: Book 1 of the Legacy Fleet Trilogy (Volume 1)", "description": "The year is 2650  75 years ago, an alien fleet attacked Earth.  Without warning. Without mercy.  We were not prepared.  Hundreds of millions perished. Dozens of cities burned.  We nearly lost everything.   Then, the aliens abruptly left.   We rebuilt. We armed ourselves. We swore: never again.  But the aliens never came back.   Until now.   With overwhelming force the aliens have returned, striking deep into our territory, sending Earth into a panic. Our new technology is useless. Our new ships burn like straw. All our careful preparations are wasted.   Now, only one man, one crew, and the oldest starship in the fleet stand between the Earth and certain destruction:   ISS CONSTITUTION"}, {"id": "147896166X", "genre": "Science Fiction & Fantasy", "title": "Dragon Storm: Library Edition (Dragon Falls)", "description": "Turn on the charm...According to some (including himself), Constantine is one of the greatest heroes of dragonkin who ever lived. Too bad he's now lonelier than ever and his biggest adventure involves a blow-up sheep--until he has an opportunity to save his kind once again. All Constantine has to do is break into a demon's dungeon, steal an ancient artifact, and reverse a deadly curse. The plan certainly does not involve rescuing a woman.Turn up the heat...Bee isn't sure whether to be infuriated or relieved when Constantine pops up in her prison. The broody, brawny shifter lights her fire in a way no one ever has before, yet how far can she really trust him? Their chemistry may be off the charts, but when push comes to shove, Constantine will have to make a crucial choice: to save the dragons or the woman he's grown to love with fierce intensity."}]