[{"id": "1977704239", "genre": "Science Fiction & Fantasy", "title": "The Prisoner Robert Hueck (TWYW) 8.5 X 11 PULG: The Prisoner (Volume 1)", "description": "Can you imagine entering a world where the battles that take place in your dreams can change your life? A world that is at the mercy of angels and demons battling to reach the Physical Plane, where your everyday life takes place. At the most dangerous city of South America lies the town of Guatire, the birthplace of a young man that will lead you through dimensional travels to a world only seen in your dreams. Travel along the teenaged heroes of this Noir Fantasy saga as they try to stop the DEVIL from escaping his prison in hell, at the same time that international agents attempt to capture a serial killer who has close ties with fallen angels."}, {"id": "B00GJ8IK18", "genre": "Science Fiction & Fantasy", "title": "The Dragon's Tear (The Way of Wolves Book 1)", "description": "Tyyr is a member of Valsair’s secret police. As part of the House of Ravens, she is the first to gather information for her king. She’s a killer, a spy; efficient and self-reliant.Rumors of a dissenting lord passes through the Houses, and Tyyr is sent to investigate. The heart of the matter is a mysterious jewel known as the Dragon’s Tear. Tyyr must take the gem back to the capital, but the escape becomes a game of cat-and-mouse when the new owners want their possession to remain a secret.Half the kingdom is all that separates Tyyr from survival. In the cross country trek, Tyyr’s greatest enemy is her own doubt;  that this time she doesn’t have what it takes to hold herself together."}, {"id": "1511537426", "genre": "Science Fiction & Fantasy", "title": "Tephra: Playing Guide: The Steampunk RPG", "description": "Tephra: the Steampunk RPG needs only a single book to be played: your Playing Guide. This 288 page book is gorgeous, with the award-winning Clockwork Roleplaying System and a ton of lore and art that makes Tephra a fan-favorite setting."}, {"id": "0333761189", "genre": "Science Fiction & Fantasy", "title": "Rats", "description": "It was only when the bones of the first devoured victims were discovered that the true nature and power of these swarming black creatures with their razor-sharp teeth and the taste for human blood began to be realised by a panic-stricken city. For millions of years man and rats had been natural enemies. But now for the first time - suddenly, shockingly, horribly - the balance of power had shifted...'The effectivenes of the gruesome set pieces and brilliant finale are all on its own' Sunday Times"}, {"id": "B00GG0OV58", "genre": "Science Fiction & Fantasy", "title": "Brolach (#1): Dark Paranormal Vampire MFM Romance (The Demon Series)", "description": "For fans of The Black Dagger Brotherhood , 50 Shades, and Twilight, comes a controversial adult tale of alpha vampire warriors who do not sparkle, claiming what is theirs for the survival of their species.From the New York Times bestselling author of A Terrible Love, comes a spin-off serial from a #1 Amazon Erotic Horror Bestselling series.Praise for BROLACH:\" ...While awaiting other books to this series and the originals to these spin offs I attempted to find other Authors of this caliber and have failed! No other authors I have found have brought out as much heat as Eros does.. I literally have to fan myself while reading her work...\" - inkleintoodoBLURB:Ruby is an exotic dancer with a past. Running from a father who is a murderer, she takes to the sea where she lives the quiet and lonely existence of the unseen.One night when her abusive boss lays more than a finger on her, the crowd gets out of hand and an unlikely savior moves to end her misery.Little does Ruby know that there are those who've been searching for exactly what she is.Brolach is a demon warrior with a purpose: to find females with enough demon blood who could be valuable breeders in Hades. Their inclusion would tip the scales in favor of the age old war between heaven and hell, to those who live below.What Brolach doesn't realize is they share a blood tie that neither suspect, one that might make them pay in blood.Please note: this book is dark paranormal romance and deals with serious themes 18+ audience.  In addition, though this is the first installment in The Demon Series, reading both The Druid and Siren Series first, might deepen the reading experience."}]