[{"id": "B006OI3JT6", "genre": "Children's Books", "title": "The Squire's Quest (The Squire's Tales)", "description": "Why is it, Terence wondered, that the things you know most surely are always the things you can’t demonstrate to any one else?And why is it, after all of these years, that Terence is still just a squire, offering advice on how best to scrub the rust spots from armor? But Squire Terence has more to worry about than his place on the social scale. For all the peace and prosperity that has made England famous across Europe, Terence is uneasy. After nearly six months without contact with the World of the Faeries – not even from his old friend, the mischievous sprite Robin – Terence is sure something is rotten in King Arthur's court."}, {"id": "B00IDL0IOQ", "genre": "Children's Books", "title": "Terrific", "description": "It's 1912 and the ocean liners rule the waves.  But what happens when a humble tramp steamer named Terrific befriends the unhappy Mauretania?  A friendship between two ships from different social backgrounds is frowned upon.  Mauretania also has competition in the form of a new ship called Titanic, which is claimed to be unsinkable.  Terrific's simple life is about to take an unexpected turn."}, {"id": "B00C8S9Y4K", "genre": "Children's Books", "title": "Snowbots", "description": "How do the robot children of Clackentown spend snow days? They have supersonic snowball fights, make robot angels with wing nuts moving up and down, take hot oil baths to thaw out the joints, and receive eskimo kisses on metal noses at bedtime.Author Aaron Reynolds and illustrator David Barneda team up to tell a hilarious story about two favorite subjects—robots and snow days!"}, {"id": "0764163159", "genre": "Children's Books", "title": "Who's Hiding? In the Garden: A Lift-the-Flap Book (Who's Hiding? Books)", "description": "All of the delightful  board books for Baby feature brilliant color photo illustrations with flaps to lift and friendly creatures hiding behind each of them. The books present five two-page spreads with a “Who’s hiding?” question on each left-hand page and a flap hiding various animals on the right-hand page. Babies will be amused as they turn from one spread to the next―until they find a surprise on the very last spread. When they lift that final flap they uncover a mirror that shows them their own smiling face! Five flaps to lift in Baby’s garden will reveal butterflies, ladybugs, frogs, snails, and Baby’s own face."}, {"id": "B017TAW44S", "genre": "Children's Books", "title": "If I Were a Rainbow (A Happy Multicultural Book)", "description": "What can a flower, an apple, a cloud in the sky, a pumpkin, even a raindrop teach a child? Perhaps to share what each has to offer.Charming, whimsical images bounce along with the rhyme to set a child’s imagination soaring. Lots of fun. Lots of ideas to spark more fun and more ideas."}]