[{"id": "0613287622", "genre": "Children's Books", "title": "Blazer Drive (Lightning on Ice)", "description": "When Josh Ellroy, left-winger for the Kamloops Blazers, and his dad find more than a dozen dead cattle on the family ranch, Josh has some serious decisions to make. On one hand, the Western Hockey League playoffs are ahead, plus a chance to play in the National Hockey League. On the other hand, there's a beautiful and interesting girl who believes more prize bulls will be killed. Josh is afraid of what will happen if he gets involved. As he learns more, he's afraid of what will happen if he doesn't."}, {"id": "B008761VNE", "genre": "Children's Books", "title": "The Howling Throne", "description": "\"Sparkling like an aged emerald, the wolf’s eyes glistened under the moonlight. He stared down the mountain into the snowy depths of the valley before him. 'What does it mean?' His snout raised to the broken clouds, 'What does it mean?'\" Hidden from man. Ruled by wolves. Watched by gods. This is the Kingdom of Vaal. Short of food and with the weather closing in, the Silver Manes must decide whether or not to leave their home and hunt farther afield - But, starvation is not the only thing that threatens them... Discover the truth, the treachery and the dark secrets behind the legend of The Howling Throne. The journey begins..."}, {"id": "1403490856", "genre": "Children's Books", "title": "The Inside & Out Guide to Inventions (The Inside & Out Guides to)", "description": "This book takes a fascinating look at new ideas that changed the world. From computers and telephones, through cameras, cars, and steam engines, ghosted-through artwork reveals the genius behind these amazing innovations."}, {"id": "0606230955", "genre": "Children's Books", "title": "Ruby's Cupcakes (Turtleback School & Library Binding Edition) (Max & Ruby)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When Max keeps flying his toy airplanes into the kitchen, making a mess while Ruby is baking cupcakes for the bake sale, she thinks he is being a pest, but soon realizes that Max and his planes can be very helpful."}, {"id": "1614790345", "genre": "Children's Books", "title": "Scooby-Doo! Picture Clue (Scooby-Doo! Picture Clue Books)", "description": "The Scooby-Doo Picture Clue books are based on the traditional \"rebus Reader\" - using a picture as a tool for learning a word. This gives readers a sense of pride that they are \"reading\" the story. Begin the transition to reading with your young student's favorite cartoon character!\n \n Aligned to Common Core Standards and correlated to state standards.\n \n Beginning Readers is an imprint of Spotlight, a division of ABDO."}]