[{"id": "0060885750", "genre": "Children's Books", "title": "Dumpy's Valentine (My First I Can Read)", "description": "It's Valentine's Day, and poor Trusty the Mail Truck has broken down. Dumpy offers to lend a hand, and with Charlie and Pop-Up's help he delivers surprises all over town. But what about Trusty? Will he get a valentine this year?"}, {"id": "0062422790", "genre": "Children's Books", "title": "Paddington Classic Adventures Box Set: A Bear Called Paddington, More About Paddington, Paddington Helps Out", "description": "Paddington Bear had just traveled all the way from Peru when the Brown family first met him at Paddington Station. Since then, their lives have never been quite the same . . . for ordinary things become extraordinary when Paddington is involved.This beautiful boxed set includes brand-new paperback editions of the first three classic novels chronicling Paddington's heartwarming adventures: A Bear Called Paddington, More about Paddington, and Paddington Helps Out.With the original text by Michael Bond and black-and-white illustrations by Peggy Fortnum, this boxed set is perfect Paddington fans old and new."}, {"id": "1406377341", "genre": "Children's Books", "title": "Skip to the Loo! A Potty Book", "description": "Sally Lloyd-Jones's riotous narration and Anita Jeram's endearing illustrations make this a charming and energetic invitation to potty trainees everywhere.Bunny wants his potty. What will Bunny do? Only one thing for it . . . skip to the loo! Bunny's not the only one skipping to the loo. Look who else wants their potty! Quite a few. . . .With rollicking rhythm, Sally Lloyd-Jones gets the party going in a book that simply rejoices in the call of nature. Everyone is invited to celebrate—from a lonely dodo to a wibbly woo, from Lord and Lady Huff Puff to an elephant in a tutu. But when the party is in full swing and everyone's on their potty, Bunny sees that someone very important is missing. Who could it be?"}, {"id": "B0068EVY8E", "genre": "Children's Books", "title": "The Land of the Silver Apples (Sea of Trolls Trilogy)", "description": " THE CHILDREN  FROM THE SEA OF TROLLS  BRAVE THEIR WORST  NIGHTMARES -- UNDERGROUND.  Jack is amazed to have caused an earthquake. He is thirteen, after all, and only a bard-in-training. But his sister, Lucy, has been stolen by the Lady of the Lake; stolen a second time in her young life, as he learns to his terror. Caught between belief in the old gods and Christianity (790 AD, Britain), Jack calls upon his ash wood staff to subdue a passel of unruly monks, and, for his daring, ends up in a knucker hole. It is unforgettable -- for the boy and for readers -- as are the magical reappearance of the berserker Thorgil from a burial by moss; new characters Pega, a slave girl from Jack's village, and the eager-to-marry-her Bugaboo (a hobgoblin king); kelpies; yarthkins; and elves (not the enchanted sprites one would expect but the fallen angels of legend). Rarely does a sequel enlarge so brilliantly the world of the first story. Look for the conclusion in The Islands of the Blessed in 2009."}, {"id": "0515157090", "genre": "Children's Books", "title": "Christmas Fun Mad Libs: Deluxe Stocking Stuffer Edition", "description": "This deluxe edition of Christmas Fun Mad Libs features a festive, full-color interior and bright and shiny red and green foil on the cover. It's the perfect stocking stuffer for kids and adults who can't get enough Christmas fun!"}]