[{"id": "1434292185", "genre": "Children's Books", "title": "Valentine's Day and the Lunar New Year (Batman: Li'l Gotham)", "description": "On Valentine's Day, Joker's plans to become Cupid backfire when all of Gotham's women relentlessly pursue him. Will Batman be able to save the Joker from the not-so-angry mob--not to mention Harley Quinn's wrath? Then, during the Lunar New Year's celebration in Chinatown, a rare artifact is stolen. Damian Wayne, Bruce's son, takes the case. Along the way, he gets a history lesson from Alfred in addition to a real mean martial arts lesson from Katana! Each library bound book in this action packed series features a comics glossary, visual discussion questions, and writing prompts."}, {"id": "1595985158", "genre": "Children's Books", "title": "Hi, My Name Is Max!: Living It Up with Down Syndrome", "description": "Max Elliott was born with Down Syndrome. His mother, Mary Elliott, is on a loving crusade to help children and adults realize that Max is really just like them. They don't need to be afraid of Max because he looks and acts differently. He is smart, kind, funny, and gentle. He loves sports and spending time with other children.  *Hi, My Name is Max!* is a delightful teaching and learning book for all ages. A portion of the proceeds from the sale of this book goes to the development of the Max Wade Children's Academy, where other children like Max can play, learn, and excel."}, {"id": "1629895644", "genre": "Children's Books", "title": "Thunder: An Elephant's Journey", "description": "A young African pygmy elephant must confront his fears to fulfill a dream and become a legend…. Thunder, a young pygmy forest elephant, sets out on a journey to find his mother after he escapes capture by poachers. With danger at every turn in the central African jungle, he must face his fears to survive. Some unlikely friends: Soma, a cranky rhino; Frederick, a nutty pink flamingo; Penelope, a chatty parrot; three kooky egrets; and Jennetta Blue, a blue butterfly; help him with his dream to find his mother and fulfill his quest to be reunited with his herd."}, {"id": "0746006713", "genre": "Children's Books", "title": "The Usborne Book of Tractors (Young Machines Series)", "description": "Describes different kinds of tractors, combine harvesters, and loaders, as well as their accessories, such as seed drills and manure spreaders"}, {"id": "1429699973", "genre": "Children's Books", "title": "Stock Car Racing (Super Speed)", "description": "Stock car races are some of the most popular events in all of sports. Thousands of fans pack the stands at superspeedways to cheer for their favorite race teams. Jump in for a close-up look at powerful stock cars, how they work, and the races they compete in."}]