[{"id": "1894525558", "genre": "Science Fiction & Fantasy", "title": "Shields of Justice: A Hero's Almanac", "description": "Shields Of Justice is a detailed gaming guide to the danger-filled world of the superhero. The book features guidelines covering superhero teams, tool of the trade, threats and dangers, archetypes, and methods of operation. Shields Of Justice also includes sample characters for both the D20 and Tri-Stat and Systems, and more details on the Empire City campaign setting. Learn what being a hero is all about!"}, {"id": "0971324115", "genre": "Science Fiction & Fantasy", "title": "Interludes: Brief Expeditions to Bluffside (d20 Fantasy Roleplaying Supplement)", "description": "With the first flakes of winter snow in the air, your party finally sees the end of their long journey in the hamlet of Kirkwood. Fornheim, the caravan master, has paid you well for keeping him and his profits safe for the last four months. Your escort is at an end. Bluffside, city of wonder and excitement, calls. Just a few loose ends and you can leave for your new lives of action and adventure. An adventure for 4 player characters of 2nd level of play (can be adjusted accordingly). Also includes the following: 12 new Creatures 2 new Spells 11 new Items 2 new Prestige Classes (one done by Monte Cook) 2 new feats 12+ new Places of Interest (POIs) in Kirkwood 30+ new NPCs"}, {"id": "1780749562", "genre": "Science Fiction & Fantasy", "title": "The Return of the Young Prince", "description": "With specially commissioned illustrations by Pietari Posti, and a foreword by Antoine de Saint-Exupéry’s nephew,THE RETURN OF THE YOUNG PRINCE will be cherished by children and adults alike across the globe. Even princes from faraway planets do not always remain small. Eventually they grow up and \u0096 no longer content with their tiny planet \u0096 set off once again to explore the universe anew. So the Little Prince, now a teenager, one day returns to Earth and finds himself on a lonely country road in the vast, desolate plains of Patagonia. There he meets the narrator of this novel, who rescues him and takes him on a journey. Slowly the Prince shares the stories of his adventures, and together they begin to explore some of life’s most important questions, taking readers along with them on a wonderful spiritual journey. An inspiring, life-changing book."}, {"id": "1142525171", "genre": "Science Fiction & Fantasy", "title": "The World's Great Masterpieces: History, Biography, Science, Philosophy, Poetry, the Drama, Travel, Adventure, Fiction, Etc. ...", "description": "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book."}, {"id": "1559581301", "genre": "Science Fiction & Fantasy", "title": "Ultima: The Avatar Adventures (Secrets of the Games)", "description": "ORIGIN, creator of both the Ultima and Wing Commander series, has nearly two million loyal game followers worldwide. An official collaboration between Prima and ORIGIN has produced the first book that \"walks through\" the complete Avatar trilogy (over 500,000 sold in North America alone). In addition, this is the first trade book of cover Ultima VII."}]