[{"id": "1508193630", "genre": "Children's Books", "title": "Gorgeous Geckos (Reptile Adventures)", "description": "From the house to the wild, geckos can be found all over the place. A charismatic gecko invites readers on the adventure of its life in this engaging book. Bright photographs showing geckos of many varieties paired with simple and enlightening text help readers learn about these wonderful reptiles and their important role in nature. This entertaining narrative will appeal to even reluctant readers and support elementary life-science curricula. Animal lovers of many ages will love this book, which is sure to be a popular addition to any library or classroom."}, {"id": "1512440078", "genre": "Children's Books", "title": "Electricity Investigations (Key Questions in Physical Science)", "description": "You probably know that electricity powers your computer and other electronics. But what is electricity? How does it work and where does it come from? Scientists have been asking questions about electricity for centuries. Does it come from frog muscles? Can magnets create electricity? How could people harness the energy from gas or wind to power devices far away? Scientists have asked all these questions and more, and they've conducted countless experiments to learn the answers. Find out what they discovered and how we use electricity to power homes and businesses."}, {"id": "1680484540", "genre": "Children's Books", "title": "All About Trains (Let's Find Out!)", "description": "One of the fastest ways for many people to travel together over land is by train. Although train travel in America is not as popular as it was a century ago, it continues to convey a sense of mystery and romanticism in our minds. This fully illustrated, informative resource for young readers introduces the history of the railroad, explains how trains are powered, examines modern high-speed trains used in other parts of the world, and looks to the future of train travel."}, {"id": "1680785532", "genre": "Children's Books", "title": "Katie Ledecky (Big Buddy Olympic Biographies)", "description": "Presents a profile of the Olympic athlete, describing her early life, her training, her performance in the Olympic Games, and her life outside the pool."}, {"id": "0794508405", "genre": "Children's Books", "title": "Diggers And Cranes (Usborne Big Machines)", "description": "Describes construction vehicles, specifically different kinds of diggers and cranes, explaining what parts of the vehicles are used for what purpose."}]