[{"id": "0060296275", "genre": "Children's Books", "title": "All the World's a Stage", "description": "This is young William, His mind all ablaze, Who stays up all night Writing poems and plays.And this is a book, unforgettable and wise, that applauds inspiration, creation, story, and the world and works of William Shakespeare.Illustrated by Caldecott Honor artist Anita Lobel, All the World's a Stage pays tribute to the act of turning words into art."}, {"id": "1424556406", "genre": "Children's Books", "title": "The Big Flood: The Story of Noah and the Ark", "description": "The Big Flood is the biblical story of Noah and the Ark in a rhyming, fun format. The story teaches about how much faith Noah had to build such a big boat to carry so many animals in a flood only God told him about. Each page is beautifully illustrated and includes scripture references from Genesis 6 - 9. The book ends with a Salvation page for your child to fill out with their name for a personal commitment to Christ. "}, {"id": "1492376574", "genre": "Children's Books", "title": "Fairy Penguin (1)", "description": "Fairy Penguin loves to play and has many adventures to share with you. The stories are full of fun simple rhyming text and colourful pictures enabling children to interact with the stories. Fairy Penguin adventures are aimed at children's aged between 0-6yrs."}, {"id": "1429648279", "genre": "Children's Books", "title": "Play Soccer Like a Pro: Key Skills and Tips (Play Like the Pros (Sports Illustrated for Kids))", "description": "Scoring a game-winning goal is the dream of many players. But pro players work hard on many other skills like passing, slide tackling, and blocking goals to help their teams find success on the field. Try out the tips inside to play soccer like a pro!"}, {"id": "B077DHVBSR", "genre": "Children's Books", "title": "Goofy & Fun Thanksgiving Stories for Kids: 20 Wacky Short Stories for Children (Funny, Spooky, hilarious)", "description": "20 of the Best Short Stories Kids LoveDo you love stories that make both kids and parents laugh out loud?  Then you HAVE to check out this series today!!Includes: 1.  Ms. Crow's Thanksgiving2.  The Owl Detective3.  The Chatroom (from the Chestnut Elementary Series)4.  Off the Forbidden Planet5.  The Amazing Mr Woodchuck's Magic Show 6.  The Incident at Chestnut Elementary School7.  Ms. Crow's Halloween Party8.  Ms. Crow's Family ReunionAnd 12 more exciting short stories for kids!!!These stories are packed with twists and turns stories that will have you on the edge of your seat.  Some of these stories are spooky and might scare you, some are adventurous and take you to outer-space, and some are sweet and teach children valuable lessons.  One thing is for sure...once you will keep coming back for more.**This deal won't last long!   Scroll up and click \"Buy Now\" to reserve your copy forever!**"}]