[{"id": "1501161814", "genre": "Science Fiction & Fantasy", "title": "The Dark Tower II: The Drawing of the Three", "description": "Now a major motion picture starring Matthew McConaughey and Idris Elba  The second volume in Stephen King’s #1 bestselling Dark Tower Series, The Drawing of the Three is an “epic in the making” (Kirkus Reviews) about a savage struggle against underworld evil and otherworldly enemies.“Stephen King is a master at creating living, breathing, believable characters,” hails The Baltimore Sun. Beginning just less than seven hours after The Gunslinger ends, in the second installment to the thrilling Dark Tower Series, Roland encounters three mysterious doorways on a deserted beach along the Western Sea. Each one enters into a different person’s life in New York—here, he joins forces with the defiant young Eddie Dean, and with the beautiful, brilliant, and brave Odetta Holmes, to save the Dark Tower. “This quest is one of King’s best…it communicates on a genuine, human level…but is rich in symbolism and allegory” (Columbus Sunday Dispatch). It is a science fiction odyssey that is unlike any tale that Stephen King has ever written."}, {"id": "1596068523", "genre": "Science Fiction & Fantasy", "title": "The Father of Lies", "description": "Bringing together K. J. Parker's recent novellas and novelettes, totaling over 500 pages of wry, twisty fiction, Father of Lies delves into the arcane as never before. Set amid the world of Parker's critically acclaimed novels and award winning stories, as well as our own, this volume reveals a side rarely glimpsed in his other works. Contained herein are the tales of creatures that pluck the strings of existence, exposing the seedy underbelly of ultimate power as only Parker can.It begins with love, as it often does. In All the Things We Do for Love, Parker demonstrates the age old proverb “be careful what you wish for, you just might get it.” It continues with a fall from grace, in Downfall of the Gods, where a daughter of heaven unwittingly pits herself against her divine family. Demonic pacts are everywhere, in The Devil You Know, where Parker returns to Saloninus, his iconic character who will finish what he started so many years ago. It ends with a beginning, in No Peace for the Wicked, as a New Pope is chosen to push back the darkness.Filled with Parker's hallmark wit and biting humor, Father of Lies is an essential collection, not just for the dedicated fantasist, but for anyone committed to a great story well told. Like all of K. J. Parker's brilliant fiction, these stories whisper the truth. Just ask yourself, can you trust the Father of Lies?"}, {"id": "B019R893YY", "genre": "Science Fiction & Fantasy", "title": "The Earl and the Artificer (The Ingenious Mechanical Devices Book 3)", "description": "What mysteries lay buried beneath weeds and dust?Following their wedding, Eilian and Hadley Sorrell journey to Brasshurst Hall, his family’s abandoned ancestral home. As Eilian struggles to reconcile his new roles as husband and earl, he finds the house and the surrounding town of Folkesbury are not as they first appear.Behind a mask of good manners and gentle breeding lurks a darker side of Folkesbury. As the Sorrells struggle to fit in with the village’s genteel society, they find their new friends are at the mercy of Randall Nash, a man who collects secrets.Soon, Eilian and Hadley become entangled in a web of murder, theft, and intrigue that they may never escape, with the manor at the heart of it all. Something long thought lost and buried within Brasshurst’s history has been found—something worth killing for."}, {"id": "B01M3Z8J5A", "genre": "Science Fiction & Fantasy", "title": "Resist: A Vampire Blood Courtesans Romance", "description": "My sister has disappeared into the shadowy vampire world of Blood Courtesans, where blood and sex are money, and humans are sold to the highest bidder.I’m Anya, and I hate vampires. They killed my aunt. And now they’ve stolen my sister. I can’t let her die, so I head to Chicago to track her down.Before I can find her, I’m assaulted by two human thugs, and of all the luck, a vampire comes to my rescue. Cam is sexy as sin with an accent that melts panties, and he hasn’t eaten in far too long. And now he's offering to help track down my sister… no strings attached.Yeah, right.The Blood Courtesans Series, where vampires are real, rich, powerful--and hungry.Blood is bought and sold like fine wine, and the best blood goes to the highest bidder.It's not supposed to be about love ... until it is.If you haven't checked out the rest of the Blood Courtesan series, you should. Starting with REBORN, Myra's story. The full list of books can be found here: http://www.bloodcourtesans.com."}, {"id": "1565042786", "genre": "Science Fiction & Fantasy", "title": "Constantinople by Night (Vampire - the Dark Ages)", "description": "Come to doomed Constantinople, would be Heaven on Earth and wonder of the Dark Medieval world. Walk it's torch lit streets and lavish bazaars. Indulge in the decadent pleasures of a thousand realms. Be on your guard, though. Intrigue layers upon intrigue in this ancient lair of Caine's children, and impending invasion threatens to send this golden paradise toppling into the abyss. Constantinople By Night carries Vampires \"By Night\" series into the world of Vampire: The Dark Ages."}]