[{"id": "1552090949", "genre": "Children's Books", "title": "I Promise I'll Find You", "description": " A beloved classic continues to reassure children.  I Promise I'll Find You is a moving story that parents will love reading to and sharing with their children again and again.  The fear of being separated from loved ones is a universal emotion. Consider a child who feels lost -- wandering away from home, becoming separated in a crowd, or feeling frightened in a new and strange place?  I Promise I'll Find You is a perennial favorite of parents and children alike; it's like a comforting hug, a warm lap, a reassuring kiss, and the enveloping arms of a parent who pledges, no matter what happens: \"I promise I'll find you.\"  In eleven warm and simple verses, Heather Patricia Ward delivers a timeless message of reassurance. Sheila McGraw's imaginative illustrations show a devoted mother and an amusing dog as they search the world over for a lost child: at sea, in the city, over mountains, and even in outer space.  Together, parents and children will enjoy the gentle language and the calm, reassuring pictures of this thoughtful and important book. "}, {"id": "1974649970", "genre": "Children's Books", "title": "Farmer's Journal For Kids: Farmers Notebook (Farming Books For Kids)(V5)", "description": "Capture Your Farming Memories Keepsake JournalFarmers have the best stories to tell and this farmer’s notebook is the perfect place to capture them. At 6x9 and 108 lined pages it fits nicely on the back of the toilet beside the latest equipment magazine.Makes the perfect farmers gift for kids who love farming and the adults who raise them. Just imagine reading all the stories Grandpa used to tell when you can no longer see him.We have made the interior prompt free so you can write what you want where you want.Start recording those farming memoirs today and pass on your awesome wisdom and advice for generations to come.Whether you raise chickens, cows, pigs, goats or grain you will never forget the important dates and details with your new farmer’s journal.Scroll and grab a gift for the farmer you love today."}, {"id": "0822569914", "genre": "Children's Books", "title": "Dance of the Swan: The Story About Anna Pavlova (A Creative Minds Biography)", "description": "Born in St. Petersburg, Russia, in 1881, Anna Pavlova grew up dreaming of becoming a prima ballerina. Throughout her lifetime, Anna inspired and encouraged people around the world with her exceptionally graceful and expressive dance. Believing that expressing beauty is essential to the human spirit, Anna strove to help audiences discover the soaring beauty that could uplift their spirits."}, {"id": "0983345406", "genre": "Children's Books", "title": "The Newest Duke Blue Devils Basketball Fan!", "description": "What's It Called? Duke University Blue Devils Basketball will have Duke's littlest Blue Devil basketball fans learning about Blue Devils basketball, yelling out landmarks, elements of the game of basketball from shooting to dunking and even singing the fight song. It s the first book a Blue Devil fan should own. For fans aged 0-5."}, {"id": "1481479849", "genre": "Children's Books", "title": "Full of Fall", "description": "Discover the magic—and the science—behind fall leaves with this companion to the celebrated Raindrops Roll and Best in Snow.With gorgeous photo illustrations, award-winning author April Pulley Sayre explores the transformation trees undergo in fall. The book takes readers through the leaves’ initial change from green to red, yellow, and orange, the shedding of the leaves, and the leaves crumbling as winter approaches. Extensive back matter explains the science behind this process to the youngest of budding scientists."}]