[{"id": "1409390969", "genre": "Children's Books", "title": "Monsterrifc Comic Collection. (Moshi Monsters)", "description": "Luvli laugh, Poppet giggle, Furi guffaw, Zommer snort, Diavlo snigger and Katsuma chuckle your way through this hilarious Moshi Monsters comic collection! It'll have every little monster in stitches!Includes exclusive virtual gift fro your room!Adopt your own Moshi Monster now at www.moshimonsters.com"}, {"id": "0802784399", "genre": "Children's Books", "title": "Trapped by the Ice!: Shackleton's Amazing Antarctic Adventure", "description": "In 1914, while attempting to be the first people to cross the Southern Polar Cap, Shackleton and his men find themselves in a very dangerous situation after their ship is crushed by ice and are forced to find their way back to civilization on foot."}, {"id": "0753402238", "genre": "Children's Books", "title": "Human Body (Zoom in on)", "description": "Find out how we work and how we should look after ourselves in this informative book. It includes ways to test your senses and reflexes, plus a story about a penpal from another world."}, {"id": "0385373961", "genre": "Children's Books", "title": "Flower Power! (DC Super Friends) (Little Golden Book)", "description": "Girl—and flower—power! Wonder Woman and Batgirl team up to stop Poison Ivy in their first-ever action-packed Little Golden Book. Girls and boys ages 2 to 5 will love this all-new Little Golden Book featuring the female superheroes of the DC Super Friends."}, {"id": "168152113X", "genre": "Children's Books", "title": "On a Safari 5, 10, 15: A Counting by Fives Book (1, 2, 3  Count with Me)", "description": "Six new books in this colorful series introduce beginning math concepts. Count by 2s, 5s, 10s, and even all the way up to 100! Each book increases number familiarity, counting, and math skills, while also introducing fun facts about popular early childhood topics. Count up to 50 by fives, learning about African animals that live on the savanna."}]