[{"id": "189556946X", "genre": "Children's Books", "title": "Great Paper Jets", "description": "Your imagination and creativity will take flight as you make paper airplanes modeled after all kinds of jets, from the Messerschmitt ME 262 to the CMC Leopard. And the fun doesn't end when the construction does, because your planes will fly as paper gliders. Try your hand at crafting these paper models: * Gloster Meteor F1 * Lockheed P-80 Shooting Star * Mikoyan-Gurevich MiG-9 * North American F-86 Sabre * de Havilland Comet * Boeing 747 Jumbo Jet * Concorde SST * Airbus A310 * Avro Arrow * General Dynamics F-16 Falcon * Mikoyan Mig-29 * Lockheed F-117 Nighthawk * Lockheed F-22 * Gates Learjet Model builders and future aviators--set your sights on hours of enjoyment! 96 pages (all in color), 8 1/2 x 10. "}, {"id": "1535040734", "genre": "Children's Books", "title": "Buses for Kids: A Children's Picture Book about Buses: A Great Simple Picture Book for Kids to Learn about Different Types of Busses", "description": "Did you know that the NEOPLAN Jumbocruiser, an articulated double-decker coach, is the world's largest bus? Did you know that there are specialized buses that transport passengers for sightseeing tours over snow or ice? More trivia and fascinating information about buses are featured in this book especially made for young learners. Over ninety buses from luxury coach to buses that ply the streets, from classic buses to the newest ones, different brands, and more are presented in this book. Each bus comes with its beautiful picture and easy to understand fun fact to fuel your child's fascination with buses. It is truly great book for children to enjoy with the family."}, {"id": "0780745086", "genre": "Children's Books", "title": "El Cumpleanos de Moira/Moira's Birthday (English and Spanish Edition)", "description": "Moira's having a birthday. When Moira wants to invite all the kids at school, and her parents say she can invite six, the stage is set for chaos."}, {"id": "1620574446", "genre": "Children's Books", "title": "Trace Letters, Ages 3 - 5 (Big Skills for Little Hands®)", "description": "In Trace Letters, your child will practice holding a pencil or crayon correctly while tracing each letter of the alphabet. Your child will develop the fine motor control needed for Kindergarten while also learning to recognize each letter and it's sound!"}, {"id": "B009RC0MXC", "genre": "Children's Books", "title": "Cave Spiders! Learn About Cave Spiders and Enjoy Colorful Pictures - Look and Learn! (50+ Photos of Cave Spiders)", "description": "Are your kids interested in Cave Spiders? Awesome! You have found the right book. Help your children learn more about Cave Spiders today by reading this book. Here is what is included inside \"Cave Spiders! Learn About Cave Spiders and Enjoy Colorful Pictures – Look and Learn!\"... Cave SpidersCave Spider SpeciesArachnidsCave Spider PicturesCave Spider FactsBaby Cave SpidersCave Spiders RunningCave Spider FoodCave Spiders EatingFun Cave Spider FactsAnd Lots More! Includes over 50 high quality photos of Cave Spiders! Other bonuses inside \"Cave Spiders! Learn About Cave Spiders and Enjoy Colorful Pictures – Look and Learn!\"...This book has photos of Cave Spiders.This book has info on Cave Spiders.This book has facts on Cave Spiders.This book will help you learn. Buy the \"Cave Spiders! Learn About Cave Spiders and Enjoy Colorful Pictures – Look and Learn!\" book right now!"}]