[{"id": "1338029819", "genre": "Children's Books", "title": "Supergirl: Daughter of Krypton (Backstories)", "description": "Who is Supergirl? How did she become a powerful Super Hero? What powers does she use to fight for what is right? Who are her toughest allies and fiercest foes? In this biography--complete with black-and-white illustrations, timelines, and character profiles--young readers will delight in learning the complete history of the last Daughter of Krypton."}, {"id": "B00BR9YTB4", "genre": "Children's Books", "title": "Bristol Motor Speedway (Edge Books)", "description": "Discusses the track design, the history, and some exciting races at Bristol Motor Speedway in Bristol, Tennessee. Includes a track diagram."}, {"id": "1783122560", "genre": "Children's Books", "title": "Micro Monsters: Activate Augmented Reality Minibeasts! (iExplore)", "description": "You usually can’t see these micro monsters—but now, with iExplore AR, you can!  Take a look at all the amazing tiny creatures that live all around us! These micro monsters are normally invisible to the human eye, but the digital magic in this incredible book gives you a close-up view and 11 brilliant interactive experiences. Breathtaking SEM (Scanning Electron Microscope) photos show what these tiny beasts really look like, and fact-filled spreads provide background information on each one: where it's found, what it does, and how it survives on your skin, on pillows, and even in outer space! Trigger the AR action with your smartphone or tablet and awaken creepy, scary fleas, ticks, and tardigrades, all magnified hundreds of times in full 3D!Click on the app’s NEW iExplore feature window to access complementary educational content, featuring facts, stats, quizzes, and much more!"}, {"id": "1448850096", "genre": "Children's Books", "title": "3: The St. Louis Cardinals (America's Greatest Teams)", "description": "St. Louis has good reason to be proud of its baseball team. The Cardinals have captured an amazing 1 World Series championships. Over the years, the team has showcased a long line of spectacularly talented players, including Rogers Hornsby, who won the Major League Baseball Triple Crown twice during the 192s, and Albert Pujols, who many consider today’s best baseball player. This colorful book, which includes a timeline, photoglossary, and engaging text takes readers on a tour of this great American team."}, {"id": "B005PYXEW2", "genre": "Children's Books", "title": "Weezie, the Elephant with Allergies", "description": "Weezie is an elephant with an unusual problem. He is sick of living in an orphanage, but how will he ever get adopted when he leaves every visitor in a puddle of snot?This lightly illustrated short story is perfect for children ages 4-10. They will love the gross aspect of it, but will also learn an important lesson about acceptance and true friendship."}]