[{"id": "B00JS272R0", "genre": "Children's Books", "title": "ABC Animals: Fish", "description": "Enjoy award winning photos of fish and aquatic organisms with your ABC learner. Photos of A-Z fish are followed by photos and diagrams of fish anatomy, fish diets and photos of selected underwater habitats. Meet a few venomous fish. Help your child have fun with science!"}, {"id": "1478752866", "genre": "Children's Books", "title": "Sebastian's Journey", "description": "WHO WILL RESCUE A TINY PENGUIN ADRIFT ON AN ANTARCTIC ICEBERG? In Antarctica I spent time observing diverse penguin populations where a Gentoo penguin won my heart. As a teacher, I shared my experiences with Primary School age children. Retired, my husband and I live near Seattle."}, {"id": "1773210017", "genre": "Children's Books", "title": "Tree Song", "description": "Listen to the music of the trees.This joyful book follows the life cycle of a tree as it grows from seedling to mature tree, and finally gives way to a new sapling. At every stage of the tree’s life, children are seen playing under its branches.Each season brings with it new sounds, whether it’s the chirping of birds in the spring or the flitter flutter of leaves in the fall. As well as a home for animals, the tree provides a canopy for a summer picnic, and a perfect place to hang a swing. Most important of all, when old age fells the tree, it provides an acorn from which a new tree will grow.Colorful illustrations with lots of small details will capture the attention of young readers, while the lyrical text makes this an ideal read-aloud book. It can also serve as the perfect introduction to nature’s life cycles."}, {"id": "1608184048", "genre": "Children's Books", "title": "Apple (Grow With Me)", "description": "\"An exploration of the life cycle and life span of apples, using up-close photographs and step-by-step text to follow an apple's growth process from seed to seedling to mature tree\"--Provided by publisher."}, {"id": "0761325654", "genre": "Children's Books", "title": "Jenny: The Airplane That Taught America to Fly (Single Titles)", "description": "The Curtiss Jenny was the Model T of airplanes: it was the first aircraft to be mass produced, and the one in which nearly every famous early aviator--from Charles Lindbergh to Amelia Earhart--learned to fly. This stunning nonfiction picture bok portrays the building of a Jenny from wood, wire, and cloth, bringing to life the science and art of the early days of flight."}]