[{"id": "1682970205", "genre": "Children's Books", "title": "50 Things You Should Know About Inventions", "description": "In the ancient world, philosopher Archimedes designed new machines for farming. During the Renaissance, artist Leonardo da Vinci sketched his ideas for wondrous flying machines. Scientist James Watt provided ideas that would power the Industrial Revolution, while American inventor Thomas Edison patented more than 1000 inventions that would shape modern life, including the movie camera and the electric light bulb. Today's inventors still explore ideas for new and clever technology, producing miniature machines that we can only see under a microscope. Step inside the world of invention and see where it might take us next..."}, {"id": "1532110871", "genre": "Children's Books", "title": "3-D Printers (Modern Engineering Marvels)", "description": "3-D Printers are a Modern Engineering Marvel! In this engaging title, readers will explore the history of printers, from punch cards, dot matrix, ink jet and laser all the way to today's 3-D printing! Charles Hull and his development of 3D layered plastic printing is featured, and a colorful infographic shows how a 3-D printer works. See the benefits of 3-D printing such as custom prosthetics and orthodontics! A timeline, a glossary, and an index supplement historical and color photos. Aligned to Common Core Standards and correlated to state standards. Checkerboard Library is an imprint of Abdo Publishing, a division of ABDO."}, {"id": "1442435607", "genre": "Children's Books", "title": "Sylvester and the Magic Pebble", "description": "A cherished classic is brought to life with the audio stylings of renowned actor James Earl Jones.Sylvester can’t believe his luck when he finds a magic pebble that can make wishes come true. But when a lion jumps out at him on his way home, Sylvester is shocked into making a wish that has unexpected consequences. After overcoming a series of obstacles, Sylvester is eventually reunited with his loving family. Illustrated with William Steig’s glowing pictures, this winner of the Caldecott Medal is beloved by children everywhere. This package includes a paperback book along with a CD of this modern classic read by legendary actor James Earl Jones."}, {"id": "1505786371", "genre": "Children's Books", "title": "Feleap The Frog and the Great Big Circus Adventure", "description": "Pollywog Pond is a rather quiet place until the day Mr. Slowpoke’s Circus comes to town. Feleap The Frog loves the circus and dreams of performing in one. Will he achieve this dream? Follow Feleap to see if he makes it to the big top!"}, {"id": "0545425581", "genre": "Children's Books", "title": "Dive! World War II Stories of Sailors & Submarines in the Pacific: The Incredible Story of U.S. Submarines in WWII", "description": "Dive! World War II Stories of Sailors & Submarines in the Pacific tells the incredible story of America's little known \"war within a war\" -- US submarine warfare during World War II.Following the attack on Pearl Harbor, the US entered World War II in December 1941 with only 44 Naval submarines -- many of them dating from the 1920s. With the Pacific battleship fleet decimated after Pearl Harbor, it was up to the feisty and heroic sailors aboard the US submarines to stop the Japanese invasion across the Pacific.Including breakouts highlighting submarine life and unsung African-American and female war heroes, award-winning author Deborah Hopkinson uses first-person accounts, archival materials, official Naval documents, and photographs to bring the voices and exploits of these brave service members to life."}]