[{"id": "B0784QSRVK", "genre": "Children's Books", "title": "Republic progress", "description": "Imperial period: the population of the city was made by two main groups: actually Roman citizens (patricians), and their antagonists — plebeians. The Roman citizens were full citizens. They broke up to three the tribe. Each tribe consisted of 100 childbirth. Each 10 childbirth formed curia (the same that Greeks called a fratriya). Curia formed the general people's assembly of the Roman community (the kuriatny commissions). It adopted or rejected the bills offered it, elected all highest officials, acted as the highest court of appeal at the solution of a question of the death penalty, declared war. Affairs of direct management, development of bills, conclusion of peace were included into competence of the Roman Council of Elders — the senate. It consisted of elders of all 300 childbirth and therefore so I was called. These elders made the hereditary aristocracy of the Roman community as the custom according to which they were elected from the same family of each sort has taken roots."}, {"id": "B005Q7SSXI", "genre": "Children's Books", "title": "Camp Granada: Sing-Along Camp Songs", "description": "A compendium of favorite camp songs for all ages to enjoy.Hello Muddah, Hello Fadduh,Here I am at Camp Granada.Camp is very entertaining.And they say we’ll have some funif it stops raining.The mosquitoes are out and biting, the rain’s coming down in buckets, and there’s poison ivy on the trail. We’re a long way from home and the food here stinks! Camp wouldn’t be camp without troubles to share. But there are also new friends to make, adventurous trails to be climbed, and toasty evenings by the fire to enjoy (not to mention a fair bit of silliness). Classic camp-song favorites—from “Rise and Shine” and “Found a Peanut” to “Kum Ba Yah”—and vibrant, folksy illustrations make this offering a musical walk through the campgrounds for generations to treasure."}, {"id": "168152130X", "genre": "Children's Books", "title": "The Boat Race (Let's Race)", "description": "A perfectly age-appropriate introduction to reading informational text, the Let's Race series brings the excitement of vehicles and racing to kids just learning to read. Up-close action photographs, carefully leveled text, and controlled vocabulary provide reading practice about \"real stuff\" for emergent readers. A photo-illustrated book for beginning readers that tells the story of a high-speed power boat race. Who will win? Includes a photo diagram."}, {"id": "1401220789", "genre": "Children's Books", "title": "Tiny Titans Vol. 1: Welcome to the Treehouse", "description": "You'll see what life is like for the very young heroes of Sidekick Elementary and learn what could go wrong when the kids of Sidekick Elementary spend an afternoon in the Batcave in this new graphic novel. These all ages tales from the DC Universe, beautifully written and illustrated by Art Baltazar and Franco, will entertain new readers and seasoned fans of comics."}, {"id": "B071DQR8YM", "genre": "Children's Books", "title": "The Adorable Polar Bear (Adorable Series Book 4)", "description": "The fourth in Ida Harmony's \"Adorable\" series. Enjoy 15 unique facts alongside beautiful pictures for Polar Bears! Polar Bears are one of the most endangered animals on earth and one of the most majestic. If you enjoyed this short fact book make sure to check out other books in Ida Harmony's \"Adorable\" Series.We recommend reading this book with font size set to 6 for most enjoyment!"}]