[{"id": "0448485109", "genre": "Children's Books", "title": "A Pig, a Fox, and a Box (Penguin Young Readers, Level 2)", "description": "In the style of Mo Willems, Jonathan Fenske tells three humorous stories of two friends, Pig and Fox, and their shenanigans with a cardboard box (all of which involved Pig accidentally crushing Fox in the box). With comic art and simple language, this Level 2 reader is sure to have kids rolling with laughter."}, {"id": "0431006865", "genre": "Children's Books", "title": "Chinese New Year (Acorn: Holidays and Festivals)", "description": "Every year families gather to ensure luck in the coming year and celebrate the approach of spring by sharing in the traditions of Chinese New Year. This book introduces readers to the sights, sounds, foods, and gifts of this special holiday and discusses the importance of Chinese New Year."}, {"id": "160905184X", "genre": "Children's Books", "title": "Balloon Toons: The Super Duper Dog Park", "description": "Super Crazy Cat Dance creator Aron Steinke is back, and now he's gone to the dogs! All aboard for the Super Duper Dog Park?an awesome amusement park where dogs ride bikes, fly kites, and have an unforgettable day!"}, {"id": "B01MZHFL3P", "genre": "Children's Books", "title": "How a Mouse Saved the Royal Cat", "description": "A delightful tale of how Cashew, the royal cat, and Herman the mouse work together to solve the king's problem. Illustrations are scattered throughout this short story to help keep your young ones engaged. A great lesson book on cooperation and problem-solving, and it is just fun to read!Perfect for bedtime or story time!Please note: The ebook version has color illustrations, while the printed version has black-and-white illustrations to keep the printing costs within reason."}, {"id": "0545883784", "genre": "Children's Books", "title": "Groovy Joe: Ice Cream & Dinosaurs (Groovy Joe #1)", "description": "Groovy Joe was living the dream. He had a spoon and tub of doggy ice cream. And he started to sing:Love my doggy ice cream! Love my doggy ice cream! Eric Litwin, author of the bestselling and beloved Pete the Cat: I Love My White Shoes, and bestselling artist Tom Lichtenheld, illustrator of Goodnight, Goodnight Construction Site, have created a captivating new canine character who will groove his way into readers' hearts and have them grooving and giggling all the while. In his debut adventure, Groovy Joe faces three roaring dinosaurs hungry for his doggy ice cream! Oh no! But Joe knows just what to do and soon enough he has them all sharing while moving and singing along. Signature rhyme, repetition, and musical writing style, combined with wild and witty illustrations come together to create an unforgettable new character who embodies positivity, creativity, and kindness. Groovy Joe is here, ready to get groovy! Download your FREE Groovy Joe songs, written and performed by Eric Litwin, at groovyjoestories.scholastic.com. "}]