[{"id": "B01N757B8J", "genre": "Science Fiction & Fantasy", "title": "Teeny Weeny Man (A Short, Completely Believable Story)", "description": "When Molly Peek discovers an extremely odd hotdog during the course of her working day, she has no idea that her knowledge of life, evolution, and whether Earthlings are alone in the universe will be greatly enhanced. For such a small guy, the Teeny Weenie Man sure knows how to make an impact. It was a good day to have all your ideas about the universe and your place in it shot to pieces. You know - bright, reasonably fine, the sun shining, and all that. Not that the weather has anything to do with it.When Molly Peek discovers an extremely odd hotdog during the course of her working day, she has no idea that her knowledge of life, evolution, and whether Earthlings are alone in the universe will be greatly enhanced. For such a small guy, the Teeny Weenie Man sure knows how to make an impact. The intergalactic invasion of Earth has never been on such a small scale."}, {"id": "1942642601", "genre": "Science Fiction & Fantasy", "title": "Eternity or Bust: Mission 16 (Black Ocean)", "description": "One mission short of retirement. What could possibly go wrong? Carl's looking forward to a quiet life with his soon-to-be wife and the child they're expecting. But when Amy makes a simple request, there's a catch. She wants their wedding on Earth so her mother can be there. For a law-abiding citizen, that would be a pricey but straightforward request. For a band of outlaws, flying into the galaxy's headquarters for law and order would be suicidal... without a plan. As usual, Carl refuses to take impossible as an option. But somewhere amid the complicated web of deception, betrayal, and lies, a key part of the plan doesn't go as expected. As Carl's house of cards collapses, there's only one thing they can do: rescue who they can, while they can. Because after that, it'll be time to disappear. Who will survive this final mission of the Mobius crew's story? Is a happy ending even possible in the Black Ocean? Eternity or Bust is the sixteenth mission of Black Ocean, a science fantasy series set in the 26th century. Do you wish there had been a second season of Firefly? Do you love the irreverent fun of Guardians of the Galaxy? Have you ever wondered how Star Wars would have turned out if Luke and Obi-wan had ditched the rebellion to become smugglers with Han and Chewie? Then Black Ocean is the series for you! Pick up your copy of Eternity or Bust, and aim to misbehave with the crew of the Mobius."}, {"id": "1631404814", "genre": "Science Fiction & Fantasy", "title": "Dungeons & Dragons: The Legend of Drizzt Volume 3 - Sojourn", "description": "Adapts the third volume of R.A. Salvatore's The Legend of Drizzt! Drizzt Do'urden has abandoned the cruel Underdark for the unknown of the surface world. But as the young warrior begins his sojourn, the family he left beneath and new enemies alike pursue him. His survival depends on gaining the trust of surface dwellers - and that challenge may be greater than any battle he could fight."}, {"id": "B00HWJ1IR6", "genre": "Science Fiction & Fantasy", "title": "Glancing Through the Glimmer: The Glimmer Books", "description": "A homesick girl meets a prince in disguise, and both run afoul of the fairies…In the modern Kingdom of Ireland, few mortals believe in the fairy folk. Without that belief, the fairies are dying. Finvarra, the King of the Fairies, would rather dance than worry—but he must have a mortal dancing partner.When Janet Gleason’s grandfather becomes the new U.S. Ambassador to Ireland, the sixteen-year-old orphan must leave Boston and her friends behind. Janet is lonely in Dublin and unused to her grandparents’ stuffy social life. An invitation to a royal ball terrifies her. She can’t even waltz and dreads embarrassment. Finvarra’s fairy witch overhears her fervent wish to learn to dance.Seventeen-year-old Prince Liam Boru loathes the idea of escorting another spoiled American girl to a ball. In fact, he detests most of his royal duties. He dresses down to move through Dublin unnoticed and finds himself on his royal backside when Janet crashes into him. Intrigued, he asks to see her again, and she willingly agrees. Unaware of each other’s identities, they arrange to meet. When they do, the fairies steal Janet away.Liam’s attempts to find her trigger a series of frustrating misadventures. Can he and Janet outwit a treacherous fairy king who’s been hoodwinking mortals for centuries?"}, {"id": "1494508206", "genre": "Science Fiction & Fantasy", "title": "Slow Bullets", "description": "A vast conflict, one that has encompassed hundreds of worlds and solar systems, appears to be finally at an end. A conscripted soldier is beginning to consider her life after the war and the family she has left behind. But for Scur-and for humanity-peace is not to be. On the brink of the ceasefire, Scur is captured by a renegade war criminal and left for dead in the ruins of a bunker. She revives aboard a prisoner transport vessel. Something has gone terribly wrong with the ship. Passengers-combatants from both sides of the war-are waking up from hibernation far too soon. Their memories, embedded in bullets, are the only links to a world which is no longer recognizable. And Scur will be reacquainted with her old enemy but with much higher stakes than just her own life."}]