[{"id": "B06ZZ2YDNW", "genre": "Science Fiction & Fantasy", "title": "The Old Man of the Temple (The Seven Signs Book 3)", "description": "An archaic power awakens, but the shadows of antiquity conceal a terrible truth.Fugitives from the Conclave, Dormael and his friends flee with the armlet in their possession. Hounded by their former allies, they undertake a dangerous trek to an ancient ruin—a place where the only things older than the stones are the secrets buried beneath them.  Pain and darkness wait in the halls of the dead, but something worse may be closing in from behind. With evil stirring, the fate of the world hangs in the balance.  Will Dormael and his friends uncover the mystery of the artifact, or be destroyed by those who wish its power for themselves?  For Dormael, D’Jenn, and Shawna, failure could mean the destruction of everything they know.The war is just beginning, and the gods will weigh the price in blood.The Old Man of the Temple is book three of The Seven Signs, the continuation of a sword and sorcery series full of magic, intrigue, conspiracy, violence, and mystery.  If you're looking for a new favorite world to call home, The Seven Signs will give you a reason to lose a little sleep.  Buy now and continue your journey into a dark new world.categories: dark sword and sorcery series, dark sword and sorcery novel, dark sword and sorcery fire, dark epic fantasy novels, dark epic fantasy fire, sword and sorcery adventure novel, sword and sorcery fire magic, wizard, magic, epic fantasy, high fantasy battle, fantasy magic assassin series, grimdark magic series, dark fantasy conspiracy, epic fantasy."}, {"id": "B003DX0I58", "genre": "Science Fiction & Fantasy", "title": "Blood Pressure: A Vampire Testament (Vampire Testaments)", "description": "The secret war between vampires and humans escalates and the world will never be the same again…Christopher Jude Miller – fully grown and still human – has returned to New York to seek answers about his past.  It is there he meets Joie, a young woman connected to his past, and falls into a twisted love triangle. He and Joie also realize that the magical forces that made both their lives possible have unexpected side effects, as they discover that united they have abilities neither knew of before - including the power to cure vampires.Created after the incidents that brought in the National Guard to contain the vampire zombie plague on the Lower East Side, Clean Slate Global is a covert ops organization formed to rid the world of vampires, run by ex-deputy mayor Jonathan Richmond.  But Richmond unleashes an ancient evil with darker motives.  It plots to use Christopher and Joie's power to eliminate all vampires from the Earth…with the exception of its own new and improved indestructible army of the undead."}, {"id": "B01N34AW9R", "genre": "Science Fiction & Fantasy", "title": "Nyssa Glass and the Caper Crisis", "description": "Orphaned cat burglar Nyssa Glass intends to outwit her rotten fate. “Adopted” by her incarcerated uncle's gang of thieves, she breaks into homes and picks pockets to repay her family debt and one day buy her freedom from their dark enterprise. Mechanically adept and determined, Nyssa longs to attend Miss Pratchett's School for Mechanically Minded Maids and make an honest life she can take pride in.She wasn't made to steal things. She was made to create and fix them.However, before she can make her escape, the head of the gang taps her for a new assignment, one her conscience cannot bear. Nyssa is faced with a heartrending decision: sacrifice everything or become the very thing she's desperate to escape.A Prequel Short for the Nyssa Glass Steampunk Series."}, {"id": "1492800473", "genre": "Science Fiction & Fantasy", "title": "The Clockwork God (Aboard the Great Iron Horse) (Volume 1)", "description": "Mr. Sedgwick's new steampunk series picks up where the Tinkerer's Daughter Trilogy left off: Barreling through their post-apocalyptic world on a massive steam locomotive called the Great Iron horse, the steam-powered ape Socrates and his crew of warriors,miscreants, and genetic anomalies are in search of a rare and precious element known as starfall. Starfall is the fuel that powers the Iron Horse, as well as the great city of Sanctuary. Supplies are running low, and unless they can locate another source, all civilization may soon collapse. Starfall also happens to be the ape's power source and without it, Socrates will die.On their first adventure, Socrates,River, and the rest of the crew encounter a bizarre cult of isolationists and their strange \"Clockwork God.\" Meanwhile, several crew members have gone missing and tensions are rising as mutineers conspire to overthrow Socrates and destroy the train. As the conflict comes to a boil, a power more ancient and sinister than anything they have ever imagined threatens to destroy them all. The \"Iron Horse\" series is a follow up to Sedgwick's best-selling steampunk series \"The Tinkerer's Daughter.\" A reading of the earlier books is not necessary to enjoy this new series, but may provide added insight to certain characters and history."}, {"id": "0745311059", "genre": "Science Fiction & Fantasy", "title": "Capital, Class & Technology in Contemporary American Culture: Projecting Post-Fordism", "description": "In the tradition of Mike Davis and Fredric Jameson, Nick Heffernan engages in a series of meditations on capital, class and technology in contemporary America. He turns to the stories we generate and tell ourselves – via fiction, film journalism, theory – to see how change is registered. By investigating a variety of texts, he observes how structural change affects the way people organise their lives economically, socially and culturally. Case studies include Ridley Scott’s Blade Runner, William Gibson’s cyberspace trilogy, Thomas Pynchon’s The Crying of Lot 49, and Wim Wenders’s Until the End of the World.Using the links between narrative cultural forms and the process of historical understanding, he brings together debates that have so far been conducted largely within the separate domains of political economy, social theory and cultural criticism to provide a compelling analysis of contemporary cultural change. By relocating postmodernism in the context of changing modes of capitalism, Heffernan puts the question of class and class agency back at the centre of the critical agenda."}]