[{"id": "152097874X", "genre": "Science Fiction & Fantasy", "title": "The Phantom of the Marshes (Hal Bishop Mysteries)", "description": "After their eventful outing at Foxfire Manor, Jem Bishop and his brother Hal have returned to London in hopes of making progress on their on their own mystery: their father's death.  But they are getting nowhere, until a letter arrives from Andrew Marsh, the son of the industrialist who manufactures the aether-engines their father became famous for.  The letter describes a terrible curse--and soon Jem and Hal are on their way to Birmingham on the trail of another case.  But as the death toll rises and the connection to their father's work becomes clear, Hal and Jem find themselves on the wrong side of the law--and the spirits."}, {"id": "1540364860", "genre": "Science Fiction & Fantasy", "title": "1: The Legends of Vandor: Anthology Volume I (The Legends of Vandor Anthologies) (Volume 1)", "description": "From the beginning of the world until the present day, the world of Vandor has been wrought with stories of bravery, selfishness, power, and the gods. The tales within this Anthology are but a part of the greater stories unfolding in Vandor. This first collection of stories sees men battling demons, witches fighting against their captors, and mighty warriors seeking vengeance against the creatures of darkness. These ten LEGENDS have been chronicled so that all may know of the might and wonder held within the world of Vandor."}, {"id": "1589940962", "genre": "Science Fiction & Fantasy", "title": "School of Illusion: A Compendium of Illusion Magic (Legends & Lairs, d20 System)", "description": "Kicking off a new series of books from Fantasy Flight Games, SCHOOL OF ILLUSION contains everything you need to make illusion magic a key component of your game. Featuring more than 60 new spells including the mind-twisting might of apocalypse, SCHOOL OF ILLUSION brings the concept of divine domains to arcane spellcasters in the form of \"disciplines.\" Illusionists can now master invisibility, terror, true illusion, and six other disciplines on their path to ultimate power. Best of all, the visual guide to illusions shows at a glance which senses a spell affects. This book also contains 9 new prestige classes and a new core class - the devoted illusionist. In addition, it contains dozens of new items - both magical and mundane - to delight players. Whether you're customizing your very own illusionist's robe or wielding the awesome might of the staff of the illusionist, you'll never look at illusion magic the same way again."}, {"id": "0765367149", "genre": "Science Fiction & Fantasy", "title": "Dark Light: Dawn", "description": "With an uncanny ability to survive any combat situation, Max Younger has built a good life for himself as a Navy SEAL. That is, until a rogue rescue operation plunges him back into the past he thought he’d escaped forever.Waiting for him back home in New York are terrible, long-hidden truths rooted in the tragic death of his father. But the origin of those truths lie further back than that, and Max finds himself ensnared in a sinister plot involving nothing less than the biblical apocalypse.The explosive conflagration of events reunites him with the only woman he ever loved: Victoria Lewin, a brilliant expert in infectious disease who may be the only one who can stop the spread of a deadly pestilence threatening the planet. Max’s reunion with Vicky comes amid a firestorm being unleashed by forces that date back to the very origins of the universe.Across the globe, the stage is being set for a final, epic confrontation between the forces of good and evil. Sides are chosen, a fearsome army rises, and the lines between science and superstition become increasingly blurred. Max desperately seeks to discover whether he is fated, under the shadow of the Medusa Strain, to help save the world . . . or destroy it."}, {"id": "B077MPYMXP", "genre": "Science Fiction & Fantasy", "title": "The Eterna Files (3 Book Series)", "description": "From Book 1: London, 1882: Queen Victoria appoints Harold Spire of the Metropolitan Police to Special Branch Division Omega. Omega is to secretly investigate paranormal and supernatural events and persons. Spire, a skeptic driven to protect the helpless and see justice done, is the perfect man to lead the department, which employs scholars and scientists, assassins and con men, and a traveling circus. Spire's chief researcher is Rose Everhart, who believes fervently that there is more to the world than can be seen by mortal eyes. Their first mission: find the Eterna Compound, which grants immortality. Catastrophe destroyed the hidden laboratory in New York City where Eterna was developed, but the Queen is convinced someone escaped—and has a sample of Eterna.Also searching for Eterna is an American, Clara Templeton, who helped start the project after the assassination of Abraham Lincoln nearly destroyed her nation. Haunted by the ghost of her beloved, she is determined that the Eterna Compound—and the immortality it will convey—will be controlled by the United States, not Great Britain.The Eterna Files seriesThe Eterna FilesEterna and OmegaThe Eterna SolutionAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}]