[{"id": "1848379145", "genre": "Children's Books", "title": "Magic Mike's Miraculous Magic Tricks: Packed with Dozens of Dazzling Tricks to Learn in Simple Steps!", "description": "This brilliant how-to title aimed at children aged seven and up teaches the secrets of real magic tricks. David Mostyn's warm and witty artwork is instantly appealing and full of humorous details for children to spot. Children will be thrilled by the idea of amazing their friends and families with their incredible abilities and impossible stunts. The range of tricks”involving coins, paper, playing cards, and mental magic”will give children the opportunity to develop verbal skill, mental agility, and physical dexterity. Clear step-by-step instructions for tricks are easy to follow and colorfully illustrated."}, {"id": "0590419528", "genre": "Children's Books", "title": "Exploring the Titanic: How the Greatest Ship Ever Lost was Found", "description": "A noted marine biologist and the scientist responsible for the discovery of the Titanic describes the sinking of the great ocean liner and the search for, and discovery of the wreck of the ship"}, {"id": "0794507697", "genre": "Children's Books", "title": "Guide To The Internet: Internet Linked (Usborne Computer Guides)", "description": "A comprehensive guide to using the Internet, this book explains all aspects of the Internet, from setting up a new Internet connection to designing your own website. Email, the World Wide Web, e-commerce and website creation are simply explained and fully illustrated with screenshots while the latest Internet technology and new software, including Microsoft Windows XP and FrontPage 2002, are also covered in detail. This jargon-free, highly visual guide should help beginners of all ages develop essential computer skills and become adept at using standard computer equipment."}, {"id": "B06XPFKP5D", "genre": "Children's Books", "title": "Diary Of A Wimpy Link 2 (Wimpy Adventures Book)", "description": "Inside the mind of Link, his personal Diaries: Discover what runs through his mind when facing certain obstacles and challenges.Pretty much everywhere you go in Zelda can be dangerous, but some areas require more specific preparation than others. Venturing out in the middle of a thunderstorm or scaling a snowy mountain can be deadly, if not downright impossible, without the right gear, items, and knowledge. Here’s what you need to know to survive in almost every situation according to Link."}, {"id": "0448428970", "genre": "Children's Books", "title": "Dish 6: On the Back Burner", "description": "Things are heating up for the sixth-graders' cooking business when they get their biggest job yet while Peichi is busy preparing for her family's Chinese New Year celebration and all the rest of the girls come down with the flu. Includes recipes for brownies, chicken parmigiana, and fortune cookies.Things are heating up for the sixth-graders' cooking business when they get their biggest job yet, while Peichi is busy preparing for her family's Chinese New Year celebration, and all the rest of the girls come down with the flu."}]