[{"id": "1482450550", "genre": "Children's Books", "title": "The Aztecs (Discovering Ancient Civilizations)", "description": "The native people known as the Aztec ruled a large empire in what is now Mexico. They created an amazing capital city called Tenochtitln, where Mexico City is now located. This advanced civilization amazed Spanish explorers when they arrived in the 1500s, and it continues to captivate people today. This notable volume presents the most essential and intriguing facets of the ancient Aztec culture, including their games, arts, economy, myths, and even rites of human sacrifice. Impressive artwork and artifacts displayed on each page offer scenes of Aztec life, further educating and fascinating readers."}, {"id": "1925235300", "genre": "Children's Books", "title": "Patterns from Nature: The Art of Klimt (Stories of Art)", "description": "This story illustrates how Klimt, an Austrian painter, expressed the inspiration from nature in his own style of the gold colored decoration in his paintings. "}, {"id": "B07223BTVB", "genre": "Children's Books", "title": "Jane The Super Kitty Saves The Zoo", "description": "Once upon a time ago there was a special kitty, her name was Jane. She had super powers. Traveling around to different places she would use those special powers to save the day."}, {"id": "1840118423", "genre": "Children's Books", "title": "Emperor's New Clothes", "description": "A reissue of this beautiful version of the Hans Christian Andersen classic, illustrated in Alison Jay's unique and attractive style. In this retelling by Marcus Sedgwick, the Emperor is a very proud and vain lion, served by his long-suffering Chamberlain and Treasurer. He wants to commission the finest set of robes ever seen! But the devious tailors have plans of their own... This new edition captures the charm of the timeless classic with a fresh new look."}, {"id": "0823957837", "genre": "Children's Books", "title": "St. Patrick's Day (The Library of Holidays)", "description": "Discusses the history of Saint Patrick's Day, including why it is celebrated, some of the traditions dealing with the holiday, and how it is celebrated around the world."}]