[{"id": "B00MXN33M4", "genre": "Science Fiction & Fantasy", "title": "Into the Dark (Alexis Carew Book 1)", "description": "At fifteen, Alexis Carew has to face an age old problem - she's a girl, and only a boy can inherit the family's vast holdings. Her options are few. She must marry and watch a stranger run the lands, or become a penniless tenant and see the lands she so dearly loves sold off. Yet there may be another option, one that involves becoming a midshipman on a shorthanded Navy spaceship with no other women."}, {"id": "153358124X", "genre": "Science Fiction & Fantasy", "title": "Realities", "description": "A young man, Ron, is found dead. The authorities say he hung himself. Mandy, knows that can't be true. She also finds she carries Ron's child and has to find the truth of what happened. What she uncovers, is a conspiracy that has repercussions for the child she carries. Both of their lives will be changed forever and maybe the rest of mankind as well."}, {"id": "1681399431", "genre": "Science Fiction & Fantasy", "title": "Legacy of Ashes", "description": "When a virus wiped out most of Earth's population 108 years ago, the survivors created a feudalism-based government. Royal families rule over makeshift kingdoms. Things run smoothly in the world until Gwen McDowell and her brother, William, are picked up by the king's guard. Gwen is forced to work as a maid while William fights in the guard they don't believe in. The structure of the kingdom slowly falls the longer Gwen and William stay. In their efforts to blend in, they uncover several life-changing secrets about the royals and even themselves. How will these secrets affect the delicate balance of power and possibly the human race?"}, {"id": "B07772LHKD", "genre": "Science Fiction & Fantasy", "title": "Christmas Past: A Chronicles of St Mary's Short Story", "description": "Max, Leon and Matthew - together at last for Christmas at St Mary's, a time of conspicuous consumption, riotous misbehaviour and the traditional illegal Christmas jump. And this time it's intergenerational. Donning her unfamiliar mother hat, Max takes Matthew back to 19th-century London, where they plan to deliver a parcel of Christmas cheer to his former friends but find themselves confronting the terrifying Old Ma Scrope in the process. 'Tis the season to be jolly. It's also the season of goodwill towards all mankind. Pity no-one told Max. "}, {"id": "0553373951", "genre": "Science Fiction & Fantasy", "title": "Lords of the Sky (Bantam Spectra Book)", "description": "Angus Wells carved a place for himself on the shelves of hundreds of thousands of fantasy readers.  Now, with Lords Of The Sky, it is clear that he has saved his most sweeping and imaginative tale for an epic more powerful than anything he has written before. For centuries, the Dhar have had to face the Ahn, fierce warriors who would lay claim to Dharbek, the land they call their ancestral home.  Now, in fantastic airships powered by magic, the Ahn have begun their greatest campaign yet.  In preparation for the coming onslaught, Storymen like Daviot travel the land collecting tales and sharing the history it's their responsibility to safeguard.  But Daviot's travels show him the dark side of Dharbek, and inspire him to be a catalyst for change, to overcome doubt and fear, and pursue the one dream that has eluded Dharbek. Using his special gifts for storytelling and world-building, Angus Wells reaches new heights with a story as ambitious as it is broad in scope. Lords Of The Sky has all the action, adventure and magic a fantasy-lover could desire, and tackles social change, prejudice, the value of genuine friendship and the power of enduring love.From the Paperback edition."}]