[{"id": "1620656922", "genre": "Children's Books", "title": "Hockey Scramble: A Spot-It Challenge", "description": "She shoots! She scores! Love hockey? These hockey-themed Spot-It scenes are a blast for both avid players and couch-side fans. Search brilliant, full-to-bursting photos for gobs of hidden objects. Even eagle-eyed readers will cheer this newest Spot-It sports challenge."}, {"id": "0615930042", "genre": "Children's Books", "title": "Be the Vet (7 Dog + Cat Stories: Test Your Veterinary Knowledge)", "description": "A dog that stops eating, a cat that throws up, a pet that won't stop itching... What could be wrong? Place yourself as the narrator in seven unique stories about dogs and cats. When a medical emergency or illness impacts the pet, you will have the opportunity to diagnose the problem and suggest treatment. Following each story is the treatment plan offered by Dr. Ed Blesy, a 20 year practicing veterinarian. You will learn veterinary terms and diagnoses while being entertained with fun, interesting stories.  Read about real life problems that veterinarians see every week in easy-to-understand terms.  If you've ever thought about being a veterinarian, this is the book for you. For ages 9-13Book 2 available now with all new cases!"}, {"id": "0689848137", "genre": "Children's Books", "title": "The House That Mack Built (Preschool Pop-Ups)", "description": "Filled with three-dimensional pop-up fun, an energetic story, based on the classic rhyme \"This is the House that Jack Built,\" follows Max the foreman as he builds a house."}, {"id": "0545436370", "genre": "Children's Books", "title": "Let's Get Dressed!", "description": "Caroline Jayne Church teaches us how to get dressed!First we needa brand-new pairof super-duper...UNDERWEAR!New from the bestselling illustrator of I LOVE YOU THROUGH AND THROUGH, this clever board book is a playful way to teach toddlers how to dress themselves. With oversized flaps on every page, readers can guess and uncover what article of clothing comes next! The simple, rhyming text surprises and delights while the hands-on format and Caroline Jayne Church's adorable toddlers makes this a perfect introduction to dressing routines!"}, {"id": "0711218994", "genre": "Children's Books", "title": "Monkey About with Chimp and Zee (Chimp & Zee)", "description": "Following on from the irresistible Chimp and Zee are two fantastically colourful and energetic interactive board books for very young readers. Monkey About With Chimp and Zee \"Ha, ha, ha! Hee, hee, hee. Do these things with Chimp and Zee\". Touch the book, lick the book, even kiss the book! Children will love monkeying about with Chimp and Zee in this brilliantly simple and fun board book."}]