[{"id": "B00HNXC2CG", "genre": "Children's Books", "title": "#13 Sherlock Holmes and the Adventure of the Three Garridebs (On the Case with Holmes and Watson)", "description": "\"Garrideb\" is more than an unusual last name. It's the key to a fortune! John Garrideb must find two more men with the same last name to obtain a deceased Garrideb's fortune. John finds Nathan Garrideb in London. But when Nathan seeks Holmes and Watson for help, what dark secret will Holmes reveal?"}, {"id": "1541904443", "genre": "Children's Books", "title": "Who Really Found America First? | Children's Modern History", "description": "Enter the world of Modern History and meet the people who braved the open seas in search of new lands and adventures. In this edition, we will explore the events, dates and people that led to the discovery of America. Coupled with a fun layout and some carefully-selected images, this book will change history lessons from boring to entertaining. Grab a copy today!"}, {"id": "0061703923", "genre": "Children's Books", "title": "Barack", "description": "A glowing picture book biography of the 44th President of the United States, Barack Obama.This is a journey that began in many places.It began in Kansas, home of Barack's mother. It began in Africa, home of Barack's father. It began in Hawaii one moonlit night, the night that Barack was born.Sometimes it was a lonely journey. Sometimes it was an enchanted journey. But throughout this most unusual ride, this boy often wondered: Who am I? Where do I belong?Jonah Winter and AG Ford re-create the extraordinary story behind the rise of the inspirational icon Barack Obama in this stunning picture book."}, {"id": "1681521865", "genre": "Children's Books", "title": "Capybaras (Weird and Unusual Animals)", "description": "Sea cucumbers? Flying dragons? Students will be shocked and amazed by these unusual creatures! Amazing photographs and informative text provide reading practice and enjoyable learning for elementary readers on eight unique animals. The inclusion of fun facts and additional resources ensure that every curious kid's questions will be answered. A photo-illustrated book for elementary readers about the largest rodent in the world, the capybara. Readers learn about their wetland habitat, feeding habits, predators, and life cycle. Includes fun facts, table of contents, glossary, further resources, and index."}, {"id": "0192736485", "genre": "Children's Books", "title": "Oxford Roald Dahl Dictionary: From aardvark to zozimus, a real dictionary of everyday and extra-usual words", "description": "For the first time in paperback, this Oxford Roald Dahl Dictionary takes readers aged 8+ on a phizz-whizzing, splendiferous, fantabulous journey deep into the language of Roald Dahl's bestselling children's stories. This is a dictionary which will develop language and literacy skills by igniting the creativity in all readers and writers everywhere. Lots of dictionaries tell you what an 'alligator' is, or how to spell 'balloon' but they won't explain the difference between a 'ringbeller' and a 'trogglehumper', or say why witches need 'gruntles' eggs' or suggest a word for the shape of a 'Knid'. This dictionary does all those things. All the words that Roald Dahl invented are here, like 'biffsquiggled' and 'whizzpopping' to remind you what means what, but that is not all. You'll also find out where words came from, rhyming words, synonyms and lots of alternative words for words that are overused. Oxford Children's Dictionaries are perfect for supporting literacy and learning and this is the world's first Roald Dahl Dictionary from the word experts at Oxford University Press."}]