[{"id": "B075RZKGX9", "genre": "Children's Books", "title": "Angels Foretold of Baby Jesus", "description": "Long, long ago, The Savior of the world was born! Heavenly Father sent angels to prepare His people for the birth of Jesus Christ. Follow these angels as they visit Isaiah, Lehi, Samuel the Lamanite, and many more, sharing the good news of the Savior’s birth."}, {"id": "0553533770", "genre": "Children's Books", "title": "The Starlight Slippers (100 Dresses)", "description": "Fans of the Land of Stories and the Descendants series are sure to find the lighthearted fantasy-adventure of 100 Dresses a perfect fit!100 Dresses100 Disguises100 Daring AdventuresInside an enchanted castle, there's a closet--a closet with one hundred magical dresses that only Darling Dimple can wear. Each one disguises her as somebody else. And once again, Darling needs them!You've heard of glass slippers? What about starlight slippers--delicate lace shoes studded with starlight opals? When Princess Mariposa reads about her grandmother's bridal slippers, she wants to find them for her own wedding! Darling is only too happy to help look for the slippers . . . until she discovers they are connected to the castle's magic. Could wearing them set the dragons free? With the help of her friends Roger, Gillian, and Dulcie and lots of dresses, Darling must save the castle--and Princess Mariposa's wedding day."}, {"id": "156145236X", "genre": "Children's Books", "title": "Aliens from Earth: When Animals and Plants Invade Other Ecosystems", "description": "Aliens are on the move! They spread out underwater, smothering sea plants and destroying fish eggs in the Mediterranean Sea. They multiply and invade wooded areas in Australia and Hawaii, killing off the native flora and fauna. They travel by air, water, boat...even on the shoes and clothes of humans!Award-winning science writer Mary Batten introduces young readers to the serious and ongoing environmental problems caused by invasive plant and animal species. Citing numerous examples, including the accidental release of the gypsy moth into the United States in 1869 and the deliberate introduction of rabbits to Australia by English settlers, Batten shows how in each case the delicate balance of the local ecosystem is threatened or even destroyed by the foreign intrusion.At the end of the book, Batten offers readers ideas they can use to minimize their own impact on local environments. Artist Beverly Doyle's realistic, full-color illustrations and maps highlight the diversity of the natural world and outline the global routes taken by animal and plant invaders."}, {"id": "0692022090", "genre": "Children's Books", "title": "A Turtle Who Likes To Eat Fish", "description": "“A Turtle Who Likes To Eat Fish” is a song and illustrated children's book developed from the true story of our own red eared slider. After adopting him our new pet was given a substantially larger bit of freedom then he was accustomed to for his 8th birthday. Our guilt over keeping such an active reptilian creature in a glass box inspired the construction of an access ramp down to our apartment floor. He has since continually amazed us with his intelligence, usually in the form of manipulation to get more fish.   We have both since moved from that apartment and the song came true. Our turtle finally got what he had been wanting his whole life. He went ... “ to a pond with a lot of space, a place to meet other turtles face to face.”   The book was made to keep children reading and features thirteen full page color illustrations by Bay Area painter René Capone  The book is dedicated to anyone who's ever gone through a time in their life where they were stuck in a place they didn't belong ... and dreamed of something more."}, {"id": "0794521185", "genre": "Children's Books", "title": "What's Physics All About? (Science Stories)", "description": "Entertaining guides that invite young readers to discover fascinating facts about science and delve into incredible tales of intrepid explorers who helped shape modern history."}]