[{"id": "B003DYGOUA", "genre": "Children's Books", "title": "Amelia Earhart: Young Aviator (Childhood of Famous Americans)", "description": "Using simple language that beginning readers can understand, this lively, inspiring, and believable biography looks at the childhood of Amelia Earhart. Illustrated throughout."}, {"id": "1681855771", "genre": "Children's Books", "title": "Truck Coloring Book", "description": "These big trucks are waiting to be painted with bold and vibrant colors. Coloring is an enjoyable activity that teaches young children about color, hue, line and form and perspective recognition. Coloring also helps your child navigate through new words and thereby widen their vocabulary. Buy a copy of this book now!"}, {"id": "1515798410", "genre": "Children's Books", "title": "The Invention of the Airplane (World-Changing Inventions)", "description": "Explore the history and development of the airplane and find out how an airplane works. Learn about the inventors who helped influence the invention of the airplane."}, {"id": "B00822LONU", "genre": "Children's Books", "title": "Doubletake (Jumping Into Danger #1)", "description": "Book One in the Jumping Into Danger Series.Hidden secrets behind barn doors.Too much imagination or too much real life?Amid the waves of flowing bluegrass live Jessica and Kristin, two girls that love their horses more than life itself. When they stumble across the racing scandal of the century, putting their life at risk for their horses is exactly what they will be forced to do."}, {"id": "0606405291", "genre": "Children's Books", "title": "The Distance Between Us: Young Readers Edition (Turtleback School & Library Binding Edition)", "description": "Award-winning author Reyna Grande shares her personal experience of crossing borders and cultures in this middle grade adaptation of her memoir, The Distance Between Us--\"an important account of the many ways immigration impacts children\" (Booklist, starred review). When her parents make the dangerous and illegal trek across the Mexican border in pursuit of the American dream, Reyna and her siblings are forced to live with their stern grandmother, as they wait for their parents to build the foundation of a new life. But when things don't go quite as planned, Reyna finds herself preparing for her own journey to \"El Otro Lado\" to live with the man who has haunted her imagination for years: her long-absent father. Both funny and heartbreaking, The Distance Between Us sheds light on the immigrant experience beautifully capturing the struggle that Reyna and her siblings endured while trying to assimilate to a different culture, language, and family life in El Otro Lado (The Other Side)."}]