[{"id": "0198229208", "genre": "Children's Books", "title": "The Revolutions of 1688: The Andrew Browning Lectures 1988", "description": "Beddard here studies the events and issues which dethroned the Catholic James II and enthroned the Protestant William and Mary. Beginning with the dynastic revolution in England, he examines the dependent kingdoms of Scotland and Ireland, the American colonies, the United Provinces, and the continental European background. Themes explored include the role of the Whigs in William of Orange's success, the shift in Tory opinion, the part played by the Scottish nobility, Ireland's reduction to colony status, the evolution of Dutch foreign and domestic policy, and transatlantic repercussions. The volume concludes with an examination of 1688 and its place in the Whig theory of history. Drawing on the expertise of an international team of scholars, the volume makes an important contribution to the historiographical assessment of the revolutions of 1688 and their profound impact on subsequent history."}, {"id": "1635175704", "genre": "Children's Books", "title": "The Space Shuttle Missions", "description": "Explores scientists' thrilling quest to develop the Space Shuttle. Engaging text, vibrant photos, and informative infographics help readers learn about this important advancement in exploring space, as well as the people and technology that made it possible."}, {"id": "0307119386", "genre": "Children's Books", "title": "All by Myself (Little Critter) (Look-Look)", "description": "Mercer Mayer’s Little Critter wants to show you all the things he can do for himself in this classic, funny, and heartwarming book. Whether he’s tying his shoes, coloring a picture, or riding his bike, both parents and children alike will relate to this beloved story. A perfect way to teach children about independence!"}, {"id": "0998309877", "genre": "Children's Books", "title": "Hey Buddy, I'm your Body! (Kids' Questions about Life)", "description": "HEY BUDDY, I’M YOUR BODY! is the first installment of a series on body, mind, and soul called Kids’ Questions about Life. It’s an educational book written in simple language for parents, teachers, and kids who are pondering the deeper, more complex yet so essential issues of life. This is an early introduction on who we are and how to take care of ourselves.Explaining the complexity of the human being in general is not an easy but very important task for parents. These concepts are made more tangible and easily understandable through a family of bears. As the bear cubs ask questions about their bodies, Mommy Bear and Daddy Bear seek to answer their little ones with simplicity and honesty.Emphasizing that we are part of nature and made from the same building blocks as everything else in nature helps children understand how to take care of their bodies. Knowing about the language of the body and becoming more aware of it is also very essential. The body knows how to heal itself, but it needs our help to make informed and wise choices for a healthy and happy lifestyle."}, {"id": "0789312379", "genre": "Children's Books", "title": "The Four Agreements: 2006 Engagement Calendar", "description": "Best-selling book The Four Agreements has introduced a simple but powerful code of conduct for attaining personal freedom and true happiness. Full of grace and simple truth, the four agreements guide readers toward a life of increased freedom, joy, and love. \" With insightful messages from The Four Agreements and The Mastery of Love, Ruiz's wisdom book on relationships, this calendar will help readers follow the four agreements as they work to achieve more happiness in their lives all year long. \" Don Miguel Ruiz is a shamanic teacher and healer whose beliefs are based on ancient Toltec wisdom."}]