[{"id": "073681552X", "genre": "Children's Books", "title": "Dorothea Dix: Social Reformer (The New Nation Biographies)", "description": "A biography of Dorothea Dix, the nineteenth-century reformer who devoted much of her life to improving the treatment of the mentally ill in the United States."}, {"id": "076132450X", "genre": "Children's Books", "title": "Endangered & Extinct Prehistoric Animals", "description": "Details the story of dramatic extinctions caused by volcanoes, ice ages, meteorite collisions with Earth, and other violent events--one of which completely wiped out the dinosaurs."}, {"id": "1555910165", "genre": "Children's Books", "title": "Walking with Henry: The Life and Works of Henry David Thoreau (Images of Conservationists)", "description": "Footstep by footstep, this wonderous introduction to the poet-philospher offers readers of all ages the chance to understand Thoreau's belief that wilderness offers truth, beauty, and goodness to us all. He was a serious field biologist who studied nature, but also a man who showed us that nature was more than facts to be assembled, arranged, and measured."}, {"id": "B00P34TF6I", "genre": "Children's Books", "title": "99 Kids Jokes - Stampy Edition", "description": "99 Hilarious jokes based on Stampy’s favourite game. What do Snow Golems wear on their head? Why won’t Endermen eat clowns? Why don’t Guardians eat penguins? Find out the answers to these and many more hysterical jokes. You will never be able to play the game, without laughing out loud, ever again."}, {"id": "1250068061", "genre": "Children's Books", "title": "Tales of Bunjitsu Bunny", "description": "Introducing Isabel, aka Bunjitsu Bunny! She is the BEST bunjitsu artist in her school, and she can throw farther, kick higher, and hit harder than anyone else! But she never hurts another creature . . . unless she has to. This series of brief stories about Isabel's adventures are a beguiling combination of child-friendly scenarios and Eastern wisdom perfect for the youngest readers.Tales of Bunjitsu Bunny, written and illustrated by John Himmelman, is the first in a series of books about a smart young bunny faced with different challenges. The lively story about a kind and wise rabbit, with two-color illustrations, will appeal to young martial arts fans."}]