[{"id": "194314737X", "genre": "Children's Books", "title": "The Pod and The Bog (Zoey and Sassafras)", "description": "With magical animals, science, mystery, and adventure -- the series Zoey and Sassafras has something for everyone! Easy-to-read language and illustrations on nearly every page make this series perfect for a wide range of ages. In the fifth book, an old friend visits Zoey at the barn with a mysterious glowing. . . seed pod? Zoey, Sassafras, and Pip must work together to discover what this mysterious rare magical plant needs to grow before all the seeds crumble to purple dust!"}, {"id": "B071CK5TKB", "genre": "Children's Books", "title": "Lose to gain", "description": "At the age of 15, I have got one of the first inks done on my hand. It was saying GNSHNG, what could have been decoded as “God is not a sucker, holds no grudges”. Nowadays, I do not feel comfortable saying it aloud, but then, being a teenager, I thought it sounded cool, and I was not aware that many years down the road, these words would acquire an absolutely different shade of meaning in my life. Namely that altered shade of meaning is something that I want to spread the word about in my story. A story of a former criminal"}, {"id": "1338167197", "genre": "Children's Books", "title": "Princess Truly in My Magical, Sparkling Curls", "description": "I love my fluffy, puffy curls.I'm so happy they are mine.When I believe in myself,They shimmer and they shine.Princess Truly is back! In the second Princess Truly adventure, Truly's magical, sparkling curls have the power to transport her to exciting new places like the Egyptian pyramids, the Jurassic period, and even into outer space. With curiosity, bravery, and her signature smarts, Princess Truly once again proves that she can do anything she sets her mind to and reminds girls everywhere to reach for the stars, believe in themselves, and dream big!"}, {"id": "1476598940", "genre": "Children's Books", "title": "Fun Things to Do with Milk Jugs (10 Things to Do)", "description": "What can you do with an empty milk jug? Simple, step-by-step instructions transform ordinary household items into fun DIY crafts and games."}, {"id": "0688102581", "genre": "Children's Books", "title": "Bound for America: The Forced Migration of Africans to the New World", "description": "Between about 1500 and 1850, millions of Africans were captured and transported across the Atlantic in one of the most tragic ordeals in human history. In this objective and profoundly moving book, Haskins and Benson open with discussions of slavery thoughout history and of Europe and Africa at the time the African slave trade began, then closely examine every aspect of the Middle Passage. Included are sections on capturing the slaves, the march to the coast, the selection of slaves for purchase, conditions on slave ships, and slave revolts aboard ship. Illuminated with historic prints, photographs, and Floyd Cooper's compelling paintings. Timeline, bibliography, map, and index included."}]