[{"id": "1635651883", "genre": "Children's Books", "title": "Words That Built a Nation: Voices of Democracy That Have Shaped America’s History", "description": "When originally published in 1999, Words That Built a Nation was hailed for bringing together the United States’ most important historical essays, speeches, and documents into one accessible collection for kids. Now, this history lovers’ must-have is back, and it’s been revised, revamped, and expanded for the 21st century. From the Constitution and the Gettysburg Address to the 2015 Supreme Court ruling on same-sex marriage, the updated collection preserves the documents of the first edition and introduces the landmark statements that are impacting our nation today. With all new illustrations, a refreshed design, and complementary background information behind each of the documents, Words That Built a Nation is the ultimate tour of United States history, created to engage, inspire, and equip kids with the knowledge they need to change and shape their world.“This book is attractive and the presentation engaging.”―School Library Journal "}, {"id": "1465420924", "genre": "Children's Books", "title": "DK Eyewitness Books: Cat", "description": "See a jaguar swimming, a cat that can outrun a car, a leopard who lost his spots, and a black panther stalking its prey. Learn why cats need whiskers, how they purr, how the Manx cat lost its tail, and why a tiger is striped. Discover how cats communicate, how cats find their way home, why the black cat has been both persecuted and pampered, why they are said to have nine lives, and more. From domestic cats to the beasts prowling in the wild, Eyewitness: Cat looks at these beautiful mammals that are a part of our world. For over 25 years, DK's Eyewitness books have been the most trusted nonfiction series in classrooms, libraries, and homes around the world. In summer 2014 this award-winning series will get a fresh new look both inside and out. The introduction of paperback editions, eye-catching jackets, and updated interiors ensure that the Eyewitness series will continue to be relevant in the ever-changing world of education and remain the go-to source for homework help, research projects, reluctant readers, ESL students, and, as always, to satisfy the minds of curious kids. Supports the Common Core State Standards."}, {"id": "0141379308", "genre": "Children's Books", "title": "You Choose in Space", "description": "Zoom off into space for an adventure where YOU CHOOSE what happens next. Which alien would you most like to be friends with? And what fantastically freaky food will you decide to munch for lunch? The possibilities are infinite in this mesmerising creative toolkit which will inspire children from 3 up to make their own stories time and again - a spectacular sequel to the bestselling You Choose - it's out of this world!"}, {"id": "1935204025", "genre": "Children's Books", "title": "The New Witches Club and the Sleepover Charm", "description": "Emma is excited about the sleepover she has planned for her eleventh birthday party. When Emma discovers that she and all of her friends are actually witches with magical powers, and they are getting a visit from a mysterious Witch Hannah, it gets even more exciting. Emma soon learns of an ancient and terrible sleepover curse that threatens to ruin the party. Can the power of these New Witches be enough to break this dastardly spell? Come join in the adventures of The New Witches Club to find out!"}, {"id": "B0716QL9LV", "genre": "Children's Books", "title": "The Abandoned Hamster (Animal Rescue)", "description": "Abandoned, lost, neglected? There's always a home at Animal Magic!In a perfect world there'd be no need for Animal Magic. But Eva and Karl Harrison, who live at the animal rescue centre with their parents, know that life isn't perfect. Every day there's a new arrival in need of their help. When Eva finds a hamster hiding in the rubbish bin at her grandad’s garden centre she’s determined to find out who he belongs to. All the signs point to Katie, the unfriendly girl who’s moved into Ash Tree Manor with her parents, but how can Eva prove she’s right?A heart-warming animal story, perfect for fans of Holly Webb and Magical Animal Friends."}]