[{"id": "B01JAH83EI", "genre": "Children's Books", "title": "Aberto (book 9) - Aberto Meets Arthur Seagull", "description": "Aberto is a friendly little Portuguese bird. One day he meets up with the not so friendly Arthur seagull. Oblivious of Arthur's disregard and lack of interest in sharing friendship, Aberto decides to fly to Africa with him. On the way he finally realises that Seagulls have a tendency only to think about themselves. The ending is a message to all children that true friendship involves sharing and caring. Give it a try at bedtime with your young children any age from three to seven. The colourful illustrations alone will give you something to share with them. There are several other Aberto stories in the series all colourfully illustrated."}, {"id": "B076DVLML9", "genre": "Children's Books", "title": "The T-Rex Who Lost His Specs!", "description": "Meet the accident-prone T-Rex. First he loses his glasses, then he has one disaster after another: he can't tell his breakfast toast from a slipper, then he mistakes a prehistoric owl for his bath towel! A laugh-out-loud tale from legendary picture book duo Willis and Ross."}, {"id": "B00LFZ0XT2", "genre": "Children's Books", "title": "Twenty-Four Gustav Klimt's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Gustav Klimt''s Paintings. Twenty-Four Gustav Klimt''s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "0613457986", "genre": "Children's Books", "title": "Motocross (Radical Sports)", "description": "Provides an overview of motocross, which is the sport of racing motorcycles on rough, hilly dirt tracks, including technique, equipment, guidelines, resources, and safety concerns."}, {"id": "1618931423", "genre": "Children's Books", "title": "Baseball: Then to WOW! (Sports Illustrated Kids Then to WOW!)", "description": "Baseball: Then to WOW! shows readers how baseball has evolved from the early days of the 1920s to the game it is today. Using MLB action photographs, illustrations, stories, and trivia, the book is a journey through time both for baseball fans and those new to the game. Kids will learn how basic equipment has changed from fingerless gloves to specially tailored leather-bound mitts and how the evolution of game strategy has transformed the sport, players, and equipment. Players throughout history are stacked up against each other in every position so fans can dream up the perfect fantasy team with Babe Ruth playing alongside Hank Aaron and Reggie Jackson. A fun-filled section of the book explores everything fan culture-from the perfect ballpark frank to the importance of baseball cards and video games in popularizing the sport."}]