[{"id": "B01J8WBNWY", "genre": "Children's Books", "title": "Amazing Americans: Rosa Parks (Social Studies Readers : Content and Literacy)", "description": "Rosa Parks was an amazing woman. She stood up for herself and for her beliefs. One day, Parks refused to give up her seat to a white man on a bus. Her actions helped spark the civil rights movement. Today, people have more freedom in America because of her actions. Colorful images, supporting text, a glossary, table of contents, and index all work together to help readers better understand the content and be fully engaged from cover to cover."}, {"id": "0142300810", "genre": "Children's Books", "title": "Here Comes Kate (Action Packs)", "description": "In four stories, Kate, a young elephant, plays in the snow, learns to appreciate her new quilt, fusses over a lost toy, and quiets the crying of her baby cousin. Reprint."}, {"id": "B076ZV516J", "genre": "Children's Books", "title": "70+ easy and beautiful crochet motifs, patterns and tutorial", "description": "extremely helpful book for beginners who want to learn how crochet patterns are actually made. This book will teach you patterns of crochet motifs, their patterns, and a tutorial on how to change them into useful stuff like scarfs, bags,  sweaters and much more. once you learn how a motif is made and how it is converted into chains you can easily turn them into whatever you want!"}, {"id": "1563648733", "genre": "Children's Books", "title": "The Torchlighters Biography Series: Corrie ten Boom", "description": "Corrie ten Boom and her family are just simple watchmakers in Haarlem, Holland, where they give what little they have to spread God's love and help others. But everything changes when World War II breaks loose and Nazi soldiers take over. As the Nazis force Corrie's Jewish neighbors out of their homes and send them to deadly concentration camps, the Ten Boom family must make a difficult choice. What can Corrie and her family do in the face of so much evil?  Read the amazing true story of Corrie ten Boom, a Torchlighter hero of the faith, and discover how her obedience to God saved lives and continues to inspire others today."}, {"id": "B004Y6MVV2", "genre": "Children's Books", "title": "Yotsuba&!, Vol. 7", "description": "Mooooo...! MOOOO...! Cows are neato! It's fun pretending to be a cow! And milk comes from cows, so I bet they're real nice too. 'Cos milk is super-yummy, right?! Yotsuba thinks so! And milk comes in lotsa flavors, so cows must come in different flavors too. How else is there white milk and coffee milk and chocolate milk?! Then there's the black and white cows, they've gotta make a super-secret special flavor, huh?! Yotsuba wants to know! Let's go ask the cows at the ranch, Daddy! Come on!"}]