[{"id": "B01D9ENXQQ", "genre": "Children's Books", "title": "Great Battles for Boys: Gettysburg", "description": "The Battle of Gettysburg is considered the most important engagement of the American Civil War. After a huge victory over Union forces at Chancellorsville, General Robert E. Lee marched his army into Pennsylvania. The two sides clashed at the town of Gettysburg on July 1, followed by even heavier fighting the next day. On July 3, Lee ordered the famous (and disastrous) attack known as “Pickett’s Charge.” Read about this famous fight that changed the United States forever.From the bestselling history series, \"Great Battles for Boys: Bunker Hill to WWI,\" taking kids--and adults--to the front lines of the world's most significant fights. History will never look the same again."}, {"id": "0060274328", "genre": "Children's Books", "title": "The World of William Joyce Scrapbook", "description": "Packed with a year's worth of holiday photographs, hilarious anecdotes, early sketches, snippets of future projects, and more, this book takes readers on a leisurely ramble through the mischievous landscape of a critically acclaimed author-illustrator."}, {"id": "1582460507", "genre": "Children's Books", "title": "First Book of Sushi (World Snacks)", "description": "Miso in my sippy cup, tofu in my bowl! From tekka maki to wasabi, tasty treats await young readers in this colorful, rhyming ode to Japanese cuisine. With pages full of tummy-tempting foods, the books in the World Snacks series are a delicious way to introduce even the littlest eaters to cuisines from all around the globe."}, {"id": "1409516490", "genre": "Children's Books", "title": "Illustrated Stories from Around the World (Illustrated Story Collections)", "description": "A wonderful collection of ten folktales specially chosen from around the globe. Stories are The Baobab Tree, Baba Yaga the Flying Witch, The Stonecutter, Dick Whittington, The Three Wishes, The Fish that Talked, King Midas and the Golden Touch, Brer Rabbit Down the Well, The Magic Pear Tree and Genie in the Bottle. Each story is brilliantly illustrated by artists from the Usborne Young Reading Programme."}, {"id": "B00FVHFEKS", "genre": "Children's Books", "title": "Learn About Horses", "description": "This picture book teaches children about basic horse care, safety, and riding. This book is packed with humorous illustrations and valuable tips about safe horsemanship."}]