[{"id": "1682807940", "genre": "Children's Books", "title": "2nd Grade Math Workbook: Counting Money | Math Worksheets Edition", "description": "The concept of money needs to be taught well to a child. He/she needs to learn its importance and how it should be handled. In math, the concept of money can be learned through numerous practice scenarios. Therefore, the purpose of this workbook is to help a child understand how money works through trial and error. Start learning today!"}, {"id": "1520338678", "genre": "Children's Books", "title": "My Own Combat Comic Book", "description": "A blank script for you to write, create and illustrate your very own comic book!    Have you ever wanted to create your own comic book but didn't know where to start? Now you do. This comic book/graphic novel will be your own creation once you fill in each panel with your own great story. Bring your characters to life and tell their tales.    A large size (8.5x11) book that contains 21 pages with various combinations of blank panels. Just enough pages to tell a great story without overwhelming the artist who creates it or the fan who reads it.    Much more info on our website myowncomicbook.com  including info on customizing.    *We recommend using colored pencils, crayons or similar to fill in panels. Markers, pens and paint may bleed through pages*"}, {"id": "155453819X", "genre": "Children's Books", "title": "Hurry Up, Franklin", "description": "In this Franklin Classic Storybook, Franklin sets off to Bear's house for a birthday party, but it's far from a straightforward journey. Like most preschoolers, Franklin is a dawdler, slow even for a turtle. The trip becomes an opportunity to play leapfrog with Rabbit, slip and slide in the mud with Otter, and maybe even play hide-and-seek with Fox. But just in time, Franklin remembers that he mustn't be late for Bear's special day."}, {"id": "B077M2DP3R", "genre": "Children's Books", "title": "Squash Boom Beet: An Alphabet for Healthy, Adventurous Eaters", "description": "\"Stomp your feet. Squash the ground. It's time to explore all around. March to the garden. Listen to the beat. Get ready to find something wild to eat!\" .... Tasting new vegetables can be an exciting adventure, especially when trying foods like dragon tongue beans, dinosaur kale, fairy tale eggplant and candy cane beets. Journey from A to Z in this award-winning book and enjoy beautiful color photography of exciting farm foods—everything from awesome Asparagus to green tiger Zucchini! This is the book parents have been waiting for. Kids will want to be brave eaters if it means trying these fun veggies. The ebook version is the perfect companion for kids when visiting the grocery store or farmers market, and helping in the kitchen. This visual field guide is a meal-time game changer! 56 pages of full-color photography of fun foods 50+ Midwest farms and gardens featured Winner of 3 international book awards "}, {"id": "1452051992", "genre": "Children's Books", "title": "Ali's Special Cure", "description": "This story is about the Islamic concept of prayer, but the underlying message is that as human beings we all ultimately believe in the same values and have the same dreams, no matter what religion we belong to. Through greater understanding of each other's beliefs and values, we are able to promote harmony within our society."}]