[{"id": "0582364191", "genre": "Children's Books", "title": "Aquila New Edition Cased (NEW LONGMAN LITERATURE 11-14)", "description": "This volume is part of the \"New Century Readers\" series of modern and classic novels, short stories and plays. Each book in the series provides the complete, original text; a section by or about the writer; and a study programme and guidance on keeping a reading log."}, {"id": "0689858442", "genre": "Children's Books", "title": "Dora's Halloween Adventure (Dora the Explorer)", "description": "Oh, no! Swiper swiped Boots's Halloween candy! Follow the candy trail and lift the flaps to help Dora and Boots find where he hid it -- and a few spooky surprises along the way!"}, {"id": "1909621234", "genre": "Children's Books", "title": "Aesop's Fables", "description": "This timeless collection brings together three hundred of the most enduringly popular of Aesop fables in a collection that will delight young and old readers alike. Here are all the age-old favourites - the wily fox, the vain peacock, the predatory cat and steady tortoise - just as endearingly vivid and relevant now as they were for their very first audience. Arthur Rackham was the leading decorative illustrator of the Edwardian period, and in this volume his delightful pen-and-ink illustrations have been beautifully and sensitively coloured by Barbara Frith."}, {"id": "B00SI02DMW", "genre": "Children's Books", "title": "The Girl Who Buried Her Dreams in a Can: A True Story", "description": "An inspirational picture book autobiography from Oprah Winfrey’s \"All-Time Favorite Guest”  This is the story of a little girl with big dreams.All the girl ever wanted was an education. But in Rhodesia, education for girls was nearly impossible. So she taught herself to read and write with her brother’s schoolbooks and to count while watching cattle graze. When the girl became a young wife and mother, she wrote her goals on a scrap of paper and buried them in a can—an ancient ritual that reminded her that she couldn't give up on her dreams.She dreamed of going to America and earning one degree; then a second, even higher; and a third, the highest. And she hoped to bring education to all the girls and boys of her village.Would her dreams ever come true?Illustrated with Jan Spivey Gilchrist’s graceful watercolors, Dr. Tererai Trent’s true story of perseverance is sure to inspire readers of all ages.From the Hardcover edition."}, {"id": "B01GISF05C", "genre": "Children's Books", "title": "Toot, Toot, Tootie (Toot, Toot, Tootie: Whimsical Adventures of a Shy Elephant Shrew Book 1)", "description": "\"What does it take to make friends?\" Think's Tootie, the shy Elephant Shrew as she goes on an adventure and meets all the animals in the Zoo. From great big elephants, to small catfish, bats and even a friendly kangaroo-rat!  Come along with us and help Tootie find her inner courage and make friends along the way!With colorful illustrations on every page, jump in for a fun read!"}]