[{"id": "0060256559", "genre": "Children's Books", "title": "A Giraffe and a Half", "description": "From Shel Silverstein, the New York Times bestselling creator of Where the Sidewalk Ends and The Giving Tree, comes a riotous rhyming picture book about a boy and his giraffe!Featuring rhythmic verse and iconic illustrations, A Giraffe and a Half will leave every reader, young and old, laughing until the very end. Beloved for over fifty years, this classic captures Silverstein’s signature humor and style.If you had a giraffe and he stretched another half, you would have a giraffe and a half. But what happens if you glue a rose to the tip of his nose? Or if you used a chair to comb his hair? Join this giraffe on a rollicking and ridiculous journey that will charm readers from beginning to end. And don't miss Runny Babbit Returns, the new book from Shel Silverstein!"}, {"id": "B00DTOYDNE", "genre": "Children's Books", "title": "Vivaldi and the Invisible Orchestra (Christy Ottaviano Books)", "description": "Every day, Antonio Vivaldi composes a new orchestral piece, and every day, the orphan Candida transcribes Vivaldi’s masterpiece into sheet music for the Invisible Orchestra. Nobody notices Candida or appreciates her hard work.But one day Candida accidentally slips a poem she wrote into the sheet music and the girl so often behind the shadows gets recognized for her own talents. Vivaldi really did have an Invisible Orchestra made up of orphan girls he taught to play. This beautiful book pays tribute to their inspiration."}, {"id": "0448461587", "genre": "Children's Books", "title": "Max Has a Fish (Penguin Young Readers, Level 1)", "description": "Max loves his pet fish--it can swim, eat, and even blow bubbles. But Max is incredibly disappointed to learn that his fish can't dance. Is there another animal that can dance with Max? Find out at the end of this fun and fast-paced Level 1 story!"}, {"id": "0375841164", "genre": "Children's Books", "title": "Motorcycles! (Step into Reading)", "description": "WHETHER THEY'RE JUMPING barrels, zipping along the highway on a road trip, or tearing up the motocross track, motorcycles are the coolest things on two wheels! Choppers! authors Susan Goodman and Michael Doolittle show readers the many types of motorcycles there are, how they work, and some of the exciting jobs, competitions, and events that feature them. This actionpacked Step 3 reader is filled with vibrant color photographs!"}, {"id": "0486274624", "genre": "Children's Books", "title": "Medicinal Plants Coloring Book (Dover Nature Coloring Book)", "description": "For centuries plants have been used to assuage or cure a wide variety of human ills. Even such familiar “weeds” as the dandelion have their palliative uses. This informative coloring book, featuring 44 accurate drawings by botanical illustrator Ilil Arbel, focuses on such medicinal plants from around the world as foxglove, belladonna, mayapple, valerian, dandelion, chamomile, quinine, arnica, burdock, tamarind, lobelia, and many more.Each illustration is accompanied by an informative caption outlining the plant's coloration and physical characteristics, geographic distribution, and medicinal uses. Invaluable as an identification guide and pictorial reference, this volume will appeal to colorists of all ages as well as to artists and crafters in need of royalty-free plant illustrations."}]