[{"id": "031630753X", "genre": "Children's Books", "title": "CatStronauts: Space Station Situation", "description": "In the third book in the CatStronauts graphic novel series, your favorite elite team of cat astronauts is a member short--one of the team has quit! When chief science officer Pom Pom rejoins the CatStronauts on the International Space Station, she has to get to work right away--the Hubba Bubba Telescope isn't working, and CATSUP is losing funding by the day! But as the CatStronauts and Mission Control race to find answers, the unthinkable happens and pilot Waffles is forced to orbit the Earth in nothing but his space suit. Even though he's no scaredy cat, Waffles has a hard time staying out in space. When disaster on a global scale rears its head, will a fractured CatStronauts team be enough to save the day? In this full color graphic novel, debut author/illustrator Drew Brockington takes the CatStronauts to the brink, adding in mounds of jokes, charm, asteroid showers, and enough tuna for everyone!"}, {"id": "1543076769", "genre": "Children's Books", "title": "Happy St. Patrick's Day: Blank Sketchbook, Extra large (8.5 x 11) inches, 110 pages, White paper, Sketch, Draw and Paint", "description": "This Sketchbook has 110 blank pages. Good Quality white paper. Soft cover (Matte finish). Size 8.5 x11 (extra large). You can use this book to sketch, doodle and draw. Great St. Patrick's day gift for kids, teens and adults."}, {"id": "1683300025", "genre": "Children's Books", "title": "My First Book of Soccer: A Rookie Book: Mostly Everything Explained About the Game (A Sports Illustrated Kids Book) (Sports Illustrated Kids Rookie Books)", "description": "The fourth book in the fan-favorite Rookie Book series, Sports Illustrated Kids explains the most popular sport in the world to its youngest fans. The ref blows the whistle, the striker approaches for kickoff, feet fly—a soccer match is underway! With a fun mix of Sports Illustrated action photography, simple text, a full glossary of terms, and awesome graphics, My First Book of Soccerintroduces readers to the world’s favorite game. Kids (and probably a few adults, too) will learn how the clock counts “up” and never stops, what an offside means, what’s up with those yellow cards, and how kicks become a gooooaaaallll! Illustrated \"rookie\" characters appears on every page, guiding the reader moment by moment, and helping to make My First Book of Soccer an ideal shared reading experience between parents and their little rookies before, during, and after the game.  "}, {"id": "0836859472", "genre": "Children's Books", "title": "The Nazi Death Camps (World Almanac Library of the Holocaust)", "description": "Discusses where the death and concentration camps were located in Nazi Germany, the methods used to kill those sent to the camps, and what happened to those who were forced to work in the camps."}, {"id": "B013D07K2Y", "genre": "Children's Books", "title": "Galaxies: Picture Book For Kids", "description": "What are galaxies? When they formed? How many are there? Learn many interesting facts about galaxies that will blow your mind.Download this book now, and enjoy quality time with your kids."}]