[{"id": "149353338X", "genre": "Children's Books", "title": "The Cats of Harrington Road: And the Holiday Guests", "description": "Holiday themed sequel to \"The Cats of Harrington Road\" that involves Hanukkah and Christmas stories as well as Russian holiday traditions."}, {"id": "0431004900", "genre": "Children's Books", "title": "History Topic Books: The Ancient Egyptians Builders and Craftsmen Hardback (Primary History Topic Books)", "description": "Focusing on builders and craftsmen of Ancient Egypt, this book is one of a series providing opportunities for children to extend their historical knowledge. Each book looks at real people from each period and offers a range of primary and secondary sources, both written and pictorial."}, {"id": "1682970760", "genre": "Children's Books", "title": "How to Code: A Step-by-Step Guide to Computer Coding", "description": "Introduces the basic principles of coding. Learn how to give instructions and turn instructions into code. Figure out how to debug code, solve problems and use algorithms.   Includes basic coding, solving problems, turning instructions into code, logo and scratch."}, {"id": "1435829409", "genre": "Children's Books", "title": "Trucks Inside and Out (Machines Inside Out)", "description": "Presents information about the exterior and interior of trucks, describing their structure, engine, tranmission, steering, brakes, wheels, and suspension, along with facts about special vehicles."}, {"id": "0064442594", "genre": "Children's Books", "title": "Emma's Strange Pet (I Can Read Level 3)", "description": "From an award-winning team comes a lively and heartwarming I Can Read book about a family's first pet.Pet wanted! Max wants a furry pet. Emma wants a pet too, but she's allergic to animals with fur. When Emma finds the perfect animal, will Max like his sister's strange pet?Emma’s Strange Pet is a Level 3 I Can Read Book, which means it’s perfect for independent reading. Kids will love reading this high-interest story about Emma and Max’s fun with their new pet!"}]