[{"id": "0737737247", "genre": "Children's Books", "title": "Illegal Immigration (Current Controversies)", "description": "Discusses opposing viewpoints on illegal immigration, including whether or not illegal immigration harms the United States and whether or not immigrants are treated fairly once they are here."}, {"id": "0756698456", "genre": "Children's Books", "title": "DK Readers L2: Boys' Life Series: Dinosaur Battles", "description": "Stegosaurus versus Allosaurus… Giganotosaurus versus Tyrannosaurus… who would win? With Dinosaur Battles, young dinosaur fans will come face-to-face with the most fearsome creatures that ever walked the Earth. Packed with basic facts on each creature, from its size and weight to its various methods of defense, this exciting spin on Boys' Life Readers will allow kids to predict the winners of each battle, while learning more about these grand and terrifying beasts."}, {"id": "B010GZXJ6U", "genre": "Children's Books", "title": "Ally Loves Basketball (Ally Loves Sports Book 4)", "description": "There’s no time like the present for Ally Mayberry to show what she can do on the basketball court! She’s excited about the brand new three-point line and the trophy that goes to the best shooter. In this thrilling new book, Ally learns to deal with playing a lesser role on a team that’s bound for greatness!"}, {"id": "1609735862", "genre": "Children's Books", "title": "Step-by-Step Experiments With Simple Machines", "description": "Explains what simple machines are and what they do; describes the scientific method; and includes experiments testing different simple machine concepts."}, {"id": "1631889311", "genre": "Children's Books", "title": "What We Get from Roman Mythology (21st Century Skills Library: Mythology and Culture)", "description": "This book introduces readers to Roman mythology, presents legendary characters and stories, and shows how Roman myths have influenced our culture. Readers are engaged with historical content while sharpening their skills at analyzing images and identifying evidence."}]