[{"id": "0525578005", "genre": "Children's Books", "title": "Too Many Cupcakes! (DreamWorks Trolls) (Beginner Books(R))", "description": "A Beginner Book featuring all the DreamWorks Trolls!Based on the DreamWorks Animation movie and TV series Trolls, Biggie asks the Bizzy Buzzer Bugs to help him bake cupcakes for Poppy's party. The Bizzy Buzzer Bugs can't wait--but they can't stop! Will the Trolls get buried in sweet treats? Girls and boys ages 4 to 6 will love following the all-new adventures of Poppy, Branch, and their friends in this original Beginner Book, which features Troll-tastic full-color illustrations!"}, {"id": "B00GF3XAA8", "genre": "Children's Books", "title": "AMAZING LABRADORS: A Children's Book About Labrador Retriever's Amazing Facts, Figures and Pictures/Photos: (Dog Books For Kids)", "description": "Of all the dog breeds in the world, the Labrador Retriever, or “Lab”, is one of the most favored. It has been known to be a faithful companion and a reliable assistant, and it is one of the top choices for a family pet.This children's book about labrador retriever dog can help your kid gain a better understanding of Labrador Retrievers, and even enrich his appreciation for the breed. Whether your child is a dog-lover or a dog-doubter, it may help improve the way he relates with Labs. Everyone wants to have a good buddy. The Labrador Retriever can be a wonderful friend. It is quite a wonderful dog. Here are some amazing things about it."}, {"id": "B077QNPRG3", "genre": "Children's Books", "title": "The Magic Money Tree", "description": "Think you can use magic to get rich quick? Well think again.Aaron dreams of being rich, but he knows little about finance. When a passing stranger makes him an offer that sounds too good to be true, Aaron starts down a path that could leave him and his sister, Lily, destitute.Can Lily catch the con man and stop Aaron from squandering all their savings on a scam? Can Aaron learn from his mistakes and discover the real key to a wealthy future?This delightful, illustrated poem tells the cautionary tale of a humble market trader, Aaron, who falls for a con man’s trick and risks losing it all, but is saved by his sister and some great advice about the magic of compound interest.Pick up The Magic Money Tree today to uncover the true secret to wealth."}, {"id": "0872263576", "genre": "Children's Books", "title": "The Aztecs", "description": "Who were the Aztecs?  Did they grow their own food?  Did they build cities?  Who did they worship?  What was it like to live in the Aztec world?This series takes an exciting look at religion, history, and culture through the everyday lives of people from all over the world.  Using color photographs and detailed illustrations, each book helps young people ask questions and leads them toward a better understanding of a particular historical era, faith or civilization."}, {"id": "B00EEA938M", "genre": "Children's Books", "title": "All Aboard, Mr. Lincoln! Abe Lincoln and the Railroads, Retro Comics 6,  Historical Biography 2", "description": "Best Selling Kindle Author Presents…Abraham Lincoln and the RailroadTravel to the FRONTIER! THE CUTTING EDGE OF HISTORY!Be there!on horseback over trails through the AWESOME wildernessPlod by Covered Wagon drawn by oxen over rough terrainTravel by rough and dusty Stage CoachBy RiverboatAnd JOIN Abe Lincolnas he rides the Experimental Railsfights for Railroads’ Rights as a lawyeras he travels by rail to Washington as President-elect, stopping for the cheering crowds, and as he is secretly moved from train to train as an Assassination Attempt surfaces outside of Baltimoreas he rides the rails to the Battlefields during the Civil Waras he rides in his President’s Caras the Black-Draped Train takes him on his Last Ride from Washington to Illinois... to his final resting place, after his AssassinationA Fabulous Slice of Dynamic, Colorful History, and Drama….AND YOU ARE THERE!...A PIONEER ON THE CUTTING EDGE through Retro Comics!Scroll Up to \"BUY NOW\" and Start Experiencing Today!  "}]