[{"id": "B06XH1KVV8", "genre": "Children's Books", "title": "Martin Little, Resurrected: A Fantasy Adventure in Heaven", "description": "Meet Martin Little — Little by name, little by fortune, and with the luck to match those two. Martin's life is not going too well. The world is against him, everything that can go wrong does… and that's all before he dies. Once he breaks into Heaven, it's all a downhill slide to Hell. His new friends are not the kind he would have picked in his righteous life on Earth, but one can't be too choosy in the afterlife. But would it be too much to ask to stay on the right side of the heavenly law?Would he be able to strike a deal with God and save himself and his friends? Would the love of his life give him a chance? Would he choose to live again or be doomed to play Roulette with Hades forever?Thoroughly British, quirky and free, this rollercoaster adventure through the heavenly realm is complete escapism, clean and fun, and a suitable read for the whole family.And to think that it all started with a cup of hot chocolate…"}, {"id": "0312504837", "genre": "Children's Books", "title": "Sticker Activity ABC: Over 100 Stickers with Coloring Pages (Sticker Activity Fun)", "description": "Children will love learning the alphabet as the find the stickers, answer the questions, and color the pictures in this fun activity book! Featuring over 100 stickers."}, {"id": "B018ZSLU5W", "genre": "Children's Books", "title": "12 Matchsticks", "description": "12 Matchsticks12 Days 12 PrayersA poor young boy gets an unusual gift at a school Christmas party that will change lives forever.             "}, {"id": "B01N4DR201", "genre": "Children's Books", "title": "Avalanche! (Survivor Diaries)", "description": "A high-stakes adventure series perfect for fans of the I Survived series and Hatchet. Twelve-year-old twins Ashley and Ryan are skiing with their parents in Wyoming's Grand Teton Mountains where there is a ground-shaking rumble. Unstable snow rushes downhill and buries them in icy white. It will take all of their knowledge and grit to survive.     With seventeen years of hands-on experience and training in remote areas,  survival expert Terry Lynn Johnson (Ice Dogs; Sled Dog School) creates on-the-edge-of-your-seat storytelling featuring the real skills that kids need to survive a disaster. This page-turner with illustrations includes survival tips from the National Avalanche Center and U.S. Forest Service. You could have a better chance of surviving a real-life avalanche after reading this book!     Stay calm. Stay smart. Survive.   "}, {"id": "0750251328", "genre": "Children's Books", "title": "What Happens When You are Born and Grow? (How Your Body Works)", "description": "Well-annoted diagrams and vibrant photographs show both the internal and external workings of each system. This book compares humans with animals and provides fun health tests and checks. It is ideal for key stage 2 science curriculum."}]