[{"id": "0786939419", "genre": "Science Fiction & Fantasy", "title": "Race Series Collection (Dungeons & Dragons d20 3.5 Fantasy Roleplaying, 3 Book Slipcased Set)", "description": "The second in a series of essential titles for the Dungeons & Dragons roleplaying game. This slip-covered gift set contains three supplements that expand the core race options for the D&D roleplaying game: Races of Stone™, Races of Destiny™, and Races of the Wild™. Choosing a race is one of the most fundamental steps in creating a character, and for the first time the supplements that focus on this important area have been collected in one set.  "}, {"id": "B078D6F44K", "genre": "Science Fiction & Fantasy", "title": "Southern Charmed (Hell's Belles Trilogy Book 2)", "description": " They'll bless your heart before they hex your a**Foster kid Briar Givhans grew up on the wrong side of the Charleston society tracks. She has no idea who her parents are or where she came from. She showed up as a toddler on the door step of a fire station with a note stuck to her back with just her name and age on it. No one ever claimed her. Now she's an adult and has long since given up on figuring out her true identity. And then Hell's Belles comes knocking on her door... This is Book Two in the Hell's Belles trilogy! Questions are answered... And even more are raised. To be a Belle is to hide everything you are. All to protect the ones you love. It's more high stakes adventure in the Holy City!"}, {"id": "1937013170", "genre": "Science Fiction & Fantasy", "title": "Agents of Oblivion (Savage Worlds, REB70001)", "description": "Ready for horror-fueled espionage action? Agents of Oblivion wants you! Agents of Oblivion is the highly anticipated Savage Worlds setting book we like to call \"The Perfect Cocktail of Horror and Espionage\". The pages within are graced with everything you need to play the style of spy game you want to play from \"The Company Line\" where every nightmare and conspiracy you can imagine is real and you can wield the powers you need to drive back the darkness to \"Spy versus Spy\" where you can take things on in a gritty brutal fashion."}, {"id": "192521205X", "genre": "Science Fiction & Fantasy", "title": "Angel Dust", "description": "Angel Dust is the first story collection by Australian rising star Ian McHugh. McHugh is a Writers of the Future winner, and has a number of significant overseas short fiction sales.  Angel Dust collects 15 incredible fantastic visions. A number of these were first published in Asimov's and Beneath Ceaseless Skies. Four stories are original to this collection.  Asimov's editor Sheila Williams says of this writer, \"Ian McHugh has a remarkable ability to render the alien utterly convincing. His nonhuman lives are so powerfully depicted that we can easily, and sometimes uneasily, immerse ourselves completely into their worlds.\""}, {"id": "B0756K6X32", "genre": "Science Fiction & Fantasy", "title": "Medusa Uploaded: A Novel (The Medusa Cycle)", "description": "Medusa Uploaded by Emily Devenport offers readers a fast-paced science fiction thriller on the limits of power and control, and the knife-edge between killing for revenge or a greater good.The Executives control Oichi’s senses, her voice, her life. Until the day they kill her.An executive clan gives the order to shoot Oichi out of an airlock on suspicion of being an insurgent. A sentient AI, a Medusa unit, rescues Oichi and begins to teach her the truth—the Executives are not who they think they are. Oichi, officially dead and now bonded to the Medusa unit, sees a chance to make a better life for everyone on board.As she sets things right one assassination at a time, Oichi becomes the very insurgent the Executives feared, and in the process uncovers the shocking truth behind the generation starship that is their home.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}]