[{"id": "0756645069", "genre": "Children's Books", "title": "Thomas Jefferson", "description": "Filled with archival photographs and amazing fact boxes, DK Biography is a groundbreaking series that introduces young readers to some of history's most interesting and influential characters. From his childhood in Virginia to his two terms as President of the United States, DK Biography: Thomas Jefferson tells the story of the principal author of the Declaration of Independence. Supports the Common Core State Standards."}, {"id": "1508155755", "genre": "Children's Books", "title": "Software Architect (Behind the Scenes With Coders)", "description": "Software architects are in charge of designing and developing the software programs that computers need to operate. In this book, readers will learn more about what software architects do, including where they work, what information they should know, and what skills they should have. STEM concepts addressed in the Next Generation Science Standards are discussed throughout the text. The text support elementary curriculum and addresses computational thinking. A glossary helps readers gain an understanding of new or complicated computer terminology."}, {"id": "0545799570", "genre": "Children's Books", "title": "Busy Builders", "description": "The busy builders are hard at work driving bulldozers, cranes, and other construction vehicles to build a new school house. A simple rhyming construction story packaged in a sturdy specialty box format that will get little ones ramped up and ready to go!Safe for all ages."}, {"id": "B00F6FB59E", "genre": "Children's Books", "title": "All Systems Go Wall - E Reusable Sticker Book", "description": "RELIVE ALL OF the action and excitement of Disney•Pixar’s latest animated feature film WALL•E, the story of a lovable robot who goes on an out-ofthis- world adventure. Kids will love creating their own fun with this oversized, full-color activity book that features WALL•E and all his zany robot pals on two sheets of colorful reusable stickers!"}, {"id": "1612964117", "genre": "Children's Books", "title": "The Dream Travelers", "description": "Ten-year-old Richard decided it was fate that his stepsisters were with him when he discovered the book. If they hadn't been, he was certain he wouldn't have survived the arrow in his back or made it home alive from planet TRAUFOS. The mysterious book introduces the children to a dream-traveling wizard who sends them on exciting but frightening adventures. Cannistra, along with his impressive line-up of appropriate teachers - Winston Churchill, Nelson Mandela, Mozart, Eleanor Roosevelt, Neil Armstrong and Albert Einstein - succeed in teaching the children important, yet difficult lessons of life; lessons they must put into daily practice. Changes in the children come slowly, evolving with each new dream travel. They have been inspired to make a positive difference in the world, and now they can. Because now they have the power - the power to Dream On."}]