[{"id": "B011IMSQ18", "genre": "Children's Books", "title": "Sugar: My Journey Home", "description": "Most horses would be content to be left out in the pasture to graze their days away with no work, no expectations, no responsibilities. Not Sugar. She’s a mare with a mission…she just doesn’t know what it is yet.That is until she meets a woman who teaches her everything she needs to be the perfect horse for one little girl, completing Sugar’s journey home. "}, {"id": "B014X4QDNG", "genre": "Children's Books", "title": "Nursery Rhymes: Fingerprints on the Mirror - Early Readers Level 1-Teaches Value Book-Bedtime Stories Values-Read Aloud Books for Kids-Read Along Books for Kids: Rhyming Bedtime Story - Funny Rhymes", "description": "2017 Golden Book Award Readers' Choice Semifinalist Winner  Karlina is a young girl who displays her joyful personality by sharing her fingerprints in the little world around her. She expresses in a loving way her unique identity with unforgettable touches and sweet messages left behind for her family. This little girl has very innocent intentions and offers fingerprints to others for free."}, {"id": "0689817878", "genre": "Children's Books", "title": "Goldilocks And The Three Bears (Ready-To-Read)", "description": "In a tale cherished by every mischievous child, Goldilocks's uninvited visit to the bear's house is formatted perfectly for beginner readers--full of repetition, sly wit, and vivid illustrations."}, {"id": "B01N06RQMU", "genre": "Children's Books", "title": "Dino Gets Glasses!: Follow Dino and Friends on His Adventure To Get New Glasses. Getting New Glasses is FUN! (Dino's Adventures Book 1)", "description": "Something's different with Dino.  Things don't just look right.  Follow Dino and friends on this hilarious adventure to get new glasses.  It can be difficult to adjust to glasses but in this tale you learn how much fun and helpful it can be.  You'll laugh, learn, and test your imagination in this fun story."}, {"id": "B01IGD5YPI", "genre": "Children's Books", "title": "Bonko: Searching For a Banana", "description": "Bonko is a hungry gorilla. All his bananas are too green. He searches for more bananas. All his jungle friends try to give him something else to eat. He only wants bananas. Will he find bananas in time for dinner?"}]