[{"id": "1420501313", "genre": "Children's Books", "title": "Auschwitz (World History Series)", "description": "Examines the history of the Nazi German concentration and extermination camp in occupied Poland, including the events that led up to it establishment, as well as the aftermath of its liberation."}, {"id": "061332675X", "genre": "Children's Books", "title": "If You Lived In The Days Of The Knights (Turtleback School & Library Binding Edition) (If You Lived...(Prebound))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Discusses the lives of nobles, merchants, and peasants in Europe during the Middle Ages, providing information about work, clothing, cleaning habits, war, social structure, religion, and customs."}, {"id": "163177087X", "genre": "Children's Books", "title": "Maddies Me Bag", "description": "Meet Maddie, a delightful girl with a SWEET secret. Maddies Me Bag is a story about a girl with diabetes. Through a classroom activity, Maddie teaches her classmates about tools and resources she uses to live a healthy, happy life. But diabetes isnt the only thing that makes her special What else does Maddie have in her Me Bag?"}, {"id": "9501113752", "genre": "Children's Books", "title": "PLANETA TIERRA (101 preguntas)", "description": "Los libros de esta coleccion presentan un tema central a traves de preguntas y respuestas claras y sencillas. Esquemas, cuadros, glosario y coloridas ilustraciones anaden un aporte mas a la informacion."}, {"id": "B009ZPWCIO", "genre": "Children's Books", "title": "Birds of prey (Four Australian birds Book 2)", "description": "In this ebook, young readers will be able to learn about 4 Australian birds of prey. The birds of prey featured are the Black-shouldered Kite, White-bellied Sea-Eagle, Whistling Kite and Brown Falcon.For each bird of prey, the following sections are included: fun facts, what the bird of prey looks like, where the bird of prey lives, what the bird of prey eats and how the bird of prey breeds.There are colourful photographs throughout to illustrate and support the text.Birds of prey is Book 2 in the Four Australian birds series. It is a great starting point for learning about favourite birds and is ideal for school projects and homework assignments."}]