[{"id": "1584152826", "genre": "Children's Books", "title": "The Life and Times of Socrates (Biography From Ancient Civilizations)", "description": "Describes the life and times of Socrates, a philosopher and teacher in ancient Athens who held that wisdom comes from questioning ideas and values rather than simply accepting what is passed on by parents and teachers."}, {"id": "0884898814", "genre": "Children's Books", "title": "Journey of Faith for Advent and Christmas (Student Workbook)", "description": "Advent offers young people a chance to think about others and to consider gifts from the heart, not necessarily from the mall. The student workbook for Journey of Faith for Advent and Christmas is for the younger adolescent (ages 10-13) and accompanies the leader's guide. Materials offer opportunities for list making, journaling, responding, and more . . . all focused on the seasons of Advent and Christmas. The leader's guide offers eight chapters and a retreat and includes all the materials found in the student workbook, with directions for their use."}, {"id": "1604146362", "genre": "Children's Books", "title": "Kindergarteners On Their First School Bus", "description": "I was a school bus driver in an upper-moderate to high income, northern New Jersey town during 2009-2010. There were 34 kindergarten students assigned to my bus. Most of them had never been on a school bus before.   This colorful book will briefly give you a glimpse into the bus rides of these little super heroes and super heroines as they handled riding their first school bus during 10 months of a very challenging and sometimes hilarious, school year.    Richard L. Allen has been a school bus driver and has written several books. His books include: Lock and Key, A New Ark Police Officer's View of Poetic Just Ice/Justice, Poetic Black, Poetic Police Food For Thought, The All About Children/Kids Book and Poetic Black II"}, {"id": "1502632837", "genre": "Children's Books", "title": "Early American Legends and Folktales (Mythology and Legends Around the World)", "description": "Early American folktales demonstrate the ambitions and values of the first settlers in the United States, including bravery, honesty, and a pioneering spirit. These legends, tall tales, and fairytales also introduced beloved figures like Babe the Blue Ox and Paul Bunyan. This book explains the traditions of storytelling that are uniquely American and describes how historical events shaped the stories we still tell in modern day."}, {"id": "098943625X", "genre": "Children's Books", "title": "Franklin Bean Hurricane Hilda: Franklin Bean - book 4 (Franklin Bean Superhero Series) (Volume 4)", "description": "Franklin Bean and John have more to survive than a hurricane. Wild animals are everywhere, and superhero Pancho Frijole is trying to save them. There is more trouble at the command center when a new villain arrives. Will Pancho have the energy to finish what he started? Find out why everyone wants more of Franklin Bean first chapter books!"}]