[{"id": "044848854X", "genre": "Children's Books", "title": "Who Was Henry VIII?", "description": "Hear Ye, Hear Ye! Travel to the age of the Renaissance and learn why Henry VIII is one of the most famous kings in English history.Mainly remembered for his six marriages and his self-appointment as the \"Supreme Head of the Church of England,\" Henry VIII was also attractive, educated, and athletic. When Henry Tudor ascended to the English thrown at the age of 17, his reign looked promising. But by the time of his death in 1547, King Henry VIII was characterized as an extremely egotistical, harsh, and insecure king. Though Henry VIII's legacy isn't free from scandal, his monarchy thrived due to the achievements of his daughter Queen Elizabeth I."}, {"id": "0827605412", "genre": "Children's Books", "title": "K'Tonton's Yom Kippur Kitten", "description": "After allowing a small kitten to take the blame for something he did, K'tonton, a thumb-sized young boy, feels guilty when he goes to services at the synagogue on Yom Kippur"}, {"id": "146541424X", "genre": "Children's Books", "title": "How to Be a Genius", "description": "How to be a Genius reveals the magical and mysterious world of the brain. With facts, puzzles, brain teasers, optical illusions, and other brain training activities, readers will unlock their true intellectual power. How to be a Genius explores the physiology, anatomy, and evolution of the brain and then teaches innovative brain stimulating exercises. Covering all aspects of brain activity, from perception and problem solving, to memory, language, and creativity, readers will learn tips and tricks for getting the most out of the brain. The book also features activities including sports, magic, playing cards, and computer games. Readers will enjoy employing their creativity with this hands-on guide to the mind filled with wonderful knowledge and great activities to boost brainpower."}, {"id": "1538212722", "genre": "Children's Books", "title": "Poisonous Slow Lorises (Cutest Animals...that Could Kill You!)", "description": "Slow lorises are big-eyed primates. They look so sweet that it might be tempting to approach these cute creatures, but dont touch, slow lorises are very poisonous. When they think theyre in danger, they may deliver a toxic bite. Readers will find out much more about these fascinating creatures, including details about their habitat, diet, and life cycle. The entertaining text coupled with appealing photographs make this volume a high-interest experience for all levels of readers."}, {"id": "1467718882", "genre": "Children's Books", "title": "Andrew Luck (Amazing Athletes)", "description": "Indianapolis Colts quarterback Andrew Luck has had incredible success playing at the highest levels of football. Andrew helped Stanford University win the Orange Bowl in 2010. He could have gone to the National Football League (NFL) after the season, but Andrew returned to Stanford to get his degree. He was chosen by the Colts with the first pick in the 2012 NFL draft. Andrew quickly made his new team a winner. Learn more about this young quarterback with a bright future."}]