[{"id": "0008222053", "genre": "Children's Books", "title": "Collins Primary Thesaurus: Learn With Words (Collins Primary Dictionaries)", "description": "This fantastic thesaurus is especially designed for children aged 7 and over (Key Stage 2) and supports today's primary curriculum needs. Clear and accessible, it is an indispensable tool for young writers.A clear, easy-to-use thesaurus that provides support for children’s creative writing and helps build vocabulary, with full definitions for every synonym and sample sentences for each word.A simple, step-by-step introduction shows children how to get the best out of their thesaurus, while the colour headwords and A-Z bar on every page make it easy to find the right word.Additional word power features on frequently used words encourage children to be more creative in their word choice.Thematic pages help build vocabulary through carefully selected visually-appealing "}, {"id": "B0776JLZP7", "genre": "Children's Books", "title": "Goldy Luck and the Three Pandas", "description": "A careless Goldy Luck wreaks havoc on the home of a family of panda bears. She eats up the littlest panda’s rice porridge, breaks his rocking chair, and rumples all the blankets on his futon. When Goldy takes responsibility for her actions, she makes a new friend (and a whole plate of turnip cakes!) just in time for Chinese New Year."}, {"id": "0999175815", "genre": "Children's Books", "title": "The Wild Chicks", "description": "The series that launched Cornelia Funke as one of the most beloved authors in German, THE WILD CHICKS is a middle-grades to YA series about a group of German girls who form the eponymous “Wild Chicks” gang. Funke began the series after her editor’s request for a story “without fairies, ghosts, or pirates,” and was adamant about creating a realistic story, with relatable characters and adventures any child could have. THE WILD CHICKS pulls from Funke’s own suburban German upbringing and takes place in the late 20th century―before the popularization of cellphones, Wi-Fi, and many of the things that children now use to amuse themselves indoors. The members of the Wild Chicks gang―Charlie, Freya, Trudie, and Melanie―don’t have perfect families, but they have each other, humor, and plenty of adventures!"}, {"id": "1448852552", "genre": "Children's Books", "title": "Oviraptor: The Egg Thief (Graphic Dinosaurs)", "description": "Introduces the oviraptor; describes in graphic novel form its life as a female cares for her nest and survives on her own, hunting for food and avoiding enemies; and provides information on oviraptor fossils and the other creatures in the story."}, {"id": "B076DS7V4Q", "genre": "Children's Books", "title": "Let's Make Some Gold!: Science's Biggest Mistakes about Geology and Ecology (Science Gets It Wrong)", "description": "Is planet Earth flat? Is California an island? Can you mix other metals to make gold? At one time, science supported wild notions like these! But later studies proved these ideas were nonsense. Discover science's biggest mistakes and oddest assumptions about geology and ecology, and see how scientific thought changed over time."}]