[{"id": "1580001181", "genre": "Children's Books", "title": "The Olympic Experience in Your School Grades 4-6 (United States Olympic Committee Curriculum Series)", "description": "Bring the Olympic Spirit to life for students with information and activities that relate to the Olympic Games. Learn about Olympic history, traditions, sports, sites and events. This series of thematic units are cross-curricular, cooperative learning tools that are filled with fun activities that foster team spirit as students go for the GOLD. Explore the Olympic Games with lessons that cover all areas of the curriculum. Students become \"Olympic Scouts\" who work their way through different tasks, culminating in a classroom Olympic Games."}, {"id": "1943431167", "genre": "Children's Books", "title": "Seeking the Snow Leopard", "description": "Stunning photographs illustrate this first-hand account of an expedition to trap and collar an elusive and endangered snow leopard. This hopeful book will introduce young readers to the culture and ecology of the eastern Himalayas."}, {"id": "1448879310", "genre": "Children's Books", "title": "How to Survive in the Arctic and Antarctica (Tough Guides)", "description": "Provides information on how to survive if stranded in the polar regions, including staying warm, finding food and water, and keeping clear of cracks and crevasses."}, {"id": "1445133431", "genre": "Children's Books", "title": "Discover the Anglo-Saxons: Art and Culture", "description": "Discover the Anglo-Saxons introduces young readers to key figures, aspects and themes of Anglo-Saxon Britain. The books feature an appealingly graphic, young, colourful approach, with one large image per spread plus fact and feature boxes, timelines, places to visit and further resources.Art and Culture offers a look at sacred and secular art in Anglo-Saxon times, including illuminated manuscripts, jewellery and weapons. It examines the role of monasteries in the creation of books and the preservation of learning, and investigates literature, such as chronicles and stories."}, {"id": "0064440419", "genre": "Children's Books", "title": "Mouse Soup", "description": "Weasel is ready for his dinner, and poor Mouse is it. Can Mouse stop Weasel from serving up mouse soup for supper? The clever mouse tells the weasel four stories to make the soup tasty—then manages to trick the weasel and get home safely. This Level Two I Can Read is geared toward kids who read on their own but still need a little help. From Arnold Lobel, the beloved author and illustrator of the Newbery Honor and Caldecott Honor award-winning Frog and Toad books. "}]