[{"id": "1554553563", "genre": "Children's Books", "title": "5 Giraffes (5 Animals)", "description": " The latest in the 5 Animals series, with an introduction by Rob Laidlaw, 5 Giraffes profiles five unique giraffes from both captivity and the wild. Accompanying the five giraffe profiles is information on their diet, social life, and chapters on some of their more unique aspects, like the giraffe's unusual body. Includes full color photographs throughout, glossary, bibliography, table of contents and index.  Included in the 49th Shelf's recommended books for giving this season. "}, {"id": "0802854664", "genre": "Children's Books", "title": "The Blue Jackal", "description": "Juno the jackal is the runt of the pack, and the other animals bully him because of his size. One night, Juno is chased by some dogs from the village, and he hides in a vat of indigo dye to escape. When he returns to the forest, his fur is bright blue, and the animals hail this strange new creature as their king. But can Juno keep his true identity hidden? Featuring illustrations inspired by traditional Warli artwork and an informative historical note, this Indian folktale will spark a wonderful discussion about the relationship between perception and reality."}, {"id": "1515779645", "genre": "Children's Books", "title": "Houston, We've Had a Problem: The Story of the Apollo 13 Disaster (Tangled History)", "description": "In an immersive, exciting narrative nonfiction format, this powerful book follows a selection of people who experienced the events surrounding the Apollo 13 disaster."}, {"id": "1584150041", "genre": "Children's Books", "title": "Garth Brooks: A Real-Life Reader Biography", "description": "Examines the life and work of the popular singer-songwriter whose early struggles led to overwhelming success"}, {"id": "079452687X", "genre": "Children's Books", "title": "Usborne Illustrated Stories for Christmas", "description": "Charmingly illustrated stories for Christmas that take young readers to the Snow Queen's palace, riding on Santa's sleigh and wandering through Victorian London with the Ghost of Christmas Past, among other magical places."}]