[{"id": "1531823785", "genre": "Science Fiction & Fantasy", "title": "Yamada Monogatari: The War God’s Son", "description": "The Abe clan and its allies are in full rebellion. When the Emperor's greatest military leader, Yoshii, is targeted for assassination by magic, it is up to the newly sober Lord Yamada and his exorcist associate Kenji to keep the young man alive long enough to put down the uprising before the entire country is consumed by war. Yamada knows how to deal with demons, monsters, and angry ghosts, but the greatest threat of all is one final assassin, hidden in a place where no one - especially Lord Yamada - would ever think to look. "}, {"id": "B077XLBV45", "genre": "Science Fiction & Fantasy", "title": "Stryker Omnibus: Books 3-5: A Post Apocalyptic Tale", "description": "From the Amazon best-selling author, Bobby Andrews, comes the five-star rated Stryker series, omnibus version.\nPraise for Stryker: \"I can only give a 5 star rating because it only goes to 5 really deserves a 10+ !!!!!!!!!\"\n\"You combined a good read with some thrilling outcomes which kept me wanting to read through the night. Thank you for writing this series.\"\n\"Your books about Stryker and the gang have kept me totally involved until my eyes get blurry and I have to take a break from reading. I love that you are educating your readers about our country and many things military along the way.\"\nISIS unleashed a weaponized version of the deadly Ebola virus, killing 97 percent of the worlds population. Only the immune and those who hunkered down in remote locations remain. Through the chaos that remains strides a giant of a man known only as Stryker. He is a former Force Recon Marine who has lost as much as anyone, but fights to preserve his honor and creed in the face of slave traders and terrorists.\nTogether with his former battle buddy, Edwards, they struggle to eliminate the remaining evil, even as the nations infrastructure crumbles and life becomes considerably more difficult. They care for three young women who survived the plague and attempt to give them lives that are as normal as possible under the circumstances.\n"}, {"id": "B00LZ2JFG2", "genre": "Science Fiction & Fantasy", "title": "Dragonhunters (Guardian's Compact Book 2)", "description": "Only one Mage Guardian now defends Aerope from the malevolent plans of Denais and his dreams of conquest and revenge.  Ardhuin desperately tries to make the Allied governments see the danger and replace their murdered Guardians, but the long peace dulls any sense of urgency. Her new husband Dominic fears the Allies consider Ardhuin's phenomenal power sufficient—and in no need of help from their mages. And yet...a weary traveler from the ends of the earth rushes to their home to deliver a message from a man thought dead. A desperate plea for help, invoking the Compact—as only another Mage Guardian would. Does another survive after all? And what new danger threatens the world?"}, {"id": "178299095X", "genre": "Science Fiction & Fantasy", "title": "The Only Genuine Jones", "description": "Two climbers. One victor. O.G. Jones and Aleister Crowley are rival mountaineers, both brilliant and ambitious, but with a very different concept of honour. It's 1896, but not as you know it. Mountaineers use new and revolutionary equipment, risking death for intangible rewards. Nobody has ever climbed a major Alpine north face before. Only an extraordinary man would want to. Crowley seeks revenge; Jones seeks redemption. Together their journey will take them to the most lethal mountain wall in the Alps, where Jones will face a terrible choice: risk death and dishonour, or allow Crowley to triumph and destroy everything he believes in. Adventure and deception, the Victorian spirit of progress, and the savage beauty of the wild combine to make this a tale of the mountains unlike any other."}, {"id": "B00PDE1DTK", "genre": "Science Fiction & Fantasy", "title": "The Clockwork Mechanical (Mechanicals Book 1)", "description": "Eleven-year-old Brad Millner's got a problem.For starters, he's lost his memory. He can't even remember his own name. As if that wasn’t bad enough, he's stranded on a space station. A space station that’s going to crash into the earth in less than one hour and kill millions of people.That means Brad’s got less than an hour to disable the space station’s force field so that it burns up when it enters the earth’s atmosphere. The only catch is that a terrible Clockwork Mechanical – the living machine that is behind the diabolical plan to destroy the world – is out to get him.Join Brad on his frantic quest to disable the space station's force field generator and save the world. See him team up with some unlikely companions - a swarm of little clockwork butterflies, a mechanical spider, and a girl with ADHD - as he tries to outsmart the Clockwork Mechanical.The Clockwork Mechanical is a middle grades children's book, ages 7 to 12, and has 88 pages.The Mechanicals Book 2 - The Ring of Fire is available now."}]