[{"id": "1975993012", "genre": "Children's Books", "title": "Yo Mama Jokes Encyclopedia: The Worlds Funniest Yo Mama Jokes: Yo Mama Jokes, Jokes and Riddles, Humor, Jokes For Kids, Comedy, Best Yo Mama Jokes", "description": "Yo Mama Jokes - Enjoy the Funniest Yo Mama Jokes Collection! \u2028 This is a collection of the best Yo Mama is so.....jokes in history. Please take some time out of your day to read this book, but try not to cry your eyes out. This collection includes the following: Yo Mama So Fat Yo Mama So Stupid Yo Mama So Ugly Yo Mama So Poor Yo Mama So Short Yo Mama So Skinny Yo Mama So Bald Yo Mama So Dirty Yo Mama So Old Yo Mama Smells Take action today"}, {"id": "068815932X", "genre": "Children's Books", "title": "The Ugly Duckling (Caldecott Honor Book)", "description": "A gorgeous, Caldecott Honor-winning version of the classic storyFor over one hundred years The Ugly Duckling has been a childhood favorite, and Jerry Pinkney's spectacular adaptation brings it triumphantly to new generations of readers.With keen emotion and fresh vision, the acclaimed artist captures the essence of the tale's timeless appeal: The journey of the awkward little bird—marching bravely through hecklers, hunters, and cruel seasons—is an unforgettable survival story; this blooming into a graceful swan is a reminder of the patience often necessary to discover true happiness. Splendid watercolors set in the lush countryside bring the drama to life in this hardcover picture book. "}, {"id": "B00M9IRWAC", "genre": "Children's Books", "title": "Mockingjay at Pooh Corner: Mr Munro's Used Books - Book One", "description": "Can books be dangerous?13-year-old Alfie Ray can’t stand his new school or any of the people in it until he comes across the Chapter, a mysterious group of sixth-formers who meet in secret to pass around strange old books. Alfie tricks his way into the group, only to find the books they read are more extraordinary than he could possibly have imagined.Mr Munro’s Used Books is a head-spinning adventure story for anyone who’s ever got truly lost in a book.Books Two, Three and Four in the series will be published in late 2014.E. H. Munro is a writer and second-hand bookseller who lives and works in north London."}, {"id": "0916941868", "genre": "Children's Books", "title": "11&12: Lost in the Dark Unchanted Forest / the Case of the Fiddle-playing Fox (Hank the Cowdog)", "description": "In the first work, Fearless Hank the Cowdog, Head of Ranch Security, enters the \"dark unchanted forest\" to rescue his master's son from Sinister the bobcat; and in the second work, Hank investigates the disappearance of eggs and a fiddle-playing fox named Frankie, at the same time he falls for a beautiful collie named Miss Beulah."}, {"id": "B06XCGB5MD", "genre": "Children's Books", "title": "3rd Grade Science: Life Sciences in Eco Systems | Textbook Edition", "description": "What is an ecosystem, and why is it important that it be balanced? Open this educational book to find out! Your child will love to learn using this book because it presents information in a direct but fun manner. The inclusion of pictures and the placement of texts make this book an experience that will stick to the memory far better than any other textbook. Grab a copy today!"}]