[{"id": "1533302022", "genre": "Science Fiction & Fantasy", "title": "Science Fiction Writers' Phrase Book: Essential Reference for All Authors of Sci-Fi, Cyberpunk, Dystopian, Space Marine, and Space Fantasy Adventure (Writers' Phrase Books) (Volume 6)", "description": "Blast off for out-of-this-world thrills! Whether you write \"hard\" sci-fi, space fantasy, cyberpunk, dystopian, or time travel, this must-own book is rocket fuel for your imagination. Open your pod bay doors to over 4,000 epic ways to describe everything from aliens to future tech, including starship combat. This book is the warp drive you need to write better science fiction instantly!"}, {"id": "1781086125", "genre": "Science Fiction & Fantasy", "title": "Not So Stories", "description": "Anthology of culturally diverse writers create short works in reaction to Kipling’s Just So StoriesRudyard Kipling’s Just So Stories was one of the first true children’s books in the English language, a timeless classic that continues to delight readers to this day. Beautiful, evocative and playful, the stories of How the Whale Got His Throat or the First Letter Written paint a magical, primal world. It’s also deeply rooted in British colonialism. Kipling saw the Empire as a benign, civilising force, and his writing can be troubling to modern readers. Not So Stores attempts to redress the balance, bringing together new and established writers of colour from around the world to take the Just So Stories back, giving voices to cultures that were long deprived them."}, {"id": "B078DP2MTV", "genre": "Science Fiction & Fantasy", "title": "A Trace of Copper (An Elemental Web Tale Book 2)", "description": "New recruit to the Queen’s agents, Dr. Piyali Mukherji is given a simple first assignment. Travel to the small Welsh village of Aberwyn and solve the mystery of a young woman’s blue skin lesion. A challenging task, for the alarming infection is unlike anything she’s seen before—and it’s spreading.Evan Tredegar, the town’s pharmacist and the only man to ever capture her heart, knows more than he’s telling. Despite his efforts to push her away, her touch reawakens old desires. As more villagers fall victim to the strange disease, he’ll have no choice but to reveal his secrets, even if it means sacrificing his freedom.Together they must move past broken promises, capture a rogue frog, and stop the infection before it spreads out of control."}, {"id": "B078B9HVW4", "genre": "Science Fiction & Fantasy", "title": "Alancia's Dance: a short story", "description": "Bull-Dancer Alancia befriends the clever inventor of the Labyrinth. When their relationship catches the eye of the jealous king, a date with the Minotaur is in her future. A Mythological Fantasy set in the world of Coiled by award winning author H. L. Burke."}, {"id": "0765318415", "genre": "Science Fiction & Fantasy", "title": "Boneshaker", "description": "In the early days of the Civil War, rumors of gold in the frozen Klondike brought hordes of newcomers to the Pacific Northwest. Anxious to compete, Russian prospectors commissioned inventor Leviticus Blue to create a great machine that could mine through Alaska's ice. Thus was Dr. Blue's Incredible Bone-Shaking Drill Engine born.But on its first test run the Boneshaker went terribly awry, destroying several blocks of downtown Seattle and unearthing a subterranean vein of blight gas that turned anyone who breathed it into the living dead.Now it is sixteen years later, and a wall has been built to enclose the devastated and toxic city. Just beyond it lives Blue's widow, Briar Wilkes. Life is hard with a ruined reputation and a teenaged boy to support, but she and Ezekiel are managing. Until Ezekiel undertakes a secret crusade to rewrite history.His quest will take him under the wall and into a city teeming with ravenous undead, air pirates, criminal overlords, and heavily armed refugees. And only Briar can bring him out alive."}]