[{"id": "1518808670", "genre": "Science Fiction & Fantasy", "title": "Counterstrike: Black Fleet Trilogy, Book 3 (Volume 3)", "description": "Captain Jackson Wolfe never thought he’d see the end of the Phage War in his lifetime. The enemy was too powerful, too numerous, and utterly determined to exterminate humanity.  But the appearance of a new ally in the fight has changed all of that. For the first time since the original incursion Wolfe thinks that maybe there’s a chance to stop their implacable enemy before they have the chance to wipe out any more human planets. That opportunity comes at great cost, however, and even as he makes plans for their first offensive move on the Phage, Jackson is all too aware that most of them will not survive.  “Counterstrike” is book three of the bestselling Black Fleet Trilogy."}, {"id": "B01M58U3TP", "genre": "Science Fiction & Fantasy", "title": "Epic Fantasy: Sword of the Elves (The Elven Saga, Book 1 of 4)", "description": "An Epic Elf Quest Carnage and terror are in the air. Vesus wakes up in an environment of desolation. His elven village has been destroyed and his memory is shattered. Moreover, he suffers in quiet agony since the girl of his dreams has been captured by brutal creatures.Terra is a kingdom with numerous secrets and magical mysteries, which have been buried deeply in the past, but the elven hero is determined to restore what has been lost. With a mission in mind to rescue his loved one, he finds himself getting increasingly twisted into a complex history of wars, adventures, and legends. Along his journey to the sword of Adamas, friends and foes cross his path, testing him to the core. The outcome of his endeavors will be unknown… for now…  Keywords: epic adventure, epic fantasy, fantasy, fantasy quest, fantasy sword, fantasy sorcerer, orcs, orc, dwarfs, dwarves, dwarf, elves, elf series, elf trilogy, elf novels, fantasy novel, fantasy novels, epic fantasy novels, epic fantasy novel, fantasy dragons, fantasy dragon, fantasy hero, fantasy heroes, epic quest, fantasy creatures, fantasy creature, fantasy epics, fantasy journey, fantasy journeys, fantasy magic, fantasy medieval, fantasy magic adventure, fantasy magic coming of age, fantasy romance novels, fantasy romance, fantasy romantic, fantasy love story, fantasy battles, fantasy battle, fantasy wars, fantasy war novel, fantasy adventure novel, fantasy adventure novels, fantasy romance adventure"}, {"id": "1499760728", "genre": "Science Fiction & Fantasy", "title": "2 Girls, 2 Cats: A Magical Mystery (Volume 1)", "description": "After returning from a year of college studies abroad, Lacey moved into her grandparents' home that is right beside of her great-grandparents' old farmhouse. The old farmhouse is supposed to be empty, but Lacey continues to notice lights coming on and going off during the wee hours of the night. Lacey invites her thirteen-year-old cousin, Jillie, to come and help her investigate and spend time with her on the farm. The girls not only discover a mother cat and her two kittens, but hidden stairs and tunnels and an uncle who has been missing for ten years. What do the girls discover about these cats? Where do the stairs and tunnels lead? Where has their Uncle Jake been all those years? It's magical, it's a mystery; it is a magical mystery that leads Lacey and Jillie to be united, by a destiny, determined many centuries before their time."}, {"id": "B00F98VZ52", "genre": "Science Fiction & Fantasy", "title": "Test of Magnitude (The Torian Reclamation Book 1)", "description": "Revenge is only justice when it can be administered without hatred.Welcome to the Tora star system, home of the spectacular Cardinal-4 space station overlooking Amulen and Banor, twin worlds that share the same orbit. One visit and you’ll understand why this station is the pinnacle of Torian achievement and a wonder of the Erobian Sphere.Unfortunately, your timing isn’t great. Many centuries of peace and prosperity are on the verge of collapsing for members of the Erob coalition as signs of the first interstellar wars loom. The half-breeds tell us it is because we are now forsaking the ancient law, and have thus allowed an evil infection to begin spreading through the galaxy. But those Erob half-breeds have always been a little over-dramatic, haven’t they?Brandon Foss, an unhappily married Virginian in his early thirties, awakes from a strange dream to discover he has been abducted from Earth and kept in cryonic preservation on Amulen for two decades. One other resuscitated human is with him, a real knucklehead who almost seems as alien to Brandon as their reptilian captors. A friendship of convenience forms as the two Earthlings soon become unwittingly intertwined in Torian politics and military affairs—at a time, it turns out, when the Torians desperately need just such intertwining.This full-length space-adventure novel has been professionally edited and specially formatted for all Kindle devices (including the latest Torian lightpads). We promise a smooth and enjoyable electronic reading experience, complete with a click-able table of contents. Download it today and embark upon your own personal test of magnitude.-No DRM (enjoy on all your devices)-"}, {"id": "1515062430", "genre": "Science Fiction & Fantasy", "title": "Red Dust and Bones", "description": "Tragedy inside mankind’s first outpost on Mars triggers political intrigue, betrayal, murder, and the ultimate triumph of courage over greed. Glenn Station broadcasts a desperate call for help and then goes silent. A rescue crew sets out on the long journey to Mars, but mysterious accidents and injuries throw the operation into chaos. The pilot, John Hellman, soon concludes that someone on Earth has planted a traitor in their midst. As panic mounts among his shipmates, he struggles to identify the deadly phantom force that is terrorizing his crew. Back on Earth, John's wife Marie heads up the government lab studying peculiar artifacts from the red planet. When she uncovers the frightening truth behind the Glenn Station disaster, she realizes that the future of humanity may be in her hands. But the danger she now faces is far different from what she ever expected. A cabal of nationalistic zealots has taken control of the mission to Mars, and they are determined to destroy anyone who threatens their hold on power. Marie’s only hope is to match wits with the player at the heart of the game, a ruthless renegade who will do whatever it takes to win. John and Marie Hellman are a world apart, yet together they are fighting the deadliest threat that mankind has ever seen."}]