[{"id": "B073PBFRD6", "genre": "Children's Books", "title": "The Tale of The Curious Monkey: A delightful story of a young monkey who learns to overcome her fears and starts a journey around the world.", "description": "The Tale of the Curious Monkey, a delightful story of a young monkey who learns to overcome her fears and starts a journey around the world with the help of her many friends. Follow the monkey on her travels as she rides through the savannah in bloom on the back of her dear Uncle Elephant. Explore the edge of the continent trotting with the graceful gazelles. Swim to the Arctic on the back of the whale, and discover that there are no boundaries for curious and inquisitive minds. The Tale of the Curious Monkey is the perfect bedtime story for all the little explorers in your life.Children's book about Monkey, nature, and journey"}, {"id": "1497599539", "genre": "Children's Books", "title": "Alberto se enrojece/Egbert turns red: Libro infantil para colorear español-inglés (Edición bilingüe) (Spanish and English Edition)", "description": "Libro bilingüe español-inglés: \"Alberto se enrojece\" - Cuando Oscar se burla de el y le molesta, Alberto se pone aún más rojo. Furioso y rojo. Que se puede hacer? Alberto tiene un plan y una idea aventurera... \"Egbert turns red\" - When Manfred bullies and teases him, Egbert turns very red. Angry and red. What can one do about it? Egbert has a plan and an adventurous idea ... "}, {"id": "1426331800", "genre": "Children's Books", "title": "National Geographic Kids Robots Sticker Activity Book", "description": "Techies in training will go bezerk over this sticker activity book, packed with 1,000 robot-themed stickers and pages loaded with sticker prompts, coloring activities, counting, patterns, mazes, matching, and more.Fans of Transformers, Wall-E, and the other AI heroes will gravitate to this awesome sticker activity book. Discover super high tech robots that explore land, sea, air, and space; wacky inventions of the past; super strong bots and super small ones; how robots help humans; everyday bots they're familiar with; and megastar machines like BB-8 and more. After getting the buzz on all things bot, kids get to play genius inventor as they sticker, draw, and color their very own special robot. This exciting, educational, yet wildly fun interactive title brings National Geographic Kids signature content to a sticker and activity book format."}, {"id": "B00F5BR228", "genre": "Children's Books", "title": "Murray A Very Light Pig", "description": "A short story for children of all ages (15 min read).One day, some of the animals that live at the King’s house, decide to use an old bucket and a plank of wood left behind by builders to make a seesaw. Once finished, they all love playing on the seesaw but one animal (Murray the pig) loves playing on it more than the others. His love of seesawing doesn’t go unnoticed and neither does the peculiar effect it seems to be having on him. The ordinary act of seesawing seems to be producing extraordinary results.“Murray AVery Light Pig” is a tale of happiness and lightness, a Jonathan Livingston Seagull for the young and not so young."}, {"id": "B0120UF3C2", "genre": "Children's Books", "title": "Albert Payson Terhune Collection: 7 Works. (Lad: A Dog, Buff: A Collie and other dog-stories, Further Adventures of Lad, Bruce, and more)", "description": "The Collected Works of Albert Payson Terhune is the collection of Works by Albert Payson Terhune was an American author, dog breeder, and journalist. The public knows him best for his novels relating the adventures of his beloved collies and as a breeder of collies at his Sunnybank Kennels, the lines of which still exist in today's Rough Collies.This is Albert Payson Terhune’s works in this book: (7 works.)1916 Superwomen1919 Lad: A Dog1920 Bruce1921 Buff: A Collie and other dog-stories1922 His Dog1922 Further Adventures of Lad1922 Black Caesar's Clan"}]