[{"id": "1936352397", "genre": "Children's Books", "title": "Margaret, Pirate Queen", "description": "For ages 3 - 9 Follow the adventures of Margaret and her first mate, Mad Maverick, as they travel the Coastal Carolina waters searching for a bounty of shrimp. With her crew of rescue dogs, they capture the scallywags on The Bulldog Bandit and exile them to Skull Island. Margaret and her fearless sea dogs set sail again to plunder and raid the inlets and marshes of the Lowcountry."}, {"id": "0844664286", "genre": "Children's Books", "title": "Loretta Mason Potts", "description": "Imagine how shocked you would be if, like ten-year-old Colin Mason, you were the oldest (smartest, best) kid in a family of four, and then you found out that all these years, without knowing it, you’ve had an older sister, an “awful, awful, bad, bad, girl—Loretta Mason Potts.” Who? What? Wait! ... But this is only the first of many surprises that lie in store for Colin, as things get curiouser and curiouser very fast. Loretta (a glum gangly girl and so very very rude!) comes home and before you know it, Colin is secretly following her down a hidden tunnel that leads from a bedroom closet to an astonishing castle, where a charming and beautiful countess keeps court attended by a dapper and ever-obliging general, and in this world everybody loves Loretta (especially when she’s rude), so much so that they’re begging her to stay with them forever. What is the secret behind this mysterious other world and how does it connect to the many secrets in the Mason family? It’ll take a spellbinding, hair-raising adventure, involving not just Colin and Loretta but their mother and the rest of the family, to work that out."}, {"id": "1515821307", "genre": "Children's Books", "title": "A T-Rex Would NOT Make a Good Knight (Dinosaur Daydreams)", "description": "So what if her arms are extremely short? Julie the T-rex wants to be a knight, and she’s ready to prove herself to the king. Discussion questions, an interactive look-and-find section, and dinosaur facts complete this fun picture book from the Dinosaur Dreams series."}, {"id": "1545172676", "genre": "Children's Books", "title": "The Art of Cursive Handwriting: A Self-Teaching Workbook", "description": "This comprehensive 198-page writing instruction guide is designed to help people of all ages (even teens or adults) learn and practice cursive handwriting:Illustrations show how to make each cursive letter one step at a time.One chapter includes several tips to deal with tricky cursive letters.Another chapter helps you memorize the uppercase and lowercase cursive alphabet.Practice cursive handwriting by copying words or sentences onto blank lines.The content is suitable for all ages, including tweens, teens, or adults. One way is that the blank lines are spaced 3/8 inches, which is narrower than most kids’ writing workbooks. Another way is that there aren’t any childish images designed to interest bored kids (some kids who are academically oriented appreciate this, too – it makes them feel like they are doing “real” work)."}, {"id": "145492229X", "genre": "Children's Books", "title": "Over at the Construction Site", "description": "Come to the construction site where there’s a whole lot of activity going on! With its irresistible rhyme, plus a fun counting element, this picture book will become every truck-loving toddler’s favorite.  Spend a day with mommy and daddy construction vehicles—bulldozers, front loaders, cement mixers, and more—as they encourage their little ones to push, dig, cut, dump, mix, and tip! With its catchy, songlike rhyming text, this fun read-aloud will delight parents and kids alike. At the end, children will love discovering what these hardworking trucks have been busy creating!"}]