[{"id": "1530741130", "genre": "Children's Books", "title": "Mommy, Where Did I Come From?", "description": "Help your child learn the amazing process of where babies come from. With simple illustrations and clear language, your child will learn just what happened as they were growing in Mommy's tummy!"}, {"id": "1849183643", "genre": "Children's Books", "title": "Bamboo Baby Blues (The Marsupilami)", "description": "A plane carrying two Chinese government envoys goes down in the Palombian jungle. A crate is parachuted out just before the crash. It contains a baby panda, official gift of China to a neighbouring country. The young survivor is found and taken in by the Marsupilami's family, but they soon face a serious problem: their new charge only eats bamboo – the only local source of which lies inside the nearby native village…  "}, {"id": "1405253045", "genre": "Children's Books", "title": "0.4", "description": "Plug into a new generation of sci-fi It's a brave new world. 'My name is Kyle Straker. And I don't exist any more.' So begins the story of Kyle Straker, recorded on to old audio tapes. You might think these tapes are a hoax. But perhaps they contain the history of a past world...If what the tapes say are true, it means that everything we think we know is a lie. And if everything we know is a lie does that mean that we are, too? 0.4 is an apocalyptic science fiction book for teens for fans of War of the Worlds, I am Legend, The Matrix and the X Files."}, {"id": "1936607700", "genre": "Children's Books", "title": "2: Curious Critters Volume Two", "description": "Unbelievably detailed, close-up images of twenty common North American animals bring young readers eye-to-eye with wildlife found in their own backyards. Photographed against white backgrounds, the incredible creatures’ colors, shapes, textures, and seeming personalities shine. Entertaining and educational narratives accompany the animals, highlighting fascinating natural history information. Learn about monarch migration, bird calls, baby rabbits, and more! Back matter includes a visual index, additional animal facts, a two-page life-size spread of silhouettes, and a full glossary. With such stunning photography, you’ll never see nature the same way again!"}, {"id": "B01M22ORYL", "genre": "Children's Books", "title": "Walk Your Dog", "description": "Pet lovers will adore this funny romp about the ups and downs of day in the life of a kid and her canine.Walking your dog is easy...but only if your dog wants to walk. This bouncy day-in-the-life adventure shows what happens when you pair a spunky little girl with a dog who's as stubborn as he is furry. Debut author-illustrator team Elizabeth Stevens Omlor and Neesha Hudson use spare text and gorgeous ink-and-watercolor illustrations to show kids that working as a team requires cooperation, patience, and heart."}]