[{"id": "1556225210", "genre": "Science Fiction & Fantasy", "title": "Alliances Revealed: A Review of the Alliances Edition of Magic : The Gathering", "description": "Pro player George Baxter give his analysis of each card from the Alliances set in an organized and easy-to-read fashion.  \"Alliances Revealed\" diagrams sixteen powerful decks that include cards from the new Alliances set as well as the top decks from the 1996 US Championships."}, {"id": "B01E9DD0TG", "genre": "Science Fiction & Fantasy", "title": "2-in-1: Over the Moon & Nemesis", "description": "NEMESIS Queen Ginger Mont Blanc's life is safe, ordered, and controlled. But in a flash Ginger's husband is killed by the horrible vampire King Mortis. Now as her kingdom falls into chaos and ruin around her things change. But that's not Ginger's worst problem, because somewhere out there is the vampire King's most trusted soldier, General Nemesis. Ginger knows the general is coming for her. OVER THE MOON Jillian Cross is a very fortunate witch. She has just inherited an old house from her deceased uncle, black magician Archibald Cross. But Jillian isn't as happy about acquiring the house as she is about the opportunity to search it. For Jillian suspects her long dead mother's bones are hidden somewhere inside that property, and she's determined to find them. Once she does, she can set her mother's restless soul free. The only thing she isn't counting on is Ed Justice."}, {"id": "1556348169", "genre": "Science Fiction & Fantasy", "title": "GURPS Spaceships", "description": "Three, two, one . . . Blast off! GURPS Spaceships is the long-awaited companion to GURPS Space, presenting rules for spacecrafts of every size and function. It covers spaceship design, travel, and operations, along with a (mapless) space-combat system. The ship design and operation rules in GURPS Spaceships are quick to learn and easy to put into action, with a maximum of colorful options. It takes only minutes to build even the largest spaceship. And the design systems are augmented by straightforward space travel and combat systems, to get you into space right away. GURPS Spaceships requires only the GURPS Basic Set, but GURPS Space is highly recommended for its guidelines on stardrives, characters, campaigns, and settings."}, {"id": "0316555673", "genre": "Science Fiction & Fantasy", "title": "Elysium Fire", "description": "Elysium Fire is a smoldering tale of murderers, secret cultists, tampered memories, and unthinkable power, of bottomless corruption and overpowering idealism from the king of modern space opera. Ten thousand city-state habitats orbit the planet Yellowstone, forming a near-perfect democratic human paradise. But even utopia needs a police force. For the citizens of the Glitter Band that organization is Panoply, and the prefects are its operatives.Prefect Tom Dreyfus has a new emergency on his hands. Across the habitats and their hundred million citizens, people are dying suddenly and randomly, victims of a bizarre and unprecedented malfunction of their neural implants. And these \"melters\" leave no clues behind as to the cause of their deaths...As panic rises in the populace, a charismatic figure is sowing insurrection, convincing a small but growing number of habitats to break away from the Glitter Band and form their own independent colonies.For more from Alastair Reynolds, check out:Revenger"}, {"id": "0981924301", "genre": "Science Fiction & Fantasy", "title": "1: The Best of Abyss & Apex Volume One", "description": "The honorable mentions from Abyss & Apex. Imaginative stories and poetry by science fiction and fantasy's rising stars including Ken Scholes, Lisa Mantchev, Jude-Marie Green, Yoon Ha Lee, Jay Lake, Justin Stanchfield, and more. \"The quality of the contents is consistently extraordinary.\" --BOOKLIST"}]