[{"id": "1509101543", "genre": "Children's Books", "title": "1,001 Cats: A Creative Cat Coloring Book", "description": "The Ultimate Cat Lover's Coloring Book With 1,001 fabulous felines to color, cat fanciers will delight in this coloring book that's completely jam-packed with cats. With more than 40 unique feline-themed illustrations, this adorable book offers a world of cats to color. Among the wide variety of creative cat designs found in this collection, that really is the ultimate coloring book for cat lovers, colorists will discover:   Feline-filled patterns and cat mandalas Cats frolicking in an enchanting forest filled with critters Kitties enjoying their favorite hobbies Cats playing among the flowers in their secret garden hideaway   And that's in addition to many more single-sided illustrations that are filled with happy cats, mischievous cats, playful cats, and even a few grumpy cats too."}, {"id": "1581840713", "genre": "Children's Books", "title": "The Autobiography of Willie O'Ree : Hockey's Black Pioneer (NHL)", "description": "The first Black NHL player recounts his Canadian boyhood, his eighteen-year career as a professional hockey player, and especially his years with the Boston Bruins"}, {"id": "B0721KGDJ2", "genre": "Children's Books", "title": "Aphorisms Honore de Balzac : Quotes Balzac ( in english language )", "description": "\" Aphorisms Honore de Balzac \" in english language , Simple and cheap translation . This ebook , no paperbook .Honoré de Balzac May 20, 1799, Tour - August 18, 1850, Paris is a French writer, one of the founders of realism in European literature. The largest work of Balzac – a  series of novels and novels \"Human Comedy\", which depicts the life of the contemporary writer of French society..."}, {"id": "B00FUMVFH0", "genre": "Children's Books", "title": "The House in the Middle of Town", "description": "Written in a charming rhythm and rhyme style, this children’s picture book shares the story of a community joining together to assist a neighbor in need."}, {"id": "1939954525", "genre": "Children's Books", "title": "Einstein and the Leaf (Einstein and Moo)", "description": "The Einstein and Moo series is about two black-and-white, brother and sister kitties who are playful, curious, friendly, and have many interesting adventures.   Einstein and the Leaf is the first of a series and is about a perfect fall day with children playing outside in the leaves while Einstein watches from inside. When the children come in and a few leaves come along with them, Einstein sees his moment and is ready to play!"}]