[{"id": "188285912X", "genre": "Children's Books", "title": "Eddie Rickenbacker: Boy Pilot and Racer (Young Patriots series)", "description": "America’s World War I flying ace, winner of the Medal of Honor, and racecar driver Eddie Rickenbacker’s first attempt at flight was riding his bicycle off the roof while holding an umbrella. Young Eddie, whose parents were Swiss immigrants, grew up in the Midwest in the early 20th century, worked hard to help support his family, but found time to build a \u0093pushmobile,” experience a thrilling ride in a \u0093horseless carriage,” and come face-to-face with a moving train. Young readers will gasp as he rides a runaway mining cart that jumps the tracks and cheer at Eddie’s first auto racing victory. Included are fun facts about Eddie Rickenbacker's life and the America he grew up in."}, {"id": "0060877219", "genre": "Children's Books", "title": "The Heart: All about Our Circulatory System and More!", "description": "By the time you finish reading these words, your heart may have beaten up to 50 times. As you walk, eat, and sleep, your heart continually pumps trillions of blood cells through thousands of miles of blood vessels inside your body. You may not be able to see your own heart, but all you have to do is look inside this book to see how this amazing organ works. Acclaimed science writer Seymour Simon brings you this indispensable guide that takes you through the heart, from atrium to capillary and back again."}, {"id": "B076YW59B5", "genre": "Children's Books", "title": "A Bird’s EYE View", "description": "Sometimes winning isn’t everything. Family and friendships are far more valuable than a prize. This is a story of four baby birds siblings whose curiosity and bravery have helped them to learn the remarkable power of a true friendship.The story is right for young children and will be a good introduction to the wonders of the natural world."}, {"id": "B00U48LMYQ", "genre": "Children's Books", "title": "Peter - Goblin Way (Peter: A Darkened Fairytale, Vol 6): Short Poems & Tiny Thoughts", "description": "Peter's Goblins - Short Poems and Tiny Thoughts is a fantastical collection of short poems based upon the surreal, magical story Peter: A Darkened Fairytale. Fans of Peter will enjoy this great little set to compliment the other books in the Peter series. These mischievous fellows get up to all sorts of no good in hidden places - goblin magic, stealing wands and even fairies. Carrying skull lanterns, you best watch out or they may just want to take hold of you. Don't say I didn't warn you. Now, run and hide!The Peter's Goblins set consists of three volumes, so keep a look out for more dark goblins coming shortly.The tale of Peter has inspired several books of which, Goblin Way is the sixth publication and there are many more adventures soon to be released."}, {"id": "0787642932", "genre": "Children's Books", "title": "Biography and Genealogy Master Index 1996-2000 Cumulation (Biography & Genealogy Master Index Cumulation)", "description": "Each BIOGRAPHY AND GENEALOGY MASTER INDEX CUMULATION OF SUPPLEMENTS makes available in one alphabet all of the material indexed in the supplement volumes during a five-year period. Five cumulation volumes have been published since the base set was issued in 1980-81. The BIOGRAPHY AND GENEALOGY MASTER INDEX is designed to help you easily determine which publication to consult for biographical information. Sources cover both living and deceased persons from every field of activity and from every country in the world. Typically current, readily available, standard reference works are indexed.  More than 15 million citations compiled from more than 5,000 editions and volumes of approximately 1,700 current and retrospective biographical sources are included in the BIOGRAPHY AND GENEALOGY MASTER INDEX base set and its 31 supplements. In total, BIOGRAPHY AND GENEALOGY MASTER INDEX provides coverage of nearly 5 million contemporary and historical figures."}]