[{"id": "140480224X", "genre": "Children's Books", "title": "The Emperor's New Clothes: A Retelling of the Hans Christian Andersen Fairy Tale (Read-It! Readers: Fairy Tales)", "description": "Two rascals sell a vain emperor an invisible suit of clothes."}, {"id": "075666294X", "genre": "Children's Books", "title": "Soccer (DK Eyewitness Books)", "description": "Updated and revised in time for the 2010 FIFA World Cup! From the early history of the game to today's biggest stars, this new edition of DK's classic Eyewitness Soccer features updated text, images, and statistics throughout."}, {"id": "0786814276", "genre": "Children's Books", "title": "Cheetah Girls, The: Growl Power - Book #8", "description": "When Aquanette and Anginette go home to Houston to visit their mom for Christmas, they are asked to perform for one of the hottest acts in town, and the Cheetah girls will have a chance to prove that they are able to put on a great show."}, {"id": "0736916768", "genre": "Children's Books", "title": "What Happens When I Talk to God?: The Power of Prayer for Boys and Girls (The Power of a Praying Kid)", "description": "Combining her passion for prayer with her love for little ones, beloved writer and speaker Stormie Omartian teams with talented illustrator Shari Warren to share an important message: \"It's never too early to teach a child to pray.\"Stormie encourages children to develop the life-changing practices of talking to God every day and explains prayer in easy-to-understand ways. With examples taken directly from the lives of young boys and girls, she helps kids get to know God, thank Him for His love and care, and ask for His help in tough times. Stormie also touches upon forgiveness, the power of praying with others, and having a relationship with Jesus as she assures children that their prayers do make a difference.Bright, contemporary watercolors depicting a broad spectrum of children accompany the text to present a beautiful picture of growing closer to God in prayer. For children ages 3 to 7."}, {"id": "0756518741", "genre": "Children's Books", "title": "Socrates: Ancient Greek in Search of Truth (Signature Lives: Ancient World)", "description": "Born into the city-state of Athens in 469 B.C., Socrates was surrounded by intellectuals. Most of these philosophers searched for answers about their surroundings. Socrates, however, sought truths about a persons soul and morals. He became famous for his never-ending questioning, and he taught the youth to question others as well. Not all Athenians appreciated Socrates questions. In 399 B.C., powerful Athenians brought charges against Socrates that led to a dramatic trial and death of the famous philosopher."}]