[{"id": "1538325276", "genre": "Children's Books", "title": "Camels (Wild and Woolly)", "description": "Although camels are popularly portrayed as beasts of burden, they've provided people with a variety of resources throughout history, including milk, meat, and fiber. The thick, golden brown hair of camels has been used to make blankets, rugs, and clothing for hundreds of years. This fascinating book about camels and their wool invites readers to take a fresh look at this familiar domesticated species. This thorough examination of life science in action supports curricular science studies."}, {"id": "1620248301", "genre": "Children's Books", "title": "Ella Mae the Courageous Cheerleader", "description": "Ella Mae's love for cheerleading is strong, but so are the bullies on the cheer team. Ella Mae, the Courageous Cheerleader is a children's book written in rhyme, sharing a personal story of dealing with bullies. It teaches children how to respond to meanness with kindness, courage and confidence. Ella Mae will inspire children who are dealing with bullies at school to turn to their faith in God. By responding according to His Word, they too can receive God's promise of blessing and the confidence that they are doing the right thing"}, {"id": "0175663955", "genre": "Children's Books", "title": "Agricultural Science for the Caribbean 2 (Bk.2)", "description": "Agricultural Science for the Caribbean is a well established and highly successful three year course for lower Secondary schools. The emphasis is on observation and practical activity, encouraging students to develop a hands-on attitude to agriculture. Students are encouraged to find out more about agriculture local to their homes so that they can relate and apply their learning to individual experiences and environments."}, {"id": "0679880720", "genre": "Children's Books", "title": "Thomas the Tank Engine's Big Lift-And-look Book (Thomas & Friends)", "description": "Fans of Thomas & Friends will discover loads of things to look at and learn about in this giant lift-the-flap board book that offers more than 60 flaps to find and lift, while also teaching toddlers about colors, numbers, letters, size comparisons, and much more. Train-loving boys and girls ages 1 to 3 will delight in lifting the flaps of this sturdy, jam-packed book to see what they can discover along with Thomas the Tank Engine and his friends during a busy day on the Island of Sodor."}, {"id": "003097173X", "genre": "Children's Books", "title": "HRW English Workshop: Student Edition Grade 6", "description": "English Workshop is an introductory course to the writing process which includes informational, creative, and persuasive writing. It also aids in understanding the parts of speech, puctuation, and grammar."}]