[{"id": "B008JQGXTE", "genre": "Children's Books", "title": "Love and Learn", "description": "Love and Learn is a collection of short, poignant children’s stories and animal fables. Each tale portrays a child’s confusion when encountering a challenge, and illustrates their understanding and growth. The lessons learned are an important part of growing up, and make an entertaining read.Recommended Age Group # 3-5 years"}, {"id": "1589809793", "genre": "Children's Books", "title": "Christmas Cats, The", "description": "In a house trimmed with holly, two sisters make preparations for their Christmas party. But sadly their assortment of cats cannot attend. So when the guests arrive, upstairs they must go! The banished cats squirm as they smell the aroma of baked treats and hear the crackle of fire, and they don't want to miss another minute of this festive fete. When the restless felines break loose and crash the party below, chaotic hilarity ensues."}, {"id": "0500651213", "genre": "Children's Books", "title": "Chineasy for Children: Learn 100 Words", "description": "The simple, super-smart way for children to learn their first 100 Chinese wordsA lively introduction for children to written Chinese, Chineasy™ for Children makes learning Chinese fun and simple. The book features playful illustrations by Noma Bar that relate each character’s shape to its meaning, alongside games and activities to make learning interactive.Introductory spreads explain how Chinese is written in pictograms―characters form building blocks for other words and sentences. Subsequent spreads feature lively scenes that help children to recognize over 100 Chinese characters. The book is organized by themes such as numbers, family, animals, and food, each section covering vocabulary within that topic. Stories about the development of characters and customs provide the perfect introduction to Chinese culture, while games and activities allow children to put into practice what they have learned. The book also features a picture library of characters for avid linguists to memorize as well as guidance on Mandarin pronunciation. Illustrated in color throughout"}, {"id": "1448803926", "genre": "Children's Books", "title": "Why Do Glaciers Grind?: All About Extreme Environments (Solving Science Mysteries)", "description": "Provides answers to questions related to extreme environments, looking at extreme climates, extreme weather, and extreme geological phenomena."}, {"id": "161429450X", "genre": "Children's Books", "title": "The Day the Buddha Woke Up", "description": "The heart of the Buddha’s story in a handful of words—beautifully illustrated by a world-renowned artist.  The Day the Buddha Woke Up is a board book that will captivate children of all ages. It’s the perfect way to introduce young children to the story of the Buddha—the clear, gracefully written story puts the Buddha's awakening into language children can understand.  The simple arc of the Buddha’s questions, his quest, and his ultimate understanding will provide a meaningful and peaceful story that children—and their parents!—will love returning to again and again."}]