[{"id": "076367544X", "genre": "Children's Books", "title": "Always (Emma Dodd's Love You Books)", "description": "One little elephant learns that a parent's love is unconditional.There is always love between parent and child, which is the heartwarming message in an exquisite new title from Emma Dodd. Featuring stunning illustrations of an elephant family and with interior pages embellished with foil, this makes a handsome addition to any nursery bookshelf."}, {"id": "1515797147", "genre": "Children's Books", "title": "Carli Lloyd: Soccer Star (Women Sports Stars)", "description": "Carli Lloyd is one of the country’s best female athletes. Learn about her childhood, the challenges she has overcome, and this soccer star’s greatest accomplishments. Get the inside scoop on her Olympic and World Cup wins."}, {"id": "1974694151", "genre": "Children's Books", "title": "Can YOU Dig It?: Archaeology Lost and Found in the Sands of Time", "description": "Have you ever wondered what it was like to live 3,000 years ago? Or even 500 years ago? Have you ever asked yourself \"Who built that really old building down the street?\" or \"Who built the Great Pyramid of Giza?\" If so, you are in the right place! Join Amanda the Archaeologist as she travels around the world, learning about different people and cultures. From ancient Egypt to Medieval Europe, Emperor Qin's Terra-Cotta Army to Cycladic Figurines, or Cahokia to Pompeii, Amanda will teach you about the people, places, and things that shaped our world today! In Can YOU Dig It: Archaeology Lost and Found in the Sands of Time, Amanda will teach you all about how archaeologists discover the truth about our human past. Filled with exciting pictures from excavations around the world, this book explains what archaeology is, how archaeologists excavate a site, and what we can learn by studying the material culture left behind by people in the past. With a whole world to explore, maybe your next question will be: \"Where will she take us next?\""}, {"id": "0778713482", "genre": "Children's Books", "title": "Food and Feasts in the Middle Ages (Medieval World)", "description": "A delightful book takes readers inside a medieval kitchen highlighting utensils used in food preparation, the servants who worked there, and how food was prepared, as well as farming and livestock; the harvest and how food was preserved; herbs and spices to flavor salty foods; hunting, hawking, and fishing; feast days, celebrations, and the Church; and food shortages and famine. Simultaneous."}, {"id": "0736970398", "genre": "Children's Books", "title": "God's Girl Says Yes: What God Can Do When We Follow Him", "description": "Great Things Happen When Girls Say Yes to God Every Christian parent wants their daughter to make good decisions as she grows into an adult. Wynter Pitts, a mother of four young girls, is no exception and she wants to help your tween daughter, age 8-12, make choices that honor God and protect her heart and soul. Smart choices begin with one word. Yes. When your daughter says yes to God in every area of her life, obeying Him becomes so much more than just following a dreary list of do's and don'ts. Her relationship with Christ transforms into a beautiful journey of self-discovery as He reveals things about her character and uncovers skills and talents she didn't know she had. In her signature conversational style, Wynter teaches your tween girl how God can help her make good decisions and where to find solid examples from Scripture and specifically, from the life of Jesus. When girls say yes to God, He can do amazing things in their life."}]