[{"id": "B0776HS62B", "genre": "Children's Books", "title": "Grumpy Monkey", "description": "A hilarious picture book about dealing with unexplained feelings...and the danger in suppressing them!Jim the chimpanzee is in a terrible mood for no good reason. His friends can't understand it--how can he be in a bad mood when it's SUCH a beautiful day? They encourage him not to hunch, to smile, and to do things that make THEM happy. But Jim can't take all the advice...and has a BIT of a meltdown. Could it be that he just needs a day to feel grumpy?Suzanne and Max Lang bring hilarity and levity to this very important lesson. This picture book is an excellent case study in the dangers of putting on a happy face and demonstrates to kids that they are allowed to feel their feelings (though they should be careful of hurting others in the process!)."}, {"id": "1515726991", "genre": "Children's Books", "title": "Carnotaurus and Other Odd Meat-Eaters: The Need-to-Know Facts (Dinosaur Fact Dig)", "description": "Odd meat-eaters like Carnotaurus were quick and deadly hunters. They had sharp teeth, good eyesight, and could run on two strong legs. Bold, full-color illustrations, easy-to-read charts and maps, and interesting facts take readers back to a time when these odd meat-eaters walked the earth."}, {"id": "0694011657", "genre": "Children's Books", "title": "Boats Board Book", "description": "Byron Barton introduces young readers to all different kinds of boats in this bold and colorful board book. With simple text and vibrant illustrations, readers will learn about transportation by boat.Fishing boats and ferryboats.Sailboats and tugs.Boats on the water.Come aboard.Supports the Common Core State Standards."}, {"id": "0689838999", "genre": "Children's Books", "title": "The Night Before Christmas Pop-up", "description": "Award winner Robert Sabuda brings Clement Clarke Moore's classic tale of The Night Before Christmas to life in this festive pop-up edition, sure to become a perennial family favorite."}, {"id": "0803738714", "genre": "Children's Books", "title": "Moxie and the Art of Rule Breaking: A 14 Day Mystery (14 Day Mysteries)", "description": "Edgar Award FinalistFor fans of The Westing Game and From the Mixed-up Files of Mrs. Basil E. Frankweiler comes a clever, treasure-hunt mystery based on a real-life art heist. Moxie Fleece knows the rules and follows them--that is, until the day she opens her front door to a mysterious stranger. Suddenly Moxie is involved in Boston's biggest unsolved mystery: The Isabella Stewart Gardner Museum art heist. Moxie has two weeks to find the art, otherwise she and the people she loves will be in big-time danger.Her tools? Her best friend, Ollie, a geocaching addict who loves to find stuff; her Alzheimer's suffering grandfather, Grumps, who knows lots more than he lets on; and a geometry proof that she sets up to sort out the clues.It's a race against the clock through downtown Boston as Moxie and Ollie break every rule she's ever lived by to find the art and save her family."}]