[{"id": "044023901X", "genre": "Children's Books", "title": "Lady Ilena: Way of the Warrior", "description": "Lady Ilena still can’t believe she is hereditary chief of Dun Alyn, her new home in the North. She eagerly awaits the return of her betrothed, Durant of Arthur’s table, and the time when Durant will rule beside her. But Britain is in a state of unrest. Despite Durant’s and Arthur’s efforts at unification, several neighboring fortresses have allied with Saxon invaders in the South. These tribes want Dun Alyn, and one tribal leader called Faolan will stop at nothing to get it. When Ilena refuses to accept Faolan’s marriage proposal in her loved one’s absence, she sets off a bloody battle–with grave results.A warrior can commit no greater crime than to falter under attack, and now Ilena faces the ultimate punishment: she must leave Dun Alyn, alone, and may not return to her people until she has proved herself worthy to be their leader. The journey will take Ilena to old friends–and new ones–as she searches for Durant and for Britain’s protector, the legendary Arthur.From the Hardcover edition."}, {"id": "0307168557", "genre": "Children's Books", "title": "Golden Books Treasury of Christmas Joy", "description": "A beautifully illustrated collection celebrating the spirit of Christmas includes classic and contemporary stories, poems, carols, recipes, and crafts, and features a full-color gatefold of the Nativity scene."}, {"id": "0763619434", "genre": "Children's Books", "title": "Maisy's Bedtime: Book and Toy Gift Set", "description": "A soft, pajama-clad Maisy toy, together with MAISY'S BEDTIME, makes for a cozy bedtime ritual for her loyal fans.What could be better than a book about Maisy? Why, Maisy herself! Finally, everyone’s favorite mouse steps out-in her pajamas, of course-to meet her many adoring fans. At six inches tall, this soft new Maisy toy is big enough for little arms to cuddle, but small enough to take anywhere-especially to bed! Packaged with a board book version of MAISY'S BEDTIME, here is a gift to be cherished by Maisy-crazy toddlers everywhere."}, {"id": "0141309032", "genre": "Children's Books", "title": "Olympic Summer Games 2000", "description": "Jam-packed with fascinating facts about the 2000 Olympics in Sydney, Australia, an exciting glimpse into the summer games features information on all of the Olympic sports, includes two special fold-outs of Olympic highlights and the Olympic venues in Sydney, and much more. Original."}, {"id": "1783445726", "genre": "Children's Books", "title": "The Little Book of Spooky Jokes", "description": "What happens if you see twin witches? You won’t be able to tell which witch is which What did the skeleton say when his brother told a lie? You can’t fool me, I can see right through you These and many more howlers will make you laugh your head off (in most cases not literally)."}]