[{"id": "0689806272", "genre": "Children's Books", "title": "Elizabeth Blackwell: Girl Doctor (Childhood of Famous Americans)", "description": "The life of the first woman doctor in the United States, who worked in England and America to open the field of medicine to women"}, {"id": "B00BRA7HUI", "genre": "Children's Books", "title": "Varian Fry (American History Through Primary Sources)", "description": "Learn about the American who risked prison and even his own life to help many refugees escape Europe during the Holocaust. Learn what Vichy France was and find out why it was such a dangerous place for refugees. Why didn’t the United States support Fry’s e"}, {"id": "0970361106", "genre": "Children's Books", "title": "Journals from the Past: A Historical Look at African-American Figures", "description": "Provides profiles of notable African Americans from all walks of life, including politicians, entertainers, writers, reformers, and educators."}, {"id": "1524787191", "genre": "Children's Books", "title": "Llama Llama Learns to Swim", "description": "Llama Llama learns to swim in this sweet 8x8 based on an episode from the Netflix animated television series.Look out, world--Llama Llama is a TV star! The beloved character, made famous by Anna Dewdney's best-selling picture books, is now the star of his own Netflix original series. Our episode-based 8x8 tells the story of one of the most memorable (and sometimes scary!) milestones: learning to swim! Your little llamas will love relating to their favorite picture book character as he faces new and challenging situations."}, {"id": "1846667763", "genre": "Children's Books", "title": "How to Draw 101 Pets", "description": "Learn how to draw 101 different pets.It's easy! Follow the simple step-by-step drawings and you will soon be amazing all your friends with your new-found artists' skills!This 48-page book from Top That Publishing contains step-by-step line drawings to help budding artists draw 101 different animals in various shapes, sizes and poses. Since each image is broken down into six simple steps, children will quickly gain in confidence when they see their finished results, and will soon be adapting their designs and drawing freehand pictures of their own. Ideal for junior artists age 5+."}]