[{"id": "0692455272", "genre": "Children's Books", "title": "Miss Jamie's Farm Book", "description": "Miss Jamie's Farm book is based on the popular audio CD and highly interactive live music show of the same name. Perfect for children aged 2-8, Miss Jamie's Farm teaches healthy eating, kindness to others, hard work and exercise.  Once you have your book, be sure to enhance the reading experience by visiting http://MissJamiesFarmBook.com to listen to the songs that go along with the book and bring the story to life!"}, {"id": "1911373153", "genre": "Children's Books", "title": "Chicken in the Kitchen", "description": "Waking up in the night when the shadow of a giant chicken crosses her bedroom door, young Anyaugo follows the mischievous bird on a fantastical adventure that challenges her to safeguard her family's food for the following day's New Yam Festival, in a U.S. release of an award-winning book from Nigeria."}, {"id": "B01L9GZMBU", "genre": "Children's Books", "title": "Monster High: Meet the Ghouls Character Guidebook", "description": "Monster High fan-ghouls can read all about their favorite monsters in this fun guidebook to all the characters illustrated with ghoulgeous full color photos. Inside are all the scary-cool facts about the student disembody's freaky flaws, pet peeves, favorites-colors, subjects, activities, and foods-GFFs, and more! From Frankie Stein to Jane Boolittle, meet all the ghouls!"}, {"id": "1590360605", "genre": "Children's Books", "title": "Project Polar Bear (Zoo Life series)", "description": "\"The Zoo Life series offers a fascinating look at the captivating world of animals and zoos. With content supplied and verified by experienced zoo staff, each book explores the life of an animal born in an American zoo and compares it to life in the wild. Brain boosters, folktales, and links to conservation organizations provide additional insights into each species.\""}, {"id": "1635175070", "genre": "Children's Books", "title": "Triceratops", "description": "Explores what scientists have uncovered about Triceratops. Colorful photos and illustrations help bring each dinosaur to life as easy-to-read text guides readers through important discoveries about its appearance, diet, and habitat."}]