[{"id": "0486402533", "genre": "Children's Books", "title": "10 Christmas Fun Books", "description": "Packed with holiday cheer, this festive assortment of 10 Little Activity Books includes stencils of snowflakes, candy canes, and other Yuletide items, easy-to-apply tattoos, a stained glass coloring book, and stickers galore — in a Santa paper doll book, in a card-making kit, in a Night Before Christmas storybook, and in individual sets."}, {"id": "0439802512", "genre": "Children's Books", "title": "Shades of Black: A Celebration of Our Children", "description": "The best-selling picture book is now available as a board book.I am Black / I am Unique / I am the creamy white frost in vanilla ice cream / and the milky smooth brown in a chocolate bar...Using simple poetic language and stunning photographs, Sandra and Myles Pinkney have created a remarkable book of affirmation for African-American children. Photographic portraits and striking descriptions of varied skin tones, hair texture, and eye color convey a strong sense of pride in a unique heritage. A joyous celebration of the rich diversity among African-Americans."}, {"id": "1519613237", "genre": "Children's Books", "title": "My Wonderful Impossible Misadventures: on the Amazon (Volume 1)", "description": "Ten-year-old Alex narrates a family trip down the Amazon River on a houseboat of questionable fitness. Things aren’t as they seem as adventure after adventure unfolds, but by the end, Alex embraces the vacation for the eye-opening experience it is intended to be."}, {"id": "0793508355", "genre": "Children's Books", "title": "A Souvenir Disney Songbook: Favorite Songs from Disneyland & Walt Disney World", "description": "(Piano/Vocal/Guitar Songbook). From the sound of children's voices singing \"It's a Small World,\" to the lighthearted refrain of \"Zip-A-Dee-Doo-Dah\" echoing through Splash Mountain, music brings its own memorable magic to every corner of the Disney theme parks. Now, you can experience the musical magic of Disneyland, Walt Disney World, and EPCOT Center with  A Souvenir Disney Songbook . Taking you on a musical tour of the parks, this songbook features 25 favorite songs and full-color photos of 18 Disney theme park attractions. Songs include: It's a Small World * The Tiki Tiki Tiki Room * Yo Ho (A Pirate's Life for Me) * Zip-A-Dee-Doo-Dah * The Best Time of Your Life * Tomorrow's Child * New World Bound * Veggie Veggie Fruit Fruit * and more."}, {"id": "B06XYYZW68", "genre": "Children's Books", "title": "Sinking the Bismarck and The Battle of Britain: An excerpt from \"Great Battles for Boys: WW2 Europe\"", "description": "Two epic and unforgettable battles, written just for kids:First, the thrilling tale of how the British Royal Navy destroyed Germany's legendary ship, The Bismarck. And second, Hitler's attempt to invade England. If he succeed, all of Great Britain would fall to the Third Reich. The fight would spur Churchill to tell the British people, \"'Let us therefore brace ourselves to our duties, and so bear ourselves that if the British Empire and its Commonwealth last for a thousand years, men will still say, 'This was their finest hour.' \"A thrilling two-chapter excerpt from the popular kids history series, \"Great Battles for Boys: WW2 Europe.\""}]