[{"id": "0375938508", "genre": "Children's Books", "title": "Yertle the Turtle and Other Stories Anniversary Edition", "description": "Inside this very special anniversary edition of Yertle the Turtle and Other Stories, you’ll find the complete, original text and illustrations by Dr. Seuss, along with 32 pages of commentary and archival images written and compiled by Charles D. Cohen, the world’s foremost Seuss scholar and collector. Also included for the first time together are two rarely seen Seuss stories: “The Ruckus” about a bird who likes to hear himself talk but has nothing to say, and “The Kindly Snather,” a cautionary tale that points to the perils of greed and sloth. With detailed—even fascinating—footnotes, this is a must-have volume for Seuss fans of all ages.From the Hardcover edition."}, {"id": "1403457255", "genre": "Children's Books", "title": "1: Settlements of the River Nile (Rivers Through Time)", "description": "The Nile river is the longest river in the world. It stretches for an incredible 4,132 miles (6,650 km) and passes through seven countries. The Nile is actually two rivers – the White Nile and the Blue Nile. They join to become a single river, the Nile, at"}, {"id": "0486421082", "genre": "Children's Books", "title": "Ping from Vietnam Sticker Paper Doll", "description": "Dress this petite charmer in a colorful jacket and trousers for the Moon Festival, embroidered shirts and skirts worn by the hill tribes, traditional \"ao dai\" outfit, and more. 1 doll, 26 full-color stickers."}, {"id": "B076HDT3P3", "genre": "Children's Books", "title": "Ship", "description": "Ship sails, tug beside.  Salt air. Early tide.Take a voyage on the high seas in this rhyming book from Chris Demarest. Perfect for little ones ready to set sail. Check out Demarest's other transportation books, Bus, Plane, and Train, for more on-the-go charm!"}, {"id": "1848793499", "genre": "Children's Books", "title": "Tractors (Busy Baby)", "description": "New tabbed books to introduce children to favorite mega-machines.Busy Baby presents a new series of tabbedboard books designed to fuel children's obsession with things that go!  Each book contains bright and colorfulphotography combined with clear text to help children identify eachmega-machine! Little ones will also love using the finger tabs todecide which vehicle they want to look at!"}]