[{"id": "0448466872", "genre": "Children's Books", "title": "Who Was Sally Ride?", "description": "In 1978, Sally Ride, a PhD candidate at Standford University, responded to a newspaper ad to join the US astronaut program. She was accepted and became the first American woman astronaut to fly in space! Among her other accomplishments, she played tennis like a professional, was an astrophysicist who helped develop a robotic arm for space shuttles, and later, through Sally Ride Science, worked to make science cool and accessible for girls. Sally Ride, who died on July 23, 2012, will continue to inspire young children."}, {"id": "0989480038", "genre": "Children's Books", "title": "Dragon Season (1)", "description": "It's the end of dragon hunting season and a mysterious egg lands at the Hare House.  How hard could it be to raise a dragon?  Families come in all shapes and sizes.  Life is better with big surprises!"}, {"id": "1616338660", "genre": "Children's Books", "title": "The Alphabet Forest", "description": "When a little girl loses her name, her brother offers to help her find it. Together they search their home, yard, and neighborhood. Their search leads them into a delightful alphabet forest where trees, birds, and animals of every letter play along the path. Surely, they can find her name here! Educational, too!Suggested age range for readers: 2-5"}, {"id": "B073LRVK8W", "genre": "Children's Books", "title": "HOW TOADFROG MET SWEETIE", "description": "Toadfrog, the handsome frog, meets Sweetie, the beautiful forest fairy, and falls head over webbed feet in love with her!  But Toadfrog decides to leap around the world and realizes it's a lonely lily pad without Sweetie.  He jumps home and discovers Sweetie has been swooped up by a dashing, feathered fellow!  Will Toadfrog hop to it and win Sweetie's heart?  Enjoy this vibrantly illustrated, loveable tale based on the TRUE events of how the author's parents met, feel in love, married, and started a family together!"}, {"id": "B073K1JDJ6", "genre": "Children's Books", "title": "Alpine Skiing (21st Century Skills Library: Global Citizens: Olympic Sports)", "description": "Using the new C3 Framework for Social Studies Standards, Alpine Skiing in the Global Citizens: Olympic Sports series explores the sport through the lenses of History, Geography, Civics, and Economics. Text and photos look at the history, basic philosophies, and geography of alpine skiing. Content includes information on multiple Olympic events in the category. As they read, students will develop questions about the text, and use evidence from a variety of sources in order to form conclusions. Data-focused backmatter is included, as well as a bibliography, glossary, and index."}]