[{"id": "0312496249", "genre": "Children's Books", "title": "Chunkies Bright Baby Chunky: Trucks (Bright Baby)", "description": "This chunky little board book for the littlest hands features fun and bright images of kinds of trucks and the names to read."}, {"id": "1432960946", "genre": "Children's Books", "title": "Australia (Countries Around the World)", "description": "Australia offers complete coverage of this fascinating country, including sections on history, geography, wildlife, infrastructure and government, and culture. It also includes a detailed fact file, maps and charts, and a traceable flag."}, {"id": "B00WN2THKM", "genre": "Children's Books", "title": "The Young Adult Award-Winners MEGAPACK", "description": "The Young Adult Award-Winners MEGAPACK™ assembles seven classic YA books, from fiction to biography, written by some of the most celebrated 20th century children's authors. Included in this volume are:IT'S LIKE THIS, CAT, by Emily Cheney Neville (Newbery Medal Winner, 1964)RUNNER OF THE MOUNTAIN TOPS: THE LIFE OF LOUIS AGASSIZ, by Mabel Louise Robinson (A Newbery Honor Book, 1940)THE WINDY HILL, by Cornelia Meigs (A Newbery Honor Book, 1922)TOD OF THE FENS, by Elinor Whitney (A Newbery Honor Book, 1929)THE JUMPING-OFF PLACE, by Marian Hurd McNeely (A Newbery Honor Book, 1930)SPICE AND THE DEVIL'S CAVE, by Agnes Danforth Hewes (A Newbery Honor Book, 1931)NEW LAND, by Sarah Lindsay Schmidt (A Newbery Honor Book, 1934)If you enjoy this book, search your favorite ebook store for \"Wildside Press Megapack\" to see the 200+ other entries in the series, covering science fiction, modern authors, mysteries, westerns, classics, adventure stories, and much, much more!"}, {"id": "1445150301", "genre": "Children's Books", "title": "It'll Never Work: Weapons and Warfare: An Accidental History of Inventions", "description": "Have you ever wondered how guns and bullet proof jackets were invented? From spears and arrows to experiments with rocket and lasers, from chain mail to kevlar and ceramic plates, It'll Never Work: Weapons and Warfare explores the history and development of weaponry, the successes and failures that have led to the weapons of modern warfare that we know today.Each title in this exciting, high-interest series looks at a different area of technology and engineering and reveals the pioneering ideas and scientific thinking that enabled its development, as well as exposing those that proved to be a dead end. Each spread examines a particular example in depth, bringing in other similar ideas where relevant, and revealing that experimentation and failure often pave the way to technology success. Beautifully designed and illustrated with infographic-style artwork, this series is an excellent technology resource for readers aged 9 and up."}, {"id": "1452151571", "genre": "Children's Books", "title": "Tiny Town", "description": "Embark on a Tiny Tour! These adorable shaped board books take young readers on a tour through a teeny world with every turn of the page. Die-cuts on each page lead to the next adventure, finally ending in the comforts of home. Toddlers will delight in guessing what comes next while learning essential prediction skills. Shaped like buildings and featuring neon accents throughout, these cute books have great value and will prove irresistible to children eager to create their own tiny world."}]