[{"id": "0998412147", "genre": "Children's Books", "title": "Sleepytown Beagles, Penny's 4th of July", "description": "Sleepytown Beagles, Penny's 4th of July is the second book in the Sleepytown Beagles series. It takes your child on another journey into a peaceful and secure place where they can visualize and drift off to sleep. In this story, Penny shares the valuable lesson she learned about dealing with her fears. Your children will learn it is always better to listen to their parents, even when they are scared. Enjoy this journey with the loveable characters of the Sleepytown Beagles."}, {"id": "163471234X", "genre": "Children's Books", "title": "Plow and Ripper (21st Century Basic Skills Library, Level 1: Welcome to the Farm)", "description": "This Level 1 guided reader explores the parts and uses of plows and rippers. Students will develop word recognition and reading skills while learning about what happens on a farm."}, {"id": "0545268486", "genre": "Children's Books", "title": "100 Most Awesome Things On The Planet", "description": "The next installment in the 100 MOST series explores the most awesome things on Earth!As a follow up to the 100 Most Dangerous Things on the Planet (10/08) and the 100 Most Disgusting Things on the Planet (1/10), the 100 Most Awesome Things on the Planet highlights the Grand Canyon, Great Wall of China, Angel Falls, Amazon River, Aurora Borealis, biggest supertanker, longest bridge, smartest robot, fastest rocket, and more. Each spread includes a rating from 1 to 5 indicating how \"awesome\" the item is, along with amazing facts, quirky side panels, and lots of full-color photos."}, {"id": "0688141145", "genre": "Children's Books", "title": "Top to Bottom Down Under", "description": "Ted and Betsy Lewin's adventures take them from the northernmost tip of Australia to the southernmost tip. At the top, they interrupt a python's mealtime, encounter a ferocious pack of dingoes, and come face-to-face with a crocodile. Down at the bottom, they dine with rude kangaroos, meet their first platypus, and confront an ill-tempered sea lion!The vivid colors, close-up paintings, and rich landscapes rendered in the Lewins' distinct watercolor styles, combined with action-packed narrative, will make you want to pack your bags and visit the land down under!"}, {"id": "1680487973", "genre": "Children's Books", "title": "The Railroad, the Telegraph, and Other Technologies (Westward Expansion: America's Push to the Pacific)", "description": "From 1800 to 1900 the territory of the United States expanded fourfold, and the population skyrocketed from about five million to seventy-five million plus. Two key innovations in technology helped this rapid development take place: steam and electricity. This easy-to-read guide traces the rail system's impact on shipping, travel, and the taming of the western frontier. Also covered are unprecedented advances in communication and other technology, such as new steel processes and improved farming tools. These changes not only ushered forth a new era of American progress but also formed the foundation of the modern world."}]