[{"id": "0060253150", "genre": "Children's Books", "title": "The Star Maker", "description": "If only Artie had kept his mouth shut.But his mean cousin Petey was putting him down, so Artie started bragging.Now he has to come up with enough money to buy firecrackers for all his cousins by the Lunar New Year.Luckily, there's one person he can count on . . . Uncle Chester!Newbery Honor Book author Laurence Yep celebrates family and Chinese New Year traditions in this story of a boy and his uncle who discover that age doesn't matter when it comes to helping out a friend."}, {"id": "0062470736", "genre": "Children's Books", "title": "Farmer Boy (Little House)", "description": "Revisit one of the most beloved books in Laura Ingalls Wilder’s classic Little House series with this gorgeous hardcover, unjacketed edition of Farmer Boy, featuring a special foreword from Ree Drummond, all-new iconic cover art, and no interior art.While Laura Ingalls grows up in a little house on the western prairie, Almanzo Wilder is living on a big farm in New York State. Almanzo and his brother and sisters help with the summer planting and fall harvest. In winter there is wood to be chopped and great slabs of ice to be cut from the river and stored. Almanzo wishes for just one thing—his very own horse—but he must prove that he is ready for such a big responsibility.Based on the childhood of Laura’s husband, Almanzo Wilder, Farmer Boy is the second book in the award-winning Little House series, which has captivated generations of readers with its depiction of life on the American frontier."}, {"id": "0806959142", "genre": "Children's Books", "title": "Shocking, Slimy, Stinky, Shiny Science Experiments", "description": "Go on--dig right into the goo and gunk! Dare to sniff the stink. This is guaranteed fun with science through your senses. More than 75 exciting experiments really test your abilities for sight, touch, and smell. Watch light reflect, bounce, and bend with mirrors and lenses. Make some static electricity with two balloons, and see what other materials you can get a charge out of. Choose some oozy, runny, sticky slimes to test, like sunscreen and squishy foods. It's hands on, eyes on, nose on science!\"...simple but appealing projects...invite[s] children to create, observe, and analyze...sharp color photos of children...look inviting and fun. The activities build on one another...the intriguing title and pleasing format should attract readers...\"--School Library Journal.\"...an anything but stuffy attitude...include clear definitions...steps are laid out clearly, and sharp color photographs of children performing the experiments make an alluring package...zippy approach.\"--Booklist."}, {"id": "0750283297", "genre": "Children's Books", "title": "Autumn (10 Minute Crafts)", "description": "Make a pinecone squirrel, a harvest collage, a leafy bookmark and a pumpkin painting! Using readily available, seasonally related materials, this series is an ideal and fun introduction to the autumn season for young children. The crafts are explained in easy to follow step-by-step instructions, and are perfect for teachers looking for original ideas as well as time-poor parents."}, {"id": "160860425X", "genre": "Children's Books", "title": "The Adventures of Captain Greenspud", "description": "Bad Veggies have invaded the land of Spry. And only Captain Greenspud, the Super Duper Hero Potato, can save the day! This happy children's tale set in a kitchen near you is something youngsters can really get their teeth into! The author says that seeing a child refusing his vegetables inspired him to create a character who would encourage kids to eat their greens. Besides Captain Greenspud, there's evil carrot Count Carrotine, his fiendish henchmen, The Split Peas, and the super sweet young miss, embodied in Sally Sweet Potato."}]