[{"id": "9881239400", "genre": "Children's Books", "title": "Amma, Tell Me About Ganesha!", "description": "We celebrate Ganesha's birthday With so much fun and lots of fanfare.His idols are offered to the rolling seasWith ardent prayer and tender care.Lord Ganesha, loved by one and all,Is the divine son of Shiva and Parvati.And this is the story of how he andHis jumbo elephant head came to be!\"Amme Tell Me\" is a charming and informative series of children's books that introduces the major Hindu festivals and figures to young readers, and are perfect for families wanting to share stories of Hinduism with their children or for educators looking for resource on the Hindu culture for their students. Written in rhyme with vivid, captivating illustrations, this series brings Hindu mythology to its readers in a fun and non-preachy way. The Series has ten books on the festivals of Holi, Diwali, and on the Hindu gods Krishna, Hanuman and Ganesha. (2016-02-26)"}, {"id": "1856976653", "genre": "Children's Books", "title": "I Wonder Why Spiders Spin Webs: and Other Questions About Creepy Crawlies", "description": "Browsers and young students alike will enjoy these lively question and answer books with their unique mix of realistic illustration and engaging cartoons. The enticing questions will amaze, amuse and inspire, while the highly visual format encourages kids to keep reading."}, {"id": "1607303051", "genre": "Children's Books", "title": "Chicago Bears Doodle Playbook (NFL Doodle Playbooks)", "description": "Chicago Bears Doodle Playbook is a pocket-sized activity book for young fans to doodle, draw, color, play games and let their imagination run wild with their favorite team. The Chicago Bears Doodle Playbook takes all the excitement of the Bears and turns it into fun, interactive activities that will entertain for hours. Plus each Doodle Playbook features eight pages of bonus stickers featuring general football subjects, team logos and a helmet for every NFL team. Take your Doodle Playbook on long car rides...carry them in your backpack...bring them to the football game...enjoy fun, interactive activities anytime! Officially licensed by the NFL."}, {"id": "B00BIO51HO", "genre": "Children's Books", "title": "10 Fun Bedtime Stories for 3 - 7 years old (For Bedtime and Young Readers) Volume 5", "description": "This book is perfect for bedtime and children who wants to learn to read This book has include the following story and it comes with a table of content feature as well"}, {"id": "1595667415", "genre": "Children's Books", "title": "Egg to Chicken (LifeCycles)", "description": "How does an acorn grow into a tree? What does a baby sea horse eat? Discover the amazing stages of different life cycles and learn all about your favourite species with this stunning series."}]