[{"id": "1596434465", "genre": "Children's Books", "title": "Zita the Spacegirl", "description": "A NEW YORK TIMES BESTSELLERZita's life took a cosmic left turn in the blink of an eye. When her best friend is abducted by an alien doomsday cult, Zita leaps to the rescue and finds herself a stranger on a strange planet. Humanoid chickens and neurotic robots are shocking enough as new experiences go, but Zita is even more surprised to find herself taking on the role of intergalactic hero. Before long, aliens in all shapes and sizes don't even phase her. Neither do ancient prophecies, doomed planets, or even a friendly con man who takes a mysterious interest in Zita's quest. Zita the Spacegirl is a fun, captivating tale of friendship and redemption from Flight veteran Ben Hatke. It also has more whimsical, eye-catching, Miyazaki-esque monsters than you can shake a stick at."}, {"id": "1438215150", "genre": "Children's Books", "title": "Rowdah's Rainy Day (Mini Mu'min Du'a Series)", "description": "Mini Mu'min Du'a Series #11 (Supplications related to rain)  It's raining and Rowdah is stuck in the house. She tries to find something to do, but she is being a rainy day grouch! Her mother teaches her about the importance of rain and how it is a blessing in so many ways. Your child will learn the supplications made before, during, and after rain.Series Overview: The Mini Mu'min Du'a Series is a collection of 17 colorful storybooks that help your child learn over 40 essential Islamic supplications and how they fit into their everyday lives. Using easy to understand language and charming rhymes, this series is perfect for read aloud story time! Series Supplement: Don't forget to take a look at our Mini Mu'min Du'a Series: Coloring Workbook (260+ pages), available here on Amazon, to help your child review and reinforce information learned in the storybooks- plus hours of coloring fun!"}, {"id": "4774300071", "genre": "Children's Books", "title": "My Book of Amazing Tracing (Kumon Workbook)", "description": "Using the proven Kumon method, this workbook will help children's pencil-control skills and build a firm foundation for writing letters and numbers."}, {"id": "075661953X", "genre": "Children's Books", "title": "Weather (DK/Google E.guides)", "description": "Each of these richly illustrated, fact-packed guides has its very own companion Web site maintained by DK and Google, providing readers with a continually updated library of links to supplement the book's information with the best of the web."}, {"id": "1851034617", "genre": "Children's Books", "title": "Arcimboldo's Portraits (My First Discoveries)", "description": " Enter the imaginary world of a most unusual artist   Guiseppe Arcimboldo creates highly original portraits by placing objects such as fruits, vegetables, flowers, leaves, fish, and shells next to one another to form faces. Using a magic flashlight made of card, you can explore the dark transparent page of the book and focus in on hidden surprises."}]