[{"id": "1439527326", "genre": "Children's Books", "title": "Bodies from the Bog", "description": "One morning in April 1952, Danish workmen digging in a peat bog near the town of Grauballe made an astonishing discovery: the body of a man preserved in the bog, his face Xattened by the weight of the peat and his skin as brown as the earth in which he lay. Who was this man, and how had he come to be there? With striking photographs and engaging text, James M. Deem tells the story of Grauballe Man and other bog bodies discovered in European peat bogs. He explains who they were, how they lived and died, and how their peat graves acted to preserve their bodies so well."}, {"id": "B00V3L8ZFM", "genre": "Children's Books", "title": "Eloise and Friends", "description": "For the first time ever, Eloise and her friends are in a board book story adapted from the original classic. How Marvelous!Eloise is a very special little girl who lives at The Plaza Hotel in New York City. She may not be pretty yet, but she’s definitely already a real person. Let Eloise introduce you to all of her companions at The Plaza—she knows you’ll love, love, love them!"}, {"id": "B01MRVOFYC", "genre": "Children's Books", "title": "Gods and Thunder", "description": "Gods and thunder. Brothers and betrayal. Death and rebirth. Original Viking tales of Asgard, Thor, Loki, Odin, and Baldur come to life in a full-color, action-packed graphic novel format that's perfect for young readers who crave adventure. Prepare yourself for sibling rivalry, ancient prophecies, and epic battles—and enter the weird, wild world of Norse mythology like you’ve never seen it before."}, {"id": "B0716PCKWD", "genre": "Children's Books", "title": "Had a great day at the zoo: Now I am in the mood for some food (Teaching gratitude and gratefulness Book 1)", "description": "Had a great day at the zoo.A  story about a boy who is in a good mood because he went to the zoo.He had a wonderful time and now he is in the mood for some food.The child understands the importance of being grateful for your day and your food.Included a free story about a boy who is not ready for bed.Night night ninjaTips and guidance to help your child to improve their thinking skills and learning skills."}, {"id": "1973430460", "genre": "Children's Books", "title": "The Tragedy of Othello, The Moor of Venice (English Spanish Edition illustrated): Otelo (Inglés Español Edición ilustrado)", "description": "The story revolves around its two central characters: Othello, a Moorish general in the Venetian army and his unfaithful ensign, Iago. Given its varied and enduring themes of racism, love, jealousy, betrayal, revenge and repentance, Othello is still often performed in professional and community theatre alike, and has been the source for numerous operatic, film, and literary adaptations...El personaje principal, Otelo, se presenta piadosamente, a pesar de su raza. Esto era poco habitual en la literatura inglesa en tiempos de Shakespeare, la cual presentaba como villanos a los moros y otros pueblos de piel oscura. En esta obra Shakespeare evita cualquier discusión respecto del islam. Otelo se ha destacado por su gran profundización en la retórica y la tragedia."}]