[{"id": "1947620177", "genre": "Science Fiction & Fantasy", "title": "The Last Wizard of Eneri Clare", "description": "Traumatized by a tragic accident at the wizardry school he attended, Tvrdik retreats to the solitude of the ancient forest. But his fragile peace is shattered when his old Master shows up to recruit him for a classic battle of good and evil. In order to succeed, he must team up with Lady Jorelial Rey, the spirited, dragon-riding regent of a kingdom in chaos, and they must convince the establishment to embrace decidedly unconventional methods of winning the fight! Together with an assortment of courageous allies -- dragons, unicorns, bards, talking beasts, and one very wild water sprite, the pair set about saving their homeland from a ruthless usurper, using their wits, creativity, and a sprinkling of magic. But will those be enough for the very last wizard of Eneri Clare, and his friends, to meet the daunting challenges ahead, and set the trajectory of history itself back on course? "}, {"id": "B07876B5RM", "genre": "Science Fiction & Fantasy", "title": "Legion Rising (Legionnaire Series Book 2)", "description": "Accolades for Ghost Legion:“Knocked it out of the park.” Trapper“What do you get if you mix Starship Troopers and the French Foreign Legion? You get a book like this.” Leif E. DolanThe war continues.Ethan Wang was born on the first day of the alien invasion. Now he has become a legionnaire, one of just a handful to survive the battle that devastated the Ghost Legion.Having licked its wounds and recovered, the Legion is now preparing to chase the invaders out of the Solar System, once and for all.Ethan and the rest of the legionnaires must fight all the way. They are well trained and ready to take the fight to the enemy. But one thing they all begin to realize is that not all of them will make it through alive.The alien invasion brought humanity together against a common foe – or so it seems. But there are more than immediately meets the eye, and while Ethan firmly believes the enemy must be overcome, he begins to wonder if he´s being used as a pawn in another fight. A fight to control the destiny of the human race.  ”For a long time, there was Heinlein, Drake, Weber, and some of Ringo's stuff. Add Andreas Christensen.” James R. Kratzer“Andreas keeps getting better and better with each book he writes!” Traci Maynard"}, {"id": "0765374811", "genre": "Science Fiction & Fantasy", "title": "Ender's Game Boxed Set I: Ender's Game, Ender's Shadow, Shadow of the Hegemon (The Ender Quintet)", "description": "FEATURING: Ender's Game (978-0-8125-5070-2, $6.99/$8.99)Ender's Shadow (978-0-8125-7571-2, $8.99/$10.99)Shadow of the Hegemon (978-0-8125-6595-9, $7.99/$9.99)"}, {"id": "0985751401", "genre": "Science Fiction & Fantasy", "title": "Advanced Encounters: Terrain Toolbox (D&D 4e)", "description": "Bring Your Encounters to the Next Level Terrain Toolbox is the first book in the Advanced Encounter series, which offers advice and tools for DMs to create more memorable encounters. Terrain Toolbox is designed to increase creative use of terrain in your game, making battles more dynamic. The book begins with general advice for designing terrain effect and powers. It discusses why we use terrain, different things terrain can do, and how the terrain might change throughout an encounter. Terrain Toolbox also contains forty-eight sample terrains, including blood mage's circle, solid clouds, and lightning pillars. Each sample terrain includes advice on how to use the terrains, and most include mechanical and cosmetic variations."}, {"id": "B0727RZS7C", "genre": "Science Fiction & Fantasy", "title": "1984 by George Orwell (Book Analysis): Detailed Summary, Analysis and Reading Guide (BrightSummaries.com)", "description": "Unlock the more straightforward side of 1984 with this concise and insightful summary and analysis!This engaging summary presents an analysis of 1984 by George Orwell, a dystopian novel which presents an uncomfortably realistic portrayal of the future, a future where the government controls everything and residents are kept under constant surveillance. In a society where dissidence is brutally punished and history is altered to suit the State, Winston Smith is one of the few people who still opposes the totalitarian regime which runs the country with an iron fist. The novel, which has been described as a “masterpiece” by The Guardian, was written in 1948 (which is how the title came about: the reversal of the final two digits) and, after it was published the following year, went on not only to become a major success, but also to have a significant influence on the English language. George Orwell was a British writer who was born in British India in 1903. A strong critic of totalitarianism, he has written a number of books denouncing dictatorships, such as that of Stalin in the 20th century. Find out everything you need to know about 1984 in a fraction of the time!This in-depth and informative reading guide brings you:•A complete plot summary•Character studies•Key themes and symbols•Questions for further reflectionWhy choose BrightSummaries.com?Available in print and digital format, our publications are designed to accompany you on your reading journey. The clear and concise style makes for easy understanding, providing the perfect opportunity to improve your literary knowledge in no time.See the very best of literature in a whole new light with BrightSummaries.com!"}]