[{"id": "B001B6EHI8", "genre": "Children's Books", "title": "Abner Doubleday: Boy Baseball Pioneer (Young Patriots series)", "description": "Young readers will share Abner Doubleday's enthusiasm and love of baseball and recognize him as a heroic general who fought bravely in two wars in this installation of the Young Patriots series. An early adapter of modern baseball rules, Abner adored the sport and helped bring it into mainstream American sporting life. As a boy, he loved nothing more than playing ball—whether it be \"one old cat\" or \"three old cat\"—with his brother and friends. When not on the playing field, Abner sought out adventures, which led him to a historic meeting with the French Revolutionary War hero General Lafayette, the recovery of a stolen trunk in the woods, and a hitched ride aboard a rickety stagecoach. Even as a child, Abner displayed the leadership skills and good sportsmanship that helped him advance the rules of baseball and lead his soldiers into battle during the Mexican-American and Civil Wars. Special features include a summary of Abner's adult accomplishments, fun facts detailing little-known tidbits of information about him, and a time line of his life."}, {"id": "1580896529", "genre": "Children's Books", "title": "Goldy Luck and the Three Pandas", "description": "In this Chinese American retelling of \"Goldilocks and the Three Bears,\" a careless Goldy Luck wreaks havoc on the home of a family of panda bears. She eats up the littlest panda’s rice porridge, breaks his rocking chair, and rumples all the blankets on his futon. When Goldy takes responsibility for her actions, she makes a new friend (and a whole plate of turnip cakes!) just in time for Chinese New Year."}, {"id": "B077BRGH94", "genre": "Children's Books", "title": "Familiar Short Stories for Kids: 20 Awe-Inspiring Stories to Read as a Family (thanksgiving, holidays, values, funny)", "description": "20 Amazing Short Stories Kids LoveDo you love stories that Kids and Parents will both laugh out loud to?  Then you HAVE to check out this series!!Includes: 1.  Ms. Crow's Thanksgiving2.  The Owl Detective3.  The Chatroom (from the Chestnut Elementary Series)4.  Off the Forbidden Planet5.  The Amazing Mr Woodchuck's Magic Show 6.  The Incident at Chestnut Elementary School7.  Ms. Crow's Halloween Party8.  Ms. Crow's Family ReunionAnd 12 more exciting short stories for kids!!!These stories are so unexpected that you will be on the edge of your seat until the last page.  Some of these stories are spooky and might scare you, some are adventurous and take you to outer-space, and some are sweet and teach children valuable lessons.  One thing is for sure...once you start reading you won't want to stop!**This deal won't last long!   Scroll up and click \"Buy Now\" to reserve your copy forever!**"}, {"id": "1541511859", "genre": "Children's Books", "title": "The Wildebeest's Journey (Lightning Bolt Books)", "description": "Wildebeests follow the rain in a massive migration every year. They travel in large herds across dangerous rivers with snapping crocodiles to find enough grass to eat and water to drink. From the day they are born, wildebeests are on the move!"}, {"id": "0768230225", "genre": "Children's Books", "title": "Math in the Community, Grade 2: It's Everyplace You Are", "description": "     Math in the Community—It’s Everyplace You Are! links standards-based math concepts to real-life situations. The eighteen learning units present imaginative scenarios at home—in the kitchen, in the bathroom, in the garage, on the porch, and more— and around town—at the store, the library, the post office, the police station, and more. The fun, hands-on activities incorporate reading comprehension with math skills such as number concepts, patterning, geometry, problem solving, and data analysis. Includes suggestions for classroom use and assessment, a vocabulary list, and an answer key.     "}]