[{"id": "B00LDGY75E", "genre": "Children's Books", "title": "The Motor Boys Over the Ocean", "description": "Ned Slade’s father was in business trouble, and the lad and his friends volunteered to ask aid from a Mr. Jackson. They started out to find him, only to learn that he had gone to a balloon carnival, as he was interested in air craft. The boys went to the aviation meet, and arrived just as Mr. Jackson went up in his big dirigible balloon. Instead of coming back, as he was expected to do, the millionaire sent a wireless message stating that he and his friends were being blown out to sea in a hurricane.He asked for help, and our heroes, in their airship, the Comet, started out over the ocean to the rescue. How they accomplished it, the perils they ran, the dangers from the escaping gas, and how they brought Mr. Jackson and his unconscious crew over a narrow plank, high above the ocean, into their own craft, you will find told of in this book."}, {"id": "1404202447", "genre": "Children's Books", "title": "Hernan Cortes: The Life of a Spanish Conquistador (Graphic Nonfiction)", "description": "In graphic art format, presents the life of Hernâan Cortâes the Spanish explorer who discovered Baja California and explored the Pacific coast of Mexico, but who is best remembered for conquering the Aztec Empire."}, {"id": "B01HQL9SHG", "genre": "Children's Books", "title": "Victorious Teen: Buddhist Advice for Dealing With What Life Throws at You", "description": "Life throws a lot at you. . . . Your grades aren't the best, your friend just turned her back on you, your parents are always on your case, your teachers don't understand what you're going through, the world is falling apart, and you don't know what to do about it. Whatever is freaking you out, you have what it takes to handle it.     Not only handle it but thrive because of it, becoming stronger than ever.   For decades, SGI President Ikeda has dedicated his life to young people, showing millions how Buddhist wisdom can help them through their struggles. His belief in your intelligence, talent, and passion is boundless, as he knows you hold the keys to humanity's future.   The Victorious Teen pulls together hundreds of gems of wisdom that will move you, inspire you, and challenge you. This one-of-a-kind survival guide will  provide the tools for you to begin building the life you want.   When you're ready to take control of your life, find new ways to face your problems, and emerge victorious, this book is for you."}, {"id": "1587171821", "genre": "Children's Books", "title": "Danger! Volcanoes: SeeMore Readers Level 2", "description": "Introduces the facts about volcanoes, what they are, why and how they erupt, different types of volcanoes found around the world, and the effects of some famous eruptions of the twentieth century."}, {"id": "1521988501", "genre": "Children's Books", "title": "10 Fun Picture Books", "description": "Heartwarming and hilarious, this 10 picture book collection is perfect for bedtime and for children that are learning to read. Exciting stories that will delight your child and captivate their imagination! Each book has a simple moral, such as accepting each other's differences, believing in yourself, being kind to others, and other important lessons.    Books that are included in this set:  Harry Saves the Day  Super Pig!  Alex Goes to School  Gibson Makes a New Friend  Monster Picnic!  Maxwell Makes Up His Mind  Alex, the Boy Who Watched Too Much TV  My Monster Goes to Night School  When I Grow Up    Please note: The Kindle Ebook version contains full color illustrations. The paperback print version has a full color cover with black and white illustrations to keep the printing costs as low as possible. This book has over 250 pages and would cost over $35 in color."}]