[{"id": "1590844904", "genre": "Children's Books", "title": "Vintage Years 1920-1930: Mass Production and the Great Boom of Wheels (World of Wheels)", "description": "Part of the series A World of Wheels, this book helps you learn about the birth of the modern motorcar, from the first Benz carriage to the super technical cars. It describes the information by some of the best automobile historians in the world. It looks at the birth of mass production of cars."}, {"id": "0689038623", "genre": "Children's Books", "title": "Baby's Box of Fun: A Karen Katz Lift-the-Flap Gift Set: Where Is Baby's Bellybutton?; Where Is Baby's Mommy?: Toes, Ears, & Nose!", "description": "A trio of baby's best board books--Where Is Baby's Belly Button?, Where Is Baby's Mommy?, and Toes, Ears, & Nose--will provide hours of lift-the-flap fun in one box."}, {"id": "1588600246", "genre": "Children's Books", "title": "If You're Missing Baby Jesus: A True Story that Embraces the Spirit of Christmas", "description": "This true story by author Jean Gietzen will unwrap the warmth of the real meaning of Christmas. Charmingly illustrated by Lila Rose Kennedy, it is a gift to treasure and share and will remind you of the joy of giving, and touch the hearts of all who receive it."}, {"id": "B00ECYOTLG", "genre": "Children's Books", "title": "Fishy Business (Sly Fox and Joe Coyote Book 2)", "description": "Fox Stories for Children | Animal Stories | Bedtime Stories for Children | Children's Stories | Children's Picture Books | Picture Story Books | Children's eBooksAge Level: 3 and up | Grade Level: Pre K and up  Sly stole fish from a wagon. Joe found the fish and start eating it. Sly is furious and decide to teach Joe a lesson. Fishy Business is the second book in a series of twelve about the adventures of Sly Fox and Joe Coyote.  Sly Fox is the good looking, clever and mischievous distant cousin of Joe Coyote. Joe is not the sharpest nail in the bucket and he always falls for the naughty ideas and traps of his cousin Sly. The adventures of Sly Fox and Joe Coyote will keep your children and you entertained for hours. Young readers love these stories, the illustrations and quirky twists in the tales."}, {"id": "0823932087", "genre": "Children's Books", "title": "Scientifically Engineered Foods: The Debate over What's on Your Plate (Focus on Science and Society)", "description": "Discusses the differences between traditional breeding techniques and genetic engineering, and considers the advantages, disadvantages, and possible side-effects of introducing genetically engineered products into the food supply."}]