[{"id": "0761366253", "genre": "Children's Books", "title": "Emanuel and the Hanukkah Rescue", "description": "Angry that his father is afraid to kindle the Hanukkah lights, Emanuel stows away on a whaling ship. When a storm overtakes the boat, it is his father’s change of heart and the family menorah that light the way home."}, {"id": "B0071UJ9RW", "genre": "Children's Books", "title": "The Land of the Dragon King and Other Korean Stories", "description": "A long, long time ago, the sea wasn’t salty, pigs didn’t have short snouts, and rabbits were missing their fluffy tails. How the sea grew salty, pigs got their snouts, and rabbits their familiar fluffy tails is revealed in this sparkling collection of Korean folk stories. Gillian McClure’s delightful reworkings of well-known fables transport readers of all ages to an exotic world of tigers, rice cakes, and persimmons. All are beautifully depicted in McClure’s distinctive, elegant illustrations. "}, {"id": "B06XC6SPKF", "genre": "Children's Books", "title": "My Big Activity Book: Find Opposites for Kids at Home! - Baby & Toddler Opposites Books", "description": "You don't have to look too far or employ complex strategies to encourage reading. In fact, influencing a child to read could be as simple as choosing the right book. For instance, this book of opposites is perfect for young children. The words and pictures used are commonly seen around the house so children can easily relate to them. This sense of familiarity is what makes this book truly effective."}, {"id": "B00PG8QFUU", "genre": "Children's Books", "title": "Have you ever seen...?", "description": "Explore and enjoy a world with your child where cows bow, pigs wear wigs, goats float and other things you wouldn't normally see, but are fun just the same.... Suitable for ages 2- 5."}, {"id": "1609920503", "genre": "Children's Books", "title": "Egg to Bee (LifeCycles)", "description": "How does an acorn grow into a tree? What does a baby sea horse eat? Discover the amazing stages of different life cycles and learn all about your favourite species with this stunning series."}]