[{"id": "B0078UMD46", "genre": "Science Fiction & Fantasy", "title": "Fire and Illusion (Blood and Gold: Book Two 2)", "description": "Seeking Jack Bishop“Are we sure we have the right place?” I didn’t want to doubt Josephine, but all we had was the coin and her sorcery. Even she admitted in the beginning there was a chance it wouldn’t work.She simply pointed at the large sign hanging on the fence. “Brindle Holdings.” But which Brindle? Samuel, or his sister, Georgina? The woman who my mother trusted me with, her own very best friend? Could the woman be playing us all false?Not that it mattered, really. I was a fugitive. Whether Georgina was in league with her brother or not, the coven was convinced of my guilt. And that was all she needed to burn me at the stake, innocent of Samuel’s actions or not.Auburdeen Hayle is supposed to be in London for her own protection. But since she chose to help and befriend Jack Bishop, everything she knows and understands has fallen to pieces around her. Worse, her friend is lost and in the hands of those who want to use him as a weapon, being slowly devoured by the living metal that infects him. Hunted by the coven meant to protect her and the constabulary being controlled by the very man who holds Jack captive, Burdie is forced to ally herself with those to whom truth and honesty are a convenience."}, {"id": "B07829Q6ZG", "genre": "Science Fiction & Fantasy", "title": "Dog Star Night", "description": "On a tiny moon of Sirius-7, settlers struggle to brave the elements, work the land, and live in peace. Governor Calhool doesn’t have the authority to raise a military beyond a handful of marshals and her budget doesn’t have room to pay for policing services from a contractor. When an off-world criminal element increases activity on Poligart, Calhool has no choice but to accept their measly bribes and look the other way as they take free run of the capital city. The situation comes to a head when one of the marshals stuns a thug who was attempting to kidnap a twelve-year-old girl. The stun is too much for a heart weakened by years of drug abuse and when it gives out a few days later, the gang declares open-season on Calhool and her marshals. Matters only get worse when four members of a rival gang drop by Poligart for some R&R and find the capital city on lockdown, heating up and ready to boil over."}, {"id": "1478788372", "genre": "Science Fiction & Fantasy", "title": "The Sam Browne", "description": "In 1880s London, in the notorious Whitechapel slum, a serial killer preyed on women, murdering them with a brutality that earned him the terrifying nickname of Jack the Ripper. His identity was never discovered…until the 1970s, when Michigan state police investigator Doug Emery is confronted by serial killings that are eerily reminiscent of the notorious Victorian murderer. Emery and an unlikely partner, Sam Browne, trace ties to the past and find a serial killer on the run from England to Michigan over decades of history. The cold case heats up as Sam Browne reveals that he and Jack the Ripper are travelers from a dying planet. A scientific study to save the heritage of the planet has gone horribly wrong.  As the two men frantically try to stop the Ripper, the past and present blend together with legend and modern science for a dramatic, unexpected thrill ride that will keep you on the edge of your seat."}, {"id": "1477825940", "genre": "Science Fiction & Fantasy", "title": "The Glass Magician (The Paper Magician Series)", "description": "Three months after returning Magician Emery Thane’s heart to his body, Ceony Twill is well on her way to becoming a Folder. Unfortunately, not all of Ceony’s thoughts have been focused on paper magic. Though she was promised romance by a fortuity box, Ceony still hasn’t broken the teacher-student barrier with Emery, despite their growing closeness.When a magician with a penchant for revenge believes that Ceony possesses a secret, he vows to discover it…even if it tears apart the very fabric of their magical world. After a series of attacks target Ceony and catch those she holds most dear in the crossfire, Ceony knows she must find the true limits of her powers…and keep her knowledge from falling into wayward hands.The delightful sequel to Charlie N. Holmberg’s The Paper Magician, The Glass Magician will charm readers young and old alike."}, {"id": "B00ICP4R8Q", "genre": "Science Fiction & Fantasy", "title": "After Tranquility", "description": "The future isn't here yet. But don't worry. It will be.Welcome to Orion's Arm, a scenario set thousands of years in the future when civilization spans the stars. Godlike ascended intelligences rule vast interstellar empires, and lesser factions seek to carve out their own dominions through intrigue and conquest. And out beyond the edge of civilized space and the human friendly worlds, adventure awaits those prepared to risk all.Collected here for your consideration are twelve stories exploring the Orion's Arm universe, spanning years and light-years to examine a complex and diverse future from its beginnings in the colonized Solar System to its continuing advance toward an uncertain destiny. About the Orion's Arm Universe ProjectOrion's Arm is a work in progress, a space opera setting like no other. It spans the next ten thousand years of galactic history, from the near future interplanetary colonization to distant eras when humanity's descendants have split into millions of different species ruled by superhuman machines. It incorporates hard science, and the \"soft\" or social sciences to create a rich and complex vision of a world that might someday be.The Orion's Arm Universe Project is continually growing and evolving as more contributions are added, and will therefore never be complete. We invite you to join us on this journey of imagination; after all it looks like we've barely gotten started, and there are still many worlds left to explore."}]