[{"id": "0987824899", "genre": "Science Fiction & Fantasy", "title": "What Kings Ate and Wizards Drank", "description": "Pick up the second book in the series, Hustlers, Harlots, & Heroes, today! amazon.com/dp/B00K1PDUP6    Equal parts writer's guide, comedy, and historical cookbook, fantasy author Krista D. Ball takes readers on a journey into the depths of epic fantasy's obsession with rabbit stew and teaches them how to catch the blasted creatures, how to move armies across enemy territories without anyone starving to death, and what a medieval pantry should look like when your heroine is seducing the hero.   Learn how long to cook a salted cow tongue, how best to serve salt fish, what a \"brewis\" is (hint: it isn't beer), how an airship captain would make breakfast, how to preserve just about anything, and why those dairy maids all have ample hips.  What Kings Ate will give writers of historical and fantastical genres the tools to create new conflicts in their stories, as well as add authenticity to their worlds, all the while giving food history lovers a taste of the past with original recipes and historical notes."}, {"id": "1495339645", "genre": "Science Fiction & Fantasy", "title": "1: Fairies Harbor: The Search Begins: Fairies Harbor: The Search Begins (Volume 1)", "description": "Becca Martin has waited her whole life for the moment she's finally accepted into The Order of the Golden Dawn, a secret organization devoted to the protection of The Fairy Queen and her people. Her first task? Simple: watch over one little Fairy Shrine and make sure it's not disturbed as another portal is put in place. Sound easy enough? Yeah, that's what she thought too. Over the next few months Becca, her best friend and cousin, Tara, her brother, Brian and their friend Trevor must never let their their guard down, for many strange creatures lurk around every corner, such as Goblins, Mermaids, Orcs, Harpies, Couatl, Dragon Kings, Dragons and more. Which ones will try to kill them and who can they trust to help save The Fairy Queen? Will they survive multiple encounters with Magical enemies? And when they are forced to choose between duty to The Fairy Queen or the lives of their own family, what will they do?"}, {"id": "B00BEL74LM", "genre": "Science Fiction & Fantasy", "title": "Tolkien Warriors—The House of the Wolfings: A Story that Inspired The Lord of the Rings", "description": "In letter written at the end of 1960, J. R. R. Tolkien wrote that, while parts of The Lord of the Rings, “owe something to Northern France after the Battle of the Somme. They owe more to William Morris and his Huns and Romans, as in The House of the Wolfings or The Roots of the Mountains.” For the enjoyment of Tolkien fans everywhere, those two books have been republished in Inkling’s Tolkien Warriors series. The Roots of the Mountains describes a Germanic tribe called the Wolfings who bravely defend their homes, families and freedoms against imperialistic Rome, much as the warriors of Rohan fought against Saruman and Sauron. Careful proofing, beautiful formatting, chapters summaries, and definitions of obscure words make the reading more enjoyable. This edition includes William Morris’s never-completed third volume, “The Story of Desiderius.”"}, {"id": "1475984510", "genre": "Science Fiction & Fantasy", "title": "2: Outrunner Odyssey Book Two: More Stories from the Voyage of the Oasis ValiMirum", "description": "The long environmental nightmare had ended. Planet Earth had been healed, its beauty and majesty restored, by a race of evolving human descendants known as the Mirsiens. In doing this they had prevailed against the Avarumak, a differnet and evil descendant race. Some Avarumak, however, were still out there . . . and waiting. With their home world renewed, the time had finally come for the Mirsiens to reach for the stars. Taya Xallnyk is one of them and commands the Outrunner vessel Oasis ValiMirum as it travels deep into the constellation of Orion. The vessel is a living, evolving entity in itself; a technological masterpiece in both form and function; a magnificent structure of almost unimaginable power. Adventures are many as the ship and its crew deal with the treachery of rogue Kynzaran aliens; struggle against the cataclysmic forces of a growing planet; contend with a rising horde a ravenous arachnids; battle a brutal Thragosian war lord with the use of a completely unexpected weapon and bring peace to the opposing factions of Aryltane with the appearance of a most mysterious visitor. Follow their incredible inter-dimensional journey through our wondrous and perilous galaxy\""}, {"id": "0441094996", "genre": "Science Fiction & Fantasy", "title": "The Cat Who Walks through Walls", "description": "A fast-paced, science fiction romp through multiple universes from the bestselling author of Starship Troopers and Stranger in a Strange Land.“[Heinlein] is, if possible, a greater genius than ever before...this time by giving us a thinking man’s Hitchhiker’s Guide to the Galaxy.”—San Francisco Chronicle  Dr. Richard Ames is an ex-military man, a sometime writer, and unfortunate victim of mistaken identity. When a stranger attempting to deliver a cryptic message is shot dead at his dinner table, Ames is thrown headfirst into danger, intrigue, and other dimensions where Lazarus Long still thrives, where Jubal Harshaw lives surrounded by beautiful women, and where a daring plot to rescue the sentient computer called Mike could change the direction of all human history."}]