[{"id": "0544850033", "genre": "Children's Books", "title": "The Doghouse (The Giggle Gang)", "description": "Fans of Elephant & Piggie will love this hilarious beginning reader with a surprise ending. Is anyone brave enough to face THE DOGHOUSE?Mouse, Pig, Cow, and Duck are playing a carefree game of ball when (horror of horrors!) their ball gets kicked into . . . THE DOGHOUSE. Who will risk a run-in with scary Dog to get it back? Hysterical high anxiety ensues as Mouse volunteers each animal to do the dirty work—but you’ll never believe what’s really going on in the doghouse! With Jan Thomas’s fun, fresh art and priceless animal expressions, this timeless tale of fear and friendship will have young readers howling."}, {"id": "148460928X", "genre": "Children's Books", "title": "Entertainment Through the Years: How Having Fun Has Changed in Living Memory (History in Living Memory)", "description": "How did your grandparents have fun? How did people listen to music in the 1950s? When did color television become popular? What toys were popular in the 1970s?  Find all the answers and more in this book about how entertainment has changed since the 1950s."}, {"id": "B00BQBVJR0", "genre": "Children's Books", "title": "In the Days of the Vaqueros", "description": "*\u0093Freedman sets the record straight.”\u0097Publishers Weekly, starred review Vaqueros, from vaca, the Spanish word for cow, were Native Americans conscripted by wealthy Spaniards to herd cattle on the Mexican plains. Often barefoot and wearing whatever clothes they had, the vaqueros became spectacular riders and masters of the art of cow herding. Three hundred years later, they taught the settlers to the American West how to round up cattle, bring down a steer, and break a wild bronco. Cowboys picked up their clothing, saddles, and lingo from the vaqueros. But it is the cowboy whose fabled reputation we remember, while the vaquero has all but disappeared from history.*\u0093Freedman tells the story with depth, clarity, and a vigor that conveys the thrilling excitement of the work and the macho swagger of the culture.”\u0097Booklist, starred review"}, {"id": "1404236511", "genre": "Children's Books", "title": "Let's Go Hiking (Adventures Outdoors)", "description": "Describes the types of equipment and clothing appropriate for hiking, introduces the types of trails and terrains appropriate for novice and advanced hikers, and discusses the benefits to hiking during the day and at night."}, {"id": "B0118FXB4M", "genre": "Children's Books", "title": "Diary of a Weird Wolf [An Unofficial Minecraft Book] (Minecraft Tales Book 22)", "description": "Follow the crazy adventures of a Minecraft Wolf!Wez is a weird wolf. No, not a werewolf! A weird wolf! He doesn't behave exactly like a normal wolf should. His wolf pack doesn't approve his weirdness either.Find out what it's like to be a weird Minecraft wolf in the Diary of Weird Wolf!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books."}]