[{"id": "1937013421", "genre": "Science Fiction & Fantasy", "title": "Super Powers Companion (Savage Worlds, Second Edition, S2P10503)", "description": "It takes more than a cape and a costume to be a hero. It takes guts, determination, and the willingness to sacrifice. It takes even more to be a super hero. For with these amazing powers comes the responsibility to stand up to the greatest evils, protect the oppressed, and occasionally, save the world. ...or rule it! The Savage Worlds Super Powers Companion (Second Edition) contains new Edges and Hindrances, Setting Rules like Death & Defeat and Power Stunts, gear, rules for headquarters, a rogue's gallery of insidious villains, and of course a host of streamlined super powers ready for action. This is a new edition of the Super Powers Companion. It's a comprehensive update of the original with significant new material. Soon after it debuts, we'll have a free list of the most important changes for owners of the original edition. The Super Powers Companion requires the Savage Worlds core rules to play. Note: Super Powers Companion (Second Edition) Free Villain Supplement The Savage Worlds Super Powers Companion (Second Edition) has significant new powers, Setting Rules, and abilities, so some of the villains from the original edition didn't make it into the latest version. We'll have a free update soon with all those villains and their updated powers for those who'd like to use them in their campaigns."}, {"id": "0140185852", "genre": "Science Fiction & Fantasy", "title": "We", "description": "The exhilarating dystopian novel that inspired George Orwell's 1984 and foreshadowed the worst excesses of Soviet RussiaYevgeny Zamyatin's We is a powerfully inventive vision that has influenced writers from George Orwell to Ayn Rand. In a glass-enclosed city of absolute straight lines, ruled over by the all-powerful 'Benefactor', the citizens of the totalitarian society of OneState live out lives devoid of passion and creativity - until D-503, a mathematician who dreams in numbers, makes a discovery: he has an individual soul. Set in the twenty-sixth century AD, We is the classic dystopian novel and was the forerunner of works such as George Orwell's 1984 and Aldous Huxley's Brave New World. It was suppressed for many years in Russia and remains a resounding cry for individual freedom, yet is also a powerful, exciting and vivid work of science fiction. Clarence Brown's brilliant translation is based on the corrected text of the novel, first published in Russia in 1988 after more than sixty years' suppression."}, {"id": "B00B1T644U", "genre": "Science Fiction & Fantasy", "title": "Dark Realm (Circles of Light Book 5)", "description": "When Tika vanishes, Farn collapses and is close to insanity. The First Daughter of the Dark Realm risks herself to retrieve Farn's mind, knowing that the young Dragon must be reunited with Tika. She believes that Tika is the only one who will be able to defeat the Crazed One."}, {"id": "0143171593", "genre": "Science Fiction & Fantasy", "title": "Penguin Celebrations - Tigana", "description": "Tigana is the internationally celebrated epic of a beleaguered country struggling to be free. It is the tale of a people so cursed by the dark sorceries of the tyrant king Brandin that even the very name of their once beautiful home cannot be spoken or remembered. But, years after their homeland's devastation, a handful of men and women set in motion a dangerous crusade--to overthrow their conquerors and bring back to the world the lost brightness of an obliterated name: Tigana. Against the magnificently realized backdrop of a world both sensuous and brutal, this masterful novel of a passionate people pursuing their dream is breathtaking in its vision, and changes forever the boundaries of fantasy fiction.    "}, {"id": "1522636013", "genre": "Science Fiction & Fantasy", "title": "Never Let Me Die (The Melissa Allen Trilogy)", "description": "What would you do if your sister was shot and your brother was kidnapped? Melissa Allen knows. It's been six months since the attack at PAR Lab. Melissa, Carrie, and Adam have settled into a semblance of domestic bliss with Heather as their guardian. Things seem too good to be true. Someone has been watching them, taking photos and keeping notes. Someone who seems to know everything about them. Someone who has no problem trying to kill them. "}]