[{"id": "1524766836", "genre": "Children's Books", "title": "The Poky Little Puppy and Friends: The Nine Classic Little Golden Books", "description": "The best-loved Little Golden Books come together in a deluxe volume that’s perfect for gift giving.   The year 2017 marks the 75th anniversary of the launch of the famous Little Golden Books! And this collection of nine classic Little Golden Books stars the line’s most popular characters, adored by generations, in The Poky Little Puppy, The Shy Little Kitten, Tawny Scrawny Lion, The Saggy Baggy Elephant, Tootle, The Little Red Hen, The Color Kittens, The Little Red Caboose, and Scuffy the Tugboat. Breathtaking illustrations on glossy paper, and a gleaming gold foil spine, make this lush volume a gift to cherish."}, {"id": "0613359410", "genre": "Children's Books", "title": "Erandi's Braids", "description": "The yellow dress Erandi wants for her birthday will look beautiful with her long, thick braids. But Mama's fishing net is full of holes, and there isn't enough money to buy both a new net and a birthday dress. The only solution lies with the hair buyers from the city. But Mama's hair isn't nearly as beautiful as Erandi's. Will Erandi have to choose between her birthday present and her braids? This touching tale of love and sacrifice is sprinkled throughout with Spanish words and expressions."}, {"id": "1857583094", "genre": "Children's Books", "title": "GCSE Human Biology (GCSE Study Guide)", "description": "This revised human biology text is one of a series previously named \"Revise Guides\". It is designed to provide year-round study and reference back-up to the GCSE course, and provides an analysis of the syllabus and exam structure of relevant examining groups. The book offers helpful tips on study, revision and coursework, topic-by-topic coverage and self-text questions for checking progress, as well as a bank of recent GCSE questions with suggested answers for fine-tuning exam technique."}, {"id": "1558967389", "genre": "Children's Books", "title": "Anne Frank and the Remembering Tree", "description": "In most windows I saw people working and children playing. When the soldiers came, people began covering their windows, so I couldn't see inside anymore. But the tiny attic window of the narrow brick house behind Otto Frank's business offices had no shade. For a long time the rooms were empty. Then one day, Otto's whole family came to live there. They called their new home the Secret Annex...A story of Anne Frank, who loved a tree and the tree who promised never to forget her. This book is co-published with the Children's Museum of Indianapolis, chosen by the Anne Frank Center as the first U.S. recipient of a sapling from the tree outside of the Secret Annex window (the tree is the narrator in the book)."}, {"id": "B00O33N14W", "genre": "Children's Books", "title": "Australia (Countries Around the World)", "description": "Australia offers complete coverage of this fascinating country, including sections on history, geography, wildlife, infrastructure and government, and culture. It also includes a detailed fact file, maps and charts, and a traceable flag."}]