[{"id": "1976472814", "genre": "Children's Books", "title": "13 Words Halloween Coloring Books For Kids (Dover Holiday Coloring Book): Halloween Coloring Book For Kids, 13 Wors Of Halloween", "description": "- Character Halloween"}, {"id": "1440503257", "genre": "Children's Books", "title": "The Unofficial Harry Potter Cookbook: From Cauldron Cakes to Knickerbocker Glory--More Than 150 Magical Recipes for Wizards and Non-Wizards Alike (Unofficial Cookbook)", "description": "With this cookbook, dining a la Hogwarts is as easy as Banoffi Pie. With more than 150 easy-to-make recipes, tips, and techniques, you can indulge in spellbindingly delicious meals drawn straight from the pages of your favorite Potter stories, such as:  Treacle Tart, Harry's favorite dessert Molly's Meat Pies, Mrs. Weasley's classic dish Kreacher's French Onion Soup Pumpkin Pasties, a staple on the Hogwarts Express cart  With a dash of magic and a drop of creativity, you'll conjure up the entrees, desserts, snacks, and drinks you need to transform ordinary Muggle meals into magical culinary masterpieces, sure to make even Mrs. Weasley proud."}, {"id": "1523502088", "genre": "Children's Books", "title": "Indestructibles: Home Sweet Home", "description": "It’s the series that could! Built for the way babies read, INDESTRUCTIBLES are now selling 400,000 copies a year, and the series has over 3 million copies in print. Sweet, soothing books, uniquely designed for safety and convenience, INDESTRUCTIBLES are printed on lightweight, nontoxic paper material, easy to clean (even dishwasher safe), and 100% chew, rip, bend, and drool proof. And now, introducing the cozy topic of home!     Home Sweet Home introduces baby to different rooms (living room, kitchen, bathroom, bedroom) and the many things inside of them (couch, table, bathtub, crib), reinforcing the pleasure of the home for families.     Delightful for babies to page through on their own or with Mom or Dad or an older sibling, this books, with its bright pictures and minimal text, is ideal for expecting parents, baby showers, or as a welcome-home gifts for a newborn.       "}, {"id": "1432934120", "genre": "Children's Books", "title": "Eyes: (2nd Edition) (Body Focus)", "description": "This coverage of the human body provides a library resource for students studying biology topics. Each book looks at the basic structure of a system or set of organs, its function, its role in the health of the individual and its relationships with other organs and systems. The books includes information on how the system can be affected and/or damaged by substances such as drugs and by physical injuries. They have an emphasis on the issue of keeping healthy and focus on sport science and how injuries and illness can affect teenagers."}, {"id": "0822572230", "genre": "Children's Books", "title": "The Bat-chen Diaries (Israel)", "description": "In 1996, on her 15th birthday, Bat-Chen Shahak was killed by a suicide bomber in Tel Aviv's Dizengoff Center. But the gifted teenager left behind a rich legacy of diaries, letters, poems and drawings. Following her death, her parents gathered her writings and created The Bat-Chen Diaries ; this is the first English translation of her work."}]