[{"id": "0590137778", "genre": "Children's Books", "title": "Stamp Mania (Brat Packs)", "description": "With the self-inking star stamp inside this pack, the reader can create cards, decorations, presents and all kinds of things for Christmas. It includes ideas such as an easy way to make an envelope, and a cocktail that changes colour as you drink it."}, {"id": "0531203328", "genre": "Children's Books", "title": "Landslides, Slumps, & Creep (First Book)", "description": "Describes the causes and consequences of landslides, avalanches, and other, sometimes rapid, sometimes slow, downward movements of rocks, soil, and/or snow"}, {"id": "B00GMS59KA", "genre": "Children's Books", "title": "Hanukkah For Kids", "description": "***The History, Traditions, Foods, and Games of This Important Jewish Celebration***Best-selling children's book author Hannah Gold presents \"Hanukkah for Children,\" an entertaining and educational guide to Hanukkah for you and your children.You will discover...* What is the Meaning of Hanukkah?* How Did Hanukkah Start?* What We Do on Hanukkah* Hanukkah Foods* The Dreidel* How to Play Dreidel* Hanukkah Gifts* The Menorah* How to Light the Menorah* The BlessingsSo get started and discover why Hanukkah is such an important event in the lives of all Jewish people."}, {"id": "1459702115", "genre": "Children's Books", "title": "Cherry Blossom Winter: A Cherry Blossom Book", "description": "After being outcast to a small community, 10-year-old Michiko’s life gets better when a former baseball star becomes her teacher. Second book in the Cherry Blossom Books series. Ten-year-old Michiko wants to be proud of her Japanese heritage but can’t be. After the bombing of Pearl Harbor, her family’s possessions are confiscated and they are forced into deprivation in a small, insular community. The men are sent to work on the railway, so the women and children are left to make the trip on their own.After a former Asahi baseball star becomes her new teacher, life gets better. Baseball fever hits town, and when Michiko challenges the adults to a game with her class, the whole town turns out.Then the government announces that they must move once again. But they can’t think of relocating with a new baby coming, even with the offer of free passage to Japan. Michiko pretends to be her mother and writes to get a job for her father on a farm in Ontario. When he is accepted, they again pack their belongings and head to a new life in Ontario. "}, {"id": "1543453864", "genre": "Children's Books", "title": "Sharky and Mia the Mermaid", "description": "The book is about a little mermaid named Mia and her friend Sharky, who is a baby shark. The story takes place on an island where they both live and play with other aquatic friends. Mia likes to travel to different islands to find flowers for herself, which she loves, and shells for her friend Sharky. She finds an island where humans have the ability to develop fins and swim like aquatic animals and aquatic animals are able to develop legs and walk around like humans."}]