[{"id": "1402240724", "genre": "Science Fiction & Fantasy", "title": "Kingdom of Summer", "description": "\"[An] engaging mix of history, legend, and romance.\" -Publisher's Weekly starred review \"A fast-paced Arthurian novel with broad appeal.\" -Historical Novels Review On the path toward greatness, even a hero makes mistakes. Armed with his magical sword and otherworldly horse, Gwalchmai proves himself the most feared and faithful warrior of Arthur's noble followers. But while defending the kingdom, he commits a grave offense against the woman he loves, leading her to disappear from his life and haunt his memories. With his trusted servant, Rhys, a commonsense peasant, Gwalchmai tries to find her in the Kingdom of Summer, where Arthur has sent him. But an unexpected and most malevolent force of evil and darkness is loose-that of his mother, the witch-queen Morgawse-and Gwalchmai finds that the secrets of his past may deny him peace... In the second book of Gillian Bradshaw's critically acclaimed trilogy, Sir Gawain comes to life as Gwalchmai, startlingly human yet fantastically heroic. PRAISE FOR Gillian Bradshaw  \"Compelling...splendid...vibrant...exhilirating, a novel seduces us into accepting sorcery and sanctity in King Arthur's England.\" -New York Times Book Review  \"Courage, darkness, magic, cruelty and kindness, justice and liberation...all the things that you have come to relish in the tales of King Arthur and his brave knights.\" -Yankee Romance Reviewers \"This engaging and enchanting retelling of the Arthur legend will appeal to adults and younger readers alike.\" -Publishers Weekly"}, {"id": "088038462X", "genre": "Science Fiction & Fantasy", "title": "Snarfquest: The Book (From the Pages of Dragon Magazine)", "description": "A comic quest for wealth, power, and all that other good stuff, conceived, written, and illustrated by Larry Elmore. SnarfQuest: The Book collects the complete adventure of the Quest for the Crown from Dragon magazine. Includes a new, full-color, never-before-published story."}, {"id": "099713643X", "genre": "Science Fiction & Fantasy", "title": "A Year Owed", "description": "A millennium from now, twenty-three-year-old Jare Redding is alone in this life, eager to leave Earth and forget his past. Against steep odds, he has been selected to take part in the colonization of a distant planet, just as he has hoped. All that stands between him and his voyage through the stars is a year of Agricultural Service, a civic duty made mandatory centuries ago, after billions died in global wars that left Earth devastated. For most, Service is a minor detour of life, a way for young citizens to learn to appreciate the bounty of their home planet, but for Jare it will be much more. There, in the midst of millions of acres of farmland, his resolve to leave will be tested, his secrets laid bare, and his newfound friends--and enemies--will make him question everything he knows.             "}, {"id": "B015TA5SQG", "genre": "Science Fiction & Fantasy", "title": "Goddess of the Dead (Wellington Undead Book 2)", "description": "India, 1803. Arthur Wellesley, the British Army's foremost vampire general, has begun to make a formidable name for himself on the field of battle, leading them to victory in the siege of Seringapatam and vanquishing its ruler, the Tipu Sultan, at the point of his blade. Jamelia, shape-shifting daughter of the Sultan, burns to avenge her murdered father in the only way she can possibly imagine: by bringing about the demise of Wellesley and driving the hated British from India for all time. Forging an alliance with Kali, the Hindu Dark Mother Goddess whose powers of death and destruction are soon to be unleashed in full upon an unsuspecting mortal world, Jamelia will lead an army of the walking dead to do battle with Wellesley and his redcoats on the blood-soaked field of Assaye."}, {"id": "055358247X", "genre": "Science Fiction & Fantasy", "title": "The Fire Dragon (Dragon Mage, Book 3)", "description": "Katharine Kerr has enchanted readers with her magical Deverry and Westlands cycle, and now she brings to a breathtaking conclusion the epic saga begun with The Red Wyvern and The Black Raven.The final chapter begins in the holy city as it rises from the ashes of Deverry's long wars. Prince Maryn prepares to claim the high kingship, but still the rebel Boar clan stands fast against him. And at court, his illicit passion for the young dweomer apprentice, Lilli, threatens to revive a curse that only she -- at her own peril -- can lift.It is a drama that will be played out centuries later in the city of Cerr Cawnen. Among the many who take refuge in the lakeside citadel, nestled in a volcano's shadow, are a Westfolk band guided by the elven enchantress Dallandra and protected by Rhodry Maelwaedd and his fiery guardian dragon. Meanwhile, from the north come the savage Horsekin slavers, ancient foe of the Westfolk, now bent on the domination of Cerr Cawnen. They are awaited by the sorceress Raena, their self-sworn high priestess and the votary of an evil goddess. Now, as Rhodry and Raena renew their timeless enmity, the fate of the city and every soul within it hangs in the balance -- and on an act of self-sacrifice dangerous beyond imagining."}]