[{"id": "1590412362", "genre": "Science Fiction & Fantasy", "title": "DC Heroclix: Icons Starter Set", "description": "Each DC Heroclix: Icons Starter Set contains six exclusive pre-painted figures (including three characters not available anywhere else in Icons!), a full-sized map, a complete rulebook, one powers and abilities card, six object tokens, six terrain markers, two six-sided dice, and a combat dial turning ring."}, {"id": "1533465568", "genre": "Science Fiction & Fantasy", "title": "Winterhaven (The Adventures of Ryes and Garth) (Volume 2)", "description": "The next step in the Adventures of Ryes and Garth! Our brave adventurers are reunited and now camp in the outskirts of the greatest city on all Tayna, Hailys. They set out to explore the destroyed city of the ancients and discover that time and the attack left little they can hold in their claws. They face many challenges in their time here and finally leave to find a home they can call their own. They find a strange Caravan road that has been deserted for some time, so follow it out of Hailys. And what they discover on that road will change their lives forever."}, {"id": "B01FOR4B1M", "genre": "Science Fiction & Fantasy", "title": "America's Galactic Foreign Legion - Book 10: Peacekeepers", "description": "Blue is not Captain Joey R. Czerinski’s favorite color – especially not to wear in the New Gobi Desert on planet New Colorado. Blue doesn’t blend with dust and dirt – it’s a beacon inviting terrorists and insurgents to take potshots at him and fellow legionnaires newly assigned as ‘peacekeepers’ to control hostilities between the spiders and scorpions. But whoever put Czerinski in charge of keeping the peace in this volatile area certainly didn’t think things through. A paranoid psychopath interested only in personal gain is not the best babysitter to keep two warring alien factions at bay.With the rise of two new terrorist leaders – one scorpion and one spider – things heat up in a hurry with the threat of nuclear detonation. But there’s always a profit to be made even amid the bombings and riots – even if somebody has to take a dive to fix the fight. And as long as Pizza Hut and Taco Bell keep their doors open, everybody’ll be happy ... at least for a while.An old foe makes another showing and scares the bejesus out of Sergeant Green and everyone else in the hallowed tunnels of the Legion’s armory and detention dungeon. Czerinski and his band face dangers, and sometimes those dangers get the best of a few. Death in war is an inevitability, but the trick is to keep on laughing at Death and going about the business of being the craziest bunch of soldiers this side of the galaxy! Laughter is truly the best arsenal in the tenth installment of the seriously screwy military space saga gone wrong."}, {"id": "1565042964", "genre": "Science Fiction & Fantasy", "title": "Cainite Heresy: A Sourcebook of Blasphmeous Horror for Vampire, The Dark Ages", "description": "Do you dare examine the soul of heresy? Here for the first time is the secret history of the blasphemy that has flourished for centuries. From the diabolic rites these heretics perform to the extent of their unholy influence over Rome and the Holy Land, The Cainite Heresy takes a look at an aspect of the Dark Medieval world that makes even vampires shudder."}, {"id": "0986396842", "genre": "Science Fiction & Fantasy", "title": "Forging Hephaestus (Villains' Code)", "description": " Gifted with metahuman powers in a world full of capes and villains, Tori Rivas kept away from the limelight, preferring to work as a thief in the shadows. But when she's captured trying to rob a vault that belongs to a secret guild of villains, she's offered a hard choice: prove she has what it takes to join them or be eliminated.  Apprenticed to one of the world's most powerful (and supposedly dead) villains, she is thrust into a strange world where the lines that divide superheroes and criminals are more complex than they seem. The education of a villain is not an easy one, and Tori will have to learn quickly if she wants to survive. On top of the peril she faces from her own teacher, there are also the capes and fellow apprentices to worry about, to say nothing of having to keep up a civilian cover.  Most dangerous of all, though, are those who loathe the guild's very existence. Old grudges mean some are willing to go to any length to see the guild turned to ash, along with each one of its members. Even the lowly apprentices."}]