[{"id": "1614294739", "genre": "Children's Books", "title": "Ziji and the Very Scary Man", "description": "Help kids learn to face their fears and self-soothe with this adorable puppy companion.Ziji is a bouncy puppy who lives with the Anderson family: Mom, Dad, Jenny, and Baby Jack. He loves to play and chase balls in the park with Jenny and their friend Nico. Then one day, an angry man shouts at Ziji and scares him so much he never wants to go back to the park again. Can Nico show him how to calm his mind and face his fears?  Renowned meditation master Yongey Mingyur Rinpoche shows young children how following our breath can calm us down—and how practicing compassion shows us that even Very Scary Men can be frightened sometimes too. A detailed appendix gives further guidance for parents."}, {"id": "0761318577", "genre": "Children's Books", "title": "John F. Kennedy, Jr. (Biographies)", "description": "From his toddler years in the White House to his later successes in the publishing industry, this illustrated biography provides an intimate look at the short-lived life of this famous American figure."}, {"id": "1622756827", "genre": "Children's Books", "title": "Wolfgang Amadeus Mozart: Musical Prodigy and Composer (Britannica Beginner Bios)", "description": "Introduce young readers to one of history’s greatest composers. They will enjoy tracing Mozart’s life from his childhood touring Europe as a musical prodigy through his years in Italy, Salzburg, and Vienna. They’ll learn about his struggles for independence and his musical innovation. The title touches on the composition of operas, liturgical music, symphonies, concertos, and more. Mozart’s enduring popularity and the significant influence he had on the composers who followed him are also discussed. A timeline helps readers understand the chronology of events discussed in the book."}, {"id": "1409312410", "genre": "Children's Books", "title": "Ladybird Read It Yourself Genie Street Mrs Greene Mermaid Queen", "description": "Genie Street is a magical place where anything can happen. This is an ideal first chapter book series for children who are gaining in reading confidence and want to progress to reading a proper book. Each book is split into two stories, with large type and plenty of pictures, so that children can read it for themselves, with a sense of achievement. This title is ideal for Key Stage 1 children. When Daisy and Tom move to Genie Street, they are worried they might be bored. But before long they meet Mrs Greene who's not just a beautician - she's a mermaid too! What will happen when Daisy and Tom join her for an adventure? This is Book 3 in the \"Genie Street\" series."}, {"id": "0064440346", "genre": "Children's Books", "title": "Owl at Home (I Can Read Level 2)", "description": "Welcome to Owl's Cozy home!Owl lives by himself in a warm little house. But whether Owl is inviting Winter in on a snowy night or welcoming a new friend he meets while on a stroll, Owl always has room for visitors!Arnold Lobel's beloved Level 2 I Can Read classic was created for kids who read on their own but still need a little help.The classic Frog and Toad stories by Arnold Lobel have won numerous awards and honors, including a Newbery Honor, a Caldecott Honor, ALA Notable Children’s Book, Fanfare Honor List (Horn Book), School Library Journal Best Children’s Book, and Library of Congress Children’s Book. "}]