[{"id": "0751365173", "genre": "Children's Books", "title": "Ballet School", "description": "This title takes young readers into the world of ballet shoes, tutus and ballet barres. It aims to teach budding ballerinas everything they need to know, from how to tie their ballet shoes, to performing the perfect plie."}, {"id": "0792255453", "genre": "Children's Books", "title": "Science Quest: Digital Revolution: The Quest to Build Tiny Transistors", "description": "This inspiring science book from National Geographic illustrates the quest towards the future of technological development. Transistors are a vital part of almost every electronic device we use today. Tiny transistors joined together as integrated circuits are used in all our powerful computers. The story behind the invention of the transistor traces advances in science and math from the earliest mechanical calculators used thousands of years ago to the breakthrough invention of the solid-state amplifier by Bell Labs in the 1940s. The strong personalities, fortunate accidents, and challenging research behind these advances bring science to life in Digital Revolution. Glen Phelan's lively text examines the complex history of the tiny transistors that have come to power our modern electronic world."}, {"id": "1430125969", "genre": "Children's Books", "title": "Trombone Shorty (Spoken word CD with Hardcover Book)", "description": "The stunning story and exquisite illustrations in this Caldecott Honor and Coretta Scott King Award-winning book can now be savored along with Troy Trombone Shorty Andrews reading the words and playing his trumpet in this readalong that will transport readers to New Orleans and beyond!"}, {"id": "1682806014", "genre": "Children's Books", "title": "Baby Seeds To Big Plants: Botany for Kids | Nature for Children Edition", "description": "The first step to getting your child involved in gardening is to learn about the principles of botany. This is where this book will come in handy. As an excellent introduction to the subject, this book comes complete with pictures and texts. It has been formatted in a way that would easily capture and absorb a child's attention. Secure a copy now!"}, {"id": "1617390348", "genre": "Children's Books", "title": "See Eye A", "description": "He pushed off with his right foot, his left foot on the board. Joey was flying! I love this, he thought. Ready, set, here I go! Suddenly the board shot out from beneath his feet. Joey's body was airborne for only a few seconds. Thud! He landed face down on the pavement as the skateboard moved on with a life of its own. When Joey falls off his skateboard, he discovers a mysterious agency located in his head. Director B. R. Ains and his team of body-fixers are at the center of the action, and they are determined to help Joey solve The Case of the Blue Cast. He is afraid at first, but he soon learns how his body is designed to deal with injuries. Join Joey as he discovers how chairs on wheels, cameras that can see bones, and shiny silver poles will help him get back on his skateboard in time for the big Fourth of July show."}]