[{"id": "B011H99IQ4", "genre": "Science Fiction & Fantasy", "title": "Abilities", "description": "There is an ancient legend- one few know and even fewer believe, \"The Brothers of the Sky.\" Two brothers, each blessed with superhuman gifts, grow up battling each other and destroying everything in their paths until one can finally kill the other.Brothers Michael and Mitchel will start a war pulling in their friends and families and learn on the way that they are no longer just hunters, but being hunted, and that they may not be the one who possesses the most powerful ABILITIES."}, {"id": "B071J5VGS4", "genre": "Science Fiction & Fantasy", "title": "Under Clock and Key (The Thief's Apprentice Book 3)", "description": "In this third installment of the Thief’s Apprentice Series, Arhyen finally finds the information he’s been searching for. Unfortunately, he has no one to tell it to. He has no idea what’s become of Liliana, or even if she still lives. If she has met her untimely end, or worse, if she’s been taken prisoner by those who’ve entrapped him, there’s no one left to ride to the rescue. As the reaper’s scythe looms near, Arhyen must find a way out. If not for himself, then for London, and the thousands of victims soon to come."}, {"id": "B077ZH3MSP", "genre": "Science Fiction & Fantasy", "title": "Robot Empire: Planet of Steel: A Science Fiction Adventure", "description": "Lost at the heart of the Robot EmpireArla Farmer, reluctant commander of the ark-ship Dawn, is taken to Core - the capital world of the Robot Empire. An artificial mind inhabiting the metal skin of a once natural planet, Core is made up of millions of distinct personalities and not all have the best interests of humanity at heart.Can Arla discover why Core went to such extraordinary lengths to bring Dawn within its reach? Will the people of the valleys find a new home to settle? And what will happen when the very existence of Core, and all other intelligent minds, is threatened by a mysterious threat that guzzles up entire planets?Planet of Steel is the third book in the Robot Empire series of galaxy-sized adventures. If you like fast-paced science fiction in the classic mould of Asimov, Clarke, Bradbury and Bear, you’ll love Kevin Partner’s brand new space adventure."}, {"id": "B0731JPS38", "genre": "Science Fiction & Fantasy", "title": "Fates Aflame", "description": "A scorching adventure for Potterheads, Halfbloods, & fantasy enthusiasts, from the Amazon bestselling author of Dark Diary and the Fluorescence series.\"Earth chose me as its Guardian. I must assume the role...\"In a society secretly fueled by unbridled magic and turbulent political landscapes, Lieutenant Hawksford is torn between prophecy and duty. With the threads of her fate tugged in all directions, uncertainty shrouds her future.She has the ability to conjure fire at will, but the birth of her powers awakens a curse and a perilous trial unfolds, putting the lives of those she loves in jeopardy. When extinct beasts brought forth by ancient magic threaten her life, she has no choice but to take a stand, and in the blink of an eye, her carefree life is extinguished. A mesmerizing standalone tale of Magic, Destiny, and friendship. Fates Aflame is a breathtaking journey through a vast new world in the tradition of epics like Harry Potter, Lord of the Rings, Narnia, and Percy Jackson.Fates Aflame is a standalone book, but you may continue the adventures in the upcoming book II. Don't miss the companion, all ages coloring book available (separate purchase - ISBN 978-0-9974485-2-8)."}, {"id": "1481515950", "genre": "Science Fiction & Fantasy", "title": "0: Home for the Holidays: A Night Huntress Novella (Night Huntress Novels)", "description": "[Read by Tavia Gilbert] Home for the Holidays originally appeared in the print anthology The Bite before Christmas. 'Tis the season to join Cat and Bones for some holiday cheer in this 'Night Huntress' novella by USA Today and New York Times bestselling author Jeaniene Frost. They were looking forward to a normal holiday - at least as ''normal'' as it gets for vampires Cat and Bones and their otherworldly friends and family. But their yuletide plans are shattered when a mysterious stranger shows up and reveals long-buried secrets that threaten to take a bite out of their holiday cheer . . . and lives."}]