[{"id": "0778740005", "genre": "Children's Books", "title": "Motocross History: From Local Scarmbling to World Championship Mx to Freestyle (Mxplosion!)", "description": "Provides a look at the fast and furious sport of motocross, with each title in this series looking at a different aspect that makes up this growing sport, its fan base, its champions, and its machines."}, {"id": "1416915451", "genre": "Children's Books", "title": "Marie Curie: Young Scientist (Childhood of World Figures)", "description": "Marie Curie was a world-renowned scientist who made many important discoveries, as well as a great teacher and a mother, but her accomplishments didn't come easily.   Born Maria Sklodovska in 1867, Marie grew up in Russia-occupied Poland where schools were not allowed to teach Polish history or language, and lab experiments were forbidden in science classes. When Marie was young, her mother and eldest sister both passed away. Marie was determined not to let hardships get in the way of her dreams. She went on to win two Nobel Prizes, one each in physics and chemistry, making her the first woman to win the award and first person ever honored with two of them.   Read all about the clever young girl whose hard work lead to brilliant contributions in the field of science."}, {"id": "1481420488", "genre": "Children's Books", "title": "Daniel Goes to the Potty (Daniel Tiger's Neighborhood)", "description": "A perfect new potty-training book for Daniel Tiger fans—push the button and hear the potty flush!Daniel and his dad are at Music Man Stan’s music shop when Daniel has to go to the potty. Will he have to wait until he gets home to use the bathroom? In this adaptation of a popular episode, Daniel learns that there are bathrooms in lots of places and that he can use the bathroom in the shop or anywhere else in the neighborhood. So remember: when you have to go potty, stop and go right away! This adorable book, with a button for kids to press to make the potty’s “flush” sound, is sure to be a hit with Daniel Tiger’s youngest fans! © 2014 The Fred Rogers Company."}, {"id": "1402746326", "genre": "Children's Books", "title": "My First Puzzles: Reading Games", "description": "Learning to read is easier when it’s turned into an entertaining game, and that’s just what these puzzles do! Each one offers five- and six-year-olds plenty of enjoyment, so they won’t even realize that they’re really building skills. For \u0093Flower Power”\u0097an easy form of crossword\u0097young solvers have to place the names of different flowers into the correct spaces on a grid. \u0093It Starts with H” is a simple word search: kids have to look across and down to find such words as harp, heart, and home. Plus, they’ll solve riddles and anagrams, do somecode-breaking, fill in blank spaces to form new words, and have a good time!"}, {"id": "1554884632", "genre": "Children's Books", "title": "Sergeant Gander: A Canadian Hero", "description": "Sergeant Gander is a fascinating account of the Royal Rifles of Canadas canine mascot, and his devotion to duty demonstrated during the Battle of Hong Kong in the Second World War. Armed only with his formidable size, an intimidating set of teeth, and a protective instinct, Gander rought alongside his fellow Canadian soldiers. As the Royal Rifles’ position become more precarious, the men were forced to retreat into the hills of Hong Kong, and it was here that a group of wounded Canadians, threatened by a live grenade, came to fully appreciate the loyalty of Gander. For his service in battle, Sergeant Gander was awarded the Dickin Medal, the animal equivalent to the Victoria Cross for humans. This honour is dedicated to animals displaying gallantry and devotion to duty while under any control of the armed forces. Sergeant Gander is the nineteenth dog to receive this medal and the first Canadian canine to do so."}]