[{"id": "B01DS0UXRS", "genre": "Children's Books", "title": "Adventures of Basil", "description": "Basil the plant starts his new life and everything is different. The sun and rain are strange but especially the animals. Luckily for Basil he makes some new friends to share his adventures. Basil's new friends want to look after him. But can they even look after themselves?"}, {"id": "0780787374", "genre": "Children's Books", "title": "Windy City Mystery (Boxcar Children Special)", "description": "The Boxcar Children are thrilled to visit their cousin Chad and his father, Mr. Piper, in Chicago. The day after they arrive, Willard the doorman hands them an envelope with a clue to a mystery inside. The riddle leads the children to a Chicago landmark where they stumble upon yet another clue! Activity section included."}, {"id": "B01KSDUI78", "genre": "Children's Books", "title": "The Blue Angels Aerobatics Maneuvers for Kids!: Quick Reference Guide (The Kidsbooks Leadership for Kids Navy Aviator Series Book 1)", "description": "The Blue Angels for Kids - Aerobatics Maneuvers Quick Reference Guide.This handy little guide explains some of the Blue Angels maneuvers with razor sharp diagrams and EASY to understand English.Great for Kids!Scroll up and Grab a Copy Today!Looks great on iPads and Android devices.OBLITERATE THE LEADERSHIP GAP!Get your kids into reading the right way.The KidsBooks are dedicated to introducing your kids to GREAT CONTENT.You don't have to \"force\" your child to read: LET YOUR KID decide!With awesome books your kid will want to read.Visit TheKidsBooks.Blogspot.com for more awesome examples.The author has personally taught his 5 year old son and other children to read with these books.Some say they are too technical, I say NEVER UNDERESTIMATE your child!Introducing your child to reading at a very young age is the BEST way to equip him for the future and give him the DECISIVE ADVANTAGE."}, {"id": "1620656949", "genre": "Children's Books", "title": "Fly Fishing for Kids (Into the Great Outdoors)", "description": "It’s a beautiful summer day, the perfect atmosphere to try your luck in a nearby stream. You wade into the water and cast your line back and forth. Suddenly a huge trout pulls on your line. Do you have what it takes to reel in that whopper? Learn all about this fun, challenging sport, including how to choose the best flies and other gear for the type of fish you're trying to catch, specific techniques to use, and safety and conservation practices to follow."}, {"id": "1783446064", "genre": "Children's Books", "title": "Elmer's Weather", "description": "Whatever the weather, come rain or shine, Elmer loves to play! This chunky board book with easy-grip toddler tabs on every page is perfect for the very youngest Elmer fans."}]