[{"id": "B00R8JM8YW", "genre": "Children's Books", "title": "Santa Says (A fun way to get overexcited children into bed) (Christmas Books Book 3)", "description": "Unashamedly corny, with a simple rhyming structure, Santa Says is designed to get overexcited children into bed, and help them wind down, ready for sleep.Excerpt (Page 7)Are you in bed now? It's time to play.It's time for you to do what I sayExcerpt (Page 8 and 9)Santa says put your hands in the airAnd hug someone you love, tight as a bearExcerpt (Page 11)Santa says put your chin on your chestBut if it's too hard just do your bestExcerpt (Page 27) Santa says to wriggle like a fishAnd maybe then I'll grant your wishI wish I may I wish I mightHave this wish I wish tonightExcerpt (Page 33)Now it's time for you to close your eyesBecause I'm planning a BIG surpriseExcerpt (Page 34)It's something special that's just for youSo make sure you do what you're told to doAnd that means when it's time to sleepWe don't want to hear a single PEEP!Excerpt (Page 35)Now off to sleep with you little fishTime to close your eyes and make that wish"}, {"id": "1934734063", "genre": "Children's Books", "title": "All About Faces", "description": "Is there any part of the body that fascinates young readers as much as the face? It's the first thing that children see when they look in the mirror. On the same person, the face can smile, cry, show happiness, and show anger. How does that happen? How do all the parts work together? This remarkable book, using easy words and delightful pictures, explains the face and its many parts in simple scientific terms and concepts that young minds can grasp."}, {"id": "1505922410", "genre": "Children's Books", "title": "Simple History: A simple guide to World War II", "description": "Explore the event that shook the world, and changed it forever. Discover the epic story of World War II through a fun timeline, witness deadly technology and combat weapons and meet the leaders who directed the global conflict. Simple history gives you the facts, simple! *This book covers American, British (and commonwealth), Russian, German, Japanese and Italian experiences of the war. What was it like to be a U.S Marine in the Pacific? Or a crew member aboard a B-17 'Flying Fortress'? Think you could cope with the Blitz in London? Find out in Simple History: A simple guide to World War II! A book for kids and grownups!"}, {"id": "0147510066", "genre": "Children's Books", "title": "When Friendship Followed Me Home", "description": "\"If you have middle schoolers who are too young to fully grasp John Green’s The Fault in Our Stars and love dogs, give them this sweet tearjerker.\" — School Library Journal\"In this beguiling tearjerker, a foster kid's luck slowly changes after he befriends a scruffy pup he finds outside the library.\"--People magazine Ben Coffin has never been one for making friends. As a former foster kid, he knows people can up and leave without so much as a goodbye. Ben prefers to spend his time with the characters in his favorite sci-fi books…until he rescues an abandoned mutt from the alley next-door to the Coney Island Library. Scruffy little Flip leads Ben to befriend a fellow book-lover named Halley—yes, like the comet—a girl unlike anyone he has ever met. Ben begins thinking of her as “Rainbow Girl” because of her crazy-colored clothes and her laugh, pure magic, the kind that makes you smile away the stormiest day.  Rainbow Girl convinces Ben to write a novel with her.  But as their story unfolds Ben’s life begins to unravel, and Ben must discover for himself the truth about friendship and the meaning of home."}, {"id": "1407178547", "genre": "Children's Books", "title": "Vicious Vikings (Horrible Histories 25 Years)", "description": "Sail back to a vicious time with fearsome seafaring Viking warriors       with big boats, big shields and enormous ginger beards. Readers       can discover all the foul facts about the Vicious Vikings, including       Viking gods in wedding dresses, corpses on trial and Death       by booby-trapped statues. With a bold, accessible new look, these       bestselling titles are sure to be a huge hit with yet another generation       of Terry Deary fans.        Revised by the author and illustrated throughout to make Horrible       Histories more accessible to young readers.        2018 is HORRIBLE HISTORIES twenty-fifth anniversary."}]