[{"id": "B01416620K", "genre": "Science Fiction & Fantasy", "title": "Seveneves eBook Sampler - pages 3-108: A free excerpt from Seveneves by Neal Stephenson", "description": "SEVENEVES was included on President Obama's Summer 2016 reading list.SEVENEVES was one of only five books recommended by Bill Gates as \"must reads\" for Summer 2016."}, {"id": "B00M29NU5Y", "genre": "Science Fiction & Fantasy", "title": "Aeonian Kiss (Revenants in Purgatory Book 2)", "description": "What happens to the dead when they die? It wasn’t a question Olivia Brennan ever thought to ask. After all, once you've been to Hell and back, how much worse can things get? Her harrowing descent has already cost her everything—her home, her career, the man she loves. But when an enemy resurfaces looking to settle a score, she learns there’s more to lose than she ever imagined.Purgatory harbors many secrets, and Olivia has landed smack dab in the middle of their tangled web. Faced with an impossible choice, she must reach into the darkest parts of her soul for the strength she needs to save everyone she loves. But even if she succeeds, will she ever be the same again?Maybe some questions are best left unanswered. ***Series reading order***Prayer for the Dead (#1)Despite Serendipity (#1.5 companion novella)Aeonian Kiss (#2)"}, {"id": "0957283806", "genre": "Science Fiction & Fantasy", "title": "Vortex, Return of the Effra 1", "description": "Vortex is a fantasy romance novel aimed at the upper teen / young adult market. It is the first book in a trilogy called The Return of The Effra. Nineteen year old student Samantha White isn't enjoying university life, she's disillusioned with her course and having second thoughts about her future. It doesn't help that she keeps having a scary, recurring nightmare and when she thinks things couldn't get worse a creepy man follows her back to her room. Damian is unique, he has silver eyes, horns and wings, he is also being visited by a ghost girl. She looks so sad and frightened he feels compelled to help her, but the night he reaches out to save her from a dragon's fiery breath he gets ripped from his life, his world, from everything he knows. Now it's Damian who's lost in an unfamiliar world that's devoid of magic and full of strange monsters. His only connection with home is Sam who he recognises as the ghost girl. Sam has to put aside her fear and disbelief in Damian's explanations about himself to try and help him find his way home. But in a world without magic is this possible?              "}, {"id": "161661594X", "genre": "Science Fiction & Fantasy", "title": "Rogue Trader: Stars of Inequity", "description": "\"Ever on forward I race, to the unknown edge of reality. There, in the eternal horizon, lies our glory and our gain!\" \nRogue Trader Alexei Magn \nStars of Inequity is a supplement for Rogue Trader that presents tempting new opportunities for those brave few who make their livings in the Koronus Expanse. \nThis detailed resource focuses on the perilous worlds of the Expanse. Game Masters can create their own new realms with the World Generator, a system designed to craft unique planets filled with terrible risks and unmatched potential for profit. Players can brave the dangers of planetside missions, crossing the surface of shadowy worlds to explore deadly jungles, ancient ruins, crashed voidships, and more. And with the Colony Creation rules, your group can construct, expand, and control its own outposts on the lost and forgotten worlds of the Expanse! \nThis is not a complete game. A copy of the Rogue Trader core rulebook is required to play."}, {"id": "B01A2R1RIO", "genre": "Science Fiction & Fantasy", "title": "A Star Curiously Singing (DarkTrench Saga Book 1)", "description": "** Reader's Favorite Gold Medal Award Winner **Sandfly is a debugger. He is property, bought and paid for in an Earth under sharia law. All faiths but one have been banned. And the rule of the great Imam is supreme.As a debugger, Sandfly has an implant in his head that connects him to the world’s technology—and doles out mental shocks to keep him obedient. All he wants is to fix bots and avoid shocks Now he's been called into Earth orbit. The masters have a new spacecraft—one capable of interstellar flight. On its maiden voyage, the only robot on board went mad and tore itself apart. Why? Better question: does it pose any risk to humans? When Sandfly reviews the bot’s final moments, he perceives something unexpected. Something impossible.As Sandfly pieces together the clues, a trap spreads beneath his feet. If he solves the mystery, he may doom himself. And if he fixes the robot, he may shatter his world. Suspenseful, unique, and awash in cyberpunk jive, A Star Curiously Singing presents a bleak future that might be closer than we think."}]