[{"id": "1894917812", "genre": "Children's Books", "title": "Desperate Glory: The Story of WWI (Stories of Canada)", "description": " Short-listed for the 2009 Red Maple Award for Non-Fiction, OLA Forest of Reading and commended for the 2009 OLA Best Bets  This book presents the story and issues of the First World War in a clear, concise and objective manner, accompanied on every page by photographs, original sketches or maps. Focussing on social as well as political issues with a Canadian perspective, Wilson presents the issues of the war with depth and compassion. This book will be a very useful tool for educators in explaining the hows and whys of this most important period."}, {"id": "1575050811", "genre": "Children's Books", "title": "Flying Against the Wind: A Story About Beryl Markham (Creative Minds Biography)", "description": "A biography of the first person, man or woman, to fly alone across the Atlantic nonstop from England to North America, from her childhood in Africa to her record-setting flight"}, {"id": "B06XF9GMXX", "genre": "Children's Books", "title": "Slate Gardens: A Novel", "description": "He is the worst of the worst; a perverted deviant and an elusive killer who presents himself as an old-fashioned country preacher.  She is the distraught widow of a man who successfully embezzled a fortune.  With her two young children, she lives amid the dilapidated ruins of a declining estate named Slate Gardens, where rumor insists three million dollars remains hidden.  Beguiled by the preacher’s psychotic manipulations, the widow takes him into her home as her second husband and a malign father to her vulnerable son and daughter.  She longs for companionship and love.  He craves only profit.A paroled convict and undetected serial killer murders a notorious embezzler in a prison shower, having confirmed the presence of a fortune hidden somewhere on the grounds of his victim’s former home, Slate Gardens.  Using all the guile of a handsome though psychopathic country parson, he will seduce and possess the man’s lonely widow and then overpower her children in an obscene quest for stolen wealth."}, {"id": "B072L1PJT6", "genre": "Children's Books", "title": "Relic: An Into the White Novella", "description": "In the future, the world is covered in ice...Felkyo is a Seeker.  Her job is to find out secrets, even when people want them to remain hidden.  When she goes to the Diggers’ mines in the North she will have to discover a murderer.  But when her own life is at risk, will she manage to survive the mines?‘The Relic’ is a prequel novella in the ‘Into the White’ series."}, {"id": "0374301913", "genre": "Children's Books", "title": "Trick or Treat, Pout-Pout Fish (A Pout-Pout Fish Mini Adventure)", "description": "A short and sweet mini-adventure especially created to introduce the youngest guppies to the popular Pout-Pout Fish.It's Halloween under the sea! Mr. Fish is wearing his costume, but what is he dressed as? A goblin? An astronaut in space? A pirate at the helm of the spooky submarine? Tiny tots will love swimming along with Mr. Fish as he turns little pouts into big smiles.With just one line of text per page, this simple, 12-page board book will send Debbie Diesen and Dan Hanna's much-loved Pout-Pout Fish flippering and swishing into the hearts and minds of very young children."}]