[{"id": "1547051205", "genre": "Children's Books", "title": "1: Mandarin mouse and his magic fairy cakes (Volume 1)", "description": "Mandarin mouse is an endearing character who sets off on his bicycle through the woods when he nears the news that his favourite aunt (Matty) is very ill and needs his help. Mandarin is famous for his delicious fairy cakes and packs these into his bag before setting off. On the way, he encounters some lovely creatures as well as a very cunning fox. He helps whoever he can and his magic cakes do come in handy. Join him in his adventures and watch the magic truly happen."}, {"id": "1481476165", "genre": "Children's Books", "title": "The Star Wolf (The Secret Rescuers)", "description": "Emma rescues a baby star wolf who was caught in a trap in this fifth book in the adorable Secret Rescuers series.Emma lives in a forest full of magical creatures like star wolves! The wolves’ special song makes the stars appear in the sky every night. When Emma rescues a baby star wolf from a trap, she knows she must return the pup to his family. Can she be brave enough to go on a night-time adventure and help to keep the stars shining?"}, {"id": "0375850864", "genre": "Children's Books", "title": "When You Reach Me (Yearling Newbery)", "description": "This Newbery Medal winner that has a fantastic puzzle at its heart has been called “smart and mesmerizing,” (The New York Times), “superb” (The Wall Street Journal), and “incandescent” (The Washington Post). When Miranda starts receiving mysterious notes, she doesn’t know what to do.  The notes tell her that she must write a letter, a true story, and that she can’t share her mission with anyone—not even her best friend, Sal.  It would be easy to ignore the strange messages, except that whoever is leaving them has an uncanny ability to predict the future. If that’s the case, then Miranda has an even bigger problem—because the notes tell her that someone is going to die, and she might be too late to stop it.  “Lovely and almost impossibly clever.” —The Philadelphia InquirerWinner of the Boston Globe–Horn Book Award for Fiction A New York Times Bestseller and Notable Book "}, {"id": "1577683676", "genre": "Children's Books", "title": "The Three Little Pigs", "description": "In this beloved tale, the three pigs find out whose house really is the strongest when they each stand up to the big, bad wolf. Children will eagerly continue reading to see what will happen when the wolf shows up and tries to blow the pigs' houses over! --Between the pages of the Brighter Child(R) Keepsake Stories books are the classic tales of magic, imagination, and inspiration that will delight children again and again. From the hard-working Red Hen to the foolish Gingerbread Man, these stories will capture children's interest and spark their imagination page after page, inspiring a lifelong love of literature and reading. Each book includes 32 pages of fresh, captivating illustrations, and measures 8\" x 8\"."}, {"id": "184898300X", "genre": "Children's Books", "title": "Africa (The History of Exploration)", "description": "Recounts the efforts by travelers from ancient times to the nineteenth century to explore parts of Africa, describes their effects on the continent and its peoples, and profiles notable explorers."}]