[{"id": "0613849698", "genre": "Children's Books", "title": "Farming (America at Work (Sagebrush))", "description": "In a picture-book format, the Canada at Work series introduces young children to the people, machines and environmental concerns involved in farming. It features a year-round, in-depth look at two kinds of agriculture -- cattle ranching and vegetable farming. Canadian in every detail, this book will help kids appreciate the work involved in bringing food to their homes."}, {"id": "1611701074", "genre": "Children's Books", "title": "My Very Own Organic Cookbook: Apples", "description": "Easy, great tasting recipes!                          This book is great for anyone looking for healthy,simple, inexpensive recipes. This book is even great for kids. They find the recipes simple and love eating what they've cooked.                          Use the recipes in My Very Own Organic Cookbook: Apples to create new and exciting ones!                           Visit a farmers market near you…Buy local…Buy organic when you can.                                                    About the author: Frances Rumsey lives near San Jose, California with her husband, two daughters, and one son. She loves to cook so she decided write a series of easy cookbooks for people of all ages.                           Look for her next book in the series, My Very Own Organic Cookbook: Tomatoes."}, {"id": "1680451774", "genre": "Children's Books", "title": "Make: Tech DIY: Easy Electronics Projects for Parents and Kids", "description": "Make: Tech DIY introduces younger children to the magic of electronics through the softer side of circuits! Young explorers will learn about electronics through sewing and craft projects aimed at maker parents and their children, elementary school teachers, and kids' activity leaders. Each project introduces new skills and new components in a progressive series of projects that take learners from the very basics to understanding how to use components such as sensors, transistors, and timers. The book is breezy, highly illustrated, and fun for everyone!"}, {"id": "1605373990", "genre": "Children's Books", "title": "Me and my cars", "description": "Toot-toot! Cars are everywhere. Some drive superfast, others are very big, some transport things and others have a siren. Which cars do you recognize?A book filled with recognizable illustrations of the many vehicles around us. For toddlers ages 12 months and up, with a focus on the child’s world."}, {"id": "0786818700", "genre": "Children's Books", "title": "Knuffle Bunny: A Cautionary Tale", "description": "Trixie, Daddy, and Knuffle Bunny take a trip to the neighborhood Laundromat. But the exciting adventure takes a dramatic turn when Trixie realizes somebunny was left behind Using a combination of muted black-and-white photographs and expressive illustrations, this stunning book tells a brilliantly true-to-life tale about what happens when Daddy's in charge and things go terribly, hilariously wrong."}]