[{"id": "B00LFYWQMK", "genre": "Children's Books", "title": "Alien Superman! (The Amazing Adventures of Superman!)", "description": "In this digital book, your two favorite heroes in one adventure together! In this action-packed chapter book, the World's Finest Heroes team up to save their great cities, while also building a great friendship. But when the MAN OF STEEL suddenly changes into a strange, green creature at the hands of Lex Luthor, can even WONDER WOMAN takedown The Alien SUPERMAN? Find out in this exciting read for any super hero fan!"}, {"id": "0310764955", "genre": "Children's Books", "title": "Stand Beautiful - picture book", "description": "Stand Beautiful, written by teen TedX speaker and CURE.org ambassador Chloe Howard, encourages readers of all ages to embrace their own uniqueness and celebrate the differences in others. Born with a clubfoot, Chloe had five major operations by the time she was fifteen. Through her hardships, she learned that each of us is perfect in our own imperfect way. With some inspiration from Bono, Chloe set out to create the Stand Beautiful movement, encouraging others to accept themselves just as they are. With playful text and adorable illustrations by Deborah Melmon, this picture book asks the question: Will YOU stand beautiful too?“You are each perfect in your own imperfect way. Love yourself, because you deserve to be loved. Rock those differences, embrace those imperfections; you are worth celebrating. Choose to stand beautiful.” Chloe Howard (TED Talk)The adorable cover of this book draws readers in and shines bright with embossing and foil."}, {"id": "1368002501", "genre": "Children's Books", "title": "Gravity Falls: Journal 3 Special Edition", "description": "Untie the string and unwrap the brown paper to reveal . . . Journal 3 Limited Edition! This 288-page book contains all of the content of the regular edition, plus all-new top-secret black light pages on real parchment; a cover with leather texture and shiny metallic pieces; a magnifying glass; a tassel bookmark; and removable photos and notes. This $150 limited edition will also include a signed note from the creator of Gravity Falls and co-writer of Journal 3, Alex Hirsch himself."}, {"id": "019834855X", "genre": "Children's Books", "title": "Oxford Connections: Year 3: Light and Shadow: Science - Pupil Book", "description": "Oxford Connections books are based on Literacy Consultant Sue Palmer's 'skeletons' concept whereby the children are shown a text model of the text type with which to write notes using the structure of the 'skeleton' as a guide. Within the titles there are notes, diagrams or pictures that the children will use as the basis for writing a piece of text. A genuinely cross-curricular scheme. Each book contains material to teach literacy and geography, science or history. Each book matches the literacy requirements for non-fiction for one year within the NLS, and history, geography or science material within one unit of the QCA schemes of work for the National Curriculum. Also suitable for the Scottish 5-14 and Northern Ireland curricula."}, {"id": "0547581319", "genre": "Children's Books", "title": "The Wild Book", "description": "Fefa struggles with words. She has word blindness, or dyslexia, and the doctor says she will never read or write. Every time she tries, the letters jumble and spill off the page, leaping and hopping away like bullfrogs. How will she ever understand them?But her mother has an idea. She gives Fefa a blank book filled with clean white pages. \"Think of it as a garden,\" she says. Soon Fefa starts to sprinkle words across the pages of her wild book. She lets her words sprout like seedlings, shaky at first, then growing stronger and surer with each new day. And when her family is threatened, it is what Fefa has learned from her wild book that saves them."}]