[{"id": "B06XBQ4PYY", "genre": "Children's Books", "title": "Mouse", "description": "A hungry mouse discovers the alphabet, nibble by nibble, in this playful tale. When the letter M comes upon a hungry little mouse with a delicious-looking cherry, he can't help but ask for a bite. The mouse reluctantly agrees, only for the M to devour the entire thing! In exchange, the M offers the mouse some of itself, but after a few bites the M has suddenly become an N. So begins the mouse's journey through the many letters of the alphabet thanks to some creative nibbling and imaginative illustrations from debut author/illustrator Zebo Ludvicek."}, {"id": "0547199457", "genre": "Children's Books", "title": "Balloons over Broadway: The True Story of the Puppeteer of Macy's Parade (Bank Street College of Education Flora Stieglitz Straus Award (Awards))", "description": "Everyone’s a New Yorker on Thanksgiving Day, when young and old rise early to see what giant new balloons will fill the skies for Macy’s Thanksgiving Day Parade. Who first invented these \"upside-down puppets\"? Meet Tony Sarg, puppeteer extraordinaire! In brilliant collage illustrations, Caldecott Honor artist Melissa Sweet tells the story of the puppeteer Tony Sarg, capturing his genius, his dedication, his zest for play, and his long-lasting gift to America—the inspired helium balloons that would become the trademark of Macy’s Parade. Winner of the 2012 Robert F. Sibert Medal and the NCTE Orbis Pictus Award."}, {"id": "1524701629", "genre": "Children's Books", "title": "Purrmaids #1: The Scaredy Cat", "description": "Get totally smitten with mermaid kittens in the first book in this new chapter book series! It’s purrfect for fans of Magic Kitten and the Fairy Animals of Misty Wood series.    Coral, Shelly, and Angel are best friends. They love exploring their home in Kittentail Cove. On the first day of sea school, their teacher asks everyone to bring in something special to share with the class. Shelly and Angel can’t wait to visit Tortoiseshell Reef to find an extra-special treasure. But the reef is all the way on the edge of the cove and Coral is scared to swim that far away from home. Can this scaredy-cat learn to be brave?    These adorable purrmaids will have young readers paws-itively hooked from page one!"}, {"id": "0635025272", "genre": "Children's Books", "title": "Granville Woods: Excellent Inventor (155) (1000 Readers)", "description": "Granville Woods held patents on over 60 different inventions. Some of his inventions are still in use today. Granville invented an \"Induction Telegraph\" that allowed trains to communicate with each other! This helped to stop accidents on the railways. Granville was recognized for his work both during his lifetime and after his death. What an accomplishment!These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "1595663177", "genre": "Children's Books", "title": "Cars and Bikes (Machines at Work)", "description": "Explaining how vehicles help people on farms, construction sites, and other places, each of these high interest books answers questions with bright, interesting photographs of machines in different situations to explain how they work and what they do."}]