[{"id": "1538350440", "genre": "Children's Books", "title": "My Pet Mouse: Step by Step (Computer Science for the Real World)", "description": "Computer science is all around us, at school, at home, and in the community. This book gives readers the essential tools they need to understand the computer science concepts of algorithms and procedures. Brilliant color photographs and accessible text will engage readers and allow them to connect deeply with the concept. The computer science topic is paired with an age-appropriate curricular topic to deepen readers learning experience and show how algorithms and procedures work in the real world. In this book, a narrator takes care of a mouse according to a set of instructions. This nonfiction title is paired with the fiction title Rosa's Rabbit (ISBN: 9781538350409). The instructional guide on the inside front and back covers provides: Vocabulary, Background knowledge, Text-dependent questions, Whole class activities, and Independent activities."}, {"id": "0531207358", "genre": "Children's Books", "title": "The Nervous System (True Books)", "description": "Explores the human nervous system, describing its parts and how they work, what happens when they don't work, and how to protect the nervous system from damage. Reprint."}, {"id": "0399552383", "genre": "Children's Books", "title": "The Amazing Collection of Joey Cornell: Based on the Childhood of a Great American Artist", "description": "Award-winning and bestselling author Candace Fleming delivers a stunning picture-book based on the childhood of artist and sculptor Joseph Cornell, sure to beguile aspiring artists and collectors of all ages.Joey Cornell collected everything -- anything that sparked his imagination or delighted his eye. His collection grew and grew until he realized that certain pieces just looked right together. He assembled his doodads to create wonderful, magical creations out of once ordinary objects. Perfect for introducing art to kids, here's an imaginative and engaging book based on the childhood of great American artist Joseph Cornell, told by master picture book author Candace Fleming and lauded illustrator Gérard DuBois."}, {"id": "B06XS6W5DV", "genre": "Children's Books", "title": "Far Side of the Moon: The Story of Apollo 11's Third Man", "description": "*Junior Library Guild Selection 2017*This graphic retelling of the Apollo 11 moon-landing mission follows astronaut Michael Collins, commander of the lunar orbiter, to the far side of the moon.When the Earth disappears behind the moon, Collins loses contact with his fellow astronauts on the moon’s surface, with mission control at NASA, and with the entire human race, becoming more alone than any human being has ever been before. In total isolation for 21 hours, Collins awaits word that Neil Armstrong and Buzz Aldrin have managed to launch their moon lander successfully to return to the orbiter—a feat never accomplished before and rendered more problematic by the fuel burn of their difficult landing. In this singularly lonely and dramatic setting, Collins reviews the politics, science, and engineering that propelled the Apollo 11 mission across 239,000 miles of space to the moon.Fountas & Pinnell Level U"}, {"id": "1973384965", "genre": "Children's Books", "title": "Cheating the Photographer: The North and South seas", "description": "Paul McMeyer is a well known photographer for National Geographic. His life is full of adventures and he already had the privilege to know nature as close as humanly possible. He also is in love with the beautiful Helen Curry, which he is thinking to marry too. What's riskier, photographing a jaguar or getting married? He knows he has to make an important choise and he will finally decides what to do. But he has to discover the drama besides what a man know and what a man don't know. Sometime he remembers his past through the pictures he managed to shoot and sometimes he wishes he didn't. All those adventures with NatGeo, all the times he risked his life. In this first book he will understand what pain means and he surely is going to act on it. What about Helen, does she love him? They've been together for a long time now and she does love him. So, why did she do all of that? Why did she make the photographer suffer that much?"}]