[{"id": "1505649935", "genre": "Science Fiction & Fantasy", "title": "1/2986", "description": "Our world changed - our climate, our ecosystems, our food and water supply. Our survival stands on a knife's edge. Ten billion lives are lost. Three million survived. War is coming. This is our story.\"Think of your darkest memory, and know that what is coming will be unimaginably worse. All your days. Every night. You'll hate me for it. You'll hate me as much as you can hate. I promise you that.\"Book 1 of the acclaimed climate fiction saga 1/2986. "}, {"id": "1543003869", "genre": "Science Fiction & Fantasy", "title": "Madison Mosby and the Rose Widow (The Moonmilk Trilogy) (Volume 1)", "description": "Madison Mosby figures she will never find happiness. At twenty-five, she’s a washed up cook, toiling in a grimy outpost in the food empire founded by her missing grandmother, and swimming in debt. Her mother is forever nagging her to start a family and she’s reminded every day that following society’s rules have gotten her nowhere in life. Madison’s new life begins when a man appears before her, begging for a product that will tip the balance of power in a war that has been raging for the past seven years - a war of sorcery, magical drug cartels, and private armies. The product he’s looking for was made by Madison's grandmother, a.k.a. the Rose Widow."}, {"id": "1531811337", "genre": "Science Fiction & Fantasy", "title": "Jump Pay (13th Spaceborne)", "description": "The national best-selling author of the Spec Ops Squad series ends the saga of The Lucky 13th.... In book three of Shelley's science fiction-military trilogy, the soldiers of The Lucky 13th are spearheading the assault of the Accord planets. Heavy casualties are expected. But the fighters of the 13th know the odds - and how to beat them. "}, {"id": "1548829722", "genre": "Science Fiction & Fantasy", "title": "Vigilant Veritas: Book 3 of the Black Saber Novels (Volume 3)", "description": "The Carthenogens are coalescing power by appointing a sole human as Chancellor of Earth. Their chosen front-man? The ever charming and cleverly manipulative Barrett Kerrington, former US vice president. He’s brought Black Saber to their knees in exchange for ultimate power. Vaughn Killian, highly trained Black Saber operative, with a past as a ruthless rebel fighter, has found his way to the Carthenogens’ home planet—in a prison cell. Just when he thinks his life is over, dressed in rags with no weapons, he finds a way into the halls of power and learns something horrible . . . the truth about what the Carthenogens really have in store for humanity. With Black Saber forces decimated to only a handful of fighter craft, it seems like all that’s left for humankind are the funeral arrangements. With the clock running out, Killian devises a strategy to disrupt the peace-preaching aliens’ death grip over humankind, but doing so will require him to utter one simple word he thought would never cross his lips . . . and will likely end his life."}, {"id": "B00MK9FPH2", "genre": "Science Fiction & Fantasy", "title": "Steampunk Carnival (Steam World Book 1)", "description": "FIVE STARS: \"Great book. Katya was a compelling lead.\" - Kollin BrughFIVE STARS: \"Definitely worth my time!\" - Amazon CustomerFOUR STARS: \"An entertaining read.\" - Shomeret, the Masked Reviewer,shomeretmasked.blogspot.comFOUR STARS: \"Great steampunk mystery.\" - kiFOUR STARS: \"First in a promising series... the author needs to hurry up and publish the sequel!\" - MRRCrossing her boss will be one dangerous ride.Katya Romanova gave up everything to work at the one-of-a-kind Steampunk Carnival. At nineteen, she wouldn't want to be anywhere else.But in 1887’s summer heat, death threats target owner William Warden and rattle Katya to the bone. When she digs up unexpected evidence about the carnival's past, she puts herself in danger along with anyone else who learns the truth. As violence erupts, Mr. Warden tightens his control around everything and everyone. Caught between his charm and his tyranny, Katya must comply even as she plots against him.The entire country backs Mr. Warden, and nothing less than the perfect plan will succeed. Failing means Katya never sees the carnival again and the person who needs it the most wasted his last chance at redemption.Witness steampunk rise and conquer in this alternate history series rich with period details.Scroll up and buy now to join Katya on her heart-pounding adventure.*For a limited time, get a FREE book from this author and VIP access behind the scenes. See details inside or sign up now at cassandraleuthold.com/vip.*"}]