[{"id": "B00NTFY72K", "genre": "Children's Books", "title": "Captain Courageous & Friends (Captain Courageous Adventures Book 3)", "description": "Follow the exciting adventures of Captain Courageous and some of his other Superhero friends in this exciting comic series."}, {"id": "B06XPKB4TX", "genre": "Children's Books", "title": "The Princess & The Bodyguard: Just Be", "description": "Looking for a practical and engaging way to teach your children the \"Be-Attitudes\"?  The Princess & The Bodyguard e-Book series is dedicated to educating, in an entertaining way, the principles of the Kingdom of God.  By sharing the virtues of Kingdom living, we can change a culture from the start."}, {"id": "1404208623", "genre": "Children's Books", "title": "Oprah Winfrey: The Life of a Media Superstar (Graphic Biographies)", "description": "In graphic novel format, presents the life and career of the high-profile talk show host."}, {"id": "B00LTKOQ6O", "genre": "Children's Books", "title": "How Mirka Got Her Sword (Hereville Book 1)", "description": "Spunky, strong-willed eleven-year-old Mirka Herschberg isn’t interested in knitting lessons from her stepmother, or how-to-find-a-husband advice from her sister, or you-better-not warnings from her brother. There’s only one thing she does want: to fight dragons!Granted, no dragons have been breathing fire around Hereville, the Orthodox Jewish community where Mirka lives, but that doesn’t stop the plucky girl from honing her skills. She fearlessly stands up to local bullies. She battles a very large, very menacing pig. And she boldly accepts a challenge from a mysterious witch, a challenge that could bring Mirka her heart’s desire: a dragon-slaying sword! All she has to do is find—and outwit—the giant troll who’s got it!A delightful mix of fantasy, adventure, cultural traditions, and preteen commotion, Hereville will captivate middle-school readers with its exciting visuals and entertaining new heroine."}, {"id": "1627791426", "genre": "Children's Books", "title": "Bella the Bunny: Fairy Animals of Misty Wood", "description": "In the enchanted world of Misty Wood, every creature has sparkly fairy wings and a special job to do. In Book 2, Bella the Bunny is opening flowers to make Misty Wood as pretty as can be. There is a surprise hiding inside one of the bluebells―Lexi the Ladybug! Lexi is sad because she looks different from other ladybugs, but Bella knows just how to make her feel better."}]