[{"id": "1934857319", "genre": "Science Fiction & Fantasy", "title": "Shadowrun 20th Anniversary Edition", "description": "The year is 2072. Magic has returned and creatures of myth and legend walk among us as megacorps bleed the world dry. You’re a shadowrunner―a deniable asset, a corporate pawn―using bleeding-edge science and magic to make your meat body and mind better-than-flesh. Stay on the edge, and you may survive another run on the mean sprawl streets. Shadowrun, Fourth Edition offers a completely new rules system that is simple, integrated, and accessible. The state-of-the-art has also been advanced, introducing a new level of augmented reality, new gear, and new magical discoveries. This full-color rulebook contains all the rules gamemasters and players need to create characters and ongoing adventures set in the popular Shadowrun universe. Shadowrun, Fourth Edition 20th Anniversary Core Rulebook is fully compatible with all Shadowrun, Fourth Edition books."}, {"id": "B01N4GI6EN", "genre": "Science Fiction & Fantasy", "title": "The Abject God: Immortal Treachery, Book Four", "description": "Vykers once killed some of the Emperor’s soldiers; now, the Emperor has crossed the sea with all his legions to exact a revenge that will impact not only the Reaper, but Kittins, Spirk, Eamon, and even the Virgin Queen herself. Meanwhile, pieces to the puzzle of Vykers’ origins begin to fall into place, revealing people and purposes both unexpected and heretofore unimaginable. And then there is the long-suffering Long Pete, who must now contend with an utterly reshaped reality that threatens his very existence."}, {"id": "0765392828", "genre": "Science Fiction & Fantasy", "title": "Patterns of the Wheel: Coloring Art Based on Robert Jordan's The Wheel of Time (Wheel of Time Other)", "description": "Let the Dragon be drawn again on the winds of time. Patterns of the Wheel is an adult coloring book suitable for all ages featuring original art drawn from The Wheel of Time ®.Since its debut in 1990, The Wheel of Time by Robert Jordan has captivated millions of readers around the globe with its scope, originality, and compelling characters. Over the course of fifteen books and millions of words, the world that Jordan created grew in depth and complexity. Now for the very first time, fans of this astounding saga can color in the hues and vibrant shades of Robert Jordan’s most beloved fantasy world. Adorn the symbols of the Ajah and the patterns on Gleeman’s Cloak. Experience the peaks of Dragonmount, the depths of the Aryth Ocean, and other parts of the realm. Fill in evocative mandalas, depictions of Old Tongue, and an array of the Wheel of Time’s most well-known symbols and magical items. Designed by officially-licensed Wheel of Time artist Amy Romanczuk, Patterns of the Wheel features 40 drawings inspired by pysanky, a traditional Ukrainian folkart, to provide hours of delight for The Wheel of Time's legions of fans."}, {"id": "150129850X", "genre": "Science Fiction & Fantasy", "title": "1: Necessary Evil (The Milkweed Triptych)", "description": "Hellboy meets Raiders of the Lost Ark in the stunning conclusion to Ian Tregillis’s Milkweed series.12 May 1940. Westminster, London, England: the early days of World War II. Again.Raybould Marsh, one of Britain’s best spies, has traveled to an alternate Earth in a desperate attempt to save at least one timeline from the ancient alien race who have been observing our species and who have already destroyed Marsh’s timeline. In order to accomplish this, he must remove all traces of the supermen that were created by the Nazi war machine and who caused the specters from outer space to notice our planet in the first place.His biggest challenge is the mad seer Gretel, one of the most powerful of the Nazi creations, who has sent a version of herself to this timeline to thwart Marsh. Why would she stand in his way? Because she has seen that she dies in all the timelines and she is determined to stop that from happening, even if it means destroying most of humanity in the process. And Marsh is the only man who can stop her."}, {"id": "B076KVRGKF", "genre": "Science Fiction & Fantasy", "title": "Destroyermen (13 Book Series)", "description": "From Book 1: Pressed into service when World War II breaks out in the Pacific, the US Walker—a Great War-era destroyer—finds itself retreating from pursuing Japanese battleships. Its captain, Lieutenant Commander Matthew Patrick Reddy, desperately leads the Walker into a squall, hoping it will give them cover—only to emerge into an alternate world. A world where two species have evolved: the cat-like Lemurians and the reptilian Griks, and they are at war. With its power and weaponry, the Walker's very existence could alter the balance of power. And for Reddy and his crew, who have the means to turn a primitive war into a genocidal Armageddon, one thing becomes clear. They must determine whose side they're on. Because whichever species they choose is the winner. "}]