[{"id": "0692217746", "genre": "Children's Books", "title": "Mabel and the Magic Ballet Slippers", "description": "Naomi is a young girl when her father loses his job and her family is forced to move to “the projects”. She reluctantly befriends Mabel, an elderly neighbor. She is sure that Mabel has nothing in common with her - until she learns that she used to dance ballet – just like Naomi used to. Join Naomi in this early reader chapter book as she learns to cope through her friendship with Miss Mabel, but also through discipline, character, courage and ballet."}, {"id": "B077ZHFCHX", "genre": "Children's Books", "title": "We keep the owls!: A story about gnomes, animals and nature to read aloud", "description": "Every year the forest community arranges the Gnome Village Competition to award a prize for the most beautiful and modern village. Glorygnome promises his friends and neighbors to win the award and so they elect him gnome mayor. Immediately he starts with many little alterations: The flower meadows are mown, the herbs are cleared out and the trees are cut back. Glorygnome gives orders to drain the moor, chase off the bats and decides that mushrooms are only allowed to grow at one definite place in the wood. Wisemunchkin and Scholarwight warn their neighbors of the environmental damage but Glorygnome knows no bounds. Finally, he even removes the protection forest above the root-settlement. But shortly before the award ceremony, the gnomes experience a nasty surprise."}, {"id": "1441313176", "genre": "Children's Books", "title": "Unicorn Adventure Scratch and Sketch: An Art Activity Book for Creative Kids of All Ages", "description": "Join a girl named Polly and her unicorn friend on a magical journey to an enchanted castle! Use your stylus pen like a magic wand, tracing the unicorn, friends, and all the wonders along the way, and discover the secret colors -- silver, gold, and rainbow -- beneath the black-coated pages!This is a Trace-Along title! This fun and easy art activity book allows budding artists to trace the white outlines on black-coated scratch art pages.20 black-coated scratch-off art board pages: 10 have gold and silver glitter beneath, and 10 have multicolored swirls beneath.20 drawings and descriptions of unicorns and friends.20 extra pages for doodling.Includes wooden stylus for drawing.For children ages 5 and up.6-3/8'' wide x 8-1/2'' highNon-toxic. Potential eye irritant. Avoid inhaling particles of scratch coating. Not for children under 5 years. Meets all applicable safety standards."}, {"id": "0635015412", "genre": "Children's Books", "title": "Carrie Chapman Catt: Amazing Activist (72) (1000 Readers)", "description": "Carrie Chapman Catt was a major force in the campaign for woman suffrage. Since she was a young girl, she knew she could achieve great things if she just set her mind to it. And she wouldn't take no for an answer!These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "072325771X", "genre": "Children's Books", "title": "Beatrix Potter's Nursery Rhyme Book R/I (Peter Rabbit)", "description": "The perfect introduction to the world of Beatrix Potter, this nursery rhyme book is filled with Potter’s vibrant art and classic characters, offering a new world to explore on every page. The simple, repetitive language of the nursery rhymes, poems, and riddles will make this book a sure read-aloud favorite and the elegant new Potter design on the cover, makes it an ideal gift and an excellent addition to every nursery library."}]