[{"id": "B00RW1URRQ", "genre": "Children's Books", "title": "Hernando Cortez (with Illustrations)", "description": "The career of Hernando Cortez is one of the most wild and adventurous recorded in the annals of fact or fiction, and yet all the prominent events in his wondrous history are well authenticated. All truth carries with itself an important moral. The writer, in this narrative, has simply attempted to give a vivid idea of the adventures of Cortez and his companions in the Conquest of Mexico..."}, {"id": "1483813037", "genre": "Children's Books", "title": "Spectrum Geography, Grade 6: World", "description": "Winding through purple mountains majesties and amber waves of grain, the standards-based Spectrum Geography: World for grade 6 guides your child’s understanding of ecosystems, world religions, current events, human migration, and more using colorful illustrations and informational text.Spectrum Geography is an engaging geography resource that goes beyond land formations and maps―it opens up children’s perspectives through local, national, and global adventures without leaving their seats."}, {"id": "0375973605", "genre": "Children's Books", "title": "Sleepy Dog, Wake Up! (Step into Reading)", "description": "The bestselling Sleepy Dog now has a sequel! In this Step 1 Step into Reading Reader, Sleepy Dog does not want to wake up! The sun is up, the cat is up—wake up, Sleepy Dog! Every sleepy child will laugh with Sleepy Dog as he shakes off his snooziness and finally gets out of bed, all ready to play. Fans of the original Sleepy Dog will be excited to join in Sleepy Dog’s fun morning.    Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story."}, {"id": "B077S2VWTT", "genre": "Children's Books", "title": "365 Foreign Dishes: A Foreign Dish for every day in the year (Classic Cookery Books) (Annotated)", "description": "\"365 Foreign Dishes\" originally published in 1908. ''A Foreign Dish for Every Day in the Year''. Starting on January 1st with Austrian Goulasch and ending on December 31st with French Braised Sweetbread, you can cook your way around the world all year long! Dedicated to all Vintage Cookbook Lovers! "}, {"id": "1974294811", "genre": "Children's Books", "title": "Music Teachers Are Fantastical & Magical Like A Unicorn Only Better: Thank You Gift For Teacher (Teacher Appreciation Gift Notebook)(8.5 x 11 Composition Notebook)", "description": "Do you need unique teacher gifts under $10?This awesome teacher appreciation gift is a simple 8.5” x 11”, 120 page lined journal notebook that beats a teacher thank you card any day. Let the teacher know how grateful you are and that their hard work is appreciated.These are also great teacher gifts to start the school year off with. You know as a pre-apology for your kids future behaviors. Always good to be prepared when going back to school.These composition notebooks make the perfect:End Of The Year Teacher BooksTeacher Appreciation GiftsTeacher Thank You GiftsFirst Day Of School Teacher GiftComposition Notebook For TeachersBack To School NotebookTeacher’s Planner & JournalScroll up today and give your teacher a gift they will actually use."}]