[{"id": "1416968628", "genre": "Children's Books", "title": "Sticky Paws (Curious George)", "description": "George gets his paws into everything! With four-color wipe-off pages and a wipe-off pen, this is the coloring book you can play with again and again. Works great with crayons, too!"}, {"id": "0064440591", "genre": "Children's Books", "title": "Frog and Toad All Year (I Can Read Level 2)", "description": "In winter, spring, summer, and fall, Frog and Toad are always together. From sledding in winter to eating ice cream on hot summer days, these two friends have fun the whole year round!The beloved classic Frog and Toad stories by Arnold Lobel have won numerous awards and honors, including a Newbery Honor (Frog and Toad Together), a Caldecott Honor (Frog and Toad are Friends), ALA Notable Children’s Book, Fanfare Honor List (Horn Book), School Library Journal Best Children’s Book, and Library of Congress Children’s Book. This Level 2 I Can Read is geared toward kids who can read on their own but still need a little help. "}, {"id": "1627793097", "genre": "Children's Books", "title": "The Elephant Whisperer (Young Readers Adaptation): My Life with the Herd in the African Wild", "description": "When Lawrence Anthony was asked to accept a rogue herd of elephants in his reserve in South Africa, it was the last chance for these elephants. If Anthony didn’t take them, they would be shot. But he had no experience with elephants at all. What was he to do?Take them on, of course!What follows is an exciting and heartwarming series of adventures, in which Anthony learns about elephants and becomes part of their family. Full of both triumph and tragedy, The Elephant Whisperer, is a fascinating and unforgettable account of living with the majestic elephant."}, {"id": "1624316158", "genre": "Children's Books", "title": "Beluga Whales (21st Century Skills Library: Exploring Our Oceans)", "description": "This book takes readers on a journey under the sea to discover the fascinating facts about beluga whales, including physical features, habitat, life cycle, food, and more. Photos, captions, and keywords supplement the narrative of this informational text, while additional search tools--including a glossary and an index--help students locate and review important information."}, {"id": "0394874714", "genre": "Children's Books", "title": "Hungry, Hungry Sharks (Step-Into-Reading, Step 3)", "description": "Did you know that there were sharks on earth even before dinosaurs? For more than twenty years, Hungry, Hungry Sharks! has been a staple nonfiction title in the Step into Reading line. Nothing is more exciting than sharks, and this title is packed with amazing facts about these fearsome underseas predators. And now it’s even more exciting, with dynamic new cover art to attract a whole new generation of early readers."}]