[{"id": "0836859790", "genre": "Children's Books", "title": "The Holocaust: A Primary Source History (In Their Own Words)", "description": "Discusses the origins of the Holocaust, the rise of Nazi Germany, the social conditions of Jews in Nazi Germany, how the Holocaust was portrayed in the media, and the aftermath of the Holocaust."}, {"id": "1492656232", "genre": "Children's Books", "title": "Quantum Entanglement for Babies (Baby University)", "description": "Simple explanations of complex ideas for your future genius!Written by an expert, Quantum Entanglement for Babies is a colorfully simple introduction to one of nature's weirdest phenomenons. Babies (and grownups!) will learn about the wild world of quantum particles. With a tongue-in-cheek approach that adults will love, this installment of the Baby University board book series is the perfect way to introduce basic concepts to even the youngest scientists. After all, it's never too early to become a quantum physicist!Baby University: It only takes a small spark to ignite a child's mind."}, {"id": "1427616450", "genre": "Children's Books", "title": "Five Little Speckled Frogs", "description": "\"Five Little Speckled Frogs, sitting on a hollow log, eating some most delicious bugs. Yum, yum!\" This picture book beautifully illustrates the familiar children's song through watercolor, collage and graphic design. Children and adults can easily read or sing the repetitive text while they count down from five. Watch for patterns by keeping an eye on the frogs and those \"most delicious bugs.\""}, {"id": "1543502253", "genre": "Children's Books", "title": "What Is Media? (All About Media)", "description": "Media is everywhere! Emerging readers need to know the different types of media, how to interact with media, and what exactly media literacy is. Straightforward, neutral text and vivid photographs provide readers with the tools they need to evaluate and understand media."}, {"id": "B0781YMNZT", "genre": "Children's Books", "title": "PUP LOVES CHRISTMAS (Pup Loves to Learn Book 1)", "description": "Pup Loves Christmas is an educational picture book for toddlers and preschoolers.  It helps your child identify and learn the names of all things Christmas, with the help of Pup and his clever rhymes!This book is part of the Pup Loves to Learn series, which contains an assortment of fun & engaging educational titles.  These learning books teach basic concepts, such as recognizing shapes, colors, animals and other everyday objects.** Don't forget your BONUS FREE GIFT waiting for you inside! **Each book contains bright colors, big cartoon images and bold words - with the purpose of capturing the notoriously short attention spans of toddlers and preschoolers.  Join Pup, an adorable little puppy dog, as he interacts with your child using short, snappy rhymes and guides them through each book from start to finish.It won't be long before your little one will be reading out loud alongside you - and more importantly - easily memorizing each topic through repetition and visual & verbal associations."}]