[{"id": "1559718420", "genre": "Children's Books", "title": "Planets, Moons and Stars: Take-Along Guide (Take Along Guides)", "description": "An introduction to the world of planets, moons, and stars including identification information, educational activities, and fun facts."}, {"id": "B007JOUKNW", "genre": "Children's Books", "title": "Kids Knowledge Series : Vegetables And Fun Teach All About Vegetables To Your Kids", "description": "This book explains each of the vegetables with pictures and illustrations. As a preschool activity , its better to teach your kids with basic stuff about fruits,vegetables,body parts so that the kids will be ahead of other kids at school. Teaching these things in an early stage makes them more confident and helps them in their mental growth.This book teaches all about vegetables for kids of less than 4-6 years and helps them memorize things with these beautifully illustrated vegetable pics.Megs is a famous author for several jokes books,story books,kids books with illustrations. Megs books are highly published in several formats."}, {"id": "1562943537", "genre": "Children's Books", "title": "Cold War, The", "description": "An illustrated history of the ideological conflict between the Communist bloc and Western democracies covers the personalities involved, surrogate wars, covert actions, nuclear threat, and the factors that brought the Cold War to an end."}, {"id": "1533483973", "genre": "Children's Books", "title": "Whispers from Indian Creek", "description": "After losing her parents in a fatal car crash, Auna goes to live with her grandparents on Indian Creek.  Undeterred by her granddaddy’s bizarre old Indian tales, about a love triangle involving her family, she soon finds out that there is something strange and deadly living on Indian Creek."}, {"id": "0399176268", "genre": "Children's Books", "title": "Hensel and Gretel: Ninja Chicks", "description": "New from the team behind The Three Ninja Pigs and Ninja Red Riding HoodThese ninja chicks are anything but chicken!   When Hensel and Gretel’s dad gets snatched by a fox, the sisters put their ninja skills to work to track him down before he can be stir-fried.   But are these two little chicks ready to take on a dark tangled forest, a tricky house made of corn bread, and an even trickier fox?   This plucky pair isn’t giving up without a fight! Kiya!"}]