[{"id": "B0096A50WS", "genre": "Children's Books", "title": "Being Teddy Roosevelt", "description": "Riley O’Rourke is writing his report on President Teddy Roosevelt in preparation for the fourth-grade biography tea, but he has a far more important goal: to get a saxophone so he can take instrumental music. His mother can’t afford to rent him a sax, and he’s sure he’ll never save up enough money to buy one. But as Riley learns more about Roosevelt’s “bully” spirit, he realizes that there just might be a way to solve his problem after all. This sparkling story about the influence of important historical figures is enhanced by tender, insightful illustrations. Being Teddy Roosevelt is a 2008 Bank Street - Best Children's Book of the Year."}, {"id": "B0091NORYM", "genre": "Children's Books", "title": "Curious George Learns the Alphabet Book and CD", "description": "What better way to learn to read than with Curious George as your classmate and the man with the yellow hat as your teacher?In this classic book by H.A. Rey, Curious George has progressed from learning to wash dishes, clean windows, and ride a bike to learning his letters--with time out for fun, food, football, mischief, and a surprise at the end!"}, {"id": "1584301570", "genre": "Children's Books", "title": "Passage to Freedom: The Sugihara Story (Rise and Shine)", "description": "A portrait of Chiune Sugihara, a Japanese diplomat in Lithuania in 1940, explains how he used his powers--against the orders of his own government--to assist thousands of Jews escape the Holocaust, actions that resulted in the imprisonment and disgrace of his entire family.\""}, {"id": "0142407224", "genre": "Children's Books", "title": "The Tough Guide to Fantasyland: The Essential Guide to Fantasy Travel", "description": "The definitive edition of a cult classic by the legendary Diana Wynne Jones.Imagine that all fantasy novels—the ones featuring dragons, knights, wizards, and magic—are set in the same place. That place is called Fantasyland. The Tough Guide to Fantasyland is your travel guide, a handbook to everything you might find: Evil, the Dark Lord, Stew, Boots (but not Socks), and what passes for Economics and Ecology. Both a hilarious send-up of the cliches of the genre and an indispensable guide for writers, The Tough Guide to Fantasyland has been nearly impossible to find for years. Now this cult classic is back, and readers can experience Diana Wynne Jones at her very best: incisive, funny, and wildly imaginative. This is the definitive edition of The Tough Guide, featuring a new map, an entirely new design, and additional material written for it by Diana Wynne Jones.World Fantasy Award FinalistA Hugo Award Finalist (Nonfiction)"}, {"id": "159296205X", "genre": "Children's Books", "title": "Midwest Division: The Dallas Mavericks, the Denver Nuggets, the Houston Rockets, the Memphis Grizzlies, the Minnesota Timberwolves, the San Antonio ... Utah Jazz (Above the Rim: the Nba Library)", "description": "Describes the seven teams that make up the Midwest Division of the National Basketball Association, their histories, famous players, and statistics."}]