[{"id": "1594720088", "genre": "Science Fiction & Fantasy", "title": "Knights & Musketeers (7th Sea)", "description": "All for One and One for All! Not everyone who wields a sword in Théah is a pirate or a highwayman. There is a long-standing tradition of honor and defense of the innocent, out of which grew Orders both chivalric and martial. Despite the massive changes that history has wrought upon the nations of Théah, there are still men and women who remain true to their ideals and proudly carry on the noble traditions. Knights and Musketeers reveals information about these Orders - their history, oaths and laws, goals, martial skills, and the chivalric traditions by which they live. So don your tabard and learn what it means to join the ranks of those who have given their lives for a cause greater than themselves. The dark and the wicked shall fear your blade, for none serve justice as fiercely as the Knights and Musketeers of this realm! Knights and Musketeers includes: Details and rules for numerous chivalric and military Orders across Théah. Guidelines for incorporating these Orders into any swashbuckling campaign. New skills and background information, suitable for use in any setting. New NPCs and ideas for adventures. Fully compatible with both the d20 system and the classic 7th Sea system! To use this companion, a Game Master also needs a copy of Swashbuckling Adventures, and a Dungeons & Dragons Core Book. A player needs only Swashbuckling Adventures and a Dungeons & Dragons Core Book."}, {"id": "B078B72FQ8", "genre": "Science Fiction & Fantasy", "title": "How to Claim an Undead Soul (The Beginner's Guide to Necromancy Book 2)", "description": "The Beginner's Guide to Necromancy, Book 2Life was simpler for Grier when she was flat broke and a social pariah. Now she's carrying the baggage that goes along with the title of Dame Woolworth, and shouldering that weight is giving her a serious crick in the neck. Her work as a Haint is the one thing that makes her feel normal, but even that's more paranormal than usual.Spirits are vanishing from well-known hot spots on the ghost tour circuit, and vampires are turning up as shriveled husks. When Grier stumbles across the menace preying on Savannah's supernatural community, what she uncovers is bigger than a few flickering lampposts gone dark. It's a deadly threat unleashed by one of their own, and the cost of saving her city might be her life."}, {"id": "0886779944", "genre": "Science Fiction & Fantasy", "title": "Guardian of the Vision (Merlin's Descendants #3) (Merlin's Descendants)", "description": "Heirs to a legacy of ancient magic, the twins Griffin and Donovan Kirkwood have become embroiled in the political and religious conflicts of Elizabethan England. But there are darker forces threatening not only the Kirkwoods but the Queen as well. For a witch descended from Nimue has unleashed a terrifying force: the Demon of Chaos...Praise for the Merlin's Descendants series:An ambitious project that should have certain appeal for fans of Arthurian legend and goddess-centered magic. (Library Journal)This well-conceived and nicely written version of what might have been should please fantasy fans. (Romantic Times)A great King Arthur story! (Barnes & Noble Explorations)"}, {"id": "1973476711", "genre": "Science Fiction & Fantasy", "title": "Infinite: Island of the Immortals (special edition)", "description": "“Did you know people could fly? Well, have you ever tried?”On an enchanted tropical island Michael glimpses something unbelievable and embarks on the adventure of his life. Because Michael sees things others don’t, he’s different - but so are the Infinite.Since ancient times the Infinite secretly guided humanity from the shadows. These days it’s from an island sanctuary, through a modern global network. But they still teach their kids everything a human being is capable of - like the socially awkward Ben, who was raised in the rainforest to do the impossible. An infinite power is inside us all. If only Michael can see that what makes him different makes him special, that what some call a weakness is your strength!But even paradise is not perfect. Earth’s guardian angels have dark secrets too. When a series of terrible attacks push the world to the brink of war, Michael and his newfound friends must confront the demons that haunt the Infinite’s past. For the very soul of the Infinite is at stake and with it the future of the whole world.Can Michael hang on to his new home?Or has trying to change the world already changed the Infinite too much?Full of hilarious characters and intriguingly set in today’s world, Infinite: Island of the Immortals brings together modern fantasy, science and the silliness of growing up in this refreshingly human adventure of epic proportions."}, {"id": "1786270099", "genre": "Science Fiction & Fantasy", "title": "Action and Adventure: A Movie Top Score Game (Magma for Laurence King)", "description": "Muscle your way to the top of the pack in an all-action, all-fighting line up of the best action films ever made.Which has the craziest stunts, the most violence, and the best quotes? Jaws or Spartacus? Goldfinger or Gladiator? Kill Bill or King Kong?Battle your friends in the ultimate conflict with these 32 top score cards."}]