[{"id": "1421538180", "genre": "Children's Books", "title": "Pokémon Adventures: Diamond and Pearl/Platinum, Vol. 3 (Pokemon)", "description": "Adventures inspired by the bestselling Pokémon Platinum video games!Reads R to L (Japanese Style) for all ages! All your favorite Pokémon game characters jump out of the screen into the pages of this action-packed manga!"}, {"id": "B019CGBBE6", "genre": "Children's Books", "title": "William Shakespeare: 54 Fascinating Facts For Kids", "description": "William Shakespeare: 54 Fascinating Facts For KidsWilliam Shakespeare rose from relatively humble beginnings in the small market town of Stratford-Upon-Avon, England, to become one of the world's greatest ever playwrights.Shakespeare wrote 37 plays during his lifetime - tragedies, comedies and histories - and they are still popular with theater-goers 400 years later.Paul Tyler gives you a wide-ranging list of facts about Shakespeare, illustrating the significant accomplishments and events in his life.Going through a complete biography can often be daunting for a youngster, but Tyler illustrates Shakespeare's life in 54 easy to understand segments.We are sure that that you will be fascinated by the facts about Shakespeare in our book and that you will be motivated to find out more about this famous playwright and his remarkable plays and poetry.Chapters:* Shakespeare's Birth* Childhood and Schooling* Marriage and the 'Lost Years'* 16th Century London* Shakespeare in London* The Plays* Wealth, Fame and a New Theater* The Last Years* Assorted Shakespeare Facts* Conclusion"}, {"id": "0746026870", "genre": "Children's Books", "title": "Windows 95 for Beginners (Computer Guides Ser.))", "description": "Introduces Windows 95, provides information about the desktop, the mouse, WordPad, Paint, multitasking, files, games, Microsoft Network, multimedia, and related subjects, and describes the differences between Windows 95 and earlier versions of the operating system.Introduces Windows 95 and provides information about the desktop, files, networks, and related subjects"}, {"id": "B00IOTDDM6", "genre": "Children's Books", "title": "Bunny House (Easy Reader Crafts Book 13)", "description": "This book doesn't contain as much of a recipe, but it has a super-fun food crafting idea to make an edible \"bunny house.\" It's not actually for rabbits!! It would be fun at Easter or other occasions you might come up with, and no measuring is used, which is ideal internationally. The idea is presented in both an easy, photo-enhanced version that people learning to read or who have problems reading can follow because of related photographs and simple language, as well as a version for people who don't. In addition, Text-to-Speech is available for those units that can use it. People who are learning English or who have disabilities limiting their reading may enjoy this title, as well as young English-speaking children. These titles might also come in handy for bad weather days because I've tried to stay away from strange, expensive, or hard-to-find ingredients. For more information on new releases or freebies, join me on Facebook at https://www.facebook.com/profile.php?id=100006613178112 ."}, {"id": "0061434566", "genre": "Children's Books", "title": "Kung Fu Panda: Master of Disaster", "description": "When lazy Po attempts to master the ancient skills of kung fu, everyone wonders if the world is ready for him. With help from some new friends, Po will prove everyone wrong. But will he be able to defeat the dangerous snow leopard Tai Lung?"}]