[{"id": "B0080R7NPU", "genre": "Children's Books", "title": "When I Grow Up", "description": "Vibrant colors and fun, 3D illustrations perfectly showcase this entertaining picture book. Pictured on each page is an adorable elephant to amuse and captivate your pre-school child or young reader. You and your child will love reading and re-reading about the little elephant trying to decide what he wants to be when he grows up. This story has a great message about how fun and important learning is!This book was created in color but will display beautifully on any Kindle device.If your Kindle does not display color, or you do not own a Kindle, you can also download the Kindle App for your computer or smart phone to get the best view of these adorable, full-color pictures. You and your preschool child or young reader will love this book!"}, {"id": "B00K6K0AS6", "genre": "Children's Books", "title": "Twenty-Four Claude Monet's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Claude Monet's Paintings. Twenty-Four Claude Monet’s Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "0310712572", "genre": "Children's Books", "title": "The Berenstain Bears: Kindness Counts (Berenstain Bears/Living Lights)", "description": "Brother Bear loves everything to do with model airplanes, whether it’s building, fixing, or flying them. But when he shares one of his prized planes with a younger cub will his kindness be returned?"}, {"id": "0750011947", "genre": "Children's Books", "title": "Pb Muslim World(Religions Of World) (Religions of the World)", "description": "Part of a series where each book examines a particular religion of the world, encompassing its history, traditions, beliefs and customs, as well as its relevance in today's world. The straightforward text is designed to encourage children to discover more about the ideas and values of other faiths."}, {"id": "1575053780", "genre": "Children's Books", "title": "Nature Art With Chiura Obata (Naturalist's Apprentice Biographies)", "description": "Describes the life and work of nature artist and Japanese American Chiura Obata. Includes tips on how readers can make their own nature art."}]