[{"id": "B00BER04VI", "genre": "Science Fiction & Fantasy", "title": "There Will be Dragons (Council Wars Book 1)", "description": "\"Paradise LostIn the future there is no want, no war, no disease nor ill-timed death. The world is a paradise—and then, in a moment, it ends. The council that controls the Net falls out and goes to war. Everywhere people who have never known a moment of want or pain are left wondering how to survive.But scattered across the face of the earth are communities which have returned to the natural life of soil and small farm. In the village of Raven's Mill, Edmund Talbot, master smith and unassuming historian, finds that all the problems of the world are falling in his lap. Refugees are flooding in, bandits are roaming the woods, and his former lover and his only daughter struggle through the Fallen landscape. Enemies, new and old, gather like jackals around a wounded lion.But what the jackals do not know is that while old he may be, this lion is far from death. And hidden in the past is a mystery that has waited until this time to be revealed. You cross Edmund Talbot at your peril, for a smith is not all he once was. . . .At the publisher's request, this title is sold without DRM (Digital Rights Management).\""}, {"id": "B00HYGXQCC", "genre": "Science Fiction & Fantasy", "title": "Adventures with PET (Past Examination Technology)", "description": "The Future on Earth isn't a fun place to be after the Great Destruction of 2041. The sky glows sickly with toxins, and everyone wears thick boots against the radioactive ooze always coming out of the ground. The government still functions, but with vastly fewer citizens. Past Examination Technology (PET) is a small but important project looking for answers to heal both the Past, and their current Future. Timber is the newest Mr. M (for Muscle), as team security. He joins an educated young woman, Ms. E, and an argumentative man in his 40s who is a gifted psychic, Mr. P, to Time Travel back to the Past, pre-Destruction, and try to piece together what happened."}, {"id": "0671035789", "genre": "Science Fiction & Fantasy", "title": "The Klingon Hamlet", "description": "For too long, readers throughout the Federation have been exposed to The Tragedy of Khamlet, Son of the Emperor of Qo'nos, that classic work of Klingon™ literature, only through inadequate and misleading English translations. Now at last, thanks to the tireless efforts of the Klingon Language Institute, this powerful drama by the legendary Klingon playwright, Wil'yam Shex'pir, can be appreciated in the elegance and glory of its original tongue.  This invaluable volume contains the complete text of the play, along with an English translation for easy consultation and comparison. In addition, an incisive introduction explains the play's crucial importance in Klingon culture, while copious notes illustrate how the debased English version diverges from the original, often distorting and even reversing the actual meaning of the verses.  Khamlet, the Restored Klingon Version, is a work that belongs in the library of every human who hopes truly to understand what it means to be Klingon."}, {"id": "1424160227", "genre": "Science Fiction & Fantasy", "title": "Genesis: The Apocalypse", "description": "In a small town in Virginia, a terrible and unimaginable accident occurs at a secret government research facility. A deadly virus is released into the air upon the unsuspecting residents of the town. The residents of this typical American town are transformed into horribly disfigured flesh-eating and mindless mutants. What was once a sunny slice of southern American heaven is transformed in minutes into a dark vision of hell. When darkness falls, chaos ensues as the residents struggle with their humanity as they are being transformed into something not human…."}, {"id": "B01MZZFTYM", "genre": "Science Fiction & Fantasy", "title": "Clockwork Twist : Inquest", "description": "Twist didn't believe in dragons until he was almost eaten by one. Slaying the fire-breathing beast seemed like a good idea at the time, but now the dragon's brothers want revenge and they've charged Twist with murder.When Twist is arrested, he and his friends are taken into a world of magical creatures, normally never seen by human beings. They cross the world by submersible with a dragon captor and a djinn, ride on a flying island, visit a hidden magical city at the South Pole, and plunge into an active volcano, all while Twist struggles to prove his innocence and survive his sentence. The irreverent kitsune, Vane,  also accompanies Twist, stumbling across his own mysterious people along the way. Meanwhile, the Rooks and Cyphers battle for the last remnants of dragon technology on Earth.After generations of avoiding humanity, the dragons built a ship to take themselves away from Earth and into the stars. But navigating isn’t easy. Jonas's Sight allows him to see over vast distances, and sometimes even through time itself, glimpsing the future. The dragons thought they could use him to guide their ship through the cosmos, but Twist and his friends put a stop to that plan, slaying a few unlucky dragons along the way. Now the dragons want justice for their fallen brothers.He saved his clockwork princess from evil secret societies, he rescued his sky pirate from outer space, but now Twist has to get himself out of peril. Delve into magic and intrigue once again with Clockwork Twist!"}]