[{"id": "1482429845", "genre": "Children's Books", "title": "Motocross (Daredevil Sports)", "description": "Likely the most physically difficult motorcycle sport, motocross challenges its riders with rough terrain and high-speed competition. With events taking place on courses 1 to 3 miles long, motocross riders need to have endurance as well as the fearlessness characteristic of daredevil athletes. Readers enter the fast-paced world of motocross through accessible language and exciting information that will appeal to even reluctant readers. A colorful layout and photographs showcase on-course action, while the main content introduces the rules of the sport as well as safety. Full of high-octane fact boxes, this volume is a ride readers can enjoy without a helmet."}, {"id": "1465447199", "genre": "Children's Books", "title": "Ultimate Sticker Book: Sharks", "description": "Packed with shark activities — from creating underwater scenes to a game of spot the shark — Ultimate Sticker Book: Shark contains more than 250 reusable stickers of kids' favorite predators of the ocean. Featuring great whites, hammerheads, basking sharks, and more, fun facts are paired with bright, eye-catching stickers, encouraging children to return to this new sticker book again and again to learn even more.Taking subjects that kids love, from dinosaurs to baby animals to transportation, DK's Ultimate Sticker Book series is being refreshed and updated and now features more than 250 fun, reusable stickers. Packed with activities that allow children to create scenes, match pairs, and complete jigsaws, the activities throughout each book are simple enough for the child to do independently, but engaging enough to keep their interest and help develop dexterity, making these books products parents can trust, and ones that kids will want to keep picking up to learn more about their favorite subjects."}, {"id": "0754061361", "genre": "Children's Books", "title": "The Ghost Hunter at Chillwood Castle (Galaxy Children's Large Print)", "description": "Roddy and Tessa have managed to keep William safe from the Ghost Hunter so far, but they can't relax. Mrs Croker's smart, cunning and very evil, and and she won't rest until she's sniffed William out and bottled him."}, {"id": "1973345382", "genre": "Children's Books", "title": "Simple Fruits", "description": "Simple Fruits is a colorful children's picture book for ages 0 to 99. It has twelve original drawings of a variety of familiar fruits including an apple, banana, and pear, along with some fun facts. The pictures are simple, colorful, and perfect for young children to enjoy with a grown-up."}, {"id": "0670849324", "genre": "Children's Books", "title": "Anne Frank: Beyond the Diary - A Photographic Remembrance", "description": "Anne Frank lived a life filled with the enthusiasms and hopes shared by many young women coming into adulthood.  But the times Anne lived in and wrote of in her diary made her simple life extraordinary.  In over one hundred photographs, many which have never been published, this poignant memoir brings to life the harrowing story of one young Jewish woman's struggle to survive during a period of history which must never be forgotten. \"All libraries will want this: for classroom units studying the Holocaust, for kids reading the diary, for everyone who remembers it.\"  - Booklist"}]