[{"id": "B00E34ETCY", "genre": "Children's Books", "title": "Flying birds of prey (First animals Book 19)", "description": "In this simple ebook, babies and toddlers will be able to look at 12 flying birds of prey.Each page has a photograph of one flying bird of prey. The name of the flying bird of prey is underneath the photograph.The flying birds of prey featured are: Black Kite, Brown Goshawk, Square-tailed Kite, Brown Falcon, Black Falcon, Swamp Harrier, Wedge-tailed Eagle, Osprey, White-bellied Sea-Eagle, Black-shouldered Kite, Nankeen Kestrel and Whistling Kite.Flying birds of prey is Book 19 in the First animals series. The First animals series is ideal for babies to 3 year olds who are just discovering the wonderful animals that share our world."}, {"id": "1547109823", "genre": "Children's Books", "title": "Happy 65th Birthday: Birthday Memory Book, Birthday Journal Notebook For 65 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B00H9GUQGQ", "genre": "Children's Books", "title": "Easy Reader Biographies: Rosa Parks", "description": "Guided Reading Level J. Learn the story of Rosa Parks' famous bus ride, and the Montgomery Bus Boycott. This full-color storybook includes a timeline and a glossary!"}, {"id": "0199171335", "genre": "Children's Books", "title": "The Middle Ages: England and France Bk. 4 (History source books)", "description": "Each volume in the \"History Source Books\" series attempts to draw young students into the lives and experiences of men and women who lived in exciting periods of history. The book contains original source material such as letters, diaries, paintings and personal accounts of the period."}, {"id": "1482420783", "genre": "Children's Books", "title": "Becoming a Pro Auto Racer (Going Pro)", "description": "The fast-paced world of professional auto racing is fun and fiercely competitive. Those at the top worked long and hard to get there, perfecting their turns, tuning their cars just right, and finding lucrative sponsorships so they can enter the best races. Readers find out how many pro auto racers start out on the track through detailed main content and additional informative sidebars. Full-color photographs put readers in the drivers seat, fulfilling their wish for knowledge on how to be a pro racer and satisfying their need for speed."}]