[{"id": "0886778697", "genre": "Science Fiction & Fantasy", "title": "The Faded Sun Trilogy: Kesrith, Shon'jir, and Kutath", "description": "All three books in C.J. Cherryh's epic The Faded Sun trilogy, Kesrith, Shon'jir, and Kutath, collected in one volume.They were the mri—tall, secretive, bound by honor and the rigid dictates of their society. For aeons this golden-skinned, golden-eyed race had provided the universe mercenary soldiers of almost unimaginable ability. But now the mri have faced an enemy unlike any other—an enemy whose only way of war is widespread destruction. These \"humans\" are mass fighters, creatures of the herb, and the mri have been slaughtered like animals. Now, in the aftermath of war, the mri face extinction. It will be up to three individuals to save whatever remains of this devastated race: a warrior—one of the last survivors of his kind; a priestess of this honorable people; and a lone human—a man sworn to aid the enemy of his own kind. Can they retrace the galaxy-wide path of this nomadic race back through millennia to reclaim the ancient world that first gave them life?"}, {"id": "0441569595", "genre": "Science Fiction & Fantasy", "title": "Neuromancer", "description": "Hotwired to the leading edges of art and technology, Neuromancer is a cyberpunk, science fiction masterpiece—a classic that ranks with 1984 and Brave New World as one of the twentieth century’s most potent visions of the future.The Matrix is a world within the world, a global consensus-hallucination, the representation of every byte of data in cyberspace...Henry Dorsett Case was the sharpest data-thief in the business, until vengeful former employees crippled his nervous system. But now a new and very mysterious employer recruits him for a last-chance run. The target: an unthinkably powerful artificial intelligence orbiting Earth in service of the sinister Tessier-Ashpool business clan. With a dead man riding shotgun and Molly, mirror-eyed street-samurai, to watch his back, Case embarks on an adventure that ups the ante on an entire genre of fiction.The winner of the Hugo, Nebula, and Philip K. Dick Awards, Neuromancer was the first fully-realized glimpse of humankind’s digital future—a shocking vision that has challenged our assumptions about our technology and ourselves, reinvented the way we speak and think, and forever altered the landscape of our imaginations."}, {"id": "0993131956", "genre": "Science Fiction & Fantasy", "title": "Nemesis (The Alliance Series) (Volume 2)", "description": "Discovering she's a walking magical weapon is just the beginning of Ada's problems. Her guardian thinks she's turned traitor, and her new boss at the Inter-World Alliance has put her on goblin-catching duty. With her family's livelihoods at stake, Ada must cooperate with the Alliance despite their obvious interest in exploiting her magical talent.Kay, meanwhile, is thrown into the middle of political turmoil on a world split between humans and centaurs, as the centaur king's murder threatens to trigger a war with their magic-wielding human neighbours. To prevent a bloodbath reaching Earth's doorstep, Kay must help Markos find the real killer -- and learn more about his own unpredictable magic in the process. But doing so risks putting Ada in even more danger.Against an enemy they quite literally can't see, Ada and Kay must face up to the real, deadly potential of magic..."}, {"id": "0756404525", "genre": "Science Fiction & Fantasy", "title": "2: The Quarters Novels, Volume II: No Quarter, The Quartered Sea", "description": "The third and fourth novels in TANYA HUFF'S hugely popular Quarters series-now IN a single volume!  The next two novels from the highly popular Quarters fantasy series, No Quarter and The Quartered Sea, are now in one fantastic omnibus edition. From the twin assassins, Bannon and Vree, to the bard sent on a seemingly impossible mission, these magical characters take readers on adventures they'll never forget."}, {"id": "0380802627", "genre": "Science Fiction & Fantasy", "title": "Memoranda", "description": "Once Cley held a position of respect and fear in Master Drachton Below's cruel autocracy. As physiognomist, Cley practiced a sanctioned, twisted science that condemned men and women to death for the size of their foreheads or thrust of their chins. Yet Cley emerged from the ruins of the Well-Built City a better man, dedicated to healing the physical ills of the simpler agrarian society he has chosen to join. Below's great evil, however, has never abated-and he was not destroyed when his dark social experiment exploded. For his own senseless reasons, he has unleashed a plague of sleep upon Cley's friends and neighbors-a disease that, ironically, has felled the Master as well. And the only antidote lies in a terrible place the former physiognomist fears to enter but knows he must: in the illusory house of a madman's dreams, imagination, and remembrances; in the intricate palace of memories Drachton Below has scrupulously constructed in the Stygian depths of his mind."}]