[{"id": "0764222627", "genre": "Children's Books", "title": "Glow-In-The-Dark Fish", "description": "Sixty short devotional readings introduce the biological sciences as indications of God's creativity and are accompanied by relevant scripture verses and suggested activities."}, {"id": "0140554599", "genre": "Children's Books", "title": "Look Again!", "description": "Illustrations of a variety of wildlife habitats invite youngsters to spot the twelve essential differences between the members of each pair of illustrations and to witness the camouflage techniques that occur in nature. Reprint."}, {"id": "1590785525", "genre": "Children's Books", "title": "Ocean Liners: Crossing and Cruising the Seven Seas", "description": "Ocean liners, the biggest ships on earth, changed history. Ocean liners—majestic passenger ships—once sailed all the world's seas. The busiest route, known as the Atlantic Ferry, crossed the North Atlantic. The liners that sailed there played important roles in times of both peace and war. Ships such as England's Britannia, Holland's Statendam, and Germany's Amerika transported the rich and famous as well as millions of immigrants to North America. The Titanic, among the most famous of ocean liners, steamed into legend on the night of April 14, 1912, when it collided with an iceberg. Over time, airplanes changed the nature of travel. The last of the great ships turned to offering passengers the pleasures of cruising. Here's the fascinating story of ocean liners—their history, development, and culture—from the first great ocean liner to today's Freedom of the Seas, which carries more than four thousand passengers."}, {"id": "0824955986", "genre": "Children's Books", "title": "The Christmas House", "description": "As the music pours into the night, each passing neighbor is drawn to the house from which it comes. A knock on the door reveals the happy couple with their newborn baby enjoying the true spirit of Christmas-without the need for presents stacked under a tree. Beautifully illustrated, this charming story is sure to be a new classic. \"\"Laughter filled the house. George nodded at the dog, cradled the baby in his arms, and led the others to the piano. The guests gathered around, letting the music hold them. Soon the sounds of all their voices were riding out the window on the soft night air, spreading the joy of Christmas."}, {"id": "B00TSI2NFK", "genre": "Children's Books", "title": "51 Moral Stories (Illustrated): Folk Tales from India", "description": "The various states of India have many native folk stories which the grandparents tell the children. These folk stories borrow their themes from various Indian classic literature such as Panchatantra or Hitopdesha or even the Aesop's fables. The diverse states of India and multiple languages have added their own flavors to these stories. But one thing is sure and that is these stories have always enchanted Indian children since time immemorial. These stories are simple and the characters present a strong moral theme. These stories have always been a part of early child development and are used to reiterate moral values in children.In our attempt to bring the treasure of children's Indian literature to the world, we present here 51 of the choicest of these stories to you. The stories are short, illustrated with nice pictures and presented in the form of fables with a moral at the end."}]