[{"id": "0266864309", "genre": "Science Fiction & Fantasy", "title": "The Story of King Arthur and His Knights (Classic Reprint)", "description": "Excerpt from The Story of King Arthur and His Knights The Lady of the Lahe finds Sir Pellias wounded Sir Gawaine the Son of Lot, King of Orhney Head Piece - T he Story of Sir Gawaine. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works."}, {"id": "1479422169", "genre": "Science Fiction & Fantasy", "title": "Weirdbook #32", "description": "Here are great fantasy and horror tales by current and upcoming masters of the genre... •Childhood’s Dread, by Taye Carrol •The Other Neighbors, by Daniel Davis •Rare Air, by Mark Slade •The Children, by J.E. Álamo •The Radiant Boy, by Kevin Wetmore •The Whisperer in the Woods, by Peter Schranz •Sweet Oblivion, by Andrew Darlington •An Unsolicited Lucidity, by Lee Clark Zumpe •Black Carnival, by Bobby Cranestone •The Howard Family Tradition, by P. R. O’Leary •Hell in a Boxcar, by Scott A. Cupp •Jorogumo, by Kelda Crich •Clay Baby, by Jack Lee Taylor •The Corpse and the Rat: A Story of Friendship, by Joshua L. Hood •Getting Thin, by DJ Tyrer •Maybe Next Door, by Richard LaPore •Containment Protocol, by Leeman Kessler •Under a Rock, by Lori R. Lopez •The Children Must Be Hungry, by L.F. Falconer •The Road to Hell, by Kevin L. O’Brien •Maggot Coffee, by Roy C. Booth and Axel Kohagen •Baby Mine, by Marilyn “Mattie” Brahen •In Blackwalk Wood, by Adrian Cole •My Longing to See Tamar, by Jessica Amanda Salmonson •Gust of Wind Made by Swinging a Blade, by Molly N. Moss Poetry by: Chad Hensley, Wade German, K.A. Opperman, Ashley Dioses, Frederick J. Mayer, and Darrell Schweitzer"}, {"id": "B018WZ4W9E", "genre": "Science Fiction & Fantasy", "title": "Tiago (A Kurupira Romance Book 1)", "description": "Where would you run when there’s no place to hide?     Twenty-four hours ago, Brielle stood helpless while an intruder murdered her mother. Her struggle to stay ahead of the psychopathic stalker seeking her DNA and birthright necessitates she flee her glass and concrete jungle. Tiago, an immortal challenged with protecting the rainforest, faces a genius scientist who has created genetically specific bacteria and needs only the crystal worn by a foreigner to create hell on Earth.     Two strangers must learn to trust and work together in order to save the ones they love.     An exciting blend of action, adventure, and romance between a man not looking for love and a woman desperate to survive."}, {"id": "B0088IIGMU", "genre": "Science Fiction & Fantasy", "title": "2/4 Cavalry Book 6: Operation Morning Glory (Military Scifi)", "description": "After entering a new universe due to a malfunction in hyperspace, 2/4 Cav now part of the Royal Dutch Army, has to fight a conspiracy that possibly threatens the Thai Defense Zone. While the Thais are normally open to most religions, a conspiracy is developing to allow it to only follow one religion: Christianity. While members are of that faith, the Thai Government fears that it would break the peaceful coexistence that the planet strives to maintain, even from the Pan-Asian Federation that surrounds the world. Also any review would be greatly appreciated, it shows where I'm at and if you do review the book, read it first..."}, {"id": "149172711X", "genre": "Science Fiction & Fantasy", "title": "1: The Defenders of Prali", "description": "Life in Prali, a small village nestled in a picturesque valley in the Italian Alps, is quiet and safe—until the gates to the underworld open nearby, unleashing the fury of the last of the dragons. Generations earlier, the dragons were driven from Prali and slaughtered. Now they have returned with only one goal: revenge against humanity. A young Franciscan monk named Bernard, an English girl named Mary, and a knight named Leonardo are all that stand in the way of fiery oblivion unleashed by the invading dragon army. The underworld is a place of dark and mysterious magic, where threats far more diabolical than dragons lurk in the shadows. A powerful wizard, Simon Magnus, sees the plight of the overwhelmed heroes and offers his assistance. But his intentions are far from altruistic; after the dragons destroy the villages, Magnus plans to step in to enslave the villagers and enlists the help of winged furia, demons from the underworld, to finish off the dragons. Desperate, Bernard seeks the assistance of the French leader, Clement Laurent. Infuriated, Magnus brings in Persian mercenaries to crush the resistance. Meanwhile, news that fighters from the Vampire Empire are on the march toward Prali pushes the heroes to the breaking point. The fate of Prali rests in the outcome of an epic battle between the combined forces of good and evil. Can Bernard and his allies hope to save their village and their way of life?"}]