[{"id": "0736427805", "genre": "Children's Books", "title": "Cars 2 Big Golden Book (Disney/Pixar Cars 2)", "description": "All the world's a racetrack as superstar Lightning McQueen zooms back into action, with his best friend Mater in tow, to take on the globe's fastest and finest in Disney/Pixar's Cars 2. Children ages 3-8 will love this hardcover that retells the entire story of the new film."}, {"id": "1606931504", "genre": "Children's Books", "title": "Stories for Amanda", "description": "An old king realizes it is better to give than to receive. A family of redwood trees talks to us about their forest home. Mr. Pencil encourages a young reader to write about their parents. Tootie, a young turkey, learns the important value of friendship. And a hermit teaches us first impressions are not at all as they seem! Fifteen original tales filled with unusual characters (a talking TV or a traffic light, for example!) that will fill you with cheer and warm your heart. Grown-ups will love reading these stories as much as children will love hearing them at bedtime, story time, or anytime! ABOUT THE AUTHOR-In order to help his granddaughter pronounce the letter \"R\", William Weinbrecht started writing the story, Not a Very Bright Raccoon. To his surprise, it worked like a charm! Bill wrote more stories for his granddaughter, enjoying the smiles it brought to Amanda's face. Now at age 73, he is a retired commercial lending officer of thirty-five years. When he's not trying to keep his golf score down, Bill volunteers at a children's hospital where he amuses the kids with cartoon sketches. He and his wife, Mary, live in San Diego, California."}, {"id": "B0716GZP21", "genre": "Children's Books", "title": "Darkmouth #4: Hero Rising", "description": "“Ghostbusters meets Percy Jackson as written by Terry Pratchett.” —Kirkus Reviews“Incredible.” —Eoin Colfer, New York Times bestselling author of Artemis FowlFinn was born to stop the monsters from invading his town. But he’d really rather not. He dreams of having an ordinary life, and right now, things can’t get any worse. Legends are running riot. Half-Hunters are out of control. And Darkmouth has been taken away from him. But something even more terrifying lurks beneath the surface: an ancient horror threatening both our world and the Infested Side.So scratch that. Things can get worse. Much worse.It’s up to Finn to save Darkmouth. Too bad he’d rather be doing…anything else. Perfect for fans of How to Train Your Dragon, the final book in the Darkmouth series is a hilarious and action-packed adventure filled with beasts of the winged, fanged, and hungry variety."}, {"id": "0786850418", "genre": "Children's Books", "title": "Disney's Animation Magic: A Behind-The-Scenes Look at How an Animated Film Is Made", "description": "Discusses the techniques and people involved in creating Disney's animated films, from the first story idea to opening night"}, {"id": "1610804996", "genre": "Children's Books", "title": "From Sharks To... Swimsuits (21st Century Skills Innovation Library: Innovations from Nature)", "description": "From airplanes to football helmets, some of the greatest inventions of all time have been based on the natural abilities of plants and animals. Readers will learn how some of history's most imaginative inventors were inspired by nature and how their incredible creations continue to improve our lives today. Available in reinforced library and paperback bindings."}]