[{"id": "0152336796", "genre": "Children's Books", "title": "Heckedy Peg", "description": "In this story, seven sweet children are transformed by an evil witch into specific types of food. “The inherent drama of the story, combined with the haunting images the art provides, gives the picture book a timeless quality.”--Booklist"}, {"id": "1543501583", "genre": "Children's Books", "title": "Guinea Pigs (Our Pets)", "description": "Squeal! Guinea pigs make fun pets. Some have long hair and some have almost no hair at all. Some have crests on their heads and others have droopy ears.Young readers will learn about the appearance and behavior of guinea pigs, and discover why these playful rodents make great pets."}, {"id": "1575054876", "genre": "Children's Books", "title": "Jesse Owens (On My Own Biography)", "description": "From the time he was a young boy on a farm in Alabama until he received his fourth Olympic gold medal in Berlin in 1936, all Jesse Owens wanted to do was run. Overcoming sickness, poverty, and racial discrimination, Jesse worked hard, shattered many track and field records, and earned countless medals and trophies. But perhaps his greatest and most important accomplishment came when he stood up to the hatred of Adolf Hitler and proved that the belief in the superiority of German athletes was false. This beautifully illustrated and simply told biography tells the inspirational story of a man with strength of spirit and heart."}, {"id": "0941831892", "genre": "Children's Books", "title": "The Magical Starfruit Tree: A Chinese Folktale", "description": "An impecunious boy's act of kindness to an old beggar bears a magical tree of starfruit for all the hungry Chinese villagers, except a miserly peddler who gets his comeuppance for his past stinginess."}, {"id": "0688167284", "genre": "Children's Books", "title": "Young Jesus of Nazareth", "description": "During the early years of Christianity, tales of Jesus' youth flourished--from his childhood play and schooling to his early ability to heal the sick. Today, these wonderful stories are largely unknown. With this lush book, which begins with the nativity and ends with Jesus' earliest teachings, Marianna Mayer splendidly revives many of them. Illustrated with the works of such masters as Caravaggio and da Vinci, here is a stunning portrait of a boy at once ordinary and extraordinary, human and divine."}]