[{"id": "B077ZTVWF1", "genre": "Children's Books", "title": "Nathan's Dog: (Picture Book for Children) (Beginner Reads 1)", "description": "Nathan is a kid that likes to have fun with his dog. They share moments and they enjoy each other's company. Nothing will ever change the love between two best friends. Beginner Reads: Nathan's Dog is a story your child will love and enjoy. -Fully illustrated picture book-Excellent as a bedtime story-Great for toddlers, preschool, and younger childrenScroll to the top of the page and select the buy button right now."}, {"id": "1410917088", "genre": "Children's Books", "title": "0: Incredible Arachnids (Incredible Creatures)", "description": "What spider is the most poisonous in the world?  Find out in this unprecedented exploration of the incredible creatures in the world around us.  Each title focuses on weird and wonderful examples of creatures that are not the norm after an introduction describing the animal's normal characteristics.  A conservation angle is also included to demonstrate how animals are in danger from humans and our activities and to stress what needs to be done to protect them and their environments."}, {"id": "B00ESEE5MS", "genre": "Children's Books", "title": "Coldfinger (Zinc Alloy)", "description": "It's winter vacation, and Zack Allen's family is headed to the mountains. When Zack arrives, Johnny, the school's biggest bully, tricks him into entering the annual ski competition. While on the slopes, however, Zack discovers an even greater problem, an evil villain is building a giant freeze ray within the mountain. Now Zinc must stop his evil plans and take home the ski trophy."}, {"id": "0753473836", "genre": "Children's Books", "title": "Life Cycles: Polar Lands", "description": "Discover which creatures are at the top and bottom of three polar food chains, and learn what happens at each stage of their life cycle. At the end of each spread, use the picture clue to guess which polar predator is waiting to pounce! Explore the Arctic and Antarctica to find out which creatures live there. . . and which will make a tasty snack!Each book in this essential series reveals the life cycles of eleven fascinating living things in a particular habitat. The life cycles link together to create three food chains. At the end of the book is a simple overview of how the three food chains interact to create a food web. With clear text and punchy photographs, this is a captivating introduction to habitats and ecosystems."}, {"id": "B01IPSETSC", "genre": "Children's Books", "title": "How Transistors Work (Connect with Electricity)", "description": "Did you know that electric current can be controlled? Have you ever wondered how that might be done? Transistors can act as amplifiers, taking in a small current and sending out a larger one, or as switches, turning electric current on and off. But how do these different transistors work? How are they used in our electronic devices? Discover the history of how transistors were developed, explore how different types of transistors can play different roles in electronics, and learn where transistors may be taking technology in the future!"}]