[{"id": "B006G8HXJQ", "genre": "Children's Books", "title": "The Thingamabob", "description": "One day, he found the thingamabob.He had no idea what it was or where it came from. . . .So begins the story of a curious elephant and a mysterious red object. But what is it?! When none of his friends can tell him, the little elephant decides to experiment. He thinks: Maybe I can fly with it? (Maybe not.) Maybe I can sail in it? (Maybe not.) Maybe I can hide behind it? (Maybe not.) Nothing seems to work, until big drops of rain begin to fall. The little elephant does not want to get wet. Luckily, with the thingamabob (an umbrella), he does not need to get wet!With bright, adorable illustrations and a simple, playful text, Il Sung Na captures the excitement of making—and sharing—an unexpected discovery.From the Hardcover edition."}, {"id": "1681522217", "genre": "Children's Books", "title": "Skunks (Spot)", "description": "Introducing emergent readers to vocabulary has never been so fun! This series includes a search-and-find feature that's perfect for engaging even the youngest readers. From geckos to owls, Backyard Animals utilizes captivating photos to teach kindergarteners new words and simple facts about animal habitats, body parts, and behaviors. This search-and-find book invites emergent readers to look for new vocabulary words and pictures while giving simple facts about a skunk's habitat, body parts, and behaviors."}, {"id": "B00Q8U5H6S", "genre": "Children's Books", "title": "Creeper Revenge:  Steve vs. Creeper: The Unofficial Minecraft Novel (Minecraft Steve's Adventures Book 1)", "description": "Creeper RevengeSteve vs. CreeperThe first few explosions had been loud, but the last, the one that knocked him through the air to his current location, had been deafening. He began to pick his way over the crater, gathering what useful materials remained of his home. He mused that he would need something sturdier if he was to survive the next night.  Steve was on his journey to seek his revenge, but it's not as easy as he thought... Find out more the \"revenge quest\"Get your Copy for FREE with Kindle Unlimited!Please note that we are not associated or affiliated with Minecraft/Mojang AB "}, {"id": "0762782625", "genre": "Children's Books", "title": "Acadia National Park: Eye of the Whale (Adventures with the Parkers)", "description": "In this latest installment of FalconGuide's Adventures with the Parkers series, the Parkers, an intrepid family of four, journey to Acadia National Park in Maine where they explore the beautiful coastal waters and hike many of the park's finest trails, including to the top of Cadillac Mountain, the first place in the U.S. to see the sun rise every morning. They decide to end their trip by camping on an island within the national park, but when Mom tries to kayak back to the mainland, she gets beached on a remote island--and quickly discovers she is not the only one stranded there!Each book in the exciting Adventures with the Parkers series for kids 8–13 explores a popular national park and is packed with adventure as well as engaging and educational facts about nature, outdoor safety, and much more. Vacation has never been this fun!"}, {"id": "1848793537", "genre": "Children's Books", "title": "Diggers (Busy Baby)", "description": "New tabbed books to introduce children to favorite mega-machines.Busy Baby presents a new series of tabbedboard books designed to fuel children's obsession with things that go!  Each book contains bright and colorfulphotography combined with clear text to help children identify eachmega-machine! Little ones will also love using the finger tabs todecide which vehicle they want to look at!"}]