[{"id": "B00XQ8F1MU", "genre": "Children's Books", "title": "The Beetle and the Berry", "description": "This story was originally published in \"Ladybug\" and is based on a true event witnessed in nature. Now with all-new illustrations.One day, tiny Arthur the Beetle finds a large, juicy berry, big enough to feed him for a week. Excited by his discovery, he begins pushing it home, planning how much he is going to like eating the berry. Then suddenly, his berry gets stuck, and Arthur the Beetle has to figure out how to free it. Sometimes approaching a problem straight ahead just will not work. There are times when a problem can only be resolved by backing off, and approaching it from a new direction. This is a difficult life lesson for most children to learn, but \"The Beetle and the Berry\" makes this concept easy for children to understand. Appropriate for ages 3-6. (Cindy Penn contributed to this description.)Children will root for the tiny beetle, and, without knowing it, will be learning problem-solving and critical thinking skills.Written by the author of the three-volume series, \"How to Write a Children's Picture Book.\" Click \"Buy now with 1-Click\" or \"Read for Free with Kindle Unlimited.\""}, {"id": "163472691X", "genre": "Children's Books", "title": "Taking Toys Apart (21st Century Skills Innovation Library: Makers As Innovators Junior)", "description": "Have you ever wondered what's inside of your favorite electronic toys? Through simple text written to foster creativity and problem solving, students will the art of innovation. Large, colorful images show students how to complete activities. Additional tools, including a glossary and an index, help students learn new vocabulary and locate information."}, {"id": "1841461377", "genre": "Children's Books", "title": "KS3 English SATS: Practice Papers (Levels 4-7) (Bookshop) Pt. 1 & 2", "description": "Offers three full sets of papers, all in the format like the SATs. This work also contains a set of answers, useful for home practice during the run-up to the exam period."}, {"id": "B01N0P1Q70", "genre": "Children's Books", "title": "Collapse and Chaos (Tangled History)", "description": "In an immersive, exciting narrative nonfiction format, this powerful book follows a selection of people who experienced the 2010 Haiti Earthquake."}, {"id": "0822505487", "genre": "Children's Books", "title": "Grace Kelly: American Princess (ACHIEVERS)", "description": "Photographs from Monaco's royal family's personal collection accompany an account of Grace Kelly's career as a film actress and her activities as Princess of Monaco."}]