[{"id": "B01CX7EGDY", "genre": "Science Fiction & Fantasy", "title": "The Keeper (The Maze Series Book 1)", "description": "A thirst for adventure. A magical maze in search of a keeper. Destiny awaits.Gabriel's lust for adventure leads him to the Maine wilderness where he enters an ancient maze and is transported to another world. His sidekick? The nagging voice inside his head. What could possibly go wrong?As if escaping an arranged marriage and Jaguar warriors bent on making him a sacrificial lamb weren't enough excitement, Gabriel's tour guide seems to enjoy killing whenever the opportunity arises. Will Gabriel be his next victim?"}, {"id": "0316440868", "genre": "Science Fiction & Fantasy", "title": "Jade City (The Green Bone Saga)", "description": "Award-winning author Fonda Lee explodes onto the adult fantasy scene with Jade City, an epic saga reminiscent of The Godfather with magic and kungfu, set in an Asia-inspired fantasy metropolis.FAMILY IS DUTY. MAGIC IS POWER. HONOR IS EVERYTHING.Jade is the lifeblood of the island of Kekon. It has been mined, traded, stolen, and killed for -- and for centuries, honorable Green Bone warriors like the Kaul family have used it to enhance their magical abilities and defend the island from foreign invasion.Now, the war is over and a new generation of Kauls vies for control of Kekon's bustling capital city. They care about nothing but protecting their own, cornering the jade market, and defending the districts under their protection. Ancient tradition has little place in this rapidly changing nation.When a powerful new drug emerges that lets anyone -- even foreigners -- wield jade, the simmering tension between the Kauls and the rival Ayt family erupts into open violence. The outcome of this clan war will determine the fate of all Green Bones -- from their grandest patriarch to the lowliest motorcycle runner on the streets -- and of Kekon itself.Jade City begins an epic tale of family, honor, and those who live and die by the ancient laws of jade and blood."}, {"id": "1438971974", "genre": "Science Fiction & Fantasy", "title": "The Essence of Daedalus Rimes: The Journey Begins", "description": "The Daedalus Rimes Saga is the back story of Earth's first contact with extraterrestrials. This means the story you, I and the general public would normally never hear. The first book in the trilogy is how the story slips out.   A group of humans is abducted and wake up aboard an alien spaceship. Dade Rimes manages to get free, and with the help of another man they seize control of the ship. Unfortunately in doing so they kill the crew.   In their attempts to fly and navigate the craft, they draw attention to themselves by another group of aliens who are at war with the first group. The humans come under attack and are quickly disabled and boarded.   The new group of aliens, distinctly different from the first, board the ship expecting to find their enemy. Instead, they find humans. What this represents to them is that their enemy has found a resource planet; an oasis in the desert of space they must deny their enemy if they hope to win the war.   Among their species, these aliens have the ability to transfer memories from one individual to another. In an experiment intended to facilitate communication with the humans they attempt to transfer the memories from a dying human; Dade Rimes, to one of their conscripts named Teela.   The experiment is successful, perhaps too successful. Teela receives more than just Dade's memories, she also receives his soul, or essence as well.    Teela is now conflicted. On one hand she wants to help her people find and destroy Earth, on the other hand there is now a part of her that claims to have a better idea."}, {"id": "1545516669", "genre": "Science Fiction & Fantasy", "title": "Nevaeh 32: Naddalin the wizard girl and the Express (Volume 32)", "description": "Nevaeh 32 Wizard girl- She- Naddalin- learns that like her mother and father, she too is a wizard, and was the chosen one. Upon arriving at the school. She is sorted into her place, like the other girls, she is the one out. These are where she well learns what it means to be a wizard and to fall in love. Think about the express- The train pulls away. As I then sit down in a seat where, I have a good vantage point of the cars. The doors close, and I hear the whistle far down the line I knew I was going far from home. I look out the window. ‘This is your conductor speaking, I'd like to welcome you aboard…’"}, {"id": "B017WISXO2", "genre": "Science Fiction & Fantasy", "title": "You Are Dead. (Sign Here Please)", "description": "You Are Dead. (Sign Here Please) is a madcap comedy of truly ludicrous proportions. After Nathan Haynes dies, he discovers that the afterlife is run by straight-laced bureaucrats, but when he refuses to sign his 21B he is punted back to life in his insane home city of Dead Donkey. He can't rest easy, though - the bureaucrats are out to get him and they will put his papers in order, no matter the cost. Will our hero die (again)? Will the bureaucrats trick him into filling the proper forms in? Will Nathan ever get to do his laundry? Find out in You Are Dead. (Sign Here Please)!"}]