[{"id": "075003064X", "genre": "Children's Books", "title": "An Egyptian Mummy (You Wouldn't Want to be)", "description": "Get ready...As a wealthy ancient Egyptian you are about to drop dead! To enter the afterlife you body must go through extraordinary processes to become a Mummy. How is a Mummy's brain pulled out through it's nose? What are a Mummy's false eyes made from? What is a body stuffed with to make a realistic looking Mummy?"}, {"id": "1422213900", "genre": "Children's Books", "title": "United Arab Emirates (Major Muslim Nations)", "description": "Updated and revised titles that combine the Modern Middle East series and Growth and Influence of Islam in the Nations of Asia and Central Asia."}, {"id": "1502630680", "genre": "Children's Books", "title": "Standing in the FBI Director's Shoes (My Government)", "description": "The Federal Bureau of Investigation is essential to the national security of the United States. This revealing volume sheds light on how the president selects the head of this critical organization and what the FBI Director's job entails. The book also includes information about how the FBI conducts investigations and how the bureau works to keep Americans safe."}, {"id": "1477700722", "genre": "Children's Books", "title": "John Cabot (Jr. Graphic Famous Explorers)", "description": "John Cabot, an Italian navigator who sailed for Britain, was the first European to set foot on North America since the Vikings. Readers will follow Cabot on his explorations to Newfoundland and back, until he puzzlingly doesn’t return from his third voyage. Fun and vibrant graphic representations of this famous explorer will spark the interest of all readers."}, {"id": "B00IZMHDGE", "genre": "Children's Books", "title": "15 Minute Reads: Fun Facts About the Moon", "description": "15 Minute Reads are designed to help children do a little bit reading everyday.Learn a little bit about the Earth's Moon as you explore some fun facts about it. How was the Moon created? There are several theories. How many people have been to the Moon? Not that many. Why does the Moon change every day? These questions and others are answered within."}]