[{"id": "1426314027", "genre": "Children's Books", "title": "National Geographic Kids: Animal Creativity Book: Cut-outs, Games, Stencils, Stickers (Activity Books)", "description": "National Geographic Kids is renowned for photos, facts, fun, and sparking the imagination and creativity of every young reader. Who better then to produce a craft book on animals around the world that engages readers and makes them part of the creative experience with a host of games, activities, trivia, and crafts?This book brings all the expertise of the National Geographic Society into the craft book market. The Animal Creativity Book is the perfect gift for any parent wanting to foster creativity and imagination, all the while educating their kids with fascinating information from the world's leading source of animal facts and fun. The book is chock-full of stencils, stickers, pull-outs, games, trivia, puzzles, and cut-outs for animal lovers to enjoy. A combination of fun and funky design, combined with National Geographic's world-famous photography, this interactive book is a sure hit."}, {"id": "1442430540", "genre": "Children's Books", "title": "The Sandman and the War of Dreams (The Guardians)", "description": "In their fourth chapter book adventure, the Guardians recruit Sanderson ManSnoozy, the sleepy legend also known as the Sandman, to their cause.When the Man in the Moon brought together the Guardians, he warned them that they would face some terrible evils as they strove to protect the children of earth. But nothing could have prepared them for this: Pitch has disappeared and taken Katherine with him. And now the Guardians are not only down one member, but a young girl is missing. Fortunately, MiM knows just the man to join the team. Sanderson ManSnoozy—known in most circles as the Sandman—may be sleepy, but he’s also stalwart and clever and has a precocious ability to utilize sand in myriad ways. If the other Guardians can just convince Sandy that good can triumph evil, that good dreams can banish nightmares, they’ll have themselves quite a squad. But if they can’t…they might never see Katherine again."}, {"id": "1942875517", "genre": "Children's Books", "title": "1: The Presidential Masters of Prehistory: Discover America's Prehistoric Forefathers (Jurassic Classics)", "description": "Famous US Presidents are given dinosaur-inspired pseudonyms and prehistoric biographies as a way of introducing young readers to US history in a fun and inviting new way in Jurassic Classics The Presidential Masters of Prehistory Volume 1. The book features an assortment of presidential biographies, each with a prehistoric twist. George Washingdonyx, Thomas Jeffersaurus, and Andrew Jaxceratops get \"dino\" histories, with a clever parody of each president's most famous contributions to our nation's history. Accurate biographies of the real-life presidents are included, as well. Endearing illustrations and humorous dinosaur mashups provide young readers with a foundation for history, as well as inspiring them to learn more."}, {"id": "0823418650", "genre": "Children's Books", "title": "Pizza For The Queen", "description": "When Queen Margherita makes a special request after tasting one of his famous pizzas, Raffaele of Napoli beams with pride and goes all about town to get just the right ingredients, but when a sneaky cat with a taste for anchovies puts an unexpected twist in his plans, Raffaele must think quickly in order to make an entirely new creation that will be just as good."}, {"id": "1619639173", "genre": "Children's Books", "title": "Alfred Kropp: The Seal of Solomon", "description": "Before The 5th Wave, there was Alfred Kropp. This second book in Rick Yancey's lauded series was called a \"rip-roaring story that teens will love\" in School Library Journal's starred review. Now the books feature a bold and exciting new look for the next generation of readers to fall in love with.Things have just settled down for Alfred, when he's suddenly kidnapped and forced to face a terrible threat--the Seal of Solomon. For millennia, the fallen angels of heaven were controlled by the ring. Now the ring has been stolen, and if it's not recovered, all hell will break loose . . .Packed with thrills and laughs on every page, the second book in New York Times bestselling author Rick Yancey's series proves once again that heroes can come from anywhere, and anyone. Perfect for fans of James Patterson!Praise for The Extraordinary Adventures of Alfred Kropp:A Publishers Weekly Best Children's Book of the YearCarnegie Medal nomineeBook Sense Children's Pick"}]