[{"id": "B0768K5JXG", "genre": "Children's Books", "title": "Fidel Castro and His Communist Marxist Government - Biography 5th Grade | Children's Biography Books", "description": "What good will reading about Fidel Castro and his Communist Marxist Government do? It will create a solid foundation that will help in the deep understanding of Fidel’s government. The purpose of biography stories is to learn from decisions made in the past, especially if those decisions changed the course of history. Grab a copy today!"}, {"id": "0984615105", "genre": "Children's Books", "title": "The Fisherman's Cat", "description": "Jake is a cat who lives in Gloucester, Massachusetts with his fisherman owner, Captain John Blackwell. When it is discovered that Jake has a unique talent for finding fish, he becomes very popular with the crew and enjoys all the attention and pampering he receives. A group of alley cats take notice of Jake's privileged life and think he is showing off to make them jealous. Jake ignores them, but, when a terrible storm interrupts a fishing journey, the fisherman's cat finds himself alone at sea and must win the hearts of The Rudder Alley Cats to survive."}, {"id": "184780862X", "genre": "Children's Books", "title": "The 50 States: Activity Book: Maps of the 50 States of the USA", "description": "Pack your bags and take the journey of a lifetime with this fun-filled activity book packed with maps, wildlife, people and places unique to America’s 50 states. In this summer companion to the popular smash-hit The 50 States, you can enjoy state trivia, picture scrambles, dot-to-dots, plus a double-sided fold-out map and more than 50 stickers included in this activity book like no other! Perfect for any long journeys – whether you're travelling the 50 states or not!"}, {"id": "1420500481", "genre": "Children's Books", "title": "Death Penalty (Hot Topics)", "description": "Each title in this series presents a thorough and carefully balanced presentation of the many issues surrounding each topic, objectively exploring important political, social, cultural, economic, moral, historical, and environmental issues, and enabling students to gain a clear understanding of what affects them, their peers, and their community."}, {"id": "B077RTPFH8", "genre": "Children's Books", "title": "Baby Adventurer: A light-hearted rhyming adventure book for Kids 2-6, adorable illustrations (perfect for bedtime and early reading) (The Gift of New Day Series 1)", "description": "Bonus - includes FREE coloring book inside!Book Description:Experience the gift of new day as Baby Adventurer explores the world around her. Baby is determined to tackle new experiences, even when faced with a setback. This is one baby who knows how to seek adventure in her not-so-ordinary day.You and your kids will fall in love with the adorable illustrations as well as the light-hearted, poetic rhythm of the book that makes it fun to read for children, parents and grandparents alike.Be encouraged by Baby Adventurer’s determination, and take heart in the special gift she finds at the end of a playful day.Buy NOW and receive the “Baby Adventurer” coloring book for FREE!! (details inside book!)"}]