[{"id": "1772753521", "genre": "Children's Books", "title": "Disney Beauty and the Beast Cinestory Comic: Collector's Edition", "description": "Be our guest and join the bright, independent Belle in an unforgettable tale of love and adventure.  On her journey of self discovery, Belle sacrifices her freedom to save her father and finds herself in the castle of a prince who's been turned into a mysterious beast. Secluded in the castle, Belle befriends the enchanted staff and ultimately the Beast as well, and learns that true beauty comes from deep within.  Experience the timeless Disney classic in a whole new way with this gorgeous graphic novel companion to the film. Featuring over a thousand frames from the movie and lyrics from all the iconic songs, the Disney Beauty and the Beast Cinestory Comic will transport you to Belle's captivating world."}, {"id": "0606144625", "genre": "Children's Books", "title": "Leader Of The Pack (Turtleback School & Library Binding Edition) (Martha Speaks (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. After being excluded from Helen's family-tree school project because she isn't a human family member, Martha decides to get in touch with her own roots. What better way to do that than to live in the wild like her wolf ancestors?"}, {"id": "1492659592", "genre": "Children's Books", "title": "Tiny the Pittsburgh Easter Bunny", "description": "It's Easter morning in Pittsburgh,and Tiny is out for a jog,but he STOPS in his tracks and discoversthe Easter Bunny STUCK in a log!With the Easter Bunny trapped, it's up to Tiny to save Easter in Pittsburgh! But being a bunny isn't as easy as it looks, especially for an elephant. In this fun and playful story, find out how Tiny uses his own special talents to save Easter!"}, {"id": "1536200638", "genre": "Children's Books", "title": "Birds of a Color", "description": "Brightly hued secrets burst forth from a flock of black-and-white birds in this lift-the-flap look at colors.Birds with black-and-white plumage fill the pages of this interactive board book, but a closer look reveals splashes of color just waiting to be discovered. Each clever spread holds a vivid surprise, helping little ones learn their colors in style."}, {"id": "1974649911", "genre": "Children's Books", "title": "Farmer's Journal: Farmers Notebook (Farming Books For Children)(V6)", "description": "Capture Your Farming Memories Keepsake JournalFarmers have the best stories to tell and this farmer’s notebook is the perfect place to capture them. At 6x9 and 108 lined pages it fits nicely on the back of the toilet beside the latest equipment magazine.Makes the perfect farmers gift for kids who love farming and the adults who raise them. Just imagine reading all the stories Grandpa used to tell when you can no longer see him.We have made the interior prompt free so you can write what you want where you want.Start recording those farming memoirs today and pass on your awesome wisdom and advice for generations to come.Whether you raise chickens, cows, pigs, goats or grain you will never forget the important dates and details with your new farmer’s journal.Scroll and grab a gift for the farmer you love today."}]