[{"id": "1599615967", "genre": "Children's Books", "title": "The Man in the Iron Mask 3", "description": "Retells, in comic book format, Alexandre Dumas' tale of political intrigue, romance, and adventure in seventeenth-century France."}, {"id": "1897206062", "genre": "Children's Books", "title": "Hockey Alphabet Book (iThink)", "description": "Learn the alphabet and have fun with pictures of this popular winter sport! More than just the letters of the alphabet, these books contain fascinating tidbits in full color with illustrations and photos. Not only will these books teach children about hockey while they learn their letters, but parents may learn a thing or two as well! \"H\" is for Hockey--Canada's favorite game.\"I\" is for Ice--we skate on it to play hockey.\"R\" is for Referee--he blows the whistle to signal a penalty.\"Z\" is for Zamboni--the big machine that goes round and round and cleans the ice."}, {"id": "1426327110", "genre": "Children's Books", "title": "100 Things to Be When You Grow Up", "description": "Who says adults can't have fun? This book explores 100 of the coolest, wackiest, and most amazing jobs and careers out there, from astronaut to zookeeper, ice cream taster to game maker.    Jam-packed with inspiration, hands-on projects, advice from National Geographic explorers, interviews with experts, weird-but-true facts, and more, this new book in the popular \"100 Things\" series is a great way to get kids thinking creatively about career paths and excited about their futures!"}, {"id": "1417733799", "genre": "Children's Books", "title": "Betsy and the Emperor", "description": "When Napoleon Bonaparte is defeated at the Battle of Waterloo in 1815, and exiled on the forbidding island of St Helena, he is overseen by the English Balcombe family. 14-year-old Betsy Balcombe is terrified of the famous man, but she is also intrigued. As she gets to know him, she sees a different side of the infamous Emperor - a softer side that few people are allowed to witness - and plots to help him escape his captivity. The plan falls apart, but Betsy and the Emperor form a fascinating and intimate relationship as a result."}, {"id": "0064461149", "genre": "Children's Books", "title": "Tinker Vs Des Moines: Student Rights on Trial (Be the Judge-Be the Jury)", "description": "Recreates the trial of John Tinker and two other students who were suspended from school for protesting the Vietnam War, and invites the reader to act as judge and jury"}]