[{"id": "1902197011", "genre": "Science Fiction & Fantasy", "title": "Lovely Biscuits", "description": "Four short stories and two plays exploring the darker side of the human imagination, laying bare the atavistic impulses that motivate social institutions and relationships. Beneath the dark fantasy is a razor sharp critique of western society and Britain in particular. This now legendary book is difficult to find these days."}, {"id": "1934857971", "genre": "Science Fiction & Fantasy", "title": "Battletech Time of War Companion", "description": "The A Time of War Companion is an advanced rules expansion for A Time of War: The BattleTech RPG. It offers several rules expansions designed specifically to enhance the basic game play experience of A Time of War campaigns, while retaining compatibility with the rest of the core rules line."}, {"id": "1906103100", "genre": "Science Fiction & Fantasy", "title": "RuneQuest: Deluxe Core Rules Compilation", "description": "RuneQuest Deluxe combines all three core RuneQuest rulebook in one handy voume, providing Games Masters and players alike with all the most up-to-date RuneQuest rules. Included within is all the information from core RuneQuest, the RuneQuest Companion and RuneQuest Monsters, re-edited and compiled into a single tome. With the help of this book, players will have all they need to embark on adventures, while Games Masters will be able to use the rules and monsters included in this book to create epic adventure. There are many other RuneQuest books available but RuneQuest Deluxe contains everything one truly needs to play the game!."}, {"id": "B078F69W7W", "genre": "Science Fiction & Fantasy", "title": "Three Days and Two Knights: An Amusing Arthurian Adventure", "description": "Sir Alanbart avoids action, recoils from romance, and shuns self-sacrifice; yet when he finds himself drawn into a harebrained attempt to rescue King Arthur, he becomes a victim of all three, and then poor Alanbart must fight hard to stay true to his cowardly and indolent nature. \nThree Days and Two Knights is a genre crossover that blends fantasy adventure, comedy, and romance in a historical literary setting. \n\"Few tales tell of heroes and dragons, knights and giants, magic, miracles, love, a banshee and the undead....\" So begins Aelfric the Entertainer, this tale's invasive, witty and often philosophical narrator. Set on the moors of Scotland in the waning months of Arthur's rule, Three Days and Two Knights tells how Sir Alanbart, an impoverished and spineless knight; Heather, an indomitable and irresistible serving maid; Scot, a pagan swordsman of questionable intelligence and sexuality, and Sir Gawain, the legendary romantic hero, form an unlikely alliance to free King Arthur from prison. The catch? They have just three days before the blue moon rises, at which time the red wizard Rabordath will use Arthur's blood to conjure a dragon that will end a kingdom and set all of Britain aflame. \nThree Days and Two Knights features characters, settings, artifacts and events drawn from medieval myth and history, and will appeal to anyone who loves the middle ages, knights, monsters, magic, or King Arthur, especially those who grew up with The Hobbit, Percy Jackson, and Cressida Cowell's How to Train Your Dragon series. \n"}, {"id": "1933618698", "genre": "Science Fiction & Fantasy", "title": "Edgar Allan Poe: Masters of the Weird Tale", "description": "Perhaps the finest, certainly one of the earliest, writers of classic weird tales, Edgar Allan Poe is sometimes overshadowed by twentieth-century practitioners. Nevertheless, his handling of psychological depth is unmatched in the field.This major collection features all of Poe's horror, detective, and science fiction, and includes the complete Poe illustrations of Harry Clarke, Fritz Eichenberg, Gahan Wilson, and Arthur Rackham, among others, including some new and fine color paintings by Swiss artist Gwabryel. Bound in three-piece cloth with ribbon marker, translucent overlays, and enclosed in a cloth slipcase. The introduction is by Poe scholar Mark Samuels."}]