[{"id": "B00C1JV1Z6", "genre": "Children's Books", "title": "10 Little Mermaids", "description": "Learn to count.  10 Little Mermaids is a delightful picture book written in rhyme or song.  The illustrations were drawn by Ella Quarry who was 8 years old at the time of publication."}, {"id": "1510730095", "genre": "Children's Books", "title": "Cinnamon Bun Besties: A Swirl Novel", "description": "It's bestie vs. bestie… Suki is assigned to run the student council Valentine's Day fundraiser at school with JJ: her former bestie turned worst enemy. He and Suki have been ultra-competitive about everything for years―there's no way they can work together. In fact, they almost immediately resolve to hold competing fundraisers. Meanwhile, Suki longs for a dog, but her parents won't let her get one. Befriending a stray at the park (who she names Cinnamon Bun) leads her to volunteer at the local animal shelter, which becomes her new home away from home. But then the fundraiser gets out of control, and the shelter might close. Suki is determined to save the day, but she can’t do it alone… and will she ever get a dog of her own?"}, {"id": "080273832X", "genre": "Children's Books", "title": "Bear's Big Day", "description": "It's Bear's very first day of school! He wants to be grown up, so he leaves his stuffed bunny Floppy at home along with all his familiar things. But being away from his best friend is hard--and the first day doesn't turn out quite how like Bear wanted it to. Bear learns that the first day of school might not always be perfect, and being grown up doesn't have to mean giving up the things he loves.This third book in the Bear and Bunny series from beloved, bestselling author-illustrator Salina Yoon tackles big themes like starting school and being independent, even in scary new situations.Awards for Salina YoonA Bank Street Best Children's Book of the Year (Stormy Night)An NPR Best Book (Found)Winner of the 2014 SCIBA Book Award for Best Picture Book (Found)A Winter 2015-2016 Kids' Indie Next Pick (Be a Friend)A Scholastic Teachers Top 10 Picture Book (Penguin's Big Adventure)"}, {"id": "1404251812", "genre": "Children's Books", "title": "Cleopatra: The Life of an Egyptian Queen (Graphic Nonfiction Biographies)", "description": "Presented in a lively, full-color graphic-novel style, history comes alive in this groundbreaking curriculum-based series, developed with special consideration for the high-low reader. From the content areas of American history, European history, and ancient history, readers will marvel at the conflicts, triumphs, struggles, and accomplishments of these key historical figures. Each title in the series includes historical background text, maps, primary source images, a glossary, additional resources, and an index. These titles are sure to be received warmly by students, teachers, and librarians alike. Queen of Egypt, companion of Julius Caesar, and wife of Mark Antony, Cleopatra lived one of history's most fabled lives. Renowned for her great beauty and intelligence, Cleopatra was a strong ruler determined to restore the glory of Ptolemaic rule to Egypt by using her relationships with Caesar and Antony to achieve her goals. Fascinated readers will learn why the events of her life--including her tragic suicide--have inspired writers and artists for centuries."}, {"id": "0531153045", "genre": "Children's Books", "title": "How Would You Survive As an Aztec?", "description": "Describes Aztec home life, families, farming, meals, work, clothing, trade, festivals, government, wars, health, and beliefs."}]