[{"id": "191128715X", "genre": "Children's Books", "title": "The Official Tottenham Hotspur Annual 2017", "description": "The Official Tottenham Hotspur Annual 2017 is a must for all Tottenham Hotspur supporters. This action-packed Annual features pictures, games and quizzes for everyone to enjoy. With profiles of all your favourite players, there's everything you need to know about your favourite Club."}, {"id": "B00HNXC258", "genre": "Children's Books", "title": "#11 Sherlock Holmes and the Adventure of Black Peter (On the Case with Holmes and Watson)", "description": "Who killed Captain Peter Carey? Everyone knows that Captain Carey, nicknamed Black Peter, was a nasty, cruel character. But who would murder him and why? Can Holmes, Watson, and Inspector Lestrade find the brutal killer before it's too late?"}, {"id": "1316637743", "genre": "Children's Books", "title": "Chemistry for the IB Diploma Coursebook with Cambridge Elevate Enhanced Edition (2 Years)", "description": "Chemistry for the IB Diploma, Second edition, covers in full the requirements of the IB syllabus for Chemistry for first examination in 2016.  Chemistry for the IB Diploma with Cambridge Elevate enhanced edition delivers complete coverage of the syllabus, with links to Theory of Knowledge, International-mindedness and Nature of Science themes. This Cambridge Elevate enhanced edition of the coursebook provides a wealth of learning opportunities through auto-marked formative assessment quizzes with tailored feedback, carefully selected animated videos to visualise challenging concepts, exam-style questions and more."}, {"id": "1618930435", "genre": "Children's Books", "title": "Big Book of WHEN (A TIME for Kids Book) (TIME for Kids Big Books)", "description": "If you were asked to come up with a list of the most important events, inventions, people, or discoveries in the past 100 or 1,000 years, what would you choose?TIME FOR KIDS new Big Book of When, the newest release from the hugely successful Big Book Series, is a riveting new resource for younger curious readers. This engaging and instructive book presents kids with answers to the kinds of intriguing questions that appeal to their sense of curiosity about when the most important events in history happened. Colorful graphs, spectacular photos, and clear, engaging timelines help answer a myriad of questions.TIME FOR KIDS Big Book of When is a must have book to satisfy the most curious kids. It will have readers of all ages thumbing through its pages again and again."}, {"id": "0385750579", "genre": "Children's Books", "title": "Bing: Make Music (Bing Bunny)", "description": "In Bing: Make Music, Bing and Flop use everyday items, like keys and a tub of rice, as well as instruments to make music. But don’t bang on the music box, Bing! Don’t worry, we can fix it. Making music, it’s a Bing thing!"}]