[{"id": "0062404520", "genre": "Children's Books", "title": "Pete the Cat Phonics Box: Includes 12 Mini-Books Featuring Short and Long Vowel Sounds (My First I Can Read)", "description": "New York Times bestselling author and artist James Dean’s Pete the Cat helps kids learn to read with phonics. Who knew reading could be so groovy! Reviewed by a phonics expert, these twelve short full-color books feature repeated examples of short and long vowel sounds and common sight words.  Each of the simple stories in this box set is designed to teach kids how to master reading while rocking out with Pete the Cat.Phonics teaches children the relationship between letters and the sounds they make. A child who has mastered these relationships has an excellent foundation for learning to read and spell. According to the National Institute of Child Health & Human Development, a child who has learned phonics has a method to recognize familiar words and “decode” unfamiliar ones. Correlates to the Common Core State Standards in English Language Arts. "}, {"id": "0062292625", "genre": "Children's Books", "title": "The Poet's Dog", "description": "From Newbery Medal winner Patricia MacLachlan comes a poignant story about two children, a poet, and a dog and how they help one another survive loss and recapture love. \"Just what I needed,\" raves Brightly.com. \"It's a heart-warming story of loss and love that filled me with hope for a better future and renewed my belief in good.\"Teddy is a gifted dog. Raised in a cabin by a poet named Sylvan, he grew up listening to sonnets read aloud and the comforting clicking of a keyboard. Although Teddy understands words, Sylvan always told him there are only two kinds of people in the world who can hear Teddy speak: poets and children.Then one day Teddy learns that Sylvan was right. When Teddy finds Nickel and Flora trapped in a snowstorm, he tells them that he will bring them home—and they understand him. The children are afraid of the howling wind, but not of Teddy’s words. They follow him to a cabin in the woods, where the dog used to live with Sylvan . . . only now his owner is gone.As they hole up in the cabin for shelter, Teddy is flooded with memories of Sylvan. What will Teddy do when his new friends go home? Can they help one another find what they have lost? "}, {"id": "0766033937", "genre": "Children's Books", "title": "Master the Library and Media Center (Ace It! Information Literacy Series)", "description": "Presents a guide to using libraries for research that includes an overview of what a library is, what is available there, how to plan out library research, how to keep track of sources, and how to evaluate potential sources."}, {"id": "0061978620", "genre": "Children's Books", "title": "Splat the Cat: Funny Valentine", "description": "Feel the love in a new Splat the Cat tale by New York Times bestselling author-artist Rob Scotton in Funny Valentine, a Valentine’s Day lift-the-flap adventure.It’s Valentine’s Day, and Splat wants to give a secret present to someone special. His classmates all decide to help, and make the best Valentine ever! Lift the flaps throughout the story to discover hidden holiday surprises. Read all about Splat’s Valentine’s Day misadventures in Splat the Cat: Funny Valentine, another sure-to-be-a-classic story by Rob Scotton. "}, {"id": "8854412449", "genre": "Children's Books", "title": "My Baptism Album", "description": "This beautiful album celebrates a sacred moment in the life of a Catholic: a child’s baptism.   Baptism marks a baby’s entrance into the life of faith—even if the child is still too young to understand—and is equally significant to those who come together to celebrate the infant: parents, godparents, family, and friends. Gather all your memories of this special and emotional day in this beautiful album, enhanced with delicate illustrations and meaningful prayers."}]