[{"id": "B06XS53CPP", "genre": "Science Fiction & Fantasy", "title": "The Laird of Duncairn (Fey Matter Book 1)", "description": "The year is 1882 Scotland, and the auld alliance betwixt king and fey has long been forgotten. Men of science, backed by barons of industry, push the boundaries of technology. When Sir Walter Conrad discovers a new energy source, one that could topple nations and revolutionize society, the race to dominate its ownership begins. But the excavation and use of this energy source will have dire consequences for both humans and fey. For an ancient enemy stirs, awakened by Sir Walter’s discovery.Outcast half-fey Effie of Glen Coe is the Empire’s only hope at averting the oncoming disaster. Effie finds herself embroiled in the conflict, investigating the eldritch evil spreading throughout the Highlands. As she struggles against the greed of mighty lords and to escape the clutches of the queen’s minions, her comfortable world is shattered. Racing to thwart the growing menace, she realizes the only thing that can save them all is a truce no one wants."}, {"id": "0853237794", "genre": "Science Fiction & Fantasy", "title": "2: Transformations: The Story of the Science Fiction Magazines from 1950 to 1970 (Liverpool University Press - Liverpool Science Fiction Texts & Studies)", "description": "This is the second of three volumes which chart the history of the science fiction magazine from the earliest days to the present. The first volume Time Machines traced the development of the sf magazine from its earliest days and the creation of the first specialist magazine, Amazing Stories. Transformations takes up the story to reveal a turbulent period that was to witness the extraordinary rise and fall and rise again of science. Britain's foremost sf historian, Mike Ashley charts the sf boom years in the wake of the nuclear age that was to see the 'The Golden Age' of Science Fiction with the emergence of magazines such as Galaxy, Startling Stories and Fantastic, as well as authors like Isaac Asimov, Philip K. Dick and Frank Herbert . He then goes on to explore the bust years of 1954-1960 followed by the renaissance in the 1960s led by the new wave of British authors like Michael Moorcock and J.G. Ballard and the rise in interest of fantasy fiction, encouraged by Lord of the Rings and the Conan"}, {"id": "1548925578", "genre": "Science Fiction & Fantasy", "title": "Proxima Riven (The Feedback Loop) (Volume 7)", "description": "Quantum Hughes should have known better.  Stuck again, but this time in a way that even he couldn’t have predicated, Quantum and the Dream Team head to Steam to seek out Ray Steampunk. Their mission? Collect a rare Proxima metal and use it to develop a weapon to free Quantum from the Proxima Galaxy.  But things are never as easy as they seem. The Reapers are hot on their tails, and Strata Godsick has a pressing message for Quantum, a message that is especially poignant after something terrible happens to a Dream Team member.  It’s time to mech up and finish this once and for all."}, {"id": "1400030927", "genre": "Science Fiction & Fantasy", "title": "Jennifer Government", "description": "A wickedly satirical and outrageous thriller about globalization and marketing hype, Jennifer Government is the best novel in the world ever.\"Funny and clever.... A kind of ad-world version of Dr. Strangelove.... [Barry] unleashes enough wit and surprise to make his story a total blast.\" --The New York Times Book Review\"Wicked and wonderful.... [It] does just about everything right.... Fast-moving, funny, involving.\" --The Washington Post Book WorldTaxation has been abolished, the government has been privatized, and employees take the surname of the company they work for. It's a brave new corporate world, but you don't want to be caught without a platinum credit card--as lowly Merchandising Officer Hack Nike is about to find out. Trapped into building street cred for a new line of $2500 sneakers by shooting customers, Hack attracts the barcode-tattooed eye of the legendary Jennifer Government. A stressed-out single mom, corporate watchdog, and government agent who has to rustle up funding before she's allowed to fight crime, Jennifer Government is holding a closing down sale--and everything must go."}, {"id": "1588469670", "genre": "Science Fiction & Fantasy", "title": "Book of Hallowed Might II: Portents and Visions (Sword & Sorcery)", "description": "Those who serve the gods represent divine power in the mortal world. Theirs is a great responsibility, and an awesome might. This new sourcebook from 3rd Edition codesigner Monte Cook and popular d20 designer Mike Mearls introduces aspects of divine magic never before seen. Within its pages, you'll find:A New Pantheon of Gods: Use the six deities of the Celestial River pantheon alone or with your own campaign's gods.Rules for Visions, Omens, and Divinations: Send characters portents of things to come using these guidelines.New Hallowed Locales: From the remote Oracle of Jezer-At to Enderfel, city of deceit, adventure in five all-new sacred sites.And Much More! This book also contains the power of the Divine Voice, masterpiece weapons and armor, plus dozens of new spells, magic items, artifacts, prestige classes, characters, creatures, and feats for the divine spellcaster's arsenal."}]