[{"id": "1547188529", "genre": "Science Fiction & Fantasy", "title": "5th Floow Below", "description": "Could Israeli scientists have stumbled upon the secret to eternal life?In a highly secured research facility atop Mount Carmel in Haifa, a group of military scientists are involved in space research. Captain Dr. Naama Kashti, a beautiful young Israeli physicist, is exposed to an unknown substance that made her body undergo very lengthy life cycles during a short period of time. Thus begins a futuristic drama about discovering the formula for both the fountain of youth and the well of desolation. Can this heavenly spark assure its possessor eternal life?The world is shaken to the core by the stunning possibilities and perilsThe dramatic secret shakes the foundations of government and is leaked to the international media. Intelligence agencies of the super powers send greedy fingers to Israel in order to extract fragments of information discovered on Mount Carmel. The Vatican is horrified by the possibility of eternal life that was not given by divine providence. This futuristic science novel is replete with theological explorations of truth, scandalous probing of human nature, and romantic fortitude alongside cynical promiscuity.Scroll up now to get your copy of 5th Floor Below!"}, {"id": "1559585277", "genre": "Science Fiction & Fantasy", "title": "SSN-21 Seawolf: The Official Strategy Guide (Secrets of the Games Series)", "description": "Author Dille provides a thorough historical and technical background for submarine warfare enthusiasts. He also provides detailed strategies and insights that will help put the reader on the winning side in any Sea Wolf engagement."}, {"id": "0786121904", "genre": "Science Fiction & Fantasy", "title": "The House of Blue Mangoes", "description": "In 1899, in the south Indian village of Chevathar, renowned for its groves of a rare variety of blue mango, Solomon Dorai is contemplating the imminent destruction of his world and everything he holds dear. As the thalaivar or headman of Chevathar, he seeks to preserve the village from both catastrophe and change, and the decisions he makes will mark his family for generations to come.Richly emotional and abundant in historical detail, The House of Blue Mangoes is a gripping family chronicle that spans nearly a half century and three generations of the Dorai family as they search for their place in a rapidly changing society. Whether recruited into the burgeoning independence movement, apprenticed in ancient medical arts, or managing a British tea plantation, the Dorai men nevertheless find themselves drawn back to their ancestral land by profound emotional ties that transcend even the most powerful forces of history."}, {"id": "B01E9O855O", "genre": "Science Fiction & Fantasy", "title": "Soulbound (The Return of the Elves Book 1)", "description": "A deathbed promise Arlyn’s quest is simple: Find her father and let him know her mother is dead. After all, Arlyn had promised her mother she’d go. The problem? Her father's people are myths and legends, and he doesn't even live on Earth. But despite a long journey through the mysterious mists of the Veil, finding him turns out to be the easy part. A dream long-buried After five hundred years, Kai has given up on finding his soulbonded. So when he stumbles across Arlyn after returning from his latest mission and recognizes her as his mate, Kai starts their bond in haste. But he never could have imagined that his bonded is his best friend’s newfound daughter. Whoops. A hidden conspiracy sparked to life Though the sight of Kai makes Arlyn’s heart pound, she isn’t sure she can forgive him for starting their bond without her permission. But her love life is the least of her problems. Her father is an elf lord, and his sudden acknowledgment of a half-human heir reignites the same conspiracy that took him away from her mother in the first place. Now Arlyn and her family must face iron wielding assassins, bigotry, and her newly awakened magical abilities if they hope to come through in one piece. Arlyn thought she would return to Earth after meeting her father. Now she must fight to save the family she never knew she wanted."}, {"id": "0679723110", "genre": "Science Fiction & Fantasy", "title": "Grendel", "description": "The first and most terrifying monster in English literature, from the great early epic Beowulf, tells his own side of the story in this frequently banned book. This  classic and much lauded retelling of Beowulf follows the monster Grendel as he learns about humans and fights the war at the center of the Anglo Saxon classic epic. This is the book William Gass called \"one of the finest of our contemporary fictions.\""}]