[{"id": "B01G2J8Z68", "genre": "Science Fiction & Fantasy", "title": "Dangerous: TerraMates Collection One: (Water World Warrior, Taken, Water World Confidential)", "description": "Three mysterious aliens.  Three Earth women fated to be their mates. WATER WORLD WARRIORWhy would I want to be married to an alien?I should not have applied to TerraMates.  The idea was crazy.  I'm a young woman, in the prime of my life.But I was desperate.When I landed on another world, his appearance intrigued me.  He dripped sexuality and moved like an animal.  We have three days together before he sets sail without me.  Am I going to escape or submit to my desires?TAKENWhat happens when TerraMates runs out of applicants?There's never a shortage of wealthy alien bachelors looking for the thrill of mating with a human.  They want our women.But despite the promise of riches, sometimes the pool of available brides runs dry.How does TerraMates find more girls, and where do they go?  When Lyzette gets taken off the street, she finds out.WATER WORLD CONFIDENTIALHe needed a wife. I wanted an alien lover.The first time I saw Jori, I hated everything about him. He didn't care about anything except himself. On the other hand, his body was spectacular, and his muscles were firm. I couldn't stop thinking about him.When TerraMates gave me the chance to marry Jori, I took it. I knew I needed the money. What I didn't know was that Jori's exterior was a facade, and he had kept secrets from everyone his entire life."}, {"id": "0786937904", "genre": "Science Fiction & Fantasy", "title": "The Two Swords (The Hunter's Blades Trilogy, Book 3)", "description": "DROW STALK THE SHADOWS.TROLLS INFEST THE LOWLANDS.ORCS HAVE CLAIMED THE MOUNTAINS.AND TIME IS RUNNING OUT.Mithral Hall is under siege, Nesmé is overrun, and even powerful Silverymoon braces for war. Through it all, Drizzt has fought alone, but as the conflict draws to a bloody conclusion, the Hunter will have to find allies both new and old–or die along with the rest of the civilized North.The conclusion of the New York Times best-selling trilogy decides the fate of Drizzt Do’Urden."}, {"id": "B077SCJPBV", "genre": "Science Fiction & Fantasy", "title": "Partnership Reforged (Partnership in Blood Book 10)", "description": "A Companion to the Partnership in Blood seriesFor two years, Thierry has wanted the one thing Sebastien's past denies him: an Aveu de Sang. With the help of friends new and old, he has finally assembled a ritual that will give him a close approximation of the ultimate bond between vampire and mortal... if it succeeds."}, {"id": "B016ONL5P0", "genre": "Science Fiction & Fantasy", "title": "Ten Thousand Gods Episode 1 (A Dark Comedy)", "description": "In this darkly funny book, we find out what would happen if the gods walked among mortals. Which gods? All gods. All religions. At the same time. But there aren't just religious gods. Oh no. There are also gods of things that people do religiously. Swimming? God. Bowling? God. Atheism? ...actually, yes!Phineas Sealby is a deity beat reporter at the Atlanta Record. His heart-felt reporting style puts him in a bad position with his publisher, who is also his girlfriend's dad. If he has any hope of keeping his job and the love of his life, he must contact and interview the one god no one has seen yet. The god has to exist. He just has to. And Phineas has to find him. There's just one problem: that god is Satan. Come along on a paradoxical, bizarre journey literally to Hell and back with possessed cell phones, accidental intimate photos, and a small man with a gross beard."}, {"id": "1530509424", "genre": "Science Fiction & Fantasy", "title": "1-7: John Carter of Mars: First Seven Novels of Barsoom series", "description": "• Contents • A Princess of Mars (1917) • The Gods of Mars (1918) • The Warlord of Mars (1919) • Thuvia Maid of Mars (1920) • The Chessmen of Mars (1922) • The Master Mind of Mars (1927) • A Fighting Man of Mars (1930)"}]