[{"id": "0763695181", "genre": "Children's Books", "title": "Where Did My Clothes Come From? (Exploring the Everyday)", "description": "Fun retro illustrations entice kids to follow the thread and learn where their clothes had their start—and how they were put together.Did you know that the cotton for your jeans was picked from a bush? How did the colorful wool in your sweater get from a sheep's back to a ball of yarn? Where did your soccer uniform, your rain boots, and your fleece jacket come from? And what does recycling plastic bottles have to do with anything? Visit farms, forests, and factories all over the world to find out how everything you wear has a story behind it. Back matter includes an author's note, an illustrator's note, a bibliography, and an index."}, {"id": "0689858264", "genre": "Children's Books", "title": "Teddy Roosevelt: The People's President (Ready-To-Read Stories of Famous Americans)", "description": "Profiles the life of Theodore Roosevelt, starting with his sickly childhood, which he overcame to become a robust outdoorsman, leader of the Rough Riders and later, the twenty-sixth president of the United States."}, {"id": "0805099166", "genre": "Children's Books", "title": "Ninja! Attack of the Clan", "description": "A ninja must be ready for anything! Maxwell is a strong, courageous, silent ninja, but he also wants somebody to play with. Mama, Papa, and little sister Cassy are all too busy, leaving Maxwell disappointed and alone. When Maxwell gets called to dinner, he finds an empty dining room. Could his ninja clan be up to something? This sequel to Ninja! is both action-packed and heartwarming."}, {"id": "0754090434", "genre": "Children's Books", "title": "Thank You! (Good manners)", "description": "Good manners make life pleasant for us all. Each title in Courteous Kids contains several simple and instructive stories that show young readers and children being read to by grown-ups how to be kind to other people, respect others' rights and privileges, and show that they care about others' feelings."}, {"id": "1532140355", "genre": "Children's Books", "title": "Skylanders Superchargers", "description": "A new team of Skylanders called the Superchargers take center stage to stop insidious evil from taking over Skylands! Dive-Clops discovers an underwater water factory, Fiesta takes on a robot army, and Spitfire, Nightfall, and Stormblade search for a missing elite team of Skylanders. In this series, readers will learn more about various Superchargers including Dive-Clops, High Volt, Fiesta, and more. Aligned to Common Core Standards and correlated to state standards. Spotlight is a division of ABDO."}]