[{"id": "1523356340", "genre": "Science Fiction & Fantasy", "title": "Keeper of the Storm (Alchemic Chronicles) (Volume 2)", "description": "Eighteen—that was how old Aurora was when she married the powerful aristocrat Acario Draconis. It was a match made in heaven...or so it seemed. Now Aurora has found out that she is the Harbinger and must track down the Four Horsemen of the Apocalypse before leading them into the Final Battle against the Ordained--a man who wants to bring the world to its knees. In order for her to be properly trained in the art of war, the Creator has sent one of his best Battle Angels to assist her, Michaelo. He is charming, elusive and doesn't put up with any crap, which Aurora finds irresistible. After he turned her into Nephilim through the exchange of blood, she's finding it harder to stay away. If she wants to prevail, she must not only distance herself from the Angel but keep him close enough to complete her goals. That should be easy enough, right? After all, it isn't just her marriage hanging in the balance...It's the fate of the entire human race. *contains adult content*"}, {"id": "B073P6DFW7", "genre": "Science Fiction & Fantasy", "title": "Written In Blood", "description": "In Victorian London, people lament over dreadful news in the paper. Give them a scandal, and they want blood.An outspoken reporter, Thierry Barnes is used to keeping his desires silent. When he encounters the handsome and mysterious Eduard de Sonnac, Thierry's tempted to step out of his carefully structured life. For one night, he will follow his passions. One night is all de Sonnac needs to change him.The story was previously released under the name Luisa Prieto."}, {"id": "B007Y2PFRK", "genre": "Science Fiction & Fantasy", "title": "Bloodlust: Vampire  on the Titanic", "description": "There are vampires on the Titanic!Mina Harker, one the undead, returns to haunt the gas-lit alleys of Edwardian London. From a brooding house by the Thames she hunts and feeds. Beautiful, voluptuous, merciless, her overwhelming and irresistible sexual allure brings willing victims.In the east-end the death toll rises and a trail of scarlet is left on the mean streets. As life in the great city goes on, millions are unaware of the unseen yet deadly war that rages on for the soul of the metropolis.But there are those who know the old ways, those who have the knowledge to end her reign of terror. Hunted, the vampire looks across the Atlantic to the  vigorous New World as a place of eternal safety. At Southampton, the Titanic, the mightiest ship in history, waits to sail..."}, {"id": "0814290949", "genre": "Science Fiction & Fantasy", "title": "The ECONOMICS OF FANTASY: RAPE IN TWENTIETH-CENTURY LITERATURE", "description": "In The Economics of Fantasy: Rape in Twentieth-Century Literature, Sharon Stockton examines the persistence and the evolution of the rape narrative in twentieth-century literature—the old story of male power and violence; female passivity and penetrability. What accounts for its persistence? How has the story changed over the course of the twentieth century? In this provocative book, Stockton investigates the manner in which the female body—or to be more precise, the violation of the female body—serves as a metaphor for a complex synthesis of masculinity and political economy. From high modernism to cyberpunk, Pound to Pynchon, Stockton argues that the compulsive return to the rape story, articulates—among other things—the gradual and relentless removal of Western man from the fantastical capitalist role of venturesome, industrious agency. The metamorphosis of the twentieth-century rape narrative registers a desperate attempt to preserve traditional patterns of robust, entrepreneurial masculinity in the face of economic forms that increasingly disallow illusions of individual authority.   It is important to make clear that the genre of rape story studied here presumes a white masculine subject and a white feminine object. Stockton makes the case that the aestheticized rape narrative reveals particular things about the way white masculinity represents itself. Plotting violent sexual fantasy on the grid of economic concerns locates masculine agency in relation to an explicitly contingent material system of power, value, and order. It is in this way that The Economics of Fantasy discloses the increased desperation with which the body has been made to carry ideology under systems of advanced capitalism."}, {"id": "B00SWPJF9C", "genre": "Science Fiction & Fantasy", "title": "Highland Wolf Clan Series, Book 1, The Reluctant Alpha: A gripping tale of Shifters full of suspense, action and paranormal romance", "description": "Born to be Alpha, Cameron Sinclair walks away from his birthright and Pack. He wants nothing to do with either as he builds his multi-billion dollar business.When summoned he reluctantly goes to the aid of his Uncle’s Pack. What he finds is danger, intrigue, heartache, and the chance of a different life. His instinct screams at him to walk away but his heart has other ideas. Come and join the Highland Wolf Clan and find out what’s in store for Cameron and his Highlanders.Book 1 in New York Times Bestselling Author, A K Michaels' contemporary fantasy romance series full of Alpha males, Highland Wolves and hot ShiftersRead the book that has over 200 five star reviews! Reviewers are calling it “gripping,”  “suspenseful”, with “lots of love and action” and a series “I couldn’t put down”!"}]