[{"id": "0808568620", "genre": "Children's Books", "title": "Bunny Trouble", "description": "Ralph is one soccer-loving bunny. But when his soccer high jinks almost land him in the farmer¹s stewpot, he discovers the needs the help of his brave sister - and lots of Easter eggs - to get him safely home again."}, {"id": "0544302362", "genre": "Children's Books", "title": "Five Little Monkeys Wash the Car (A Five Little Monkeys Story)", "description": "The five little monkeys and Mama are eager to get a new car. The five little monkeys clean and paint their old car until it sparkles like new. But who will buy it? Perhaps those clever monkeys can convince their cranky crocodile neighbors that what they really need is . . . yes, a car! Children will love predicting how the five little monkeys will deal with each new challenge, making this a perfect story for interactive reading. Lively verse and Eileen Christelow's inimitably comic illustrations put the five little monkeys in the driver's seat in more ways than one."}, {"id": "076369276X", "genre": "Children's Books", "title": "Get Coding!: Learn HTML, CSS & JavaScript & Build a Website, App & Game", "description": "Learn how to write HTML, CSS, and JavaScript and build your own website, app, and game! An essential guide to computer programming for kids— by kids.Crack open this book and set off on several fun missions — while simultaneously learning the basics of writing code. Want to make a website from scratch? Create an app? Build a game? All the tools are here, laid out in a user-friendly format that leads kids on an imaginary quest to keep a valuable diamond safe from dangerous jewel thieves. Presented by Young Rewired State — an international collective of tech-savvy kids — in easy-to-follow, bite-size chunks, the real-life coding skills taught in this engaging, comprehensive guide may just set young readers on the path to becoming technology stars of the future."}, {"id": "159953049X", "genre": "Children's Books", "title": "Why We Have Thanksgiving (Beginning to Read-easy Stories)", "description": "An easy-to-read fictional retelling of the journey of the Pilgrims to America, their struggles during the first year, and celebration of the first Thanksgiving. Includes reading activities."}, {"id": "1933241578", "genre": "Children's Books", "title": "Grade 4 Division (Kumon Math Workbooks)", "description": "Most grade-school workbooks try to cover the full range of topics in one workbook, and as a result do not dedicate enough pages to important mathematical concepts. Kumon's research has found, however, that children find learning easier when they tackle one skill set at a time. With these findings in mind, we designed our newest line of workbooks to help children with one particular mathematical skill set per book."}]