[{"id": "0545486726", "genre": "Children's Books", "title": "Amazing Motorcycles & ATVs Flip Book", "description": "Do you have the need for speed? A follow-up to the extremely successful MONSTER TRUCKS flip book!Satisfy your need for speed with this book packed from cover to cover with fun facts and incredible images of motorcycles and all-terain-vehicles! Flip the pages to read all about the most amazing motorcylces around, then flip the book over to see the coolest ATVs--fantastic four-wheelers that can take your need for speed to almost any terrain you can imagine!"}, {"id": "B00Z58YUK8", "genre": "Children's Books", "title": "Diary of an Iron Golem and a Snow Golem [An Unofficial MineCraft Book] (Minecraft Tales Book 12)", "description": "Follow the adventures of an Iron Golem and his Snow Golem companion!Guarding a castle was too much too handle for one Golem so the Snow Golem came to the rescue! But Iron Golem isn't too happy with Snow Golem!Find out what happens in the Diary of an Iron Golem and a Snow Golem!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books."}, {"id": "1541914139", "genre": "Children's Books", "title": "What Can We Take Away from the Renaissance Period? History Book for Kids 9-12 | Children's Renaissance Books", "description": "You may have heard about the Renaissance. You might have discussed it in class, or you've seen movies about them. You read facts and data but what should be the core take away from the Renaissance Period? How does it affect modern living? Knowing the answer to these questions is the goal of this history book for kids 9-12. Grab a copy today!"}, {"id": "1842704265", "genre": "Children's Books", "title": "Tadpole's Promise", "description": "The award-winning, unpredictable picture book from this best-selling author/artist team is now available for the first time in paperback. Tadpole loves his rainbow friend, the caterpillar, and she tells him she loves everything about him. \"Promise that you will never change,\" she says. But as the seasons pass and he matures, his legs grow, and then his arms—and what happens to his beautiful rainbow friend? As he sits on his lily pad, digesting a butterfly, Tadpole little realizes that now he will never know! Follow the predictable changes of a tadpole and a caterpillar to their natural conclusion in this award winning picture book."}, {"id": "B00K2BZSMM", "genre": "Children's Books", "title": "Archie 1000 Page Comics Bonanza (Archie 1000 Page Digests)", "description": "Archie 1000 Page Comics Bonanza collects 1000 pages of new and  classic Archie tales in our biggest collection ever, with over 100  full-color stories  featuring America's favorite red-head and friends  navigating the  pressures and pratfalls of teenagers everywhere!"}]