[{"id": "1520271212", "genre": "Children's Books", "title": "Diary of Anna the Girl Witch 2: Wandering Witch", "description": "For Anna, life has never been normal. She was raised by her uncle in the wilds of Siberia, educated at an orphanage in Geneva, and recently discovered her own supernatural powers: Anna is a witch.    A letter arrives from her uncle Misha, saying that her father is alive and in danger; Anna is the only one who can help. The young witch leaves for her Siberian homeland, where she finds dangers beyond anything she could have imagined. Anna discovers that her father has been captured by none other than Anna’s grandmother — a fearsome witch known as Baba Yaga. She will need to confront her grandmother with her own courage and wisdom.    How far will Anna go to save the one she loves? How much is she willing to lose?     Based on an exciting Russian fairytale, this second Diary of Anna Sophia is a fun read for middle grade children, and those young at heart!"}, {"id": "9814779288", "genre": "Children's Books", "title": "Discover Forensics: How to Use Science for Investigations", "description": "Every crime scene has clues if you know where to look, and with the correct techniques, you might just uncover the truth of what happened. Moments like this are perfect for forensics to come in and save the day!In this book, experts will guide you to explore how everyday objects can provide vital clues to investigate questions. You will learn to debunk myths commonly depicted on television, immerse in Singapore stories that make headlines in newspapers and challenge yourself with fun activities.Go behind the scenes and see how forensic scientists work to solve crimes. You will realise that the science learnt in school is a useful foundation to unravelling mysteries. So let's look at prints, knots, fibres, soil, blood, and analyse them to gather clues and find out who the culprit is. Along the way, you will also learn the methods to figure out how pure is a gold bar or how dangerous is an unknown white powder.Read on to discover the intriguing world of forensic science, and how you can answer the \"who\", \"what\", \"where\", \"when\" and \"how\" of crimes. Remember ― every contact leaves a trace!"}, {"id": "B008SLD7V2", "genre": "Children's Books", "title": "Diary of a Pet Turkey", "description": "In this delightful tale, based on a true story, a suburban family adopts a wild turkey and raises it by hand. Joanne Ingis takes readers on an unbelievable journey, from the hatching of the egg, to the naming of the turkey, to its incorporation into the family's daily life. Young readers will love the story of a turkey being cared for rather than eaten at a holiday dinner! A perfect Thanksgiving gift that is sure to appeal throughout the year."}, {"id": "B00JYZAOVC", "genre": "Children's Books", "title": "Swim, Duck, Swim!", "description": "It's time for Duckling to jump in the water and do what ducks do—swim! But he doesn't want to get wet. He'd rather take a nap. And he's really, really mad that everyone keeps telling him what to do! Luckily, Mama and Papa Duck are very, very patient, and soon, Duckling will join his siblings in the pond. Here is a charming story, illustrated with exquisite, up-close photos, that will help young readers learn to swim—or try anything new."}, {"id": "1538214202", "genre": "Children's Books", "title": "Surviving a Robot Revolution (Surviving the Impossible)", "description": "Many people have maintained a certain suspicion toward robots, especially as they've become more integrated into our lives. They work in factories and hospitals, aid in law enforcement, and even vacuum our homes. Some wonder: What would happen if robots take over? Keep calm. All the answers to surviving the robot revolution are in this electrifying volume, which describes the best strategies to battle the malevolent forces of artificial intelligence. Readers will love this page-turning experience, which includes accessible text and thrilling images that stir the imagination."}]