[{"id": "0997580437", "genre": "Children's Books", "title": "Is Allah Real? (Children's First Questions) (Volume 4)", "description": "Discover the signs of Allah in the divine balance and common patterns found in the natural world.  The Children’s First Questions series promotes curiosity and encourages the pursuit of knowledge, and scientific literacy. Helping children to grasp complex concepts in a unique and age appropriate way, using authentic Islamic sources and scientific facts.  Give your kids the bridge they need between scientific discovery and Islamic identity. With original ink drawings, facts, and diagrams, this is an Islamic children's book unlike any other you have on your shelf.   OTHER BOOKS IN THE SERIES: How Big Is Allah? How Does Allah Look? Where Is Allah?  This series is written according to the Qur'an and Sunnah and does not describe Allah in any way."}, {"id": "1434217310", "genre": "Children's Books", "title": "My Frozen Valentine (Batman)", "description": "It's Valentine's Day in GOTHAM, but not everyone is celebrating. VICTOR FRIES (aka MR. FREEZE) has never gotten over the death of his wife, Nora, and he's not about to let anyone enjoy this painful holiday. Only BATMAN can stop the cold-hearted criminal before VICTOR refrigerates the city!"}, {"id": "0380732602", "genre": "Children's Books", "title": "Stories to Solve", "description": "How can a thirsty crow drink from an almost-empty pitcher? How does arresting a stone help a judge find a boy's stolen money? This artfully illustrated book presents fourteen intriguing mysteries from world folklore. Each brain-teasing tale is followed by a simple explanation of the solution, while notes at the back of the book describe the origins of these classic mysteries. "}, {"id": "0340877847", "genre": "Children's Books", "title": "Jack and the Beanstalk", "description": "A retelling of the traditional tale. One day, Jack's mother asks him to sell the cow at market to earn some money. But Jack ends up swapping the cow, not for lots of gold pieces, but for a handful of magic beans. What happens when the beans grow into a giant beanstalk?"}, {"id": "0794527280", "genre": "Children's Books", "title": "Construction Sites (Usborne Lift and Look Board Books)", "description": "Provides information about construction and construction vehicles, and challenges young readers to lift flaps and find a little rabbit on every page. On board pages."}]