[{"id": "1626926778", "genre": "Children's Books", "title": "Non Non Biyori Vol. 9", "description": "The manga series that inspired a hit anime adaptation, for fans of Yotsuba!Welcome to the countryside village of Asahigaoka, a quaint town far removed from the hustle-and-bustle of the big city. You couldn’t imagine a more isolated setting in all of Japan. So when Tokyo-raised elementary school student Hotaru Ichijo transfers to the tiny Asahigaoka Branch School due to her father’s job, she’s in for the culture shock of her life! Join Hotaru and her new friends, the eccentric Renge and the mischievous sisters Natsumi and Komari, as they share daily adventures in the idyllic Japanese countryside."}, {"id": "1429673095", "genre": "Children's Books", "title": "LeBron James: Basketball Superstar (Superstar Athletes)", "description": "Did you know LeBron James averaged more than 30 points a game as a senior in high school? Discover how an amazing high school player went on to become an outstanding NBA star!"}, {"id": "0448422980", "genre": "Children's Books", "title": "Pocahontas GB: An American Princess (All Aboard Reading)", "description": "A carefully researched story offers the biography of the daughter of Chief Powhatan who saved Captain John Smith of Jamestown from execution by her tribe and who became an early American heroine. Simultaneous."}, {"id": "1438050127", "genre": "Children's Books", "title": "Furry Chick (Mini Friends Touch & Feel)", "description": "Delight all of Baby's senses with this adorable little book that has a \"spot\" of fur that Baby can touch and feel right on the front cover!Welcome, little chickadee! Furry Chick meets friends on the farm. Bright illustrations and gentle text stimulates babies' sense of sight and hearing, and introduce fun facts that can help your little one learn new words and ideas. Perfectly sized for little hands to explore and enjoy."}, {"id": "0545552397", "genre": "Children's Books", "title": "LEGO DC Super Heroes: Phonics Boxed Set", "description": "Phonics comes to life with LEGO (R) DC Super Heroes (TM) Superman, Batman, Wonder Woman, and more!Learn to read with Superman, Batman, Wonder Woman, and all the other characters in the LEGO(R) DC UniverseTM)!These books will readily appeal to a wide audience--from LEGO fans to DC Super Hero fans! Beginning readers will enjoy LEGO DC Universe's well-recognized heroes from movies, TV, comics, video games, and more. This set includes ten books and two workbooks (focusing on short and long vowels), all held in a sturdy box with plastic handle."}]