[{"id": "0991534514", "genre": "Children's Books", "title": "The Adventures of Danica Dreamer: When I Grow Up, I Could Be President of the United States", "description": "Danica Dreamer is a smart, adventurous and curious young girl with a wild imagination and big dreams for her future. Join her on an amazing journey to discover what it would be like to be the President of the United States of America.   With the help of her tablet, Tabby, her little brother, Chase, and her favorite stuffed bunny, she'll learn about the responsibilities of being America's Chief Executive and whether she has the makings of a great President.   This fun educational story is told in an easy to understand way and simply explains the job of the U.S. President. Parents can read along with their kids and encourage them to pursue their dreams, teaching them that anything is possible through hard work and perseverance.   Questions for discussion are included at the end of the book to spark conversations between parents/teachers and children to open their minds and pursue what they are passionate about in order to reach their full potential."}, {"id": "1682133818", "genre": "Children's Books", "title": "The Hungry Snake", "description": "This friendly snake is very hungry! Come along as he tries to solve his craving for just the right meal that will not only satisfy his empty tummy, but also give young readers a fun story they will want to tell again and again. As soon as the last page is read, children beg to act the story out, taking turns as the hungry snake, the grasshopper, or the many animals the snake meets along the way. Children can use their creativity to come up with different animals and what they kindly offer the hungry snake to try.  This book is perfect for teaching, sharing, and creativity during family time, at home or in the car. It is also a great addition to learning in the classroom! "}, {"id": "0340715170", "genre": "Children's Books", "title": "Activators - Riding", "description": "A hobby guide to horse riding. It covers choosing a riding school, what to wear, mounting and dismounting, tack, finding the right position, moving off, trotting, cantering, riding in a group, jumping, hacking, riding clubs and pony sports. There are snippets about top riders."}, {"id": "1400139309", "genre": "Children's Books", "title": "The Princess and Curdie, with eBook", "description": "In this sequel to The Princess and the Goblin, Curdie has returned to his life as a miner and has dismissed the supernatural happenings of the past, believing them to have been a dream. When Curdie callously wounds a pigeon, his conscience leads him to Princess Irene's mystical great-great-grandmother for help. She has him plunge his hands into a pile of rose petals that burns like fire. Extraordinarily, this grants him the power to see what kind of \"animal\" a person is at heart. She then sends him on a quest, accompanied by a peculiar doglike creature named Lina, who was once a human. However, Curdie must resolve his own skepticism before he can use the powers granted him to defeat the evil that is threatening the future of the kingdom."}, {"id": "B007WTR4W4", "genre": "Children's Books", "title": "Egyptians (Sir Tony Robinson's Weird World of Wonders Book 4)", "description": "In Sir Tony Robinson's Weird World of Wonders Egyptians, Sir Tony Robinson takes you on a headlong gallop through time, pointing out all the most important, funny, strange, amazing, entertaining, smelly and disgusting bits about the Egyptians! It's history, but not as we know it!Find out everything you ever needed to know in this brilliant, action-packed, fact-filled book including:- Why the gods looked so strange- Why tomb raiding is a bad idea- Why they loved cats, and- How to make a mummy in eight easy stepsFor more funny history facts discover British."}]