[{"id": "B072M6GV72", "genre": "Science Fiction & Fantasy", "title": "Ghost in the Ring (Ghost Night Book 1)", "description": "Caina Amalas was once a deadly Ghost nightfighter, a spy and agent of the Emperor of Nighmar. Now she only wishes to live quietly with her husband.But civil war grips the Empire, and Caina's skills are needed against the cruel sorcerers of the malevolent Umbarian Order. And Caina has a dangerous connection to the Umbarians. For Caina's mother had many secrets, secrets that might yet kill Caina herself..."}, {"id": "1601259700", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Roleplaying Game: Book of the Damned", "description": "Be it the darkest depths of the demon-haunted Abyss, the apocalyptic realm of Abaddon, or the infernal layers of Hell itself, the denizens of these evil planes of existence have long tempted, tormented, and tortured mortal life. From the lowliest imp to the mightiest demon lord, these realms are ripe with horrors and festering with threats to body, mind, and soul. And the route to knowing these blasphemous secrets are held within the infamous pages of the Book of the Damned.  Pathfinder RPG Book of the Damned explores the workings of these powerful forces of evil, focusing on the numerous demigods that influence mortal life and the countless fiends who prey upon the living and dead alike. Within these pages, you’ll find details on demon lords and arch devils, information on the realms of Hell, Abaddon, and the Abyss, and rules for incorporating fiendish influences into your game―be they in the form of foes for heroic parties to face, or temptations for less scrupulous adventurers to consider.  Pathfinder RPG Adventurer’s Guide includes: • Information on the sinister boons granted worshipers of dozens of fiendish demigods drawn from the planes of Abaddon, the Abyss, and Hell, including Archdevils, Demon Lords, and the Four Horsemen of the Apocalypse. • An exploration of the infernal realms of Hell, the sinister reaches of Abaddon, and the bottomless rifts of the Abyss. • New feats, spells, magic items, and prestige classes for use by characters who both fight against and serve the forces of darkness. • Rules for infernal contracts and sinister rituals. • Statistics for several never-before revealed fiends and lavishly-illustrated in-world excerpts from the pages of the notorious Book of the Damned itself. • ... and much, much more!"}, {"id": "B00A90CSGU", "genre": "Science Fiction & Fantasy", "title": "The Artificer's Apprentice", "description": "Can a man fashion justice as he would a clock?Cast out of the craft hall in his prime and bitter from his many losses, a blind artificer has taken on an apprentice to make what he no longer can: a device that will enter him into the Grand Competition.The Artificer’s Apprentice is a short story set in a medieval city where magic and technology blend seamlessly and the Artificer guilds make handsome profits keeping the city's systems running. The leaders of these guilds have complete control over their members, but one man is about to challenge that authority.Follow the tale of The Artificer’s Apprentice to see what he shall fashion in his shop..."}, {"id": "0304353671", "genre": "Science Fiction & Fantasy", "title": "Le Morte D'Arthur: Complete Unabridged, New Illustrated Edition", "description": "A blessed king who strives for peace and justice; the round table where only the most gallant knights may sit; the dramatic quest for the Holy Grail; a fateful romance that destroys a dream: the epic story of King Arthur never fails to stir the imaginations of readers everywhere. This outstanding illustrated version adds to Sir Thomas Malory's skillful recounting with original artwork that creates a unique vision of Camelot. Some of these breathtaking, elaborate watercolors and pens-and-inks have hung in museums, including the depiction of the Tintagel Castle, the Sword in the Stone, Merlin and Nimue, and Guenevere rescued from the stake. With remarkable accuracy, Anna-Marie Ferguson captures every nuance of the historical period-the knights' shining armor, the intricate architecture, and the English forests with their abundant flora and fauna. Yet she also revels in the fantasy, with mysterious and magical landscapes, misty and moonlit. These legends have always been a treat for the mind-and now they are a feast for the eyes, too."}, {"id": "B0192CTMWS", "genre": "Science Fiction & Fantasy", "title": "Harry Potter and the Deathly Hallows", "description": "\"'Give me Harry Potter,' said Voldemort's voice, 'and none shall be harmed.  Give me Harry Potter, and I shall leave the school untouched. Give me Harry Potter, and you will be rewarded.'\"As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy ...Pottermore has now launched the Wizarding World Book Club. Visit Pottermore to sign up and join weekly Twitter discussions at WW Book Club."}]