[{"id": "B077K8ZKZM", "genre": "Science Fiction & Fantasy", "title": "Rumble (Cryptid Clash! Book 5)", "description": "Mongolian Death Worm vs. Mole PeopleLike thunder rolling beneath the sands, the mole person could feel the worm roll by. The sand tented just enough for it to track where the storm was headed: straight for the feeding frenzy.Something has gone wrong in Mongolia. Morgan Industrial Technologies’ natural gas station has gone dark. No communication in or out, it seems, and the satellite imaging shows the station wrecked. Wrecked as though everything has descended into a warzone.Which perhaps it has. The station may have been working on more than natural gas. Mongolian Death Worms, the olgoi khorkhoi of lore, have attacked this base–ripping up anything on the sands, and rending the foundations of the structures. At night, the Eaters in the Rocks emerge, ripping people apart and eating everything they can get their many limbs on. To say nothing of the other dangers–a wild man whose flesh is carved with arcane wards, young Mongolian eco-terrorists, and, most dangerous of all, an office bureaucrat.Cecilia Stonecipher’s mercenaries will descend onto this station. But is modern firepower enough?From Nikki Nelson-Hicks, Rumble is the fifth volume of Cryptid Clash!, a series which pits cryptozoological creatures against each other in fights to the death. Cryptid Clash! features horror, urban fantasy, and military sci-fi luminaries such as William Weikle, Gav Thorpe, David Annandale, C.L. Werner, Nikki Nelson-Hicks, and Josh Reynolds."}, {"id": "0984090037", "genre": "Science Fiction & Fantasy", "title": "The Devious Book of Fumbles & Crits: A 4th Edition D&D Supplement", "description": "Lady Luck ~ she is a fickle mistress. Why not take her out and get her something nice?   Actually, she better be in a hot bath with a glass of wine while you are rubbing her feet, because with \"The Devious Book of Fumbles & Crits,\" if you roll a \"1\" she can make your life a living hell...literally."}, {"id": "B075GXJ6LJ", "genre": "Science Fiction & Fantasy", "title": "Lancelot and the Wolf - The New Edition (The Knights of Camelot Book 1)", "description": "“King Arthur has dominated my life for decades and now I am banished from his side. I am not certain either of us can survive this torment...”Lancelot, the greatest Knight of Camelot is flogged almost to death, exiled, and stripped of his King’s grace. Alone and lost in both body and soul, he starts to rebuild his life, choosing convention over controversy. Fate has other ideas. First he must fight to regain his honour, then he fights for his King’s life. Finally, they must both face their enemies, the rival fey families of Albion.But this not their only fight, in a world where love between men is not permitted, the king and his greatest knight must find a way to face their long denied passion. They must redeem a love both men find hard to bear.A reimagining of the Arthurian myths, of romance and adventure, sorcery and action, creating a new Camelot you’ll never forget. Lancelot and the Wolf is the first in the epic story of The Knights of Camelot.This story is a cross between an adult version of ‘Merlin’ and ‘Brokeback Mountain’ - WOW! Claire Ashton—bookreviewer.com"}, {"id": "153341355X", "genre": "Science Fiction & Fantasy", "title": "Jacob's Bridge", "description": "Since 1908, when an object from space exploded over Siberia and caused the Tunguska blast, that same region has been the frequent site of multiple space object impacts. And yet, very little research has been done on the objects or the blasts.  In 2030, a Russian miner discovers something in a coal mine beneath the location of the 1947 Sikhote Alinsk explosion in Siberia. What at first was thought to be an unexploded WWII bomb is revealed to be something else entirely. The Russians shut the site down, conduct a massive military buildup, and launch some cover story about a mining accident.  American scientist Anita Raymie isn’t buying it. She and her handsome boss, CIA agent Gary Dannon, and their US government team of scientists are ordered to investigate. The White House very much wants to know what the Russians are doing.  As Anita and her team study surveillance and satellite data from the mine area, she discovers an eyewitness to the Sikhote Alinsk event, Russian defector Michael Antelov, who is still alive and living in America. She meets him and learns what he saw in 1947, and this leads to Anita presenting her findings to the U.S. president and secretary of defense.  In the midst of all these developments, Anita and Gary are forced to acknowledge romantic feelings for one another. But that will have to wait, because the team finds that the Russians are hiding an object that is definitely not a World War 2 bomb. Russian archeologists and scientists study the find and discover that it is an object not from earth. It’s a suspended animation case that is keeping its alien occupant alive."}, {"id": "B077MQK6D1", "genre": "Science Fiction & Fantasy", "title": "Pixels and Flesh (Andersson Dexter Book 4)", "description": "After settling into a new job, new home and new living arrangements, Andersson Dexter has finally found a comfortable life in both the physical and virtual worlds. But that sense of security is blown apart when an explosion rocks Dex’s real-life Nice neighbourhood.He and his colleagues begin an investigation into a string of seemingly senseless and random vandalism attacks that remind them all of similar assaults in the simulated world Marionette City. While at first the attacks seem more like a nuisance than a threat, Dex discovers that there are more serious — even fatal — consequences.As the trail leads Dex closer and closer to home, he is forced to confront the lengths he is willing to go for justice."}]