[{"id": "1338157795", "genre": "Children's Books", "title": "Front Desk", "description": "Mia Tang has a lot of secrets.Number 1: She lives in a motel, not a big house. Every day, while her immigrant parents clean the rooms, ten-year-old Mia manages the front desk of the Calivista Motel and tends to its guests.Number 2: Her parents hide immigrants. And if the mean motel owner, Mr. Yao, finds out they've been letting them stay in the empty rooms for free, the Tangs will be doomed.Number 3: She wants to be a writer. But how can she when her mom thinks she should stick to math because English is not her first language? It will take all of Mia's courage, kindness, and hard work to get through this year. Will she be able to hold on to her job, help the immigrants and guests, escape Mr. Yao, and go for her dreams?"}, {"id": "0382095499", "genre": "Children's Books", "title": "Dogs (My World-Red)", "description": "A child discusses the care, feeding, handling, and training of a pet dog. Also describes ways that working dogs help people"}, {"id": "0435123459", "genre": "Children's Books", "title": "Tyso's Promise (New Windmills)", "description": "One of a series of top-quality fiction for schools. When a good-looking, tough gypsy boy runs away from his aunt and uncle, he promises to return to collect his brother and sister. Will he find a way to keep his promise, and will he manage to stay out of trouble?"}, {"id": "B06XFX4X3S", "genre": "Children's Books", "title": "Peter's Magic Fountain Pen", "description": "This is a story I originally wrote for my son as a present on his 12th birthday. That was way back in 1990. He is grown up now with children of his own.  The book was published in paperback form but has been out of print for years.  I am delighted to here bring to new readers on Amazon."}, {"id": "1514367939", "genre": "Children's Books", "title": "My Zoo Full of Friends: Blank Address Book with email and birthdays (Address Books)", "description": "This cute address book contains four addresses per page with two pages per letter. In addition to normal address fields it also contains blanks for email and birthdays. Soon your child will be addressing letters and invitations."}]