[{"id": "1442402989", "genre": "Children's Books", "title": "Creepy Pair of Underwear!", "description": "From the celebrated team behind Creepy Carrots!, Aaron Reynolds and Caldecott Honor winner Peter Brown, comes a hilarious (and just a little creepy) story of a brave rabbit and a very weird pair of underwear.Jasper Rabbit is NOT a little bunny anymore. He’s not afraid of the dark, and he’s definitely not afraid of something as silly as underwear. But when the lights go out, suddenly his new big rabbit underwear glows in the dark. A ghoulish, greenish glow. If Jasper didn’t know any better he’d say his undies were a little, well, creepy. Jasper’s not scared obviously, he’s just done with creepy underwear. But after trying everything to get rid of them, they keep coming back!"}, {"id": "1474741002", "genre": "Children's Books", "title": "Warring Gods: Immortal Battle Myths Around the World (Graphic Library: Universal Myths)", "description": "Gather round to hear of epic battles and petty feuds between gods told from ancient myths around the world! Warring Gods gathers seven diverse battle stories in one book so readers can discover the unique differences and surprising similarities between these world myths all recreated in gripping graphic novel format. Dive into legends from various mythologies and traditions, including Greek, Egyptian, Native American, Norse, and more. Extra info provides insight into the culture and primary sources from which these myths originated. With the Universal Myth series, readers can experience exciting multicultural tales brought to life!"}, {"id": "1934706892", "genre": "Children's Books", "title": "1, 2, 3", "description": "Beloved illustrator Simms Taback's bright colors and bold illustrations bring a fresh look to beginning conceptboard books in 1-2-3."}, {"id": "1410906671", "genre": "Children's Books", "title": "My Rosh Hashanah (Festivals)", "description": "No matter what religious festivals a young reader may take part in, theyre sure to love reading about all of the festivals that come to life in this new series. Each title looks at the preparations that go into each festival, what people wear, where it takes place, the food that is eaten, when it happens, who celebrates it, and why its celebrated. A case study approach is taken, following a young child as they get involved in the preparations and celebrations."}, {"id": "B074GZKXGG", "genre": "Children's Books", "title": "Gate to Hell World", "description": "It was supposed to be a fun filled getaway to Fun Planet on the moon before his father shipped out on the battleship The Far Horizon to confront the swarm of insectoid Repthogs who were invading the Fringe Worlds. But when Cody steps through the transporter gate he is sent to an unexplored world filled with alien creatures that are half animal and half plant. The only thing all the horrid creatures seem to have in common is their desire to make a meal of Cody. However, a strange indigenous humanoid tree walker, named Frick, who is also part animal and part plant, comes to Cody’s aid and saves him from a monstrous Jabberwock and the many other dangers that the stranded teenager faces on Hell World. Yet the strange pair of friends’ true adventure only starts when they locate a recently crashed colony ship of religious fanatics that believe only in the pure human form. Things get even more complicated when they also discover a swarm ship of the insectoid Repthogs. Both groups are out to destroy Frick and rest of the tree walkers on Hell World. But Cody vows to defend Frick and Hell World from both groups."}]