[{"id": "099672124X", "genre": "Children's Books", "title": "Try! Try! Try!", "description": "Kirkus Best of 2016 Try! Try! Try!\"You can roar you can hop, even slippity-slide! All you have to do is Try! Try! Try!\" Oh, it's fun to learn new things! In Lindsey Craig's new get-up-and move book TRY! TRY! TRY! children will hop with bunnies, roar with a bear, then smile to watch as animals overcome their shyness to do some very silly dancing indeed! With Lindsey Craig's musical text and Ying Hui Tan's endearing illustrations, this will soon be a favorite book.   ***Kirkus BEST BOOKS 2016   Kirkus Indie Best Books of the Month- November     "}, {"id": "1550415689", "genre": "Children's Books", "title": "On the Limit (Redline Racing)", "description": "#3 IN THE REDLINE RACING SERIES  Canadian Children's Book Centre Our Choice, 2007  There was no time to think about what to do, only to react. I braked hard, eased the Swift right, flicked left to avoid a piece of wing, then right again to miss the spinning black car. I found myself through the accident, out of the corner, and accelerating hard up to turn four.  Following the second-place finish in Milwaukee, Eddie Stewart and his race team are filled with confidence. The future looks bright as they head for Toronto and their next race. But their chief rival, Raul DaSilva, is determined to win at all costs - even if it means vandalizing Eddie's car. Now Eddie and his crew will have to test the limits of their talent and teamwork to make it to the podium."}, {"id": "1482404524", "genre": "Children's Books", "title": "20 Fun Facts About Machu Picchu (Fun Fact File: World Wonders!)", "description": "Provides information about Machu Picchu, including such facts as the lack of an Incan writing system and that the whole structure was built without mortar."}, {"id": "0750251301", "genre": "Children's Books", "title": "What Happens When You Eat? (How Your Body Works)", "description": "Well-annoted diagrams and vibrant photographs show both the internal and external workings of each system. Compares humans with animals and provides fun health tests and checks. Ideal for key stage 2 science curriculum."}, {"id": "B00J0RGOT0", "genre": "Children's Books", "title": "ANIMAL PICTURE Book For Children: My Big Animal Book,Children Books, Your Very First Picture Book: Fun, Entertaining Stories About Animals", "description": "Animal Picture Books for ChildrenWhat happens when four animals; a curious cat, a wise dog, a cooky porcupine, a hungry butterfly and, last but not least, a beautiful horse, go against the odds?These animals can't stay out of trouble, can they? In this entertaining, fun read go on a remarkable journey with Jinny, Billy, Gorge, and the rest of the gang.These are a few short stories I decided to put together for children. They are fun, entertaining pieces and are definitely great for bed time stories. My favorite one, in particular is chapter four which is called the Horse of Beauty. I have read my kids that story and I believe there is a lesson to be learned. So, enjoy and if you like these short stories please tell everyone you can about them. This will definitely inspire me to write more stories and eventually become tech savvy."}]