[{"id": "0823411141", "genre": "Children's Books", "title": "The Treasure Chest: A Chinese Tale", "description": "In southern China, with the help of a magical fish, a poor boy defeats an evil king, wins the hand of a beautiful girl, and comes to rule over an enchanted kingdom, in a colorful retelling of a Chinese folktale."}, {"id": "1542622042", "genre": "Children's Books", "title": "Charlene the Star (Charlene the Sar) (Volume 1)", "description": "Charlene the Star was born into a family of famous racehorses. Unlike her big brother, Charlie, Charlene decides she doesn’t like racing. How will she explain this to her mom? How does she show her trainers she doesn’t like racing? Will she become a model instead? Will Charlene discover her natural gift? Her career path takes many twists and turns before she finds her place to shine. You’ll love reading about Charlene’s adventures. She may surprise you with her unusual talent. Charlene the Star is first in the series of Charlene the Star books. The others are Charlene the Star and Hattie’s Heroes and Charlene the Star and Bentley Bulldog. In addition, Deanie wrote an award-winning children’s autobiography, Tails of Sweetbrier and a fictional story, Charlie the Horse."}, {"id": "0764224816", "genre": "Children's Books", "title": "Make a Wish (Hidden Diary)", "description": "Twelve-year-old Lucy and Serena agree to read one entry a week from their secret diary and then try to act it out."}, {"id": "0822504790", "genre": "Children's Books", "title": "Neil Armstrong, Space Pioneer (Achievers)", "description": "A biography of Neil Armstrong who, on July 20, 1969, as a member of the three-man Apollo 11 crew, became the first human being to walk on the moon."}, {"id": "1541904702", "genre": "Children's Books", "title": "The Assyrian and Neo-Assyrian Empire | Children's Middle Eastern History Books", "description": "How did the people from the Assyrian and Neo-Assyrian Empire live? Now is your chance to peek through the past by opening the pages of this wonderful educational resource. Learn from the lessons of the past and they will guide you to make decisions for the future. Enjoy a good read. Grab a copy of this book today!"}]