[{"id": "0516204319", "genre": "Children's Books", "title": "It Could Still Be a Robot (Rookie Read-About Science)", "description": "A simple introduction to smart machines, most of which currently do not take human form, performing tasks too dangerous, too boring, or too difficult for people to do"}, {"id": "B00U4ZRTZU", "genre": "Children's Books", "title": "Out of Synch", "description": "Thirteen-year-old Katie Phillips dreams of reaching the U.S. Synchronized Swimming National Championships. But her sports-obsessed father wants her to quit the team to focus on swimming races—real swimming, as he puts it—to earn a college scholarship like her narcissistic older brother Nick, a Florida state record holder.When Katie’s duo partner is seriously injured in a freak accident during practice, her determination to overcome her family’s lack of support is put to the test as her life unravels around her. She’s on the verge of failing math class, and her tough-as-nails swim coach is pushing her hard to qualify for states in the 200 freestyle. Then there’s the boy she can’t stop thinking about. And through it all, she wonders just what her muscle-bound brother is trying to hide about his record-setting performance two years earlier . . . ."}, {"id": "0516233556", "genre": "Children's Books", "title": "Essential Fishing for Teens (High Interest Books: Outdoor Life)", "description": "Presents information about fishing, including an explanation of the different types of fishing, the equipment needed, and safety tips."}, {"id": "1864650680", "genre": "Children's Books", "title": "Alyawarr Picture Dictionary (IAD Press Picture Dictionaries)", "description": "The Alyawarr Picture Dictionary is part of an innovative series of illustrated Aboriginal language dictionaries. This picture dictionary is a valuable resource for school children and their teachers, for Alyawarr speakers wanting to learning Alyawarr literacy, and for anyone wanting to learn about the Alyawarr language of Central Australia."}, {"id": "1787004597", "genre": "Children's Books", "title": "Cuddle the Magic Kitten Book 2: Superstar Dreams", "description": "In Superstar Dreams, Cuddle takes Olivia and Grace on an amazing adventure to a top TV talent show. Will the best friends be able to help a young girl fulfill her superstar dreams with kitten magic?"}]