[{"id": "0984309616", "genre": "Science Fiction & Fantasy", "title": "40 Winks: Stories from Slumberland", "description": "When we fall asleep does our brain jump out of our head and go on vacation? Do our family and friends throw secret parties? Is the world torn apart and recreated from scratch? Is the entire idea of sleep just a recent invention? Can one man get noticed by setting the world record for time slept? How do two troubled sleepwalkers end up as the perfect couple? What would happen if a company invented a machine to spy on our dreams? Are there really monsters under our beds? Read sleep-themed stories about love, horror, misunderstanding, discovery, exploration and more in this collection of 40 short works of fiction."}, {"id": "1543671519", "genre": "Science Fiction & Fantasy", "title": "Nightblade's Honor (Blades of the Fallen)", "description": "In the riveting sequel to Nightblade’s Vengeance, the nightblades must choose a side, and the Kingdom will either rise again…or shatter into pieces.With the realm on the brink of war, the once-celebrated blades have become an easy target for the rage of its devastated citizens. The nightblade warrior Asa’s lifelong quest for vengeance is over, but now she finds herself on the run from the people she sought to protect. As Asa forges a new course of action in an uncertain world, her path crosses with that of a young noblewoman.Mari knows that great opportunity lies in the heart of chaos. If the Kingdom is to rise again, Mari will need support, and she can think of no group better than the nightblades. But the nightblades have been betrayed before, and gaining their trust will not be easy.Mari wants to save the Kingdom. Asa wants to save the people. Both are willing to risk everything. But do their quests make them allies…or enemies?"}, {"id": "B008O5NS1Q", "genre": "Science Fiction & Fantasy", "title": "The Dark World  (with linked TOC)", "description": "World War II veteran Edward Bond's recuperation from a disastrous fighter plane crash takes a distinct turn for the weird when he encounters a giant wolf, a red witch, and the undeniable power of the need-fire, a portal to a world of magic and swordplay at once terribly new and hauntingly familiar. In the Dark World, Bond opposes the machinations of the dread lord Ganelon and his terrible retinue of werewolves, wizards, and witches, but all is not as it seems in this shadowy mirror of the real world, and Bond discovers that a part of him feels more at home here than he ever has on Earth. Dark World was a profoundly influential novel. It's mixture of science and fantasy inspired Roger Zelazny to write the Amber Chronicles. Marion Zimmer Bradly said that every novel she had ever written was because she had read Kuttner."}, {"id": "0756403596", "genre": "Science Fiction & Fantasy", "title": "1: Shadowmarch: Shadowmarch: Volume I", "description": "Shadowmarch begins Tad Williams' first epic fantasy trilogy since his best-selling Memory, Sorrow and Thorn. Rich with detail and exotic culture, and filled with a cast of characters both diverse and three-dimensional, Shadowmarch is a true fantasy achievement, an epic of storytelling by a master of the genre."}, {"id": "B00ZO7IAJC", "genre": "Science Fiction & Fantasy", "title": "Bloodlore (Cadis Trilogy Book 1)", "description": "A follow-up to the much loved Meratis Trilogy, this action adventure trilogy follows assassin Venn Connell as she fights to save her country from an enchanted army.Venn Connell is bored.When the Andvellian ambassador in Margolin goes missing, she jumps at the chance to find him, but quickly learns the mystery goes deeper than one missing courtier.With border tensions rising, a man vanishing before her eyes with a relic she believed lost, red-clad soldiers out for blood, and something dark following her from the charred ruins of Treevale fortress, Venn becomes a pawn in an unseen game. Forced to confront her past and question her future, Venn knows she has to tread carefully. One wrong move and she could lose herself in the shadows, and hurl her country into war.A follow-up to the Meratis Trilogy, the Cadis Trilogy follows Venn Connell, the sassy, blade-wielding assassin whose sharp tongue and love for adventure get her in no end of trouble. When a simple quest rolls into more action than she expects, the woman who swore never to grow attached to anyone must trust in her friends to overcome old spells, demons, and a magical war that could destroy her world."}]