[{"id": "1613830335", "genre": "Children's Books", "title": "Abracadabra!: Magic with Mouse and Mole (Mouse & Mole (Paperback))", "description": "Mouse and Mole are very excited. Minkus the Magnificent is in town--ONE SHOW ONLY!--and they can't wait to sit in the front row and see his tricks. After the abracadabras happen, though, something goes a bit wrong--and Mole is very disappointed to discover that magic is sometimes not exactly what it seems. How will Mouse help her friend realize that there is magic happening right in front of their very eyes? Wong Herbert Yee gives readers another grand adventure with two best friends, Mouse and Mole, who, despite their different outlooks on life, manage to show each other that friendship itself is a magical event!"}, {"id": "159223805X", "genre": "Children's Books", "title": "101 Things to Make and Do with Googly Eyes (101 Craft Series)", "description": "A googly eye is a small and sometimes colorful bit of plastic that spices up children’s playtime. Jam-packed with all sorts of creative ideas, this fun kit describes 101 things to make and do with googly eyes, including cool games, crafts, and amusing tricks. Young ones turn rocks into pets, transform a pair of plain sunglasses into a fashion statement, make friends out of school supplies, put a new twist on the “I spy” game, create real \"eyesores,\" and much more."}, {"id": "B0055UP87U", "genre": "Children's Books", "title": "What The Fox Learnt (Illustrated) (Four Fables from Aesop)", "description": "Four fox tales from Aesop's fables presented with modern illustrations: The Fox and the Crow, The Fox and the Goat, The Fox and the Grapes and The Fox and the Cat. These are short stories that are fun and easy to read. Each story is summarized with a moral that you might have even heard of."}, {"id": "1502342243", "genre": "Children's Books", "title": "Boy Does Electricity Glow!: A Conservation Story (Conservation Series) (Volume 3)", "description": "Boy Does Electricity Glow! A beautifully illustrated picture story about how two brothers unite to conserve electricity, helping to save the world’s resources. The story tackles a serious environmental concern and helps the reader see how easy it is to make an impact, reducing the amount of electricity each person uses in his or her daily life. The tale walks the reader through examples in which children avoid waste and become environmentally conscious. Recommended for reading ages 3-7 years."}, {"id": "0545034183", "genre": "Children's Books", "title": "Go, Diego, Go!", "description": "Learn to read with Diego and his friends as they rescue animals in this phonics box set!Based on the best research on how children develop reading skills, this phonics box set introduces a carefully selected progression of letter sounds, starting with the easiest and most common. Each story helps build a young reader's confidence with repeated examples of the letter sounds being focused on, as well as \"words to learn\" and \"words to sound out.\" This phonics box set will readily appeal to Diego's audience of beginning readers as they capture all of the familiar elements from Diego's hit TV show, including his fantastic exotic animal rescues."}]