[{"id": "B00I0IN5MY", "genre": "Children's Books", "title": "The Insect Folk - Illustrated", "description": "Through delightful outings with her students, a teacher introduces her class to the fascinating world of insects. She encourages her students to observe and ask questions. This is a wonderful science text about insects that is illustrated and  for young children."}, {"id": "1422207420", "genre": "Children's Books", "title": "Johnny Depp (Sharing the American Dream: Overcoming Adversity)", "description": "Presents the life and career of the award-winning actor known for his roles on the television series \"21 Jump Street\" and in such films as \"Edward Scissorhands,\" the \"Pirates of the Caribbean\" trilogy, and \"Sweeney Todd.\""}, {"id": "0375822658", "genre": "Children's Books", "title": "Junie B. Jones's Second Boxed Set Ever! (Books 5-8)", "description": "Barbara Park’s #1 New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for more than twenty years. Over 60 million copies in print and now with a bright new look for a new generation! Meet the World’s Funniest Kindergartner—Junie B. Jones! Books in this set include: Junie B. Jones and the Yucky Blucky Fruitcake (#5), Junie B. Jones and That Meanie Jim's Birthday (#6), Junie B. Jones Loves Handsome Warren (#7), Junie B. Jones Has a Monster Under Her Bed (#8).USA Today:“Junie B. is the darling of the young-reader set.” Publishers Weekly:“Park convinces beginning readers that Junie B.—and reading—are lots of fun.”  Kirkus Reviews:“Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”  Time:“Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”"}, {"id": "0769652727", "genre": "Children's Books", "title": "Goldilocks and the Three Bears", "description": "     Presenting a Picture Board Book perfect for babies and toddlers!     An excellent platform for early learning, this sturdy, oversized board book features larger-than life illustrations in vibrant colors with large, easy-to-read text.     This ageless fairy tale classic is now available in an oversized board book! Papa, Mama, and Baby Bear are in for quite a surprise when they return home to find that a nosy, young flaxen-haired girl has boldly made herself at home in their cottage.     Our Picture Board Book series features over 12 amazing titles that children will love to read over and over again! The oversized, sturdy format is perfect for little ones to play and learn with. Check out the other titles in this wonderful series!   "}, {"id": "B00AXOP7MY", "genre": "Children's Books", "title": "Princesses Don't Get Fat", "description": "*Now including bonus chapter, \"Princes Don't Bake.\"A fairy tale romance with a plus-sized heroine and plenty of dessert.Princess Valeria of Amaranta is fat, but she doesn’t care. All she wants to do is to eat and lead an idle life. When it becomes apparent she cannot get a husband, her mother decides to send her to the Royal Riviera Academy of Fighting Arts. For a chubby princess who has never picked up a sword, life at the Academy is torture. Worst of all, the food is terrible.Valeria decides to improve Rivieran cuisine by sneaking into the palace kitchens and offering her expertise, never expecting the crown prince would take interest in her kitchen excursions. As they spend more time together, the princess must decide whether she should become thin or stay in the kitchens with her beloved desserts and remain fat."}]