[{"id": "1515741583", "genre": "Children's Books", "title": "Gross Facts About Vikings (Gross History)", "description": "From smelly ships to violent wars and icky battle wounds, life was rough for Vikings. Get ready to explore the nasty side of Viking life."}, {"id": "0395938473", "genre": "Children's Books", "title": "The New Way Things Work", "description": "The information age is upon us, baffling us with thousands of complicated state-of-the-art technologies. To help make sense of the computer age, David Macaulay brings us The New Way Things Work. This completely updated and expanded edition describes twelve new machines and includes more than seventy new pages detailing the latest innovations. With an entirely new section that guides us through the complicated world of digital machinery, where masses of electronic information can be squeezed onto a single tiny microchip, this revised edition embraces all of the newest developments, from cars to watches. Each scientific principle is brilliantly explained--with the help of a charming, if rather slow-witted, woolly mammoth."}, {"id": "1682750027", "genre": "Children's Books", "title": "Colonial Comics, Volume II: New England, 1750–1775", "description": "A massacre in Boston. A tea party. A shot heard around the world. But who was the first casualty of the massacre? How did the tea get to Boston Harbor? What was the Battle of Concord like for a Minute Man? Colonial Comics: New England, 1750–1775 expands the frame of this important period of American history. Unconventional characters come to life, including gravedigging medical students, counterfeiters, female playwrights, instigators of civil disobedience, newspaper editors, college students, rum traders, freemen, and slaves. "}, {"id": "0694012173", "genre": "Children's Books", "title": "Dreidel, Dreidel, Dreidel Board Book", "description": "Celebrate the Feast of Lights with a festive game of \"Dreidel, Dreidel, Dreidel.\" Press the button and sing along to this joyful Hanukkah tune."}, {"id": "0140903895", "genre": "Children's Books", "title": "Tell Madonna I'm at Lunch (Fantail)", "description": "Ever wondered how to write a best-selling novel, be a pop star or movie personality? This guide shows you how. Using comic strip-style illustrations, the book shows fans how to attract fans of their own."}]