[{"id": "1897550057", "genre": "Children's Books", "title": "Piglets Don't Watch Television (Abby and Tess Pet-Sitters)", "description": "When Ms. Fitzpatrick calls about needing a pet-sitter for \"Prissy,\" Abby hears barking in the background. Alas, it turns out that Prissy is not a dog, but a pot-bellied pig-and she is definitely not an ordinary pet! Trina Wiebe lives in Invermere, British Columbia, and is the author of the Abby and Tess Pet-Sitters series and the Max-a-Million series. Combined, these books have sold over 65,000 copies worldwide and have been translated into five languages.        "}, {"id": "0763694886", "genre": "Children's Books", "title": "Shake the Tree!: a minibombo book", "description": "There's a whole lot of shaking going on — and a funny final twist — as a series of hungry animals seek shelter in an obliging tree.Mouse spots a nut high up in a tree. \"Mmm,\" she says. \"I'm going to gobble that up!\" So she shakes the tree a little to the right, and she shakes the tree a little to the left. But it isn't the nut that falls from the tree, it's Fox, who thinks that Mouse looks pretty tasty! Soon a warthog and then a bear come along with similar ideas. Little readers will enjoy the just-made-it escapes (and be happy to get in on the shaking action), only to laugh out loud when their expectations are foiled at the end."}, {"id": "B00AKN1O2K", "genre": "Children's Books", "title": "The Blocked Train (Children's fiction for railroad and train)", "description": "The Blocked TrainBy Joseph SwainThe great 1882 children fiction about the country life relationship in the family.  Retold story in the winter of snowing weather.  **This kindle edition is scanned from the original hardcover book."}, {"id": "1849410410", "genre": "Children's Books", "title": "Little Red Train's Race to the Finish", "description": "The nasty Swish Train drivers have challenged Duffy and Jack to a race. The winner gets to keep the Little Red Train’s very last route! When the flag goes down, the Swish Train speeds straight out of sight, but there’s worse to come…"}, {"id": "B01766LCA2", "genre": "Children's Books", "title": "Charlie Plays Ball (Charlie the Ranch Dog)", "description": "For Charlie, it's hard work being King of the Ranch. There's napping to do, food to taste, and car rides to take-it's downright exhausting! But it's not all work-there's a lot of play too!There's always a game to join and a goal to score. From football to soccer to basketball, Charlie is ready to jump in and lend a paw to help the underdogs get the winning point. While Charlie may be an all-star on the field, when it comes to his favorite kind of ball, he has to wait until dinnertime. And at the table, Charlie is the MVP!Ree Drummond—The Pioneer Woman herself—delivers a slam dunk with this hilarious new story about Charlie—a basset hound who is truly in a league of his own."}]