[{"id": "B005Q18AAU", "genre": "Science Fiction & Fantasy", "title": "The Burn", "description": "The Burn is full of nuclear fallout, roving gangs, anarchy, unreliable plumbing. That's what Terra's father tells her. She has lived her whole life in comfort in a colony at the bottom of the Pacific Ocean. She hates it. And she would pay any price to leave. But when Terra finally escapes the colony, she finds out her father is right. She finds a group of survivors that quickly become friends, and every day with them is a race for survival. But then she witnesses and commits unspeakable acts, and she must decide where her loyalty lies: with the colony she despises or The Burn, where every day is filled with nightmares."}, {"id": "0399586237", "genre": "Science Fiction & Fantasy", "title": "Black Chamber (A novel of an alternate World War I)", "description": "The first novel in a brand-new alternate history series where Teddy Roosevelt is president for a second time right before WWI breaks out, and on his side is the Black Chamber, a secret spy network watching America's back.In 1912, just months before the election, President Taft dies suddenly, and Teddy Roosevelt wastes no time in grabbing power as he wins another term as president. By force of will, he ushers the United States into a new, progressive era with the help of the Black Chamber the mysterious spy organization, watching his back.Luz O'Malley--a brilliant, deadly, and young Cuban Irish American agent of the Black Chamber--heads to Germany. She's on a luxury airship swarming with agents of every power on earth, as well as conspirators from the Mexican Revolutionary Party and the sinister underground of the reborn Ku Klux Klan, yet none know her true identity.Her anonymity will be essential as she strives to gain the secrets of Project Loki, an alarming German plan that Roosevelt fears will drag the U.S. into a world war. To gather this intelligence, Luz will have to deceive the handsome yet ruthless Baron Horst von Duckler. She, along with naive Irish-American Ciara Whelan, has to get this vital information back to the U.S.--or millions of lives will be lost."}, {"id": "B002NVQHKQ", "genre": "Science Fiction & Fantasy", "title": "Darkfever Unabridged on 8 CDs [Fever Series #1]", "description": "MacKayla Lane's life is good. She has great friends, a decent job, and a car that breaks down only every other week or so. In other words, she's your perfectly ordinary twenty-first-century woman.\n\nOr so she thinks...until something extraordinary happens.\n\nWhen her sister is murdered, leaving a single clue to her death - a cryptic message on Mac's cell phone - Mac journeys to Ireland in search of answers. The quest to find her sister's killer draws her into a shadowy realm where nothing is as it seems, where good and evil wear the same treacherously seductive mask. She is soon faced with an even greater challenge: staying alive long enough to learn how to handle a power she had no idea she possessed - a gift that allows her to see beyond the world of man, into the dangerous realm of the Fae...\n\nAs Mac delves deeper into the mystery of her sister's death, her every move is shadowed by the dark, mysterious Jericho, a man with no past and only mockery for a future. As she begins to close in on the truth, the ruthless Vlane - an alpha Fae who makes sex an addiction for human women - closes in on her. And as the boundary between worlds begins to crumble, Mac's true mission becomes clear: find the elusive Sinsar Dubh before someone else claims the all-powerful Dark Book - because whoever gets to it first holds nothing less than complete control of the very fabric of both worlds in their hands..."}, {"id": "1887801588", "genre": "Science Fiction & Fantasy", "title": "Hedge Magic (Ars Magica) (Ars Magica Series)", "description": "Hedge Magic features four non-Hermetic magical traditions of Mythic Europe. The Cunning-folk live close to the land, crafting charms, banes, and potions. Natural Magicians study the classical works of antiquity, unearthing new secrets of formulae and ritual. Spirit Masters call magical beings of diverse sorts, bargaining with them for powerful services. Finally, Ascetics, through meditation and austerity, are able to take their minds and bodies beyond the limits of the mundane world. Whether these new traditions are used by players to create exciting new characters, or storyguides to provide unforeseen challenges, one thing is certain: With these new inhabitants, Mythic Europe will never be the same."}, {"id": "B076V9JHDX", "genre": "Science Fiction & Fantasy", "title": "The Mermaid Trials", "description": " Losing is dangerous. Winning means everything.Katriana has been waiting for this moment her entire life.Once a century, the Royals hold the Trials. Every Mer of a certain age must participate. The contests are brutal. Survival is not guaranteed. But for the victors, the prize is unimaginable.They are allowed to walk on land.She is forced to work for her evil stepmother, while ignoring the taunts of her spoiled half-sister. She’s desperate to escape. So desperate, she begins the Trials without armor, or even a helmet.Not one to give up, Katriana gives the Trials all she is worth, even catching the eye of a mysterious benefactor who is more than he seems.How much will she sacrifice to become one of the elite? And if she does win, will she be able to halt mankind’s destruction of the sea?The Mermaid Trials is a new series from author Cameron Drake."}]