[{"id": "0316557315", "genre": "Children's Books", "title": "My Little Pony: 5-Minute Stories", "description": "Join Pinkie Pie as she remembers the adventures she had with her best friends in Equestria in this scrapbook she made for the royal baby Flurry Heart. Discover the magic behind cutie marks, the history of Hearth's Warming Eve, and so much more. Every one of these stories is perfect for reading aloud in just 5 minutes. ©2017 Hasbro. All Rights Reserved."}, {"id": "0521407087", "genre": "Children's Books", "title": "Medieval Britain: Conquest and Power (Cambridge History Programme Key Stage 3)", "description": "The major transition in British society that occurred during the Middle Ages is analyzed from four different perspectives that explore the period's power struggles, economic aspects, ideas and beliefs and medieval culture."}, {"id": "B01L9DJERQ", "genre": "Children's Books", "title": "How I Discovered Poetry (Ala Notable Children's Books. Older Readers)", "description": "A powerful and thought-provoking Civil Rights era memoir from one of America’s most celebrated poets. Looking back on her childhood in the 1950s, Newbery Honor winner and National Book Award finalist Marilyn Nelson tells the story of her development as an artist and young woman through fifty eye-opening poems. Readers are given an intimate portrait of her growing self-awareness and artistic inspiration along with a larger view of the world around her: racial tensions, the Cold War era, and the first stirrings of the feminist movement. A first-person account of African-American history, this is a book to study, discuss, and treasure."}, {"id": "1537324292", "genre": "Children's Books", "title": "God Is Near", "description": "Rigley had Annabelle's heart as soon as he jumped into her lap and kissed her on the nose. This adorable bunny brings the story behind the story of the redbird. God Is Near engages the imagination with a charming story showing how God speaks His message of love through His creation. Using signs and wonders, God teaches children that He walks with them through sadness, loneliness, or whatever life brings their way. He shows how He hears and answers prayers, but most of all, He assures children that they will never be alone because He is always near."}, {"id": "0618574948", "genre": "Children's Books", "title": "The Fellowship of the Ring: Being the First Part of The Lord of the Rings", "description": "The Lord of the Rings, J.R.R. Tolkien's three-volume epic, is set in the imaginary world of Middle-earth - home to many strange beings, and most notably hobbits, a peace-loving \"little people,\" cheerful and shy. Since its original British publication in 1954-55, the saga has entranced readers of all ages. It is at once a classic myth and a modern fairy tale. Critic Michael Straight has hailed it as one of the \"very few works of genius in recent literature.\" Middle-earth is a world receptive to poets, scholars, children, and all other people of good will. Donald Barr has described it as \"a scrubbed morning world, and a ringing nightmare world...especially sunlit, and shadowed by perils very fundamental, of a peculiarly uncompounded darkness.\" The story of ths world is one of high and heroic adventure. Barr compared it to Beowulf, C.S. Lewis to Orlando Furioso, W.H. Auden to The Thirty-nine Steps. In fact the saga is sui generis - a triumph of imagination which springs to life within its own framework and on its own terms."}]