[{"id": "083682945X", "genre": "Children's Books", "title": "1960s: Space and Time (20th Century Science & Technology)", "description": "Presents a decade-by-decade account of the scientific and technological progress that included space travel and the use of plastics."}, {"id": "1565655141", "genre": "Children's Books", "title": "Kidsource: Science Fair Handbook", "description": "Provides information on choosing and planning a science fair project, finding and using resources, applying scientific principles, and delivering the final project"}, {"id": "0060574186", "genre": "Children's Books", "title": "The Berenstain Bears: All Aboard! (I Can Read Level 1)", "description": "The Bears are on a steam train trip across Bear Country. Mama and Papa enjoy the scenery, but the cubs want to learn about the train. If they are lucky, Grizzly Jones might let them blow the whistle. Woo-hoo!Beginning readers will feel like they are on board with the Bear family as they pass new sights and find out all about how the train runs."}, {"id": "B01B6HGIOW", "genre": "Children's Books", "title": "The Doomsday Shroud (The Demon Conspiracy Book 2)", "description": "Trouble continues for Kelly and Travis Bishop. Their older brother, Jon, runs away to New York City, the nation embraces Majik Juice, and the American Security Administration makes house calls at two in the morning. The good news? An assassin thinks he can save humanity from injustice. The bad news? Demons have discovered the perfect lure to get Kelly back into Pandora’s Cave. The Doomsday Shroud is Book 2 of The Demon Conspiracy Series, an original series of apocalyptic thriller novels.  If you like nightmares, conspiratorial thinking, deep mystery and unforgettable characters who are forced to the frontlines of a terrible struggle, then you’ll love R. L. Gemmill’s brilliantly visual look at the doom of modern civilization.  Fans of Harry Potter, Divergent, The Hunger Games and Miss Peregrine’s Peculiar Children will love The Demon Conspiracy Series!  Face the terror TODAY!READ WITH CAUTION!"}, {"id": "B00G675GR8", "genre": "Children's Books", "title": "Quokka! A Kids Animal Book: Learn Amazing Fun Facts &  Pictures about Quokka - A Cute Furry Animal from Australia", "description": "The Quokka is truly an amazing little animal that we can proudly say it is exclusive to Australia. They are very special creatures that you are going to have a lot of fun learning about. They can be extremely crafty in the way they create trails and they are very friendly to people. All the information you will learn here is going to turn you into a Quokka expert!If you wanted to learn about Quokka, this is the right place to be. This book is suitable for children age 5 and older. On the other hand, younger children can enjoy the pictures while the parent read to them. So sit back and get ready to enjoy a nice read about these interesting and beautiful animal!Get this book at this special price exclusive to the Amazon Store."}]