[{"id": "1481461311", "genre": "Children's Books", "title": "Pocket Full of Colors: The Magical World of Mary Blair, Disney Artist Extraordinaire", "description": "Amy Guglielmo, Jacqueline Tourville, and Brigette Barrager team up to tell the joyful and unique story of the trailblazing Disney artist Mary Blair.Mary Blair lived her life in color: vivid, wild color. From her imaginative childhood to her career as an illustrator, designer, and animator for Walt Disney Studios, Mary wouldn’t play by the rules. At a time when studios wanted to hire men and think in black and white, Mary painted twinkling emerald skies, peach giraffes with tangerine spots, and magenta horses that could fly. She painted her world."}, {"id": "1481460501", "genre": "Children's Books", "title": "Living in . . . Mexico", "description": "Discover what it’s like to grow up in Mexico with this fascinating, nonfiction Level 2 Ready-to-Read, part of a new series all about kids just like you in countries around the world!¡Hola! My name is Rosa, and I’m a kid just like you living in Mexico. Mexico is a country filled with beautiful art, incredible ancient ruins, and gorgeous beaches, rainforests, and deserts! Have you ever wondered what Mexico is like? Come along with me to find out! Each book in our new Living in… series is narrated by a kid growing up in their home country and is filled with fresh, modern illustrations as well as loads of history, geography, and cultural goodies that fit perfectly into Common Core standards. Join kids from all over the world on a globe-trotting adventure with the Living in… series—sure to be a hit with children, parents, educators, and librarians alike!"}, {"id": "0756613825", "genre": "Children's Books", "title": "DK Eyewitness Books: Ancient China", "description": "Photographs and artwork chronicle three thousand years of Chinese history, from the earliest dynasty to the twentieth century, and examine some of the contributions China has made to the world."}, {"id": "1891839144", "genre": "Children's Books", "title": "Bright Star: The Story of an African King", "description": "This is the story of a king named Njoya [enjoy-ah], who ruled the small African kingdom of Bamum in the grasslands of Cameroon at the turn of the twentieth century. When the German colonial army marched into his kingdom, Njoya had to find a way to help his people maintain their identity—and their dignity—in the face of great change. In the entire history of Mankind, there have been few leaders like Njoya. He created a writing system, built schools, and fostered art, business, and agriculture. James Rumford, with the rich browns of the gourd pictures of Africa, tells this triumphant story and how in the worst of times, like a star in the darkest of nights, there was man who shone even more brightly."}, {"id": "B0194112F2", "genre": "Children's Books", "title": "Forward: My Story Young Readers' Edition", "description": "Abby Wambach has always pushed the limits of what is possible. Named by Time magazine as one of the most influential people of 2015, the iconic soccer player captured the nation’s heart when she led her team to its recent World Cup Championship. Admired for her fearlessness and passion, Abby is a vocal advocate for women’s rights and equal opportunity, pushing to translate the success of her team to the real world. She has become a heavily requested speaker to a wide a range of audiences, from college students to executives at Fortune 500 companies.In this edition of Forward that’s been adapted for young readers, Abby recounts her own decisions, wins, losses, and the pivotal moments that helped her become the world class athlete and leader she is today. Wambach’s book goes beyond the soccer field to reveal a soulful person grappling with universal questions about how we can live our best lives and become our truest selves. Written with honesty and heart, Forward is an inspiring blueprint for individual growth and a rousing call to action."}]