[{"id": "B077SBCVYS", "genre": "Science Fiction & Fantasy", "title": "Hidden Revolt (The Artifice Mage Saga Book 3)", "description": "Welcome to the revolution. Fire up the dragons!The Iron Empire is ripe for revolt. The guilds are repressive, the price of dragon rum and steaks are soaring, and the mage menace spreads unchecked. Resentment builds. One day a young hero clanks into the capital and promises to kick the imperial palace to rubble.Devin, more artifice than mage with his mechanical foot, returns to the empire, his nemesis Captain Vice in hot pursuit. The firebrand mage stirs the passions of imperial citizens under the guise of dragon conservation. We are all like slabs of dragon flesh: once powerful and mighty, but the empire bleeds us until nothing remains but bones and ruptured organs. The message resonates. A rebellion is born in secrecy and treachery. Beneath their cloaks of lies and shifting alliances, mages, gentry, and commoners alike reach for the mantle of the butchered dragon while Captain Vice's iron fist slowly closes around them.Rise up and smash the state in Book Three of The Artifice Mage Saga. Join the fantasy steampunk brawl of metal vs. magic where sorcery is bloody, science is greasy, and nobody's hands are clean."}, {"id": "B075PQ41KX", "genre": "Science Fiction & Fantasy", "title": "The Chronicles of Nether (Nether Chronicles Book 1)", "description": "Witness a tale unfold before your very eyes. In the land of Nether, a magical world where magic is alive and real. A land where heroes rise and monsters fall. Where mystery and untold truths lurk beneath the surface. After all the world of Nether is a magical place, even so magic is not embraced by all. In truth people fear magic and magical creatures save for the brave men and woman who train to defend the land from their vile evil.And Trent is one such brave young man, well at least he tries to be. Trent Bartholomew Albinus the 3rd a student at the heroic Gilgamesh academy faces the everyday challenges one might expect a warrior in training to face. As well as challenges that not even he was expecting.This is the story of his journey. This is Trent’s chronicles.A tale of magic, self-discovery and most importantly dragons. Join Trent on his journey and witness the Chronicles of Nether."}, {"id": "0316385239", "genre": "Science Fiction & Fantasy", "title": "No Game No Life, Vol. 5 - light novel", "description": "In the world of Disboard, everything is decided by games. Since arriving in this strange place, genius gamer siblings Sora and Shiro have risen to become king and queen of what's left of Disboard's humans. Their latest challenge is winning an unwinnable romance game against the races of Dhampir and Siren. To uncover the true strategy to beat this sadistic game of love, they head for the home of the angelic Flügel: the midair city of Avant Heim. But the Flügel are a hideously powerful race, created specifically to kill gods. Will things really go as planned?"}, {"id": "1905176074", "genre": "Science Fiction & Fantasy", "title": "WARS Incursion (Wars RPG)", "description": "WARS is about energy, power, conflict and the mysterious quantum effects of The Mumon Rift. In the 24th Century, escalating warfare among three human factions in Earth’s Solar System increases dramatically when a new planet appears and two warring alien races attempt to take over the universe. WARS Incursion is the first supplementary source book for the exciting new science fiction roleplaying game, WARS. Packed with exciting and intriguing new adventures for WARS players, the WARS Incursion book is certain to prove popular, particularly as its release coincides with the core rulebook."}, {"id": "B00BS930PY", "genre": "Science Fiction & Fantasy", "title": "The Eyes Have It: Short Story", "description": "A smart play on common English idioms, “The Eyes Have It” tells of a narrator who discovers hidden references to an invading alien race between the covers of his paperback book.Philip K. Dick was an American science-fiction novelist, short-story writer and essayist. His first short story, “Beyond Lies the Wub,” was published shortly after his high school graduation. Some of his most famous short stories were adapted for film, including “The Minority Report,” “Paycheck,” “Second Variety” (adapted into the film Screamers) and “We Can Remember It For You Wholesale” (adapted into the film Total Recall).HarperCollins brings great works of literature to life in digital format, upholding the highest standards in ebook production and celebrating reading in all its forms. Look for more titles in the HarperCollins short-stories collection to build your digital library."}]