[{"id": "150642192X", "genre": "Children's Books", "title": "The Life of Martin Luther: A Pop-Up Book", "description": "The story of Martin Luther and his role in sparking the Protestant Reformation is given an interactive retelling in this beautiful and sturdy pop-up book. From Luther's decision to become a monk to his 95 theses, history jumps off the page through the vibrant, colorful illustrations of renowned artist and paper engineer Agostino Traini. Full of surprising details, this book will have kids coming back again and again to learn about this fascinating chapter in the history of the Christian faith. Published in time for the 500th anniversary of the Reformation, The Life of Martin Luther is also an excellent gift for anyone with an interest in the history of the Christian church.Scholars disagree on some aspects of Martin Luther's biography. In this book for children, we've chosen to tell the popular version of Luther's life story, while also drawing on the expertise of historians.\"A useful choice for Sunday school and one-on-one reading at home\" --School Library Journal\"Traini's cheerful cartooning keeps the mood upbeat, even when Luther's beliefs caused him trouble.\" --Publishers Weekly"}, {"id": "1400101190", "genre": "Children's Books", "title": "Aesop's Fables", "description": "By their nature, \"fables\" are \"fabulous\", larger than life, the characters often using wit and guile to save themselves from circumstances. Thus Brer Rabbit is more than a bunny in a briar patch, just as Mowgli is more than a wolf child. Aesop, an ancient Greek poet who was sold into slavery in the early sixth century B.C, relied on animal stories to convey his key points to his masters in court. AESOP'S FABLES are now classic, memorable morality plays in which amusing animal characters drive home thought-provoking morals to generations of listeners and modern day readers. They illustrate what was fundamental to Greek culture yet their appeal lies in logic we still understand. Fables from different cultures frequently overlap in the lessons they teach. If we would only stop to listen, there is an important lesson for us to learn from these fables; mankind is one, not several."}, {"id": "B00LRIUB3K", "genre": "Children's Books", "title": "Aaron Has a Lazy Day (Step into Reading)", "description": "P. D. Eastman’s classic character Aaron the Alligator makes his early-reader debut! On this lazy day, Aaron is hot, tired, and hungry—perhaps a nice, juicy lemon will taste good? Blech! Lemons are not good to eat! Follow daffy Aaron as his hazy, lazy day becomes less lazy and more crazy! Young readers will giggle along as they tackle the simple words and sentences all on their own. Aaron the Alligator is a star of The Cat in the Hat Beginner Book Dictionary and a long-out-of-print series called Everything Happens to Aaron.   Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story."}, {"id": "B00TWODYJY", "genre": "Children's Books", "title": "Fox and the Goat  Children's Picture Book English-Arabic (Bilingual Edition)", "description": "Short story about a fox and a goat. The story follows fox looking for water and a goat the fox interacts with.Based on the fable by Aesop with word usage of verbs run, walk, and jump."}, {"id": "0606360425", "genre": "Children's Books", "title": "World's Scariest Prisons (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Featuring photos and stories from the world's scariest prisons, discover why prison is to be avoided at all costs! World's Scariest Prisons will explore the most terrifying prisons of all time. From the Roman Coliseum to the Bastille, the Tower of London to Alcatraz, World's Scariest Prisons will captivate young readers! Each prison will receive its own photo-intensive overview as well as a sidebar, a break-out fact box, and a quote. Each prison profile will be followed by a feature spread that explores high-interest topics such as prison slang, prison clothes, and prison food, as well as little known details about kids in prison, famous escapees, and ghost stories. World's Scariest Prisons will be equal parts informative and fun. Perfect for reluctant readers, the text will be simple and engaging."}]