[{"id": "1597809160", "genre": "Science Fiction & Fantasy", "title": "Bash Bash Revolution", "description": "A compelling coming-of-age artificial intelligence novel from Philip K. Dick Award-nominated author Douglas Lain.  Seventeen-year-old Matthew Munson is ranked thirteenth in the state in Bash Bash Revolution, an outdated video game from 2002 that, in 2017, is still getting tournament play. He’s a high school dropout who still lives at home with his mom, doing little but gaming and moping. That is, until Matthew’s dad turns up again.  Jeffrey Munson is a computer geek who’d left home eight years earlier to work on a top secret military project. Jeff has been a sporadic presence in Matthew’s life, and much to his son’s displeasure insists on bonding over video games. The two start entering local tournaments together, where Jeff shows astonishing aptitude for Bash Bash Revolution in particular.  Then, as abruptly as he appeared, Matthew’s father disappears again, just as he was beginning to let Jeff back into his life.  The betrayal is life-shattering, and Matthew decides to give chase, in the process discovering the true nature of the government-sponsored artificial intelligence program his father has been involved in. Told as a series of conversations between Matthew and his father’s artificial intelligence program, Bash Bash Revolution is a wildly original novel of apocalypse and revolution, as well as a poignant story of broken family."}, {"id": "B01CO65KUM", "genre": "Science Fiction & Fantasy", "title": "Hunted (Alex Beckett #1)", "description": "The year is 2201, but utopia is distant memory. Earth's population is a fraction of what it was, following a long war with an alien race, who left as unexpectedly as they arrived. War veteran Alexandra Beckett makes a living putting her knife skills to use as a tracker, a hunter for hire in a dangerous new world of large mutated beasts. Beautiful, fierce and deadly, she unwittingly attracts the attention of secret cabal of powerful people who mean to use her gifts for their own ends. The hunter is now the hunted."}, {"id": "B01MQ479MT", "genre": "Science Fiction & Fantasy", "title": "Maximum Ride (9 Book Series)", "description": "From Book 1: In James Patterson's blockbuster series, fourteen-year-old Maximum Ride, better known as Max, knows what it's like to soar above the world. She and all the members of the \"flock\"--Fang, Iggy, Nudge, Gasman and Angel--are just like ordinary kids--only they have wings and can fly. It may seem like a dream come true to some, but their lives can morph into a living nightmare at any time...like when Angel, the youngest member of the flock, is kidnapped and taken back to the \"School\" where she and the others were experimented on by a crew of wack jobs. Her friends brave a journey to blazing hot Death Valley, CA, to save Angel, but soon enough, they find themselves in yet another nightmare--this one involving fighting off the half-human, half-wolf \"Erasers\" in New York City. Whether in the treetops of Central Park or in the bowels of the Manhattan subway system, Max and her adopted family take the ride of their lives. Along the way Max discovers from her old friend and father-figure Jeb--now her betrayed and greatest enemy--that her purpose is save the world--but can she?"}, {"id": "1556345895", "genre": "Science Fiction & Fantasy", "title": "GURPS Cliffhangers", "description": "Background material on the world of the 1920s and '30s. Rules and guidelines for generating characters with the style and stamina for cliffhanging adventures. Campaign and adventure seeds, including suggestions on adding the cliffhanging style to other genres. Sample characters, both dashing heroes and dastardly villains."}, {"id": "B074LV4CS2", "genre": "Science Fiction & Fantasy", "title": "Originators (Netherspace #2)", "description": "Contact with an alien race, the Gliese, has been made, but communication is impossible. There is trade, but on seemingly inexplicable terms; anti-gravity technology was traded for a bicycle tyre. As we begin to colonize the stars, we're still dependant on the mysterious aliens who we still do not understand. It falls upon the unlikely team of a conceptual artist, Marc, and assassin, Kara, to embark on a mission that will unearth the mystery of the Gliese."}]