[{"id": "1410908720", "genre": "Children's Books", "title": "On Safari (Let’s Get Moving)", "description": "Have you ever wanted to experience the excitement of a safari trip? Now you can! This series will encourage young children to take part in physical activity by taking them on an imaginary journey through a variety of exciting locations. For each step of the journey the child will be encouraged to mimic plants or animals, e,g, swimming like an octopus, jumping like a kangaroo, or swaying like a palm tree. The journeys are illustrated by photos of typical plants and animals that might be seen in the habitat."}, {"id": "0635005549", "genre": "Children's Books", "title": "North Carolina Survivor: A Classroom Challenge! (3) (North Carolina Experience)", "description": "The Survivor GameBook is reproducible and allows kids to learn about their state through timed activities, prize suggestions and an official survivor certificate. The book includes timed, multiple-choice questions, fill in the blank questions, choose the appropriate dates and matching that are challenging and fun to answer. This book covers fascinating state facts and meets state standards."}, {"id": "0736865012", "genre": "Children's Books", "title": "William Penn: Founder of Pennsylvania (Graphic Biographies)", "description": "Tells the story of Quaker leader William Penn, founder of the Pennsylvania Colony, whose ideas about government influenced the U.S. Constitution. Written in graphic-novel format."}, {"id": "1583402225", "genre": "Children's Books", "title": "The Buddha and Buddhism (Great Religious Leaders)", "description": "An introduction to the life of the Indian Prince Siddhartha Gautama, who founded Buddhism in about 531 B.C. and became known as Buddha."}, {"id": "1426324049", "genre": "Children's Books", "title": "National Geographic Kids Funny Fill-In: My Gold Medal Adventure (NG Kids Funny Fill In)", "description": "Do you love sports? Are you excited for the 2016 Olympic games? Here's an activity book that puts you right at the center of the gold-medal action! Fill in the blanks as you and a friend try your best at gymnastics, synchronized swimming, and much more!"}]