[{"id": "0996215204", "genre": "Children's Books", "title": "Bonnie, Our Backyard Bunny", "description": "Bonnie, Our Backyard Bunny is a based-on-truth tale about a rabbit, her world, and her gratitude for it. The tale conveys a sense of place in the natural world to children, as well a sense of safety and \"rightness\". Bonnie was born from an oral storytelling by an environmental educator and storyteller. The story then engaged one of Cuba's most well-known and best loved artists, who offered to illustrate the book because his work shares the same mission: to convey that everything in the world has a place, and everything fits together. The work is a collaboration across cultures. It will be published in Spanish."}, {"id": "0794519989", "genre": "Children's Books", "title": "Jobs People Do: Combined Volume", "description": "Enables young readers to find out what Daisy the doctor, Fred the firefighter, Sam the chef, Vicky the vet, Frank the farmer, and Tessa the teacher do all day at work."}, {"id": "B01M5GWH2B", "genre": "Children's Books", "title": "Brick by Brick: A Snippet of the Life of Booker T. Washington", "description": "A children's book snippet about the life, accomplishments, and achievements of the great Booker T. Washington - an inspirational African-American innovator, leader, scholar, and philanthropist."}, {"id": "1546428372", "genre": "Children's Books", "title": "The 9 Lives of Kitty Cat", "description": "Enjoy this humorous story of Joey and his Kitty Cat as Kitty Cat learns how to be safe after experiencing 8 accidents. Excellent story which teaches young children how to be aware of their surroundings and how to be safe."}, {"id": "1979889481", "genre": "Children's Books", "title": "Daily Planner Book Notebook: Day Plan, To do List, Office Work Agenda, Journal Book, Student School Schedule, Fitness & Health Workout Note, Business Daily Goal, Success Life Organizer 60 Pages", "description": "Daily Planner Book Notebook: Day Plan, To do List, Office Work Agenda, Journal Book, Student School Schedule, Fitness & Health Workout Note, Business Daily Goal, Success Life Organize to review your progress on your business, set your daily agenda, prioritize your tasks of the day. Focus on achieving your business goals you have set for yourself."}]