[{"id": "B00Z7BRMP8", "genre": "Science Fiction & Fantasy", "title": "1066: The Conqueror's Folly", "description": "Many long days had passed since Stamford Bridge, and the confidence of the English soldiers in their King remained high. Oft repeated was praise for the daring speed with which the King had stolen a march on the Norwegian’s who had thought York to be safe from his reach.            The King’s army had struck the Norwegian troops like a lightning bolt, catching the invaders completely by surprise while the Derwent River divided their army.  Waving charge after charge forward, Godwinson had battered them to pieces with his mighty cavalry.  Ultimately the shield wall had fractured, and the Norwegian infantry had been forced into launching an ill-fated counter-charge.  By the end of that day of heavy fighting, King Harald Hardraada of Norway would die from an arrow to throat, and Godwinson’s brother Tostig would reap the traitors’ death he deserved.  So complete was his victory, the invaders were virtually wiped out.          Upon learning of still another challenger to his throne landing to the south, Godwinson had left the paltry survivors of Hardraada’s army to flee to from whence they came, and force-marched as many of his soldiers as he could to meet this new threat from Normandy…"}, {"id": "B00NJV0548", "genre": "Science Fiction & Fantasy", "title": "13: A Short Story Collection", "description": "If you need a fiction fix, but don’t have the time to commit to a full novel, a short story collection like \"Thirteen\" is the perfect solution for a mental getaway. Only have 15 minutes or so?  Then check out \"The Long Ride Home\" or \"Promises, Promises\", quick short stories that will fulfill your craving for fiction in tiny bite-size pieces.  Have a little more time to kill?  The intense, innovative novella \"Shards Of Glass\" will take about two hours to read and will keep you turning the pages the entire time.  Need a laugh?  \"A Little Vampire Story\" will get you giggling in no time flat.  From dark fantasy to comedy to science fiction, \"Thirteen\" is an eclectic blend guaranteed to provide entertainment for any occasion."}, {"id": "B01N4SH538", "genre": "Science Fiction & Fantasy", "title": "49ers (3 Book Series)", "description": "From Book 1: It's 2100, in a VR game called World Domination, a game designed to eliminate civilian, technological, fiscal and environmental loss but to still cater for the warlike nature of humans, all of the troops are hard-wired into their harnesses.  The rules were simple, survive 100 battles and you're free. Die 50 times and you'll receive a lethal dose of poison administered by the game, as war must always have consequences. Take on a Special Mission and and you'll gain 1 extra life, mission credits and valuable power-ups and special weapons. But now, on the brink of defeat, European High Command has decreed that soldiers who hit 49 deaths are to be kept permanently in the game. The 49ers is a regiment of Last Chancers, doing whatever it takes to stay alive."}, {"id": "B004NSV7MK", "genre": "Science Fiction & Fantasy", "title": "Ironwolfe: Book One of the Triads of Tir na n'Og", "description": "When he crosses from the bloody battlefields of Hungary into Tir na n’Og, Janos Narodniho, known to history as the Ironwolfe, a Voivode in the infamous Black Army of Mathias Corvinus, leaves one war for another when he finds himself bound in service to the mighty Sidhe, the Fey who rule over all mankind through their human agents, the Triads.  And from the Fey, there is nowhere to run, no shelter from either their sorcerous power or their sleepless vigilance.  For the first time in his illustrious and bloody career, the Ironwolfe is ensnared in events from which he cannot trick, think, or fight his way free...while the futures of his own world and Tir na n’Og hang in the balance.This novel begins the saga of the Triads of Tir na n'Og, an action adventure series suitable for young adults but written for lovers of epic sword and sorcery fantasy of all ages."}, {"id": "080417153X", "genre": "Science Fiction & Fantasy", "title": "The Water Knife", "description": "WATER IS POWER In the near future, the Colorado River has dwindled to a trickle. Detective, assassin, and spy, Angel Velasquez “cuts” water for the Southern Nevada Water Authority, ensuring that its lush arcology developments can bloom in Las Vegas. When rumors of a game-changing water source surface in Phoenix, Angel is sent south, hunting for answers that seem to evaporate as the heat index soars and the landscape becomes more and more oppressive. There, he encounters Lucy Monroe, a hardened journalist with her own agenda, and Maria Villarosa, a young Texas migrant, who dreams of escaping north. As bodies begin to pile up, the three find themselves pawns in a game far bigger and more corrupt than they could have imagined, and when water is more valuable than gold, alliances shift like sand, and the only truth in the desert is that someone will have to bleed if anyone hopes to drink."}]