[{"id": "1772754455", "genre": "Children's Books", "title": "DreamWorks Trolls Cinestory Comic (Dreamworks Cinestory Comic)", "description": "This holiday season, enter a colorful, wondrous world populated by unforgettable characters. Discover the story of the overly optimistic Trolls, hilarious creatures with a constant song on their lips, and the comically pessimistic Bergens, who are only happy when they have Trolls in their stomach. From the creators of Shrek, DreamWorks Trolls is a fresh comedy filled with heart and hair-raising adventures. Fans of DreamWorks Animation will love this graphic novel-style re-telling of this all-new film, featuring over 1000 stills from the movie in vibrant, full-color."}, {"id": "1481485245", "genre": "Children's Books", "title": "The Adventures of Sophie Mouse 3 Books in 1!: A New Friend; The Emerald Berries; Forget-Me-Not Lake", "description": "The first three books in The Adventures of Sophie Mouse series are now available in one enchanting paperback bind-up!Join Sophie Mouse and her forest friends in Silverlake Forest as they make a new friend, look for special emerald berries, and learn to swim at Forget-Me-Not Lake in this all-in-one paperback edition! With easy-to-read language and illustrations on almost every page, the Adventures of Sophie Mouse chapter books are perfect for beginning readers. This fantastic three-book bind-up includes A New Friend, The Emerald Berries, and Forget-Me-Not Lake."}, {"id": "B011VCX9ZS", "genre": "Children's Books", "title": "If I Just Had Two Wings", "description": "In her dreams, Phoebe twirls through rows of sea island cotton as a white dress blows around her knees like a breeze. As she dances, she loses all memory of being born a slave on an Alabama plantation. She lifts up her feet and flies high above the fields, as light as air. Before her a single white star shines. Thirteen-year-old Phoebe has always dreamed of leaving her life as a slave behind. She has heard whispers about a secret path to freedom, and she has seen what can happen to those who take it and fail. But freedom means more to Phoebe than anything, and when she meets Liney, a strong young woman who picks cotton next to her, they form a plan to escape together. One night, Poebe, Liney, and Liney's two small children flee under cover of darkness. Following clues from the songs and stories they have heard, the runaways elude slave catchers and reach the first stop on the Underground Railroad. It is only one safe house in a chain that leads all the way north to Canada. But between them and freedom, lie miles and miles of unfriendly country and dangers too horrible to imagine."}, {"id": "1484780760", "genre": "Children's Books", "title": "Star Wars: The Last Jedi Chewie and the Porgs", "description": "From Emmy award-winning writer Kevin Shinick comes a lovable tale of Chewbacca the Wookiee and the pesky porgs of Ahch-To Island. Featuring adorable illustrations by artist Fiona Hsieh."}, {"id": "B006CDQ5JY", "genre": "Children's Books", "title": "Solving the Mysteries of Pompeii (Digging Into History)", "description": "Shows archaeologists as detectives of the past and how they work to solve mysteries of ancient cultures and civilisations by literally 'Digging Into History'"}]