[{"id": "B071VPR6LF", "genre": "Science Fiction & Fantasy", "title": "Feylin Lore: Reflections", "description": "Talia is a mysterious woman with a complicated past. She is a fighter who keeps her thoughts and feelings well guarded. While fulfilling her destiny, she meets Hark—a man whom she is inexplicably drawn to. Little does she know, her life will play out before his eyes during the very moment he intends to destroy her. Hark develops a deeper understanding of Talia's past as her secrets are revealed to him. Will Hark choose his feelings over the fate of the world, or is it much too late?  In this post-technological age, supernatural powers emerge within the gifted “feylins,” leaving the mundane antiquated. Reflections is a story of love, loss and sacrifice."}, {"id": "1589943554", "genre": "Science Fiction & Fantasy", "title": "Call of Cthulhu Collectible Card Game: Dunwich Denizens Asylum Pack 4", "description": "Fantasy Flight Games presents DUNWICH DENIZENS, the fourth Asylum Deck for the Call of Cthulhu Collectible Card Game. Introducing 20 new cards to the Call of Cthulhu metagame, this 40 card deck will feature Wilbur and Lavinia Whately, the terrifying Dunwich Horror, and the brave Arkham investigators who are risking it all in an effort to stop the spreading terror. Chaos is coming, and Cthulhu awaits..."}, {"id": "0773522069", "genre": "Science Fiction & Fantasy", "title": "Dystopian Fiction East and West: Universe of Terror and Trial", "description": "Gottlieb juxtaposes the Western dystopian genre with Eastern and Central European versions, introducing a selection of works from Russia, Poland, Hungary, and Czechoslovakia. She demonstrates that authors who write about and under totalitarian dictatorship find the worst of all possible worlds not in a hypothetical future but in the historical reality of the writer's present or recent past. Against such a background the writer assumes the role of witness, protesting against a nightmare world that is but should not be. She introduces the works of Victor Serge, Vassily Grossmam, Alexander Zinoviev, Tibor Dery, Arthur Koestler, Vaclav Havel, and Istvan Klima, as well as a host of others, all well-known in their own countries, presenting them within a framework established through an original and comprehensive exploration of the patterns underlying the more familiar Western works of dystopian fiction."}, {"id": "0425265633", "genre": "Science Fiction & Fantasy", "title": "Tower Lord (A Raven's Shadow Novel)", "description": "New York Times bestselling author Anthony Ryan returns to the “wonderful universe” (Fantasy Book Critic) of Blood Song, as Vaelin Al Sorna continues on his inevitable road to destiny…King Janus’s vision of a Unified Realm has failed, drowned in the blood of brave men fighting for a cause that was forged from a lie. Sick at heart, Vaelin Al Sorna, warrior of the Sixth Order, returns home, determined to kill no more, seeking peace far from the intrigues of a troubled Realm.But those gifted with the blood-song are not destined to live quiet lives. Vaelin finds himself a target, both for those seeking revenge and those who know about his gift. And as a great threat once again moves against the Realm, Vaelin realizes that when faced with annihilation, even the most reluctant hand must eventually draw a sword."}, {"id": "1937013529", "genre": "Science Fiction & Fantasy", "title": "East Texas University: Degrees of Horror Limited Edition (Savage Worlds, hardcover, S2P10311LE)", "description": "Your boyfriend dumped you. You ve got exams first thing in the morning. And the world s going to end at midnight unless you stop it. Looks like another all-nighter with the study group. Degrees of Horror features a full-length Plot Point Campaign that takes the students from Freshman to Senior, and uncovers a mystery as old as the faculty themselves. The syllabus includes classroom intrigue, dark conspiracy, dusty mysteries from the past, killer exams, massive parties, and new horrors to torment the student body. Degrees of Horror also includes a full course-load of Savage Tales that work equally well with the Plot Point Campaign or your own epic saga. Degrees of Horror is a Plot Point Campaign for East Texas University. It requires that book and the Savage Worlds core rules to play."}]