[{"id": "0003277097", "genre": "Children's Books", "title": "AQA (B) Biology: Core Principles (Collins Student Support Materials)", "description": "A revision-style booklet written by senior examiners to match perfectly to particular specifications. Each booklet also contains a sample test and answers to allow students to check their progress.  Biological molecules Biochemical techniques Cell ultrastructure Prokaryotic and eukaryotic cells Cell transport Exchange with the environment Enzymes Digestion"}, {"id": "1483808726", "genre": "Children's Books", "title": "Spectrum Math Workbook, Grade 4", "description": "Reinforce your child’s fourth-grade skills with Spectrum Math. With the progressive lessons in this workbook, your child will strengthen skills that include multiplication and division, fractions, classifying geometric figures, and preparing for algebra. The best-selling Spectrum(R) Math workbook series provides quality educational activities that build the skills your child needs for math achievement and success. Students in grades K\u00968 will find lessons and exercises that help them progress through increasingly difficult subject matter. Chapter pretests and posttests, Mid-Tests, and Final Tests, along with complete answer keys, help students track their progress and locate areas for improvement. Aligned to current state standards, Spectrum is your child’s path to math mastery. Spectrum, the best-selling workbook series, is proud to provide quality educational materials that support your students’ learning achievement and success."}, {"id": "1608865525", "genre": "Children's Books", "title": "Disney's Hero Squad: Ultraheroes Vol. 1: Save the World (Disney's Hero Squad: Ultraheroes-Save the World)", "description": "All new, never before seen stories with your favorite Disney characters in a futuristic superhero epic!It’s the year 2734 and the only one standing in the way of earth’s utter destruction is…Mickey Mouse?! Join the four-colored fun as Mickey Mouse, Goofy and Donald Duck take to the skies to save the world. Superheroes are for kids again, with Disney!"}, {"id": "1947871005", "genre": "Children's Books", "title": "Baby Adventurer: A light-hearted rhyming adventure book for Kids 2-6, adorable illustrations (perfect for bedtime and early reading) (The Gift of New Day) (Volume 1)", "description": "Experience the gift of new day as Baby Adventurer explores the world around her. Baby is determined to tackle new experiences, even when faced with a setback. This is one baby who knows how to seek adventure in her not-so-ordinary day. You and your kids will fall in love with the adorable illustrations as well as the light-hearted, poetic rhythm of the book that makes it fun to read for children, parents and grandparents alike. Be encouraged by Baby Adventurer’s determination, and take heart in the special gift she finds at the end of a playful day."}, {"id": "1440477000", "genre": "Children's Books", "title": "Angel Rain Anime Edition: 01 The Agenda", "description": "There is a world which functions as a middle ground in an unseen war between angels and demons from two rival eternal orders... THE ORDER OF HEAVEN & THE ORDER OF DEATH! A curious young KnightAngel from the Order of Heaven gets more than he bargains for when he infiltrates the Realm of Death disguised! Sparks fly as it is made clear that he is not the only one with an agenda...! SPECIAL ANIME EDITION: Experience Angel Rain in it's true vibrant color form! We highly recommend this unique, explosive and action packed series by new author/artist Shinjii V."}]