[{"id": "0152006761", "genre": "Children's Books", "title": "Cactus Poems", "description": "At first glance, deserts may appear to be desolate wastelands, but in reality they sustain a unique selection of plants and animals--each of which has developed a fascinating way to survive in this rigorous environment. Through photographs and poetry, young readers will discover a creosote bush bragging about its phenomenal longevity, a bulging saguaro majestically reaching for the sun, a collared lizard playfully pining for a fly-catching mate, and many others. Notes at the end provide fun, child-friendly information about the plants and animals mentioned in the book."}, {"id": "1534401105", "genre": "Children's Books", "title": "Who's Your Valentine, Charlie Brown? (Peanuts)", "description": "Good grief! Is this the year Charlie Brown finally has a Valentine? Find out in this adorable shaped board book with foil on the cover.Charlie Brown is certain this is the year he will get a Valentine from the Little Red-Haired Girl. He is so certain, he checks the mailbox every time he passes by. But when Valentine’s Day comes and there’s still no Valentine, Charlie Brown is sad. Still, he can’t help but check one more time—maybe that Valentine got stuck in the back of the mailbox. He peeks in the mailbox and this time there is a Valentine waiting for him—a live one, of the beagle variety, waiting to give him a big Valentine’s Day smooch! © 2017 Peanuts Worldwide LLC"}, {"id": "B00EO8KMWU", "genre": "Children's Books", "title": "25 Silly Dog Pictures for Kids & Adults: Pictures of Dogs to Make You LOL", "description": "25 Silly Dog Pictures for Kids & Adults: Pictures of Dogs to Make You LOLEveryone needs a good laugh every now and then. And, you'll get plenty of them when you take a look at this book which includes 25 photos of dogs doing silly things. Here's just a few silly dog pictures included:- Scuba dog- Dog in transit- Oh, my head- EarsAnd many more to brighten your day.Not Just For KidsAlthough most kids age 7-12 will love them, these photos are also for adults. So, when you've had a long day at work or have been running errands all day, you can sit back, look at the silly dog pictures here and have a good laugh. Get Your Copy Now!Go to the top of the page and click the orange buy button to order. In about two minutes, you will be laughing so hard at the silly dog pictures that you will forget all about the rough day you had. Buy the book now while the price is low and tell your family & friends about it so they can have some  laughter in their lives too!After all, laughter is the best medicine!!!"}, {"id": "0763644307", "genre": "Children's Books", "title": "All Fall Down", "description": "LeUyen Pham's adorable, vibrant illustrations bring Mary Brigid Barrett's singsong text to life in a board book for the very young.From a bright tower made of blocks to a boisterous family playing a game of Ring Around the Rosie, there are many ways to join things together ï¿½ and watch them tumble in a delightful heap!"}, {"id": "0887762859", "genre": "Children's Books", "title": "Little Water and the Gift of the Animals (Native Legends)", "description": "A great hunter, Little Water has a special gift – he can communicate with the animals of the forest, who respect him. One day, when Little Water returns from the hunt, he finds his village silent. Everyone is very sick, and the medicine man cannot cure them. He instructs Little Water to seek help from the animals. But Little Water is caught in a terrible storm and injured. The animals come to his help and give him knowledge of their healing powers. With their help, Little Water is able to save the villagers, who never forget the gift from the forest animals."}]