[{"id": "1770411658", "genre": "Children's Books", "title": "Navigating the Shadow World: The Unofficial Guide to Cassandra Clare's the Mortal Instruments", "description": "An insightful and clever companion to the urban fantasy phenomenon, now a Freeform TV series Shadowhunters Navigating the Shadow Worldtakes readers deep into the rich universe of Cassandra Clare’s New York Times–bestselling Shadowhunter Chronicles. With intelligent but accessible explorations of each volume of the Mortal Instruments and Infernal Devices series, Liv Spencer delivers the next best thing to a Shadowhunter’s Codex with commentary on the books as well as the references to folklore, legends, and literature. Spencer also recounts Cassandra Clare’s journey, from journalist and fan fiction writer to superstar author; explores the cast and crew who brought the first book to life in the film The Mortal Instruments: City of Bones; and delves into the TMI fandom, a passionate community that is anything but mundane. From the Clave to Chairman Meow, demon pox to dastardly ducks, Navigating the Shadow World is your very own insight rune."}, {"id": "4770027001", "genre": "Children's Books", "title": "The Tale of Genji: 1 (Kodansha bilingual comics) (English and Japanese Edition)", "description": "A rendering in manga of the 11-century epic of love, betrayal and death at the Imperial Court of Japan."}, {"id": "0590469630", "genre": "Children's Books", "title": "Children of the Wind and Water: Five Stories About Native American Children", "description": "Depicts traditional lifestyles in five different tribes of North American Indians through vignettes set in a time more than two hundred years ago, when they still had much of the continent to themselves"}, {"id": "006074443X", "genre": "Children's Books", "title": "Fashion Fun (My Little Pony)", "description": "The ponies are putting on a fashion show. Sew-and-So has created designs that are perfect for all her pony friends -- and something extra special to help Minty be a real showstopper!"}, {"id": "110199701X", "genre": "Children's Books", "title": "To Pluto and Beyond", "description": "New Horizons was designed by NASA to study Pluto and the fringes of our solar system, farther away than any spacecraft has ever explored. Join science writer Elaine Scott as she tells the story of this mission.For Stephen Hawking, New Horizons signifies that \"We explore because we are human and we want to know.\" This remarkable ship, no bigger than a piano, and using no more energy than a lightbulb, has already traveled three billion miles out to Pluto, and is continuing on to the Kuiper Belt, the farthest reaches of our solar system. The book will feature the beautiful, amazingly sharp photographs it is sending back from its journey, which are letting scientists fill in the blanks in our knowledge of Pluto--and delivering a few surprises along the way. Elaine Scott tells the exciting story of everyone's favorite planet, from Pluto's discovery through the frustrating attempts to study such a distant object, the creation of the New Horizons project, scientists' hopes and expectations for the mission, and what is being discovered. Her clear, engaging prose does more than narrate the events. By showing how scientists operate, their hypotheses, hopes, and disappointments, and how they make use of them, she gives readers an inspiring portrait of the scientific method itself."}]