[{"id": "B019YRJVEK", "genre": "Science Fiction & Fantasy", "title": "Bleeding Star Chronicles #14- Shadows and Tall Trees (The Bleeding Star Chronicles)", "description": "Note: This novella is also available in Bleeding Star Chronicles Collection 3.Sarah Winchester is a woman on a mission- the most important mission of her life.  In order to stop the malevolent Krimson King, she must gain the confidence of the man closest to him, and come up with a plan to defeat him before his conquest begins.  As Sarah struggles with the morality of her actions, she is confronted with one burning question- will the end justify the means?"}, {"id": "1601251602", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Path: Legacy Of Fire #2: House Of The Beast", "description": " The gnoll slavers have been defeated, and the heroes settle in to their new home only to learn that the leader of the regional gnoll tribes, the deadly Carrion King, still lives, and as long as he does, the Pale Mountain Pass between Osirion and Katapesh is fraught with peril. The heroes must confront the Carrion King deep within his lair inside an ancient temple devoted to Rovagug, the monstrous god of wrath and disaster.  This volume of Pathfinder also includes rules for running and protecting an isolated village from the dangers of the surrounding wildlands, an exploration of Sarenrae (the Goddess of the Sun and Redemption), a bonus adventure featuring a deadly monster’s lair in a remote mountain, several new monsters, and the second part of New York Times best-selling author Elaine Cunningham’s Pathfinder Journal."}, {"id": "1978079869", "genre": "Science Fiction & Fantasy", "title": "The Vengeance of Snails (Penny White) (Volume 4)", "description": "‘You’ve never told Clyde?’ Morey asked. ‘About what happened to his mother?’‘How can I?’ My pen drew an outline of a shovel on my notepad. ‘I killed her with a gardening tool.’Life certainly hasn’t been dull since my first visit to Lloegyr, a magical country which parallels England. My household now includes a family of cat-sized gryphons and a hymn-singing snail shark, and I’m visited regularly by Raven, a darkly beautiful dragon. And I enjoy the excitement of planning our wedding day with Peter, my handsome fiancé.But Lloegyr offers danger as well as wonder. My brother is recovering after being hunted by a pack of gryphons. I was dismissed from my dream position as minister of a church in Lloegyr. And something non-human seems to be stalking Peter.Then there’s the mystery of Clyde’s true identity. Is he just a large carnivorous snail who loves beer and children’s TV programmes? Or does his unusual shell point to a far greater destiny, one which could threaten everyone who knows him?"}, {"id": "1877034134", "genre": "Science Fiction & Fantasy", "title": "Hal Spacejock 5: Baker's Dough", "description": "Robots have a tough life in Hal Spacejock's universe: as second-class citizens they have no rights, and most are overworked, mistreated, and recycled at the drop of a hat.When Kim Baker, a wealthy industrialist, leaves his vast fortune to an elderly robot, it's front page news.Unfortunately, the robot hasn't been seen for decades ...Baker's Dough is the fifth novel in the Hal Spacejock series (65,000 words, approx 280 pages)This space pirates novel is part of a science fiction comedy series. New release science fiction."}, {"id": "0990409104", "genre": "Science Fiction & Fantasy", "title": "Wolves and Men", "description": "The wickedness of men knows no bounds. It does not stop to consider the lives it destroys; does not feel the pain it inflicts; nor hesitates where it devours. Its appetite is destruction, and its darkness infects wherever it wounds. It prowls through night and day, seeking the weak, the innocent, and the pure. Where it finds beauty, it mars; where it sees life, it poisons; and where there is light, darkness will fall. Charlotte Benson is no stranger to the evils of men. Plagued by terrible dreams of her past, she seeks respite in the Ouachita Mountains, at a peaceful wildlife refuge called Willow's Bend in far eastern Oklahoma. Even though she's tucked away in her tiny cabin, she knows she'll have to face her demons. But what she doesn't expect is that Willow's Bend might have its own demons that could threaten her life. When locals in Willow's Bend start talking about the strange behavior of their dogs and news surfaces about experiments in the woods, rumors run wild in the tiny community. And as Charlotte's dreams suddenly change from events in her past to those in the future-with some of the dreams even coming true-the serene mountain sanctuary she sought turns into a waking nightmare. With a unique blend of edge-of-your-seat suspense and coming-of-age narrative, Natasha Wittman reveals not only the darkness of men's hearts but the triumph of forgiveness and grace over grief in her debut novel, Wolves and Men."}]