[{"id": "1580376231", "genre": "Children's Books", "title": "Exploring Australia, Grades 5 - 8 (Continents of the World)", "description": "Take students in grades 5–8 on a field trip without leaving the classroom using Exploring Australia! This 48-page book features reading selections and assessments that utilize a variety of questioning strategies, such as matching, true or false, critical thinking, and constructed response. Map projects and hands-on activities engage students in learning about the physical, political, and human geography of Australia. For struggling readers, the book includes a downloadable version of the reading selections at a fourth- to fifth-grade reading level. This book aligns with state, national, and Canadian provincial standards."}, {"id": "198148003X", "genre": "Children's Books", "title": "The Nathan Collection: Books 1-3 (Storybook Collection for Children)", "description": "Get all 3 books in 1! Save more by buying this storybook collection for your child!   This storybook collection is filled with three fun stories about the character Nathan. You will read about his love for his dog, how he loves to recycle, and his love for video games.  Beginner Reads: The Nathan Collection Books 1-3 is a story your child will love and enjoy.  -Fully illustrated picture book -Excellent as a bedtime story -Great for toddlers, preschool, and younger children  Scroll to the top of the page and select the buy button right now. "}, {"id": "1853041912", "genre": "Children's Books", "title": "Garfield - Great Impressions (Garfield Pocket Books)", "description": "As arguably one of the most successfully merchandised characters of all time, Garfield evokes instant recognition all over the world. Popular with both children and adults, this book is another in the \"Garfield Pocket Books\" series. The author also created the \"Garfield Treasuries\" series."}, {"id": "1547211067", "genre": "Children's Books", "title": "Happy 29th Birthday: Birthday Gifts For Her, Birthday Journal Notebook For 29 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0764111930", "genre": "Children's Books", "title": "10: The Rude Parrot (Petsitters Club)", "description": "When cranky Great-aunt Cynthia--who hates pets--comes for a lengthy visit just as Sam has started to petsit a parrot, Sam's Dad convinces her that the parrot is stuffed, but when the parrot starts yelling insults at her, she blames the Petsitters. Original."}]