[{"id": "159298715X", "genre": "Children's Books", "title": "The Adventures of Happy Bunny", "description": "The precocious rabbit Happy Bunny, the oldest of several bunnies in his household, is tasked with a job to locate and return to his home with many items of food that will sustain his family during the long cold winter. If he should fail, all the little bunnies and Mother and Father will face a harsh winter. On his journey, Happy Bunny encounters both friends and adversaries that try to help and hinder his task. When Happy Bunny discovers an unexpected surprise, he is able to return to his family safely."}, {"id": "1934490946", "genre": "Children's Books", "title": "The Misadventures of Michael McMichaels Vol. 1: The Angry Alligator", "description": "A chapter book for independent readers in grades 1-5. Helps children understand the impact of making a mistake and telling and a lie, and how a lie can quickly spin into more lies. What was supposed to be a fun, educational field trip to the local zoo turned into a living nightmare for a young third-grader. One stupid prank, quickly followed by one big lie, leaves Michael scrambling to save himself from a hotheaded redhead bent on revenge and a sharp-toothed alligator ready to chomp. Will Michael escape his web of lies by owning up to his mistakes and apologizing? Or will he keep hiding the truth by spinning wilder and wilder tales?"}, {"id": "158838022X", "genre": "Children's Books", "title": "Hank Aaron: The Life of the Home Run King (African American Profiles for Young Readers)", "description": "A biography of Hall of Fame baseball player Hank Aaron, who broke Babe Ruth's career home run record."}, {"id": "B00J0BJHNG", "genre": "Children's Books", "title": "Lamby the Lonely Lamb", "description": "Lamby is a very different lamb because of his color.  He is lonely and only wants to be accepted by the other lambs.  Find out what lesson Lamby learns when a little girl, Leah, comes to the farm where Lamby lives."}, {"id": "B0084FH8HG", "genre": "Children's Books", "title": "Muse: A Cat's Story", "description": "Muse is a young cat whose mind has a special power, but she feels trapped living her life as a stray in the big city. With no memories of her kittenhood, she is haunted by dreams of the countryside, and she begins to wonder if the country is her real home.Two other stray city cats befriend Muse, and each of them has its own journey to make as well. Together, they embark on an adventure to discover what it means to be home, to find peace, to experience joy, love, loss, and acceptance, and to experience a wild ride along the way."}]