[{"id": "1784075752", "genre": "Science Fiction & Fantasy", "title": "Merlin", "description": "As Britain slipped towards the end of the fifth century memories of how things had been when it was a Province of Rome began to fade. Petty kingdoms had been established and in the east of the Island Saxon mercenaries who had first come by invitation, 'Wolves hired to help repel the ravages of other wolves', had themselves become first the despoilers of a country they had come to protect, then settlers in their own right. The old order had gone, except in the Soth-West. Merlin is the story of one man from that settled order. It is the story of his journey to find himself, and of his dedication to a burden imposed upon him. It is also a love story, and the two go together. In the process it also tells of the efforts of another man, Arthur, to salvage from the wreckage of what was once Roman Britain a viable kingdom. While Merlin is fiction it is also a well-researched portrayal of Arthur's Britain, based on historical sources."}, {"id": "1681196638", "genre": "Science Fiction & Fantasy", "title": "Halo Warfleet", "description": "Halo: Warfleet is the official, authoritative guide to spacecraft in the Halo universe, featuring ten intricately detailed full-color cross-sections of the franchise's most renowned ships--including the Pillar of Autumn, Truth and Reconciliation, Infinity, and Shadow of Intent. Discover encyclopedic information which reveals the secrets of Covenant, UNSC, and Forerunner weapons, sensors, fighters, planets, and more!Illustrated by renowned artists Hans Jenssen, John R. Mullaney, Isaac Hannaford, Darren Bacon, Shi Kai Wang, Glenn Israel, and Jay Prochaska.Additional artwork by Carlos Naranjo and Tyler Jeffers.Foreword by Frank O'Connor, Halo Franchise Creative Director.Cover art by Sparth, Art Director for Halo 5: Guardians.Written by Kenneth Peters, Halo Franchise Writer."}, {"id": "0441117732", "genre": "Science Fiction & Fantasy", "title": "Count Zero", "description": "A stylish, streetsmart, frighteningly probable parable of the future from the New York Times bestselling author of Neuromancer.A corporate mercenary wakes in a reconstructed body, a beautiful woman by his side. Then Hosaka Corporation reactivates him, for a mission more dangerous than the one he’s recovering from: to get a defecting chief of R&D—and the biochip he’s perfected—out intact. But this proves to be of supreme interest to certain other parties—some of whom aren’t remotely human..."}, {"id": "0765367513", "genre": "Science Fiction & Fantasy", "title": "The Six-Gun Tarot (Golgotha)", "description": "Six-Gun Tarot is the first book in the twisted weird west world of the Golgotha series by R.S. Belcher.Nevada, 1869: Beyond the pitiless 40-Mile Desert lies Golgotha, a cattle town that hides more than its share of unnatural secrets. The sheriff bears the mark of the noose around his neck; some say he is a dead man whose time has not yet come. His half-human deputy is kin to coyotes. The mayor guards a hoard of mythical treasures. A banker's wife belongs to a secret order of assassins. And a shady saloon owner, whose fingers are in everyone's business, may know more about the town's true origins than he's letting on.A haven for the blessed and the damned, Golgotha has known many strange events, but nothing like the primordial darkness stirring in the abandoned silver mine overlooking the town. Bleeding midnight, an ancient evil is spilling into the world, and unless the sheriff and his posse can saddle up in time, Golgotha will have seen its last dawn…and so will all of Creation.R.S. Belcher's The Six-Gun Tarot is \"an astonishing blend of first-rate steampunk fantasy and Western adventure.\" (Library Journal, Starred Review)Other Books by R.S. Belcher:The Golgotha SeriesThe Six-Gun TarotThe Shotgun ArcanaNightwiseThe Brotherhood of the WheelThis edition of the book is the deluxe, tall rack mass market paperback."}, {"id": "B06X3SZ9YS", "genre": "Science Fiction & Fantasy", "title": "The Brody Taylor Series: Books 1 - 3 (The Brody Taylor Series Boxset)", "description": "Brody Taylor exploits the weakest link in all computer systems. Humans.Most people think that computer hackers are evil blackhats who break into websites one day and steal our identities the next. But there are others. Whitehats, hackers of good intent, who try to prevent the chaos caused by their anonymous adversaries.And rising above them all is elite hacker and social engineer, Brody Taylor, who is both white hat and black hat. He upholds the law by breaking the law, applying blackhat tactics to achieve white hat outcomes.The Brody Taylor Series: Books 1 - 3 includes the first three books in the cyberthriller series readers describe as “a cross between Stieg Larsson's Lisbeth Salander and Mark Billingham's Tom Thorne.” If you like complex plots, conspiracy theories and twists you won't see coming, there's 1,000+ pages of entertainment and 300+ five-star reviews. Find out why so many readers love the well-meaning, but always trouble-making, Brody Taylor.Buy the box set to get three books you won’t want to put down!"}]