[{"id": "B00GLBRGCC", "genre": "Children's Books", "title": "Jane Bakes a Pumpkin Pie: Pumpkin Pie Recipe Rhyming Book (A Thanksgiving Children's Picture Book for Ages 2-8) (Jane and Her Friends 3)", "description": "Come join Jane and all her friends while they make pumpkin pie. This fun rhyming book will give your child the basic steps to making the perfect pumpkin pie. The accompanying illustrations are simple and cute and make the perfect addition to this delightful story. In addition, it comes with a simple recipe for the perfect pumpkin pie that you and your child can enjoy making together."}, {"id": "178603171X", "genre": "Children's Books", "title": "Art Masterclass with Kandinksy", "description": "Make art like the masters with Art Masterclass! Learn how to make art like Wassily Kandinsky, one of the most famous twentieth-century artists. In this book, you’ll take 12 lessons, including learning how to draw from your imagination, listening to music for inspiration and using shapes and stickers to make pictures. At the end, you’ll use everything you’ve learnt to create your own Kandinsky-inspired masterpiece at the back.   "}, {"id": "0316045462", "genre": "Children's Books", "title": "Me . . . Jane", "description": "Winner of the Caldecott MedalPatrick McDonnell-beloved, bestselling author-artist and creator of the Mutts syndicated comic strip--shares the inspiring story of young Jane Goodall, the legendary and inspiring conservationist featured in the hit documentary film Jane.In his characteristic heartwarming style, Patrick McDonnell tells the story of the young Jane Goodall and her special childhood toy chimpanzee named Jubilee. As the young Jane observes the natural world around her with wonder, she dreams of \"a life living with and helping all animals,\" until one day she finds that her dream has come true. With anecdotes taken directly from Jane Goodall's autobiography, McDonnell makes this very true story accessible for the very young--and young at heart.One of the world's most inspiring women, Dr. Jane Goodall is a renowned humanitarian, conservationist, animal activist, environmentalist, and United Nations Messenger of Peace. In 1977 she founded the Jane Goodall Institute (JGI), a global nonprofit organization that empowers people to make a difference for all living things."}, {"id": "B016AQWI0C", "genre": "Children's Books", "title": "Books for babies:The worm loves apples (gift inside): (Baby stories),(Animal for children),(picture books for babies),(circle of life),(basic concepts) (little stories Book 1)", "description": "How to expose your child to the circle of life?This simple short picture book make it easy.Using the word \"loves\" instead of \"eats\" make it a friendly way of telling the \"circle of life\" facts.The Worm Loves Apples And your baby will love this book.Hand made drawings painted with real colors. Whats make it easy for a child or a baby to connect to.Great picture book for your 0-4 children.Get this great picture book for your child today!!!"}, {"id": "0735338841", "genre": "Children's Books", "title": "Diary of a Wimpy Kid Greg Mini Journal", "description": "Big kids, little kids, boisterous kids and shy kids alike will enjoy this cute Fregley Mudpuppy Mini Journal based on the main character from thebestselling Diary of a Wimpy Kid books by Jeff Kinney. Growing up should be fun. 1. Top opening, elastic closure 2. 160 pages"}]