[{"id": "1465463496", "genre": "Children's Books", "title": "Baby's First Thanksgiving", "description": "Celebrate baby's first Thanksgiving with this board book little ones will gobble up!Featuring all the trimmings, including corn, turkey, cranberry sauce, plus turkey handprints, fall leaves, and the gathering of family and friends, Baby's First Thanksgiving features all the favorites associated with America's favorite holiday.The simple visuals and word labels promote language skills, and the small format is perfect for babies to hold and helps develop their fine motor skills. An ideal baby gift, or self-purchase for your own baby."}, {"id": "0310753457", "genre": "Children's Books", "title": "May the Faith Be with You: 180 devotions that are out of this world", "description": "Life in the Spirit isn’t about cushioned pews and easy living—it’s about adventure, risk, daring, and the pursuit of wisdom. It’s about letting the awesome power of God work through you to do things you never thought possible. In this brand-new 180-day devotional, you’ll learn the highest, truest, and most rewarding way to a life of wisdom, apprenticing with the Ultimate Master himself—Jesus Christ. May the Faith Be With You will give you a devotional experience that’s out of this world."}, {"id": "B00JG8MBWW", "genre": "Children's Books", "title": "Simple History: A simple guide to World War I - CENTENARY EDITION", "description": "This year 2014 marks the 100 years centenary of the First World War, one of the most destructive and world changing conflicts in the history of mankind.Learn the fascinating facts about the First World War and discover this epic moment in history. With the fun illustrations and the unique style of the 'Simple History' series, let this book absorb you into a period of history which truly changed the world. Jump into the muddy trenches of World War I and on the way meet the soldiers and leaders of the conflict and explore the exciting weapons, tanks, planes & technology of combat. Illustrated in the popular minimalist style of today, young reader's imaginations will come to life. Simple history gives you the facts in a simple uncomplicated and eye catching way. Simple history is part of an ongoing series, what will be the next episode? Designed for children aged 9 -12 Visit the website information: www.simplehistory.co.ukBuild your collection today!World war 1 for kids"}, {"id": "B00GK5XV7S", "genre": "Children's Books", "title": "Kangaroos! A Kids Picture Book About Kangaroos. Another Favorite From The \"Amazing Nature Series\" Discover a Kangaroo's Habitat, Species and Lifestyle.", "description": "Did You Know That Kangaroos Happen To Be The Largest Living Marsupial On Earth? Discover Kangaroos! A Kids Book About Kangaroos With Fun Facts, Pictures and Habitat Information. (An Amazing Nature Series Book)This easy to read and understand Kangaroo kids book is perfect for children between the ages of 8-12 years of ageChildrens author Catherine Wilder takes an in depth look into Kangaroos, a Kids book about Kangaroos.Kangaroos are in the group Macropodoidea which include such mammals as kangaroos, wallabies, rat kangaroos. Inside this book you will learn about:What Are Kangaroos?How Many Species Of Kangaroos Are There?Where Can Kangaroos Be Found?How Do Kangaroos Get AroundHopping Speed And more!Pick Up This Book Today At The Low Amazon Introductory Rate of Only $0.99 For a Limited Time!Buy It Now!"}, {"id": "0763635022", "genre": "Children's Books", "title": "Where's Waldo? The Wonder Book", "description": "Find Waldo in the midst of characters who have walked straight out of their books!WALDO has wandered around the world, through time, and across the silver screen. Where is he off to now? Into a world of dreams and fantasies, of swarming scenes that could be invented only by the inspired mind of Martin Handford. Wilder and wackier than ever before, WALDO's adventures now span a crazy cake factory, the Land of Woof (imagine 1,000 Woofs!), an endless maze of halls and doors (can you find the keys that match the keyholes?), a riotous fun fair of fruits and vegetables, and much more! Every teeming double-page spread features more than twice the characters--and twice the challenge--of previous WALDO books! WHERE'S WALDO? THE WONDER BOOK will make your eyes POP!"}]