[{"id": "1634890507", "genre": "Children's Books", "title": "Charley the Bulldog's Fantastic Fruit Stand", "description": "Meet Charley and Otis, two lovable bulldogs with two very different personalities! Charley likes to work hard and play hard--but Otis likes to do a whole lot of relaxing. In this delightful story, see what happens when Charley's fruit stand begins to earn Charley some extra spending money . . . and a new toy to boot!"}, {"id": "B009X2EC0K", "genre": "Children's Books", "title": "Reptiles (First animals Book 15)", "description": "In this simple ebook, babies and toddlers will be able to look at 12 scaly reptiles.Each page has a photograph of one reptile. The name of the reptile is underneath the photograph.The reptiles featured are: crocodile, alligator, gharial, chameleon, perentie, iguana, green turtle, box turtle, eastern snake-necked turtle, black-headed python, puff adder and garter snake.Reptiles is Book 15 in the First animals series. The First animals series is ideal for babies to 3 year olds who are just discovering the wonderful animals that share our world."}, {"id": "1416959475", "genre": "Children's Books", "title": "Love, Raggedy Ann (Raggedy Ann and Me!)", "description": "Raggedy Ann has special valentine treats for all of her friends! In this unique and squeezably adorable new format, a plush Raggedy Ann doll is suspended on the spine and die-cut through each board page so that she whirls and twirls as she shares her valentine's greetings. This board book includes a Raggedy Ann plush suspended in spine with elastic and die-cut through the center of book."}, {"id": "0807281956", "genre": "Children's Books", "title": "Harry Potter and the Sorcerer's Stone (Book 1)", "description": "Read by Jim Dale8 hours 17 minutes, 7 CDsHarry Potter has no idea how famous he is. That's because he's being raised by his miserable muggle aunt and uncle who are terrified Harry will learn that he's a wizard, just as his parents were.But everything changes when Harry is summoned to attend an infamous school for wizards and he begins to discover some clues about his illustrious birthright.From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny."}, {"id": "1591163617", "genre": "Children's Books", "title": "Dragon Ball Z, Vol. 1 (Limited Edition) (Dragon Ball Z (Graphic Novels))", "description": "Goku must rescue his son, Gohan, from Raditz but the adventure turns fatal, and with Goku in the afterlife, Goku's former arch-enemy, Piccolo, must begin training Gohan to follow in his father's footsteps."}]