[{"id": "B06XJYHH7Y", "genre": "Science Fiction & Fantasy", "title": "Baited (The Chronicles of the Hunter Book 2)", "description": "In the shadowy realm between dark and light, survival doesn’t always go to the strongest. Most are hunters. Some are prey. And a select few…are both.Jezebel has a dark past and darker secrets. She’s known as a man-hater. Cold. Calculating. Vicious. But nobody ever asked her why. Adam Ballantine doesn’t do death defying stunts just to make a living. He’s addicted to the thrill. The closer he gets to death, the more he likes it. When Jezzie gets the assignment, it looks clean. Easy. In and out. She should have been warned. Adam is exactly what she doesn’t need - a bad boy with a bad rep. Worse, he won’t quit tempting fate. Nothing scares this guy. Except this time, the stakes are different.Someone is really trying to kill him.And Adam is making it easy for them..."}, {"id": "1250060893", "genre": "Science Fiction & Fantasy", "title": "Carter & Lovecraft: A Novel", "description": "A Shelf Awareness Best Book of the Year\"Carter & Lovecraft is a Pandora's box loaded with all the wonderfully twisted stuff I love, including a two-fisted homicide cop turned PI, warped realities, a mysterious bookstore, the Cthulhu mythos, a dash of romance, and creepy fish-men. What's not to love? Jonathan L. Howard knows how to show his readers a wickedly good time.\" ―Christopher Golden, New York Times bestselling author Dead RingersDaniel Carter used to be a homicide detective, but his last case―the hunt for a serial killer―went wrong in strange ways and soured the job for him. Now he's a private investigator trying to live a quiet life. Strangeness, however, has not finished with him. First he inherits a bookstore in Providence from someone he's never heard of, along with an indignant bookseller who doesn't want a new boss. She's Emily Lovecraft, the last known descendant of H.P. Lovecraft, the writer from Providence who told tales of the Great Old Ones and the Elder Gods, creatures and entities beyond the understanding of man. Then people start dying in impossible ways, and while Carter doesn't want to be involved, he's beginning to suspect that someone else wants him to be. As Carter reluctantly investigates, he discovers that H. P. Lovecraft's tales were more than just fiction, and he must accept another unexpected, and far more unwanted, inheritance."}, {"id": "178565604X", "genre": "Science Fiction & Fantasy", "title": "Empire of Time (New Pompeii 2)", "description": "For fifteen years, the Romans of New Pompeii have kept the outside world at bay with the threat of using the Novus Particles device to alter time. Yet Decimus Horatius Pullus—once Nick Houghton—knows the real reason the Romans don’t use the device for their own ends: they can’t make it work without grisly consequences. This fragile peace is threatened when an outsider promises to help the Romans use the technology. And there are those beyond Pompeii’s walls who are desperate to destroy a town where slavery flourishes. When his own name is found on an ancient artifact dug up at the real Pompeii, Nick knows that someone in the future has control of the device. The question is: whose side are they on?"}, {"id": "1480545368", "genre": "Science Fiction & Fantasy", "title": "Fiendish Schemes", "description": "In 1986, K. W. Jeter coined the term steampunk, applying it to his first Victorian-era science fiction alternate-history adventure. At last he has returned with a new tale of George Dower, son of the inventor of Infernal Devices, who has been in self-imposed exile…accumulating debt. The world Dower left when he went into hiding was significantly simpler than the new, steam-powered Victorian London; a mad whirl of civilization filled with gadgets and gears in the least expected places. After accepting congratulations for his late father’s grandest invention—a walking, steam-powered lighthouse—Dower is enticed by the prospect of financial gain into a web of intrigue with ominously mysterious players who have nefarious plans about which he can only guess.If he can make his father’s Vox Universalis work as it was intended, his future is assured. But his efforts are confounded by the strange Vicar Stonebrake, who promises him aid, but seems more interested in converting sentient whales to Christianity than in helping George. Drugged, arrested, and interrogated by men, women, and a steam-powered Prime Minister, Dower is trapped in a maelstrom of secrets, corruption, and schemes that threaten to drown him in the chaos of this mad new world.“This is the real thing—a mad inventor, curious coins, murky London alleys, and windblown Scottish Isles…. A wild and extravagant plot that turns up new mysteries with each succeeding page.” —James P. Blaylock on Infernal Devices“Jeter is a modern Arthur Conan Doyle…. [Fiendish Schemes] reads [like] a Sherlock Holmes adventure.” —Tee Morris, author of the Ministry of Peculiar Occurrences series"}, {"id": "1556344147", "genre": "Science Fiction & Fantasy", "title": "GURPS Villains (GURPS: Generic Universal Role Playing System)", "description": "A pirate said to Alexander the Great, \"Because I have only one ship, I am called a pirate. Because you have a great navy, you are called an Emperor.\"   Villains. Where would the heroes be without them?   Probably unemployed.   The hero may be the star of his story, but it takes a prize villain to bring out the best in him! GURPS Villains is a compilation of dastardly foes from all ages, genres, and backgrounds. Crackpot spy-movie masterminds, backstabbing patricians, grim undead overlords, hard-bitten crime bosses . . . they're all here! Each villain is described both biographically and in game terms, and is accompanied by \"bits\" like fiendish plots, evil henchmen, devious deathtraps, and secret strongholds. GURPS Villains also includes a GM's guide to dramatic villain design and use. After all, everybody loves a \"good\" bad guy!   GMs can use this book for instant opponents, or choose a villain they like and build a whole campaign around him! There are over 50 villains (and villainous groups) with complete stats and writeups, including details of their \"evil plans,\" in this survey of fiends and foes from all times and climes."}]