[{"id": "0791059863", "genre": "Children's Books", "title": "Death and Dying (21st Century Health and Wellness)", "description": "Discusses that great mystery, death, as perceived through the ages; dying with dignity; the dimensions of grief; and the quest for immortality."}, {"id": "157572345X", "genre": "Children's Books", "title": "Joseph Turner (Life and Work of)", "description": "An introduction to the life and work of the nineteenth-century English painter, Joseph Turner, describing the development of his techniques and showing some of his different paintings."}, {"id": "1609912098", "genre": "Children's Books", "title": "Bremner & the Party (Ripley’s Picture Books)", "description": "Brand new picture books from Ripley’s feature fun and engaging stories around two favorite Ripley’s Aquarium mascots—Sharkee the sand tiger shark and Bremner the pufferfish. Filled with expressive illustrations, silly situations, and lovable characters, kids and parents alike will be enchanted by each of these charming “tails”!Bremner the pufferfish is going to a party. Tonight. Gulp! And he’s nervous. And he knows what happens when he gets nervous. He puffs up. And he definitely doesn’t want to puff up. Children and parents alike will laugh their way through Bremner’s nervous dialogue as he goes off the deep end before joining the party. Will Bremner puff up and ruin the celebration? There’s only one way to find out!"}, {"id": "B00OBOA9NE", "genre": "Children's Books", "title": "The Thief and the Sword (Cleopatra in Space #2)", "description": "Cleopatra's space adventure in the REALLY far future continues!A mysterious thief has stolen the ancient sword Cleo recovered in Book One: Target Practice, and she's determined to get it back. But her teachers at Yasiro Academy forbid her from risking her life, so she's stuck at school, trying to adjust to her newfound popularity and responsibility. And when she learns more about the prophecy that names her the savior of the galaxy, she must go on a dangerous journey to find the time tablets that could decide her fate... before they fall into the wrong hands!"}, {"id": "1681522063", "genre": "Children's Books", "title": "Gymnastics (Spot)", "description": "Young sports fans will love learning more about their favorite games! In this series a search-and-find feature guides early readers as they learn new vocabulary pertaining to different sport fundamentals, player positions, and rules. Carefully chosen photos and words are sure to captivate kindergarteners and other readers, alike! This search-and-find book invites emergent readers to look for new vocabulary words and pictures while giving simple facts about the fundamentals of gymnastics, including event descriptions and key terms."}]