[{"id": "B00FI4BYEE", "genre": "Science Fiction & Fantasy", "title": "Moth (The Moth Saga Book 1)", "description": "They say the world used to turn.  They say that night would follow day in an endless dance.  They say that dawn rose, dusk fell, and we worshiped both sun and stars.That was a long time ago.The dance has died.  The world has fallen still. We float through the heavens, one half always in light, one half always in shadow.  Like the moth of our forests, one wing white and the other black, we are torn.My people are the fortunate.  We live in daylight, blessed in the warmth of the sun.  Yet across the line, the others lurk in eternal night, afraid... and alone in the dark.I was born in the light.  I was sent into darkness.  This is my story."}, {"id": "B0733Y5RXX", "genre": "Science Fiction & Fantasy", "title": "2Dee (My Name is Dee)", "description": "The population of Los Angeles has vanished. John Dee has to find out why. With the help of his AI son, he journeys between dimensions, undergoes radical body modifications, topples extrasolar governments, and hunts his lost love, all without a clear idea of who he is. To rescue his city, and himself, he must confront both the cruelty of the universe he finds himself in, and his own interior darkness. - - \"Weird, avant-garde, poetic and challenging. Robin Dunn's 2DEE fairly bubbles, a surreal experiment that looks and smells like SF. But it's really a fever dream of ghetto genres, broken cliches and ultimately an elegy to the sprawl of urban LA. At first, I wanted more aliens, but everything about this is alien. Arrogant, neurotic, playful, it reads like an SF hallucination, a satire, the last thoughts of a dying man, fragments leading up to the apocalypse. 2DEE is an heir to the 1970's New Wave science fiction movement.\"        -- Roger Leatherwood, author of Naked in Hollywood"}, {"id": "1626948275", "genre": "Science Fiction & Fantasy", "title": "Goodwill", "description": "Two Weeks before Christmas… Finding a red weave pocketbook, containing a passport bathed in a creepy glowing plasma, in a Goodwill and being followed around by the murdered woman to whom it belonged is just another day in the life of Theresa Lillian Lewis. The plucky war widow and mother of a twelve-year-old is all too used to the weird. Theresa communicates with ghosts—they mostly want her to find lost items—but after she buys the red pocketbook, things get complicated fast. She collides with a hot cop named Andy, gets shot, finds out that the devil has a serious bone to pick with her because of something she did as a four-year-old, and gets to meet Santa and a mischievous nymph named Barney. Now, all Theresa has to do is to resolve some mysteries about her childhood and her parents, learn what she has to do to put the world back in order, and escape from the devil in hell…"}, {"id": "1556342071", "genre": "Science Fiction & Fantasy", "title": "GURPS Magic Items 2 (GURPS: Generic Universal Role Playing System) (No. 2)", "description": "GURPS Magic Items 2 once again opens the doors to shops full of arcane artifacts and enchanted objects . . . over 450 completely new items.  All of the familiar magical shops from Magic Items are here, with new items for armor and protection, magical weaponry, mystical healing, necromantic magic, curses, tricks and traps, and more. In addition, this book introduces eight new shops that magic-seeking adventurers can visit, with items for bardic magic, adventuring items, holy magic, and toys and entertainment."}, {"id": "1507686447", "genre": "Science Fiction & Fantasy", "title": "The Elemental Conductors", "description": "Joshua was an ordinary man living an ordinary life until one night when he is struck by lightning only to wake up with the power of electricity. Not sure how any of this happened he and his best friend Tony soon find themselves being hunted by a secret government organization bent on using the powers of people like him for their own dark purposes. Now on the run, Joshua is forced into a life he could have never imagined full of superpowers, subterfuge, and danger. Will he be able to save himself and others like him or will he become a victim like the countless others before him?"}]