[{"id": "1549627740", "genre": "Children's Books", "title": "Digging for Gold (Annotated & Illustrated): A Story of California", "description": "*This Book is annotated (it contains a detailed biography of the author). *An active Table of Contents has been added by the publisher for a better customer experience. *This book has been checked and corrected for spelling errors. An Iowa farm boy goes to Sacramento to seek his fortune on the California gold fields."}, {"id": "0553376012", "genre": "Children's Books", "title": "YM The Best of Say Anything", "description": "Everyone, and we mean everyone—has an embarrassing moment they’d like to forget about. You know, like . . .tripping in the cafeteriagetting caught picking a wedgieexposing a little more skin than you had in mindblurting out something that’s completely ridiculous—in front of the guy you have a crush on.The good news is, you aren’t alone. More than a million readers have written to ym over the years with some of the silliest, craziest, most embarrassing stories ever heard! The best of the best—the ones that made the editors shriek with laughter—are in this book."}, {"id": "0752219332", "genre": "Children's Books", "title": "1940's House Activity Book (PB)", "description": "\"The 1940s House Activity Book\" aims to be an engaging and inspiring approach to the history of the 1940s for children and about children, with a wide range of activities through which they can learn about life in Britain during World War II."}, {"id": "0545639204", "genre": "Children's Books", "title": "Long Road to Freedom (Ranger in Time #3)", "description": "Ranger is a time-traveling golden retriever with search-and-rescue training. In this adventure, he goes to a Maryland plantation during the days of American slavery, where he meets a young girl named Sarah. When she learns that the owner has plans to sell her little brother, Jesse, to a plantation in the Deep South, it means they could be separated forever. Sarah takes their future into her own hands and decides there's only one way to run -- north."}, {"id": "198117530X", "genre": "Children's Books", "title": "Epic Food Jokes: Jokes for Kids (silly memes jokes) (Volume 2)", "description": "EPIC FOOD JOKES is jokes for kids It's contains alots of food related jokes This joke book is fun readable. Can make children and adult laugh out loud."}]