[{"id": "1543500404", "genre": "Children's Books", "title": "Shetland Ponies (Horse Breeds)", "description": "The Shetland pony may be small, but it's tough. In the 1800s, these ponies worked pulling heavy carts full of coal in mines. Today the Shetland's gentle personality makes it a favorite children's pony around the world. From jumping events to pulling carts, these ponies can do it all!"}, {"id": "B00F8H095G", "genre": "Children's Books", "title": "The Truth About Dangerous Sea Creatures", "description": "The Truth about Dangerous Sea Creatures, full of eye-catching photography and interesting facts will thrill any young reader interested in the misunderstood creatures of the deep sea."}, {"id": "150092511X", "genre": "Children's Books", "title": "Toys In The Attic: A Spooky Lucas Mystery Book 1 (Volume 1)", "description": "Summer has arrived in Lucas, Texas. Drew Stone and his friends are looking forward to lazy days of swimming, bike riding and video games. But an unexpected stay at his grandfather's farm and a surprising encounter with a long-dead relative set Drew on a different path. With help from his friends and some of Lucas's quirky citizens, Drew will have to uncover secrets the town has kept buried for more than 50 years."}, {"id": "1616335157", "genre": "Children's Books", "title": "Recycle! a Children's Musical", "description": "In this fun educational musical about recycling, a \"nutty professor\" transports four modern day kids back to the 1950's.  Together they compare the lifestyles of today's \"disposable generation\" to kids living in a time before plastic bags, aluminum cans, and water bottles became a part of our every day life. Suggested age range for performers/audience: 5-12"}, {"id": "0620615540", "genre": "Children's Books", "title": "Jeff Madison and the Shimmers of Drakmere: A magical fantasy adventure (Book 1) (Volume 1)", "description": "What if there existed a dark kingdom forged on a web of evil spells, with a conniving king plotting to infiltrate the dreams of children all over the world? What if he and the wicked witch on his side could inject the sleep of every child with the most horrid of nightmares ... And all they needed was one very particular boy? When Jeff's brother Matt is captured and spirited away to the kingdom of Drakmere, Jeff knows he must save him. But who are the mysterious, cloaked strangers on Matt's trail? And what do they mean when they say Matt is a dream catcher? Soon Jeff faces a choice: He can follow the strangers through the moonglow doorway into the perils of Drakmere or stay at home and risk the possibility of never seeing his brother alive again. And time is running out, because Jeff must make his choice before the last of the moonbeams passes and the doorway closes forever ..."}]