[{"id": "0375806156", "genre": "Children's Books", "title": "Thanksgiving on Thursday (Magic Tree House #27)", "description": "The #1 bestselling chapter book series of all time celebrates 25 years with new covers and a new, easy-to-use numbering system! It's a time for giving thanks when the Magic Tree House whisks Jack and Annie back to 1621 on the first Thanksgiving Day. The Pilgrims ask them to help get things ready. But whether it's cooking or clamming, Jack and Annie don't know how to do anything the Pilgrim way. Will they ruin the holiday forever? Or will the feast go on? Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who are just beginning chapter books Merlin Missions: More challenging adventures for the experienced reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House adventures Have more fun with Jack and Annie at MagicTreeHouse.com!"}, {"id": "B0099JQRFU", "genre": "Children's Books", "title": "The Sniper", "description": "Stalingrad snipers were legends in their time. Their patience, keen eyes, and ruthlessness helped win the Battle of Stalingrad and turn the tide of the Second World War. James Riordan visited Stalingrad in 1959 and several times later. In 2006 he met Tania Chernova, whose story was so fascinating that Riordan made her the heroine of this compelling novel. The year is 1942. Legendary sniper Vasily Zaitsev, who killed a record 242 Nazis, recruits Tania to seek out and shoot German officers. At first, she finds it almost impossible to kill. But when she discovers that her beloved grandparents, along with many of her friends, have been brutally murdered by invading Nazis, she vows to \u0093break them like sticks.” Following her capture and daredevil escape, she leads a handpicked unit on what seems like a suicide mission \u0097 to seize Field Marshall Paulus, the Commander-in-Chief of the invading army. But Tania is no ordinary marksman. Author Riordan’s dramatic narrative and wealth of period detail make this story of one of the lesser-known episodes in World War II history a gripping one."}, {"id": "B00D75VBEO", "genre": "Children's Books", "title": "GYMMY THE OWL AND HIS FRIENDS:Tales in Rhyme About the Animal Kingdom's Natural Gymnasts", "description": "A delight for all lovers of rhymed poetry and gymnastics, Gymmy the Owl and His Friends offers children and parents entertaining and amusing poems and useful information about gymnastics and gymnastics terminology. Author Vladimir Zaglada, who worked at the highest levels of Soviet gymnastics during its heyday, created Gymmy and his friends as a way of introducing young children and their parents to the world of gymnastics. Readers of any age will be drawn in by his parallels between the natural abilities of animals and the skills humans must work hard to develop in order to perform gymnastics feats. Gymmy the Owl makes learning fun by following each humorous rhymed tale with a small dose of important information and key gymnastics terminology. Illustrator Katya Korobkina brings to life a charming community of “Nature’s Gymnasts.”"}, {"id": "1350025313", "genre": "Children's Books", "title": "The Writer's Eye: Observation and Inspiration for Creative Writers", "description": "Learning to write starts with learning to do one big thing: pay attention to the world around you, even though just about everything in modern life makes this more difficult than it needs to be. Developing habits and practices of observing, and writing down what you notice, can be the first step away from the anxieties and doubts that can hold you back from your ultimate goal as a writer: discovering something to say and a voice to say it in. The Writer's Eye is an inspiring guide for writers at all stages of their writing lives. Drawing on new research into creative writers and their relationship with the physical world, Amy Weldon shows us how to become more attentive observers of the world and find inspiration in any environment. Including exercises, writing prompts and sample texts and spanning multiple genres from novels to nonfiction to poetry, this is the ideal starting point for anyone beginning to write seriously and offers refreshing perspectives for experienced writers seeking new inspiration."}, {"id": "0439669448", "genre": "Children's Books", "title": "The Dumb Bunnies", "description": "A so-dumb-it's-funny story from bestseller Dav Pilkey.Let the Scholastic Bookshelf be your guide through the whole range of your child's experiences-laugh with them, learn with them, read with them!Category: HumorMeet the Dumb Bunnies.They eat lunch in a carwash. They go bowling in a library. And they ice-skate on the bottom of a lake. Everything the dumb bunnies do is REALLY dumb - but lots of fun.When an intruder sneaks into the bunnies' house, this spectacularly stupid family is stumped. See what happens to their unwelcome guest and laugh yourself silly!"}]