[{"id": "158668132X", "genre": "Children's Books", "title": "I Love Nursery Rhymes (Barney)", "description": "A fun coloring & activity book featuring tons of nursery rhymes and starring Barney!This 60-page coloring and activity book is full of nursery rhymes and pictures to color for hours of fun!"}, {"id": "154301139X", "genre": "Children's Books", "title": "How Bear Lost His Tail", "description": "An Iroquois story about how bear lost his tail. Kid's book. 24 pages full color pictures. Illustrated. Native American. Nature."}, {"id": "1772600571", "genre": "Children's Books", "title": "Fania's Heart", "description": "Ten-year-old Sorale discovers a tiny heart-shaped book among her mother's belongings. Its pages are shaped like four-petaled flowers, upon which are written words in languages Sorale does not understand. Who wrote these words? Where did the heart come from? Why has her mother never mentioned this tiny book before? Fania's Heart reveals the story of the crafting of the heart, against all odds, within the confines of Auschwitz, and of the women of immeasurable resilience, courage and loyalty who risked their lives for Sorale's mother, their friend."}, {"id": "1502847477", "genre": "Children's Books", "title": "Kitten & Koi (Kitten and Friends) (Volume 2)", "description": "*****5-stars from Readers' Favorite! Kitten’s new friend Koi is a fish. Koi can’t leave the pond, but Kitten wants to find a game they can play together. Is Kitten brave enough to try to swim? The second book in the Kitten and Friends series, Kitten & Koi is a story of friendship and acceptance. Snuggle up with the sweetest, fluffiest kitten in the whole wide world!"}, {"id": "1515774031", "genre": "Children's Books", "title": "STEM Adventures", "description": "Meet Max Axiom, super scientist. Using his amazing powers, Max explores the very workings of the technology we see and use every day. Whether investigating the inner workings of a robot or the power produced by a combustion engine, Max does what it takes to reveal how technology works and how we used it in our world."}]