[{"id": "B01767Z3O2", "genre": "Children's Books", "title": "Brave Girl: Clara Lemlich and the Shirtwaist Makers", "description": "When Clara arrived in America, she couldn't speak English. She didn't know that young women had to go to work, that they traded an education for long hours of labor, that she was expected to grow up fast. But that didn't stop Clara. She went to night school, spent hours studying English, and helped support her family by sewing in a shirtwaist factory. Clara never quit, and she never accepted that girls should be treated poorly and paid little. Fed up with the mistreatment of her fellow laborers, Clara led the largest walkout of women workers the country had seen. From her short time in America, Clara learned that everyone deserved a fair chance. That you had to stand together and fight for what you wanted. And, most importantly, that you could do anything you put your mind to."}, {"id": "0153431687", "genre": "Children's Books", "title": "Spring Forward, Student Edition, Level 1 (Storytown)", "description": "Level 1-1 HARCOURT hardcover student textbook SPRING FORWARD ISBN 0153431687. Corresponds with copy right dates 2004- 2008 of the Harcourt Storytown reading/ language arts series."}, {"id": "0876145918", "genre": "Children's Books", "title": "Everybody Cooks Rice (Picture Books)", "description": "A child is sent to find a younger brother at dinnertime and is introduced to a variety of cultures through encountering the many different ways rice is prepared at the different households visited."}, {"id": "B0096DVUTC", "genre": "Children's Books", "title": "Marvel Adventures Iron Man, Vol. 1: Heart of Steel (v. 1)", "description": "The Armored Avenger blasts into the newest title in the critically-acclaimed, best-selling Marvel Adventures line! Who is Iron Man, the world-renowned symbol of mega-conglomerate Stark International? And what terrible secret from his past forces billionaire inventor Tony Stark to become the Golden Guardian? Find out here! Collects Marvel Adventures Iron Man #1-4."}, {"id": "B076DRBQMV", "genre": "Children's Books", "title": "Race Cars on the Go (Bumba Books ™ — Machines That Go)", "description": "Carefully leveled text and fresh, vibrant photos engage young readers in learning about how race cars work. Age-appropriate critical thinking questions and a photo glossary help build nonfiction learning skills."}]