[{"id": "1445154420", "genre": "Children's Books", "title": "Reading Champion: Hippo's Birthday: Independent Reading Green 5", "description": "In this story, it is Hippo's birthday and she really wants to make a birthday cake. But all her friends are busy and it looks as if they have forgotten. The Hippo receives an invitation...Reading Champion offers independent reading books for children to practise and reinforce their developing reading skills.Fantastic, original stories are accompanied by engaging artwork and  a reading activity. Each book has been carefully graded so that it can be matched to a child's reading ability, encouraging reading for pleasure.Independent Reading Green stories are perfect for children aged 4+ who are reading at book band 5 (Green) in classroom reading lessons."}, {"id": "1633221873", "genre": "Children's Books", "title": "The Human Body in 30 Seconds: 30 mind-blowing topics for budding biologists explained in half a minute (30 Second Series)", "description": "Go on an extraordinary journey through the human body with this fact-packed book, 30 seconds at a time!Colorful artwork engages readers with every flip of the page, as the inner workings of the body are revealed, from the bones to the brain. The 30 Seconds series takes readers on a journey of discovery through a wide range of fascinating subjects. Each topic is presented with a quick 30-second soundbite, supported by flash summaries and full-color artwork. Fun, interactive missions with things to make or do support the topics, encouraging readers to test, explore, and discover even more."}, {"id": "1406353817", "genre": "Children's Books", "title": "Have You Seen My Dragon?", "description": "In the heart of the city, among the taxis and towers, a small boy travels all over the town, searching for his dragon friend. Readers will certainly spot the glorious beast, plus an array of big-city landmarks and features they can count. Is the dragon taking the bus, or breathing his fiery breath below a busy street? Maybe he took a taxi to the zoo or is playing with the dogs in the park. Steve Light's masterful pen-and-ink illustrations, decorated with meticulous splashes of colour, elevate this counting book (numbers 1-20) to new heights - with brilliant flashes of humour."}, {"id": "1934246867", "genre": "Children's Books", "title": "AC Heroes, Storm Surge Book One", "description": "The children of the 3rd grade aftercare at Lamarque Elementary, seem to be normal to other teachers, friends, and even their parents, but everyday between 3:00 and 6:00... They are AC HEROES!"}, {"id": "1921696001", "genre": "Children's Books", "title": "Sam, Grace and the Shipwreck", "description": "An evocative retelling of the wreck of the SS Georgette off the coast of Western Australia in 1876, this inspiring account chronicles the heroic efforts of 16 year old Grace Bussell and Sam Isaacs, an Aboriginal stockman. Lavishly illustrated, this mixed media book\u0097which includes collages, computer generated images, and oil paintings\u0097depicts Bussell and Isaacs as they rescue the lives of 50 passengers and crew from sure-drowning. Highlighting the courage and leadership of these two individuals, this fictionalized narrative of historical events gives due credit to a previously unsung hero and demonstrates why Bussell became known as \u0093Australia’s own Grace Darling.”"}]