[{"id": "193324142X", "genre": "Children's Books", "title": "My First Book of Money: Counting Coins", "description": "Using Kumons step-by-step, incremental approach, this workbook introduces children to the concept of money by giving them plenty of practice working with each coin before moving on to the relationships between coins. Eventually, your child will understand the names and values of every coin worth less than a dollar. Ages 5-7."}, {"id": "B00HE2JLSY", "genre": "Children's Books", "title": "Izzy the Whiz and Passover McClean", "description": "Izzy the Whiz is an amateur inventor who, right before Passover, creates a super duper machine that whirs and purrs and munches and crunches and miraculously cleans the entire house just in time for the holiday – but not without creating havoc along the way. A fun, crazy, rhyming tale a la Dr. Seuss."}, {"id": "075135001X", "genre": "Children's Books", "title": "The Ultimate Teddy Bear Book: Sticker Album", "description": "This sticker book contains over 100 self-adhesive stickers of the world's favourite and most famous teddy bears. Each sticker is re-usable and can be used to decorate furniture and favourite belongings, or brighten up personal stationery."}, {"id": "1561790818", "genre": "Children's Books", "title": "10: Other Times, Other Places (Adventures in Odyssey)", "description": "From an incredible adventure in Bethlehem to an imaginary journey into the future, they're at it again! When John Avery Whittaker and his young Odyssey pals get going, you'll always find exciting drama and lasting value lessons. Volume 10 contains the following episodes (and themes): Back to Bethlehem 1, 2, & 3 (the story of Jesus' birth) Someone to Watch Over Me (God's protection, guardian angels) Melanie's Diary (anger and revenge) Isaac the Procrastinator (time management) The Second Coming (Jesus' return) Emotional baggage (healing old wounds) Waylaid in the Windy City, 1 & 2 (good vs. evil) The Homecoming (forgiveness) Last in a Long Line (family relationships)"}, {"id": "0974826626", "genre": "Children's Books", "title": "Aaron Burrd, the Paranoid Bird with Acute Acrophobia", "description": "A collection of delightful and interesting stories that will charm and amuse parents and children alike. Both educational and fun, these stories are designed to be a stepping-stone for youngsters toward more progressive reading as well as to prepare them for later school."}]