[{"id": "B00KK6BJ90", "genre": "Children's Books", "title": "Cixi \"The Dragon Empress\" (The Thinking Girl's Treasury of Dastardly Dames)", "description": "The last empress of China, Cixi fought ruthlessly to isolate her country from the West, while cloistered inside her lavish Forbidden City, ignoring the needs of her people. But was the Dragon Empress evil or just out-of-touch?Gorgeous illustrations and an intelligent, evocative story bring to life a real dastardly dame whose ignorance brought a centuries-old dynasty crashing down, ending the imperial system that had ruled China for millennia."}, {"id": "0613357604", "genre": "Children's Books", "title": "Venus & Serena: The Grand Slam Williams Sisters (Scholastic Biography)", "description": "In just a few short years, young tennis stars Venus and Serena Williams have become two of the best-known sports figures in the world. This biography chronicles their exciting rise to fame and provides in-depth information about their lives, dreams, and amazing accomplishments."}, {"id": "B0713X54M3", "genre": "Children's Books", "title": "Jane and Anna The Second Adventure", "description": "Strange things are happening in the town of Riverside. Jane and Anna set out to solve two mysteries with the help of their friends Cale, Joe and Rachel. Together the five children set out to find out who has kidnapped little Bella and to search for Joy's missing cattle. An action packed adventure filled with friendship and fun!"}, {"id": "0769677215", "genre": "Children's Books", "title": "Subtraction 0 to 12 Flash Cards (Brighter Child Flash Cards)", "description": "Brighter Child® Subtraction 0 to 12 Flash Cards offer children a fun and easy way to practice their subtraction skills. The set features 54 cards with two subtraction problems each, their answers on the opposite side. Bright, bold numbers are placed on a white background for easy reading, and a special card also offers creative game ideas designed to reinforce learning.The popular Brighter Child® Flash Cards give children a fun and easy way to practice important skills. Offering 24 titles encompassing preschool to grade 5, each title focuses on an important subject including early concepts, math, phonics, and U.S. History. Fun game ideas and learning suggestions are included to help children build proficiency and confidence. Game cards also allow children to develop thinking, decision-making, turn-taking, and social skills while playing fun games at the same time.Select titles are also available in English-Spanish and Spanish-only versions."}, {"id": "B00FAUUEX8", "genre": "Children's Books", "title": "Meet Helen Keller: An Illustrated Biography of Helen Keller. For Children Age 8 & Up (Meet Famous People Book 4)", "description": "If you are looking for an inspirational, true-life hero to introduce your children to, Helen Keller is definitely a good choice! \"Meet Helen Keller\" was written for children age 8 & up. With many colorful illustrations, this biography focuses on Helen Keller's life stories and how she overcame her disabilities. Helen Keller was a very special woman who did not let a problem keep her from reaching her goals. Before she was two years old, a quick illness left her unable to see or hear any more. Suddenly in a dark, quiet place, Helen depended on the love of her family and friends and her own strong curiosity to learn. With the patience and creativity of a loving teacher, Helen learned how to read special books, speak and type for herself. Helen worked very hard to share what she learned to help other people get past their disabilities and problems. Her fight for fairness for all people has made Helen Keller one of the most famous women in the world."}]