[{"id": "0882892894", "genre": "Children's Books", "title": "Gaston Drills an Offshore Oil Well", "description": "Gaston, a Louisiana gator, learns how oil is found and produced, what kinds of oil rigs can be used, and how a new well is capped"}, {"id": "1842153234", "genre": "Children's Books", "title": "Pyramids (Fantastic Facts)", "description": "Discusses the different kinds of pyramids, their structure, construction, purposes, and creators, and suggests related projects exploring how pyramid shapes have many kinds of properties and uses."}, {"id": "0744119251", "genre": "Children's Books", "title": "Looking at the Pieces Spring Quarter Large Group Programming Guidebook: God's Story: Genesis-Revelation (Promiseland)", "description": "120 pages; 13 weeks of Large Group programming material including Bible stories taught creatively; drama scripts; music suggestions; ideas and instructions for teaching props; relevant, creative hooks into Bible teaching; and weekly Bible verses"}, {"id": "B007JC6LSW", "genre": "Children's Books", "title": "It's Milking Time", "description": "A lyrical and visual treasure—perfect for reading aloud to any child who's ever asked: Where does milk come from?As the sun sets over the fields, a little girl and her father begin the evening milking. They work side by side, fanning out beds of straw, bringing in the cows, and hooking up the milkers.Soon they've filled milk can after milk can for the creamery truck that will arrive in the morning. The fresh dairy product isn't just for them—other families will buy their milk, butter, and cheese at stores and farmers' markets near and far, connecting the little girl's farm to the world beyond.Phyllis Alsdurf has created a poetic story that lovingly depicts the special bond between a child and her father, as well as the relationship between a young farmer and her animals. With Steve Johnson and Lou Fancher's exquisite illustrations, It's Milking Time is a must-have for any picture book collection.A natural read-aloud selection for fans of Jane Yolen's Owl Moon."}, {"id": "B0084IUE1K", "genre": "Children's Books", "title": "DK Readers L4: Thomas Edison: The Great Inventor", "description": "Thomas Edison: The Greatest Inventor tells the story of the greatest inventor of the modern age, and how his creations have changed our world.DK Readers is a multi-level learning-to-read program combining DK's highly visual style with appealing stories at five graduated levels. Stunning photographs and engaging, age-appropriate stories are guaranteed to capture a child's interest while developing reading skills and general knowledge. DK Readers allow progression from stories for beginning readers with simple sentences and word repetition through to stories with rich vocabulary and more challenging sentence structure for proficient readers.  Written by leading children's authors and compiled in consultation with leading literacy experts."}]