[{"id": "0394873408", "genre": "Children's Books", "title": "The Berenstain Bears and the Bad Habit", "description": "This classic Berenstain Bears story is a perfect way to teach children about the importance of overcoming bad habits!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Join Mama, Papa, and Brother, as they try and help Sister break a very bad habit . . . biting her nails. Will she manage to get her bad habit under control, or will she end up stuck as a nail nibbler. Includes over 50 bonus stickers!"}, {"id": "B00VAL12GY", "genre": "Children's Books", "title": "Cell Wars II: Virus Invasion", "description": "** SILVER MEDAL winner of The Wishing Shelf Independent Book Awards 2014/15 ** Cell Wars is a series of books that teaches children of all ages about biology especially bacteria and viruses, cells, blood vessels, immune system and the transport of oxygen and carbon dioxide in the blood, through an adventure fictional story with black and white pictures. A creative and entertaining book for students studying GCSE and A level Biology. Bands, a white blood cell, is on a dangerous mission to find and destroy all the deadly flu viruses rapidly spreading through the body. His teacher, Master Baso and Captain Neutro have taught him so much but will it be enough?Follow the adventures of Bands in the second book of the award winning 'Cell Wars' series and find out if it is the flu virus or Bands who is exterminated.Parents - this book explains how the flu virus works in an entertaining fictional story full of real life characters and facts."}, {"id": "1427857024", "genre": "Children's Books", "title": "Disney Manga Fairies - Petite's Fairy Diary (Disney Fairies)", "description": "Petite is the smallest fairy in all of Neverland. She’s even smaller than a bug! Petite’s small size makes her clumsier than all of the other fairies in Pixie Hollow. With the Moon Banquet coming soon, all of the fairies must present their talents to Queen Clarion, but Petite hasn’t found her talent yet! Can Petite find her talent before the Moon Banquet in just a few days?  Join the fairies of Pixie Hollow in another whimsical adventure!"}, {"id": "B073ZM1NPF", "genre": "Children's Books", "title": "Robots, Drones, and Radar: Electronics Go to War (STEM on the Battlefield)", "description": "In 2011 unmanned drones flew high over Pakistan. Before anyone even knew the drones were there, missiles fired by these drones took out key terrorist targets. These drones were steered remotely by US Air Force pilots, stationed safely thousands of miles away at a base near Las Vegas, Nevada.Electronics didn't become part of warfare until the late nineteenth century. Electronics engineers developed radar to detect enemy ships and aircraft and sonar to help submarines navigate underwater. Computer scientists hope to develop artificially intelligent robot warriors that will replace human soldiers in dangerous combat situations. Read how electronics have shaped war in the modern world—and how they may change warfare in the future."}, {"id": "0545919738", "genre": "Children's Books", "title": "I Survived the American Revolution, 1776", "description": "British soldiers were everywhere. There was no escape.Nathaniel Fox never imagined he'd find himself in the middle of a blood-soaked battlefield, fighting for his life. He was only eleven years old! He'd barely paid attention to the troubles between America and England. How could he, while being worked to the bone by his cruel uncle, Uriah Storch?But when his uncle's rage forces him to flee the only home he knows, Nate is suddenly propelled toward a thrilling and dangerous journey into the heart of the Revolutionary War. He finds himself in New York City on the brink of what will be the biggest battle yet."}]