[{"id": "B076PKRCFW", "genre": "Children's Books", "title": "All About Christmas for Kids: The English Reading Tree", "description": "Introducing:  All About Christmas for KidsThe English Reading Tree Book 33 All About Christmas is aimed at children aged seven and over and is part of the English Reading Tree Series (number 33). It is a perfect tool for parents to get their children into the habit of reading.This book has been created to entertain and educate young minds. It is packed with information and trivia and had lots of authentic images that bring the topic alive.There is a quiz at the beginning and end to test how much has been learned.What people are saying about the English Reading TreeExcellent books that not only improve reading ability but educate: GoodreadsVery well presented and I particularly enjoyed the quiz at the end: Post OnlineSimple, easy to read and full of interesting facts. What more can a parent ask? Island EBooks"}, {"id": "0140565701", "genre": "Children's Books", "title": "Froggy's First Kiss", "description": "Does Froggy have a girlfriend?He can't even think straight when she's around. When Frogilina smiles at him through the monkey bars, Froggy falls smack on his head-bonk! So with Valentine's Day just a week away, Froggy gets busy making an extra-special valentine. The fifth book about the irrepressible Froggy, this is sure to keep children giggling with delight.An IRA-CBC Children's Choice Book\"The narrative is smoothly written with rhythmic language and the repetition that young children love...A great read-aloud for Valentine's Day, or whenever love is in the air.\" —School Library Journal"}, {"id": "B01BKR46WY", "genre": "Children's Books", "title": "Candy Cane Lane", "description": "A group of misfit holiday decorations come vividly to life as they try to make their way home for the holidays in this enchanting and heartwarming picture book from Scott Santoro.The houses on Candy Cane Lane have some of the most spectacular holiday decorations around, so when a winter storm hits and damages some of the festive lawn ornaments, the residents simply can’t allow the broken figures to ruin their prized displays. Many end up in the trash, including a scuffed choirboy who is sure he’ll never have a chance to bring holiday cheer to the lane again. That is, until a little girl in the only undecorated house on the block saves him and gives him a special spot on her lawn. But when a misunderstanding the next morning sends the choirboy off to the dump, he’ll have to team up with a plucky group of other discarded lawn ornaments to find his way back to the little girl and the one place everyone wants to be during the holiday season—home. With classic holiday spirit and illustrations as merry and bright as any holiday display, Scott Santoro brings Candy Cane Lane to life for readers of all ages."}, {"id": "1601150229", "genre": "Children's Books", "title": "About Space (We Both Read - Level 1-2 (Quality))", "description": "This revised edition provides exciting new information and spectacular photographs. Updates include the International Space Station, the new category of dwarf planets, and how astronauts live in space."}, {"id": "0545201004", "genre": "Children's Books", "title": "Hiro's Quest #3: The Shadow Stealers", "description": "In this exciting new chapter book series from New York Times-bestselling author Tracey West, a ninja-in-training must use skills he doesn't know he has to defeat a deadly enemy.When Hiro's family is plagued by a mysterious moon sickness, it's up to him to find a cure. Hiro, Aya, and Yoshi must journey to an ancient monastery to find answers. But along the way, they encounter the bakeneko--magical, shape-shifting cats who pose as Hiro's brothers to confuse and waylay them. To save his family, Hiro must defeat the shadow-stealing bakeneko--and the evil monk who controls them...."}]