[{"id": "B004UVQPJK", "genre": "Children's Books", "title": "ConnectiCat (Magic in Suburbia)", "description": "The Lama's nephew wasn't a great Buddhist--or even a great human. So some people might have considered his reincarnation a step backwards, but those would be the people who didn't love cats.This story originally appeared in the anthology CATFANTASTIC III, edited by Andre Norton, in 1994."}, {"id": "B00QXI555I", "genre": "Children's Books", "title": "Fire Crew! (Disney Planes: Fire & Rescue) (Step into Reading)", "description": "From the world of Cars soars Planes: Fire & Rescue, a comedy-adventure featuring a quirky crew of elite firefighting aircraft devoted to protecting historic Piston Peak National Park from raging wildfires. Boys and girls ages 4 to 6 will love this fun and exciting Step 2 Step into Reading reader!"}, {"id": "1444913018", "genre": "Children's Books", "title": "64 Zoo Lane: Kevin The Crocodile", "description": "Perfect for preschool children, 64 Zoo Lane had the highest viewing figures on CBeebies in 2011. With six classic 64 Zoo Lane stories now reissued, Lucy and her animal fans are bound to win yet more young fans.Lucy has some very strange neighbours with horns and humps, tails and trunks - that's because Lucy lives next door to the zoo! Every night, she climbs down the long long neck of Georgina the Giraffe and listens to one of them tell her a story... Tonight it's the story of Kevin the Crocodile. He's small and friendly, so when Victor tries to teach him to be fierce and mean, will it work?Have fun with 64 Zoo Lane at http://www.bbc.co.uk/cbeebies/64-zoo-lane/"}, {"id": "053121429X", "genre": "Children's Books", "title": "Taylor Swift (Real Bios)", "description": "Ever since she exploded onto the scene with her self-titled 2004 debut album, Taylor Swift has been one of the biggest stars in country and pop music. Readers will find out how Taylor went from living on a Christmas tree farm to playing sold-out stadium shows for her loyal fans, also known as Swifties. They will also learn how Taylor got her start and what she has planned for the future."}, {"id": "0399236309", "genre": "Children's Books", "title": "The Day the Animals Came: A Story of Saint Francis Day", "description": "Ria hates New York. She misses her friends, and the warm Puerto Rican sun; most of all she misses the animals she left behind. Then, one day, Ria's neighbor Mrs. Blum takes her on a surprise trip: to a big cathedral-it's the festival of St. Francis Day, when everyone brings their pets to be blessed! At first, Ria is disappointed. She doesn't have a pet of her own for blessing. But a mishap with a mischievous duck leads to Ria being asked to join the magnificent Procession of Animals, right into the church! With Groucho the duck in her arms as she dances with elephants and turtles, snakes and dogs, Ria begins to realize that she's not so far from home after all. This story of a special New York tradition has universal appeal for animal lovers of all ages, everywhere. Illustrated by Loren Long."}]