[{"id": "0531211991", "genre": "Children's Books", "title": "Ed Sheeran (Real Bios)", "description": "In the glitz and glamour world of pop music, no one would have ever predicted Ed Sheeran, with his boy-next-door looks and shy-guy personality, would become a superstar. Readers will trace Sheerans path to stardom, from his beginnings as an 11-year-old songwriter and guitarists to one of the worlds biggest pop stars. They will also learn about Sheerans collaborations with music legends such as Elton John and Taylor Swift and find out what he is planning for his next album. The well-organzied chapters help readers identify key details while the photos add clarity and enable students to better understand the text."}, {"id": "1979623090", "genre": "Children's Books", "title": "Elephants Coloring Book 1 (Volume 1)", "description": "The perfect coloring book for every child that loves elephants. 40 coloring pages filled with nothing but elephants. Art is like a rainbow, never-ending and brightly colored. Feed the creative mind of your child and have fun! Each picture is printed on its own 8.5 x 11 inch page so no need to worry about smudging."}, {"id": "1410909409", "genre": "Children's Books", "title": "1: States of Matter (Material Matters)", "description": "This book tells you everything you need to know about solids, liquids, gases, and plasma. There are loads of photos and facts to help you fully understand the topic and find answers quickly. You don't have to be a professor to understand this science book!"}, {"id": "1541417747", "genre": "Children's Books", "title": "The Hero Two Doors Down: Based on the True Story of Friendship Between a Boy and a Baseball Legend", "description": "Stephen Satlow is an eight-year-old boy living in Brooklyn, New York, which means he only cares about one thing-the Dodgers. Steve and his father spend hours reading the sports pages and listening to games on the radio. Aside from an occasional run-in with his teacher, life is pretty simple for Steve. But then Steve hears a rumor that an African American family is moving to his all-Jewish neighborhood. It's 1948 and some of his neighbors are against it. Steve knows this is wrong. His hero, Jackie Robinson, broke the color barrier in baseball the year before. Then it happens-Steve's new neighbor is none other than Jackie Robinson! Steve is beyond excited about living two doors down from the Robinson family. He can't wait to meet Jackie. This is going to be the best baseball season yet! How many kids ever get to become friends with their hero?"}, {"id": "148142422X", "genre": "Children's Books", "title": "5 Little Ducks", "description": "Make way for another perfect preschool picture book by Caldecott Honor recipient Denise Fleming!Featuring a flock of oh-so-adorable fuzzy ducklings, this delightfully fresh take on the classic Five Little Ducks nursery rhyme emphasizes numbers and the days of the week—and these lucky ducklings are doted on by a loving Papa Duck as well as the traditional Mama. Young readers won’t be able to resist counting—and quacking—along!"}]