[{"id": "1505105692", "genre": "Children's Books", "title": "1: The Story of Civilization Test Book: VOLUME I - The Ancient World", "description": "This test book serves as a companion resource to The Story of Civilization: Volume I, The Ancient World. With this book, students can test their reading comprehension and further educate themselves on the content found in the text. One quiz corresponds to each chapter in the text book. Questions for each chapter are suitable as a study exercise or as an objective answer test, with an answer key for teachers in the back. The questions include matching items, multiple choice, and true/false. The Story of Civilization series is comprised of seven different products and uses the \"schoolhouse model\" so that kids of all ages can engage with the content and the text. The child will use different products depending on their age. This test book is suggested for middle school-aged chldren.   "}, {"id": "1612548946", "genre": "Children's Books", "title": "A Wish for Winellda the Witch", "description": "Winellda the witch has but one wish--to be accepted by her friends. In A Wish for Winellda the Witch, author Esther Clark uses the magic of Halloween to teach children a lesson in acceptance in this wonderfully spooky but light-hearted children's book. Whimsical illustrations set the mood for trick-or-treating fun!"}, {"id": "193705411X", "genre": "Children's Books", "title": "Finders Keepers", "description": "When Mr. Martin hired Tomas, his son's best friend, to clear out his family's old vacant store, he was just trying to get an unsafe and dirty job done on the cheap. He told Tomas he could keep anything he found, but the offer backfires when the boy finds six valuable boxes of old Topps baseball cards in pristine condition. The cards are worth millions, and now Mr. Martin wants them as his own ... soon everyone in the small town starts taking sides or trying to get their hands on the unexpected windfall."}, {"id": "1250039894", "genre": "Children's Books", "title": "Abraham Lincoln Comes Home", "description": "When Abraham Lincoln was assassinated in 1865, the country grieved for the courageous president who had guided them through the Civil War. Over the course of thirteen somber days, people paid homage as Lincoln's funeral train made its way from Washington, D.C., to Springfield, Illinois. In moving prose and stunning paintings, a young boy experiences the deep feelings evoked by the assassination and death of a major historical figure, during a time of great change in the country."}, {"id": "1568998600", "genre": "Children's Books", "title": "Box Turtle at Silver Pond Lane - a Smithsonian's Backyard Book", "description": "Children follow Box Turtle as she stirs from her cozy bed of leaves and soil to find the perfect spot to lay her eggs. Reviewed by the Smithsonian Institution for accuracy, Box Turtle at Silver Pond Lane is a fun and informative story with beautifully detailed illustrations. Watch your children have a blast reading and learning about the animals that live in an American backyard!Book Features:- An informative storyline and colorful illustrations- Appropriate for ages 3-9- Hardcover dimensions: 12 x 8 3/4 inches"}]