[{"id": "0547928203", "genre": "Science Fiction & Fantasy", "title": "The Two Towers: Being the Second Part of The Lord of the Rings", "description": "The second volume in J.R.R. Tolkien's epic adventure THE LORD OF THE RINGSOne Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themFrodo and his Companions of the Ring have been beset by danger during their quest to prevent the Ruling Ring from falling into the hands of the Dark Lord by destroying it in the Cracks of Doom. They have lost the wizard, Gandalf, in a battle in the Mines of Moria. And Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape, the rest of the company was attacked by Orcs. Now they continue the journey alone down the great River Anduin—alone, that is, save for the mysterious creeping figure that follows wherever they go. “Among the greatest works of imaginative fiction of the twentieth century. The book presents us with the richest profusion of new lands and creatures, from the beauty of Lothlórien to the horror of Mordor.” – Sunday Telegraph"}, {"id": "B01NBB6XQ3", "genre": "Science Fiction & Fantasy", "title": "Jumping Barrel (Cyborg Sizzle Book 7)", "description": "He requires an Expert. She needs a hero.Barrel requires an Expert for the Tau Cetian orphans. He’s looking for a female who is willing to commit to a lifespan-long role, who is comfortable with moving off planet, and who, preferably, has the ability to speak the offsprings’ first language.Nola wants the role Barrel is offering so badly she bends a few truths. Yes, she was born off planet but she has lived almost all of her lifespan in sheltered Academies. Yes, she has learned Tau Cetian but she has never spoken with a local. Yes, she plans to follow the rules but his deep, sexy voice tempts her to rebel.When a fact-morphing human academic meets her battle-worn cyborg warrior, deceptions are revealed, passions flare, and circuits sizzle. Wrong seems right. Lies turn into truth. The candidate least qualified for the role becomes the one candidate Barrel can’t let go.Jumping Barrel is a short companion story in the Cyborg Sizzle series and is meant to be read after Releasing Rage, Breathing Vapor and Crash And Burn.It is also a BBW Cyborg SciFi Romance."}, {"id": "1556432526", "genre": "Science Fiction & Fantasy", "title": "4: Thunder and Roses: Volume IV: The Complete Stories of Theodore Sturgeon", "description": "Thunder and Roses is the fourth volume in The Complete Stories of Theodore Sturgeon. Included in Thunder and Roses are 15 stories, with major works like \"Maturity,\" \"The Professor's Teddy Bear,\" \"A Way Home,\" and the title story, in addition to two works never published before."}, {"id": "B00BA1F0I0", "genre": "Science Fiction & Fantasy", "title": "Plague of Spells: Forgotten Realms: Abolethic Sovereignty, Book 1", "description": "Lovecraftian Horror in Faern! Blue fire sears the face of Faern, leaving the twisted and mutilated dead in its wake. But a rare few escape death - and suffer some mystical mutation. Raidon Kane is one of those who survives, the wake of blue fire burning the sigil of the amulet he wears into his chest and binding him with all the power and responsibility it entails. With everyone he knows and cares about dead, Raidon must find within himself the strength to lead the fight against the rise of an elder evil the likes of which would be the end of mortal kind. Award-winning game designer Bruce R. Cordell depicts the rise of a monstrous nation of elder evil as only he can in this brand-new trilogy Abolethic Sovereignty. Dedicated to showcasing one of the most fascinating new aspects of the changed face of Faern, this trilogy is packed with the exciting battles, wizardry, and monsters that are the hallmark of Forgotten Realms novels as well as introducing a new never-before-seen element of Lovecraftian horror to Faern."}, {"id": "B01M34FQDF", "genre": "Science Fiction & Fantasy", "title": "Adventure (Dragons & Magic Book 2)", "description": "Hair like a waterfall at sunset, skin of pure snow, and a tinkling laugh that sends a shiver up Edmond’s spine. He knows it’s just because of Melinda’s high Charisma, but he doesn’t care. Edmond is in love.When Melinda is taken by the dragon that lives beneath their town, he knows he has to save her. In books, it’s always the lowly shop boy who succeeds where others have failed. He doesn’t have the Strength of a warrior, the Dexterity of a rogue, or the Wisdom of a magician. He just has his Luck.Luck and a best friend with muscles like boulder-covered rocks."}]