[{"id": "1597163872", "genre": "Children's Books", "title": "African Elephant: The World's Biggest Land Mammal (Supersized!)", "description": "In African Elephant, young readers follow elephants living in the savannahs of Africa as they learn about their natural habitat, physical characteristics, diet, life cycle, and behavior. Age-appropriate text paired with colorful photographs will engage young readers as they discover how the world's largest land mammal adapts to its environment for survival. African Elephant includes such useful and fun learning features as a detailed diagram that compares the animal's super size to something familiar in kids' own lives."}, {"id": "B076T8RVBL", "genre": "Children's Books", "title": "KidNewsMaker", "description": "Christon 'The Truth' Jones is a 10-year-old Les Brown certified motivational speaker, best-selling author and nationally ranked football player while Taylor Richardson at 14 is already preparing to set off into space. Nine-year-old BreAnn Ferguson opened a care closet to help young hurricane victims and Alejandra Stack talks activism as an NAACP Youth Council President who met the last of the original Freedom Riders. Tamara Lewis wraps it up giving some solid advice as a momager in the parenting section of this edition of KidNewsMaker magazine, published by a 12-year-old award-winning journalist."}, {"id": "0749652322", "genre": "Children's Books", "title": "Muslim (Beliefs & Cultures)", "description": "This book covers every aspect of the Muslim faith. Interviews with adults and children practising the fa ith help further in bringing it to life. '"}, {"id": "1936313367", "genre": "Children's Books", "title": "Soccer World: Spain: Explore the World Through Soccer", "description": "Journeying to the country that won the 2010 FIFA World Cup, this book explores the culture of Spain through the world’s most popular sport: soccer. From watching an amazing game between world class rivals Real Madrid and FC Barcelona to exploring island volcanic landscapes and witnessing the many fiestas that are celebrated there, readers join professional soccer player Ethan Zohn on the experience of a lifetime. Activities generated from each chapter include learning a phrase in each of the different languages that Spain recognizes, making a sand-drip sand castle to understand the concept of surface tension, and creating a time capsule unique to a family's culture and era. Readers will also have the opportunity to research a real project in Spain through which they can give back and make a difference in this fascinating country."}, {"id": "154711259X", "genre": "Children's Books", "title": "Happy Birthday 8: Birthday Books For Boys, Birthday Journal Notebook For 8 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]