[{"id": "1608867714", "genre": "Children's Books", "title": "Steven Universe Original Graphic Novel: Too Cool for School", "description": "We're going to give you another reason to Believe In Steven!Schoolboy Steven, activate! Steven finds himself enrolled in Connie’s school after a show-and-tell lesson goes awry...and things just get crazier from there! Steven is having a hard time fitting in with normal school and Connie just wants to graduate with good grades and a clean record, but when gem and homework collide, who knows what will happen. This is a lesson you don’t want to miss! Based on the success of the Adventure Time and Regular Show original graphic novels, KaBOOM! is kicking off a series of brand-new stories about the misadventures of Steven Universe and the Crystal Gems!"}, {"id": "0689843941", "genre": "Children's Books", "title": "Marsupial Sue Book and CD", "description": "If you're a Kangaroo  through and through,  Just do what Kangaroos do.  Young Sue really doesn't like being a kangaroo, so she goes off to find something better. First she tries climbing the trees like a koala, but that doesn't work. Then she wades into the sea like a platypus, but that's no good either. Finally, Sue joins up with some bouncy, jouncy wallabies...and discovers that being a kangaroo isn't so bad, after all.  Using a jaunty waltz rhythm, actor, comedian, and best-selling author John Lithgow reassures children that they can be happy with who they are.  For listening or singing along, a CD of a John Lithgow performance of Marsupial Sue and an instrumental version is included with this book, as is the score of the song."}, {"id": "0742428656", "genre": "Children's Books", "title": "Bible: Biblical Women Flip-Flash (Flip-flash Bible)", "description": "                          Great for large or small groups, pairs, or individual use.  Features 79        Bible questions and answers.  Increases Bible knowledge.  Perfect as a        game or Bible drill.         "}, {"id": "1547086211", "genre": "Children's Books", "title": "Happy Birthday 98: Birthday Books For Adults, Birthday Journal Notebook For 98 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "0688154778", "genre": "Children's Books", "title": "Mountains", "description": "\"In the trademark Simon style, carefully selected color photos, drawings, and a clear and informative text tell the story of Earth's mountains: their formation, relative sizes, ecology, and influence on weather....Simon may have done more than any other living author to help us understand and appreciate the beauty of our planet and our universe;"}]