[{"id": "1506704972", "genre": "Children's Books", "title": "Plants vs. Zombies Volume 10: Rumble at Lake Gumbo", "description": "Calling all Cat-Tail Commanders and Spudmarines--the battle for clean water begins! As soon as Dr. Zomboss discovers Lake Gumbo near Neighborville, Gargantuars start posing on Muscle Beach, volleyballs bounce off bungee zombies, and Zomboss uses a giant underwater drill to muddy and pollute the lake!Neighborhood defenders Nate, Patrice, and Crazy Dave spot trouble and grab all the Tangle Kelp and Party Crabs they can to quell another zombie invasion! Having a new Security Gourd group, the unique Kelptomaniac, and returning pig-dog Twister on their side, Paul Tobin and Ron Chan return to the series they helped make a bestselling hit--with bonus stories by Kevin Burkhalter and Christianne Goudreau."}, {"id": "0995577064", "genre": "Children's Books", "title": "BUGS!: Explorer", "description": "Leave no stone unturned with our explorer to uncover the fascinating world of bugs. Our six-foot-long timeline features over 100 bugs from their first appearance about 230 million years-ago through to their living descendants, and how they survived and thrived. Then join our explorer on his quest to find out as much as possible about these amazing creatures in his fascinating journal. Find out why they were so successful, who discovered the first one, how they support our environment and more!"}, {"id": "0766088391", "genre": "Children's Books", "title": "Zoom in on Power Grids (Zoom in on Engineering)", "description": "When we flick on a lamp switch, we rarely think of the science and engineering behind the light. This straightforward and accessible text informs readers about the interconnected network that electricity takes as it moves from suppliers to users. From power stations and voltage switches to the power lines that lead to our homes, readers will gain a greater understanding of the energy we use every day. A follow-up activity utilizes a maze that allows readers to trace the correct path of electricity through a power grid."}, {"id": "B00OGJ6C8A", "genre": "Children's Books", "title": "I Love Hockey", "description": "First words for future hockey stars! This board book explores all our favorite things about hockey, complete with engaging photographs and text. Perfect for the youngest hockey fans!"}, {"id": "0027623629", "genre": "Children's Books", "title": "Simon & Schuster's Children's Guide To Dinosaurs And Other Prehistoric Animals", "description": "An authoritative reference guide to the animals of the prehistoric world offers a chronological study of five different geological periods, with profiles of the dinosaurs and other animals who lived during each. BOMC."}]