[{"id": "B00B3M49F6", "genre": "Children's Books", "title": "At Home with the Gopher Tortoise: The Story of a Keystone Species", "description": "At Home with the Gopher Tortoise: The Story of a Keystone Species teaches young readers about the gopher tortoise and the more than 360 different kinds of animals that depend on it for survival. From owls to rabbits, from skunks to scorpions, the gopher tortoise provides creatures with shelter, food, or a place to raise their young. In this fascinating tale of ecological interdependency, glorious illustrations reveal the gopher tortoise's world both below and above ground, showing children how the fate of one species is important to so many others."}, {"id": "B0099QA6R8", "genre": "Children's Books", "title": "The Voyage of the Dawn Treader: Quest for the Lost Lords (I Can Read Book 2)", "description": " When Edmund, Lucy and Eustace are pulled into Narnia through a painting, they find themselves aboard the Dawn Treader, the ship of their friend King Caspian. Together, they must find and rescue the seven lords who were exiled by the tyrant Miraz, King Caspian’s uncle. "}, {"id": "1591975204", "genre": "Children's Books", "title": "Air Force One (Symbols, Landmarks, and Monuments Set 2)", "description": "Explores the history and usage of aircraft to transport the president, especially Air Force One, the planes which have been a symbol of the United States for fifty years."}, {"id": "1554397049", "genre": "Children's Books", "title": "Extreme Canadian Weather: Freakish Storms and Sudden Disasters", "description": "The weather in Canada is rarely boring. The country experiences just about every type of wild weather possible, including tornadoes, droughts, dust storms, ice storms, hail storms, hurricanes, floods and lots of snowstorms. There are times when the weather has been so extreme, it has surprised everyone."}, {"id": "1511891432", "genre": "Children's Books", "title": "Adventures Of A Minecraft Creeper: An Unofficial Minecraft Novel", "description": "Yes, on popular demand, Alex Brian has written a full length novel on the life of a creeper in Minecraft! So, here we go. Enjoy! Another adventurous Minecraft book by the Best Selling Author 'Alex Brian'! A Story That Has Never Been Told Before... Explore the world of Minecraft with the creeper. In this novel, Adventures Of A Minecraft Creeper, you will meet the creeper again and get involved in the hilarious adventures of the creeper. Thanks For All Your Support And Giving So Much Love To All Of Alex Brian's Collections!"}]