[{"id": "B075CQN1FL", "genre": "Science Fiction & Fantasy", "title": "The Defender of Rebel Falls: A Medieval Science Fiction Adventure (The William Whitehall Adventures Book 1)", "description": "The pen may be mightier than the sword, but William Whitehall knows which one feels better in his hand. As a librarian—a reluctant one—his reports catch the eyes of a powerful nobleman, who selects William for an important mission. As he faces danger after danger, he soon realizes that having the right weapon is one thing, but having the wits to use it is quite another. Because when he faces his ultimate challenge, it's more than just his own life at stake."}, {"id": "0765305356", "genre": "Science Fiction & Fantasy", "title": "2A: The Science Fiction Hall of Fame, Volume Two A: The Greatest Science Fiction Novellas of All Time Chosen by the Members of The Science Fiction Writers of America (SF Hall of Fame)", "description": "Eleven essential classics in one volumeThis volume is the definitive collection of the best science fiction novellas published between 1929 and 1964, containing eleven great classics. No anthology better captures the birth of science fiction as a literary field. Published in 1973 to honor stories that had appeared before the institution of the Nebula Awards, The Science Fiction Hall of Fame introduced tens of thousands of young readers to the wonders of science fiction and was a favorite of libraries across the country. This volume contains novellas by Poul Anderson, John W. Campbell, Lester del Rey, Robert A. Heinlein, C.M. Kornbluth, Henry Kuttner and C. L. Moore, Eric Frank Russell, Cordwainer Smith, Theodore Sturgeon, H. G. Wells, and Jack Williamson."}, {"id": "1601252471", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Chronicles: Heart of the Jungle", "description": " Set the scene for the Serpent’s Skull Adventure Path or paint a vivid backdrop for thousands of untold wilderness adventures with this wide-ranging jungle campaigning sourcebook.  Learn the terrible secrets that lurk below the darkened canopy of the Screaming Jungle, dare the treacherous territory of the Gorilla King, and explore the fallen air-cities of long-dead cultures! Discover the secrets to surviving in the hostile Mwangi Jungle — and how to make it a memorable threat for players. Unearth lore about the strange creatures who live in the Mwangi expanse and their even stranger deities. All this and more awaits in this overview of the Mwangi Expanse, an unmapped green hell in the southern reaches of the Pathfinder Chronicles Campaign Setting. "}, {"id": "B018WS0CN6", "genre": "Science Fiction & Fantasy", "title": "Zombie's Bite (Dorina Basarab series)", "description": "When Dorina Basarab, half human, half vampire, assassin-for-hire, hits New Orleans, she thinks it's for a typical job: take out a mad master vamp before he can wreak havoc on the city. But when the elusive master suddenly shows up at her hotel, things get complicated, especially when Dory realizes that the murder he has in mind is his own! And that the Big Easy is about to get a whole lot harder."}, {"id": "B076CN9M5P", "genre": "Science Fiction & Fantasy", "title": "Fallen Angels (Dystopian Child Prodigy SciFi) (The Unmaker Series Book 2)", "description": "The tale of the healer continues.The second installment of a high-paced, action-packed series which combines post-apocalyptic tones with Sci-Fi action and will have you turning each page with excitement.Follow Callum Thorpe and Dante Castello as they face the consequences of their actions and prepare for a bleak future which may be even uglier than their present. Our heroes must prepare for the biggest challenges of their lives, and there may not be any allies around to help them anymore.Can Dante keep himself safe within the dark, dangerous corridors of the University, or will he be consumed by his unseen enemy?"}]