[{"id": "140530359X", "genre": "Children's Books", "title": "What Makes Me Me? (Big Questions)", "description": "Why does your mum love broccoli and your dad hate it? Why are you a marvel at maths, while your sister is terrific at tennis? Robert Winston explains that biology isn't just science and shows how your social and emotional self is created; what makes you an individual and why. Your body's biology is explained, and information is made fun and interactive with real-life scenarios as you really discover - what makes you you!"}, {"id": "B000SI127Y", "genre": "Children's Books", "title": "Everybody Tells Me to Be Myself but I Don't Know Who I Am: Building Your Self-Esteem (Faithgirlz)", "description": "This new Faithgirlz!™ book helps girls ages eight to twelve develop God-centered self-esteem. Every girl is unique and beautiful, but not every girl sees herself that way. And with the often conflicting messages girls get—from the media, from boys, from parents and teachers, and from each other—it’s no wonder that many of them never learn who they really, truly are. As a result, girls regularly hand over decisions and choices ofVarying importance to friends and peers who are less qualified to make them, with often tragic consequences. In Everybody Tells Me to Be Myself But I Don't Know Who I Am, girls explore the big questions about authenticity and self-esteem through journaling, Scriptures, quizzes, and creative activities, as well as straight talk—in language just right for girls eight to twelve—from Faithgirlz!™ author Nancy Rue, who helps each girl grow into the young woman God created her to be."}, {"id": "0974690112", "genre": "Children's Books", "title": "Lolek - The Boy Who Became Pope John Paul II", "description": "Lolek is a celebration of the childhood of Pope John Paul II. He was a little boy who, despite tragedy and oppression in his young life during World War II, was a shining example for his peers and adults alike. Pope John Paul II was a world class freedom fighter, campaigning for world peace as a human rights advocate and defender of the oppressed. During his combat against world poverty, he taught that every life is precious no matter one's nationality or religious belief, whether one is rich or poor, young or old. One of Lolek's greatest achievements was the downfall of Communism in Europe. He encouraged people to feel their own power, and the power of faith led to the freedom of half a continent. Children 4-12 years."}, {"id": "1338099132", "genre": "Children's Books", "title": "Harry Potter and the Cursed Child, Parts 1 & 2, Special Rehearsal Edition Script", "description": "  Normal 0     false false false  EN-US X-NONE X-NONE            MicrosoftInternetExplorer4              \"The Eighth Story. Nineteen Years Later.Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany, a new play by Jack Thorne, Harry Potter and the Cursed Child is the eighth story in the Harry Potter series and the first official Harry Potter story to be presented on stage. The play will receive its world premiere in London’s West End on July 30, 2016. It was always difficult being Harry Potter and it isn’t much easier now that he is an overworked employee of the Ministry of Magic, a husband and father of three school-age children.While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places.\" "}, {"id": "0763634808", "genre": "Children's Books", "title": "Roman Diary: The Journal of Iliona of Mytilini: Captured and Sold as a Slave in Rome - AD 107", "description": "Relive the drama of the Roman Empire through the eyes of a young Greek slave in this latest installment in an acclaimed historical series.Iliona never imagined that her sea voyage from Greece to Egypt would lead her to Rome. But when her ship is boarded by pirates, that's where she ends up -- as a slave. Separated from her brother, Apollo, Iliona is soon at the whim of her owners, and the chance of regaining freedom seems like a distant dream. But unlike her brother's plight, Iliona's life as a slave isn't as bad as she feared: her new family provides clothing, food, and even schooling, and best of all, she is free to explore the wonders of Rome. Step back to AD 107 and take in the luxury of the baths, the splendor of the Senate, the thrill of gladiatorial combat, and the excesses of Roman feasts in a fictional diary full of excitement, humor, and accurate historical detail.Back matter includes notes for the reader, a glossary, an index, and sources."}]