[{"id": "B013VIZ5Z2", "genre": "Children's Books", "title": "Brendon & Carson's Ninja Adventures: Rise of BAD BOYS INC. (Brendon and Carson's Ninja Adventure Series Book 2)", "description": "Book 2 in Brendon and Carson's Ninja Adventures.Once again you and Ninja Force must save the day and stop BAD BOYS INC. from taking over the world.  An Interactive, adventure story, and puzzle book.  Great for the young and young at heart interested in the martial arts.  It's all up to you and Ninja Force to stop BAD BOYS INC and their Supreme Leader.  Help the boys solve puzzles and save the day!"}, {"id": "1974292878", "genre": "Children's Books", "title": "Hello 4th Grade: Back To School Notebooks For Fourth Grade (Composition Notebooks)(8.5 x 11)(Journals For Kids To Write In)", "description": "Cute & Cool Composition NotebooksThis awesome school journal for kids has 120 lined pages measuring 8.5 x 11 that people will be jealous of. Stop buying those boring composition books and grab one of these fun and exciting school notebooks.Great gift ideas for teachers and students. Perfect for back to school supplies, birthday gifts and Christmas gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "1852103213", "genre": "Children's Books", "title": "The Witness History (Witness history series)", "description": "This series discusses some of the major historical topics through a mixture of narrative and analysis of the key issues involved. Each book is designed to introduce the reader to a wide range of contemporary sources and aims to encourage readers in the handling and assessment of original historical material. This particular book traces the development of the Third Reich from the end of the First World War to its collapse in 1945. It begins by examining the Weimar Republic and the reasons why it failed, and goes on to look at the rise of the Nazi party and the appointment of Hitler as Chancellor in 1933. It assesses the consolidation of power by the Nazis in the early 1930s and the development of Nazi social, economic and racial policies up to 1945. The author also covers the fate of the Jews and analyzes the reasons why oppposition to the regime failed. Finally the book examines Hitler's foreign policy and the impact of the Second World War on Germany. The author has also written \"Bismarck and Germany (1862-1890) and \"The Third Reich.\""}, {"id": "1484781449", "genre": "Children's Books", "title": "Thomas Paine and the Dangerous Word", "description": "\"The mind once enlightened cannot again become dark.\"As an English corset-maker's son, Thomas Paine was expected to spend his life sewing women's underwear. But as a teenager, Thomas dared to change his destiny, enduring years of struggle until a meeting with Benjamin Franklin brought Thomas to America in 1774-and into the American Revolution. Within fourteen months, Thomas would unleash the persuasive power of the written word in Common Sense-a brash wake-up call that rallied the American people to declare independence against the mightiest empire in the world. This fascinating and extensively researched biography, based on numerous primary sources, will immerse readers in Thomas Paine's inspiring journey of courage, failure, and resilience that led a penniless immigrant to change the world with his words."}, {"id": "B00KDLSVZM", "genre": "Children's Books", "title": "Twenty-Four Vincent van Gogh's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Vincent van Gogh's Paintings. Twenty-Four Vincent van Gogh's Paintings for Kids There are colorful, youthful, and inspirational."}]