[{"id": "0230709257", "genre": "Science Fiction & Fantasy", "title": "The Gabble and Other Stories", "description": "In the eight years since his first full-length novel Gridlinked was published by Pan Macmillan, Neal Asher has firmly established himself as one of the leading British writers of Science Fiction, and his novels are now translated in many languages. Most of his stories are set in a galactic future-scape called `The Polity', and with this collection of marvellously inventive and action-packed short stories, he takes us further into the manifold diversities of that amazing universe. No one does monsters better than Neal Asher, so be prepared to revisit the lives and lifestyles of such favourites as the gabbleduck and the hooder, to savour alien poisons, the walking dead, the Sea of Death, and the putrefactor symbiont. Through these thirteen stories, welcome to a universe of unbridled imagination, each one of them a delight in itself."}, {"id": "B008PXORQW", "genre": "Science Fiction & Fantasy", "title": "The Iron Trail: An Alaskan Romance (Classic Reprint)", "description": "DfACT THAT HAD SPRUNG UP BETWEEN THEM Frontispiece SHE FELT THAT HER ADVENTURE HAD BEEN A GREAT SUCCESS Facing p, 42 night after night they discussed the wonderful change in their fortunes i3o tell me, why did you insist on coming? ... 208 its breaking up! he shouted, its breaking up! 242 i didnt realize how deeply you kids care for EACH other and FOR ME 302 come! well be married to-day .....(Typographical errors above are due to OCR software and don't occur in the book.)About the Publisher Forgotten Books is a publisher of historical writings, such as: Philosophy, Classics, Science, Religion, History, Folklore and Mythology.Forgotten Books' Classic Reprint Series utilizes the latest technology to regenerate facsimiles of historically important writings. Careful attention has been made to accurately preserve the original format of each page whilst digitally enhancing the aged text. Read books online for free at www.forgottenbooks.org"}, {"id": "B00TISP5Q4", "genre": "Science Fiction & Fantasy", "title": "Dreamcaster, part one: A Fantasy Romance", "description": "A story of magic and steamy romance!With her home city occupied by brutal invaders, Marla is a young woman scraping to get by on the fringes. Struggling to keep a low profile, she has only tantalizing memories of a past that was very different. Memories and dreams... Who is the mysterious man who comes to her in those dreams, and why is Marla being hunted down?A story of magic, mystery, romance and brutality in a war-torn fantasy world where love lies in tatters and one woman may hold the key.**Dreamcaster is published in the short serial format, with each of the four instalments available free via Kindle Unlimited and Kindle Select**"}, {"id": "1568822227", "genre": "Science Fiction & Fantasy", "title": "Gaslight Equipment Catalogue (M.U. Library Assn. monograph, Call of Cthulhu #0319)", "description": "Miskatonic University Library Association monographs are works in which the author has performed most or all editorial and layout functions. This work has not been otherwise edited or modified. The trustees deem that this work offers significant value and entertainment to our patrons.THE GASLIGHT EQUIPMENT CATALOGUE: Being a Compendium of various useful articles and sundries for the Victorian era, together with information pertaining to their use."}, {"id": "1416527419", "genre": "Science Fiction & Fantasy", "title": "Q&A (Star Trek: The Next Generation)", "description": "Nearly two decades ago, Jean-Luc Picard took command of the U.S.S. Enterprise™ NCC-1701-D. The captain knew it was an honor without equal. His new command bore the name of Enterprise. The people who had commanded other like-named starships had gone down in Starfleet's annals. Some officers would be intimidated, but they would not have been given command of Enterprise.   On her first mission, the Enterprise was sent to Farpoint Station. A simple, straightforward investigation. Perfect for a crew that had never served together. Then there was Q. An omnipotent lifeform that seemed bent on placing obstacle after obstacle in the ship's -- and in particular in Picard's -- way. And it hadn't ended with that first mission. When he was least expected, Q would appear. Pushing, prodding, testing. At times needling captain and crew with seemingly silly, pointless, and maddening trifles. Then it would turn all too serious, and the survival of Picard's crew was in Q's hands.   Why was it today that Picard was remembering the day he took command of the Enterprise-D? Now he commanded a new ship, the Enterprise-E. His crew was different. There was nothing about Gorsach that in the least resembled Farpoint. But Picard couldn't shake the feeling that something all too familiar was going on. All too awful. All too Q."}]