[{"id": "1481486861", "genre": "Children's Books", "title": "The Little Reindeer", "description": "“An original and entertaining Christmas story with its own understated charm.” —Kirkus Reviews (starred review) “A quietly magical tale of holiday miracles and nighttime adventure.” —Publishers Weekly  “Killen works magic through simplicity in this understated holiday story…A perfect bedtime read; little ones will cozy up to this sweet book and drift off on their own reindeer-fueled flights of fancy.” —Booklist “An elegant book that has a calming effect; a perfect holiday bedtime story.” —School Library Journal  A HORN BOOK HOLIDAY HIGH NOTE An enchanting Christmas story about a magical yet unlikely friendship between a little girl and a lost reindeer sure to be a Christmas classic lovingly told and illustrated with red foil highlights and interactive die cuts.When a jingling sound wakes her from her sleep, a little girl’s dreams come true when she meets a lost reindeer in the forest. They set off on a magical adventure and it becomes a Christmas never to forget. Nicola Killen’s evocative illustrations are sure to enchant in this beautiful book with die cut pages, foil, and flashes of festive red."}, {"id": "0307931633", "genre": "Children's Books", "title": "Babymouse #20: Babymouse Goes for the Gold", "description": "Winner of the Eisner Award and multiple children’s choice awards and with over two million books sold, kids, parents, and teachers agree that Babymouse is perfect for fans of Junie B. Jones, Ivy and Bean, Bad Kitty, and Dork Diaries!    Babymouse has big dreams . . . and wet whiskers. She has joined the swim team and is ready to dive in. Next stop, the Olympics! But competitive sports aren’t really her strong suit. Will hard work and determination earn her a gold medal?   NEW YORK TIMES BESTSELLING, THREE-TIME NEWBERY HONOR–WINNING author Jennifer Holm teams up with Matthew Holm to bring you a graphic-novel series packed with humor and kid appeal: BABYMOUSE! "}, {"id": "1549967517", "genre": "Children's Books", "title": "Greek Titans: Titans of Greek Mythology", "description": "Looking at the past through the prisms of Greek Mythology not only provides an insight into history but also exhibits the endless creativity of the human mind. The Titan gods are the lesser known gods, but they are, nonetheless, very fascinating. Enriched with a wealth of riveting tales, the eBook discusses the Titans and the primordial deities that were the forebears of all the famous Olympian gods. It relates the stories of the Titans before and after the rise of the Olympians and the monumental war of the Titanomachy. The Twelve Titans including Theia, Hyperion, Oceanus, Coeus, Cronus, Phoebe are discussed in different chapters. Interesting stories of each god are told."}, {"id": "B00DQI0OZO", "genre": "Children's Books", "title": "The Time Machine", "description": "H. G. Wells' classic science fiction masterpiece The Time Machine explores human nature. The Time Traveler finds himself in 802,701 A.D., where he meets the peaceful Eloi and encounters the violent Morlocks. Wells uses these two descendants of man to explore evil and its causes, drawing conclusion that might surprise you in this riveting tale that has stood the test of time."}, {"id": "0385904231", "genre": "Children's Books", "title": "Horse Play (Saddle Club(R))", "description": "THE SADDLE CLUB would do anything to help a friend in need. So when Stevie overhears Max on the phone mysteriously pleading for more time and more money, she, Lisa, and Carole, know what they need to do. Pine Hollow is clearly in trouble and it's up to the Saddle Club to save the day. But while the girls are plotting good deeds, someone is pulling pranks on them! Could it be the same person who wants to see Pine Hollow sold to the highest bidder?From the Trade Paperback edition."}]