[{"id": "1465444920", "genre": "Children's Books", "title": "My First Body (My First (DK Publishing))", "description": "Children can learn about their body in My First Body, an informational board book featuring images illustrating parts of the body. The bold, visual images are labeled clearly and promote early learning and language skills. The books are a sturdy format that is ideal for small hands to hold and carry, and the pages are filled with a distinctive, iconic design. The books can be read either alone or with an adult, and encourage learning on your own. Explore the amazing human body in My First Body.This revamp of DK's most successful board books series includes updated photography, contemporary design, and an insightful approach to engaging preschoolers. With charming, bold design, clear labels, and a wide variety of topics, these first learning books encourage children to build the vocabulary and language skills that form the foundation of early education. DK's iconic My First board book series not only provides a collection of educational information books that children can refer back to again and again, but also offers a first taste of independent learning."}, {"id": "0778728587", "genre": "Children's Books", "title": "Extreme Structures: Mega-Constructions of the 21st Century (Science Frontiers)", "description": "Provides answers to such questions as \"Where are the tallest skyscrapers?\" and \"Can our structures use less energy for a cleaner world?\""}, {"id": "1429660511", "genre": "Children's Books", "title": "Betta Fish (Colorful World of Animals)", "description": "Bright colors can be a warning! Betta fish may not look fierce, but these fish have ways to keep others away. Read Betta Fish to find out how these fish use their colors to stay safe."}, {"id": "B003HOXLDE", "genre": "Children's Books", "title": "Kids Around the World Celebrate!: The Best Feasts and Festivals from Many Lands", "description": "Everyone loves a reason to have a good time, and although cultures around the world have their own unique feasts and festivals, we all share many of the same reasons to celebrate. Now you can learn about the many ways people from around the globe celebrate their special days, and join in the fun!  Celebrate Chinese New Year while making chiao-tzu dumplings, then pop over to Saudi Arabia and taste delicious date-nut cookies called ma amoul while celebrating Eid ul-Fitr. Make an elaborate Venetian mask to wear at a masquerade ball in Venice during carnevale, then pound out a festive rhythm on the Igbo drum you ve made and celebrate the Iriji festival in Nigeria. Eat, drink, and make merry with the many diverse and exciting crafts, recipes, and activities in this book. No matter what language you say it in, celebrations are fun!"}, {"id": "0606405755", "genre": "Children's Books", "title": "What a Team! (Frozen) (Turtleback School & Library Binding Edition) (Disney Frozen)", "description": "An original story starring Anna, Elsa, and Kristoff from Disney Frozen competing in the Ice Games--plus stickers!  An original story featuring the beloved characters from Disney Frozen! Kristoff has always wanted to take part in the Ice Games--days of fun winter competitions. But growing up with trolls and a reindeer, he didn't have any human friends to make a team. Anna and Elsa are happy to help their friend--and have some fun along the way! This full-color storybook starring the beloved characters from Disney Frozen is great for children ages 3 to 7, and it comes with more than 30 stickers! Disney Frozen is the #1 animated film of all time, featuring a powerful story, a strong ensemble cast, a pair of relatable sisters, magical environments, and unforgettable music."}]