[{"id": "1404812571", "genre": "Children's Books", "title": "Happy Easter, Gus! (Read-It! Readers: Gus the Hedgehog)", "description": "Gus and friends prepare for the Easter egg hunt at school with a giant chocolate egg for first prize."}, {"id": "0763652806", "genre": "Children's Books", "title": "Summertime Rainbow: A Mandarin Chinese-English bilingual book of colors", "description": "In English and Mandarin Chinese, Belle Yang's bilingual board books celebrate the natural world with simple concepts and beautiful, bold illustrations.It's summer, and the meadow is in full bloom. As some bunnies hop along, they see blue sky, white clouds, and yummy green grass. How many more colors can be found? Look for an explanation of tonal marks at the end of the story, along with pinyin translation of the Chinese characters."}, {"id": "B0099R1Z86", "genre": "Children's Books", "title": "Here Comes Pixie Pie (A fun rhyming children's book)", "description": "A fun rhyming picture book perfect for all little girls.  This story is about family and friendship.  Your child will use her imagination as she places herself in the story as Pixie Pie's friend.  If you favor Dr. Seuss you will love this.  Ages:  Pre-K through 4th GradeSecond Reader"}, {"id": "B01N1R8LS4", "genre": "Children's Books", "title": "Balancing, Tipping and Survival: A Toy Modeling Eco-Adventure", "description": "Taking you on an eco-adventure, this book uses fun toy models and beautiful illustrations to explore ecosystem balancing and tipping.  This is important because our ecosystem is at the brink of tipping into a sixth mass extinction, and because modeling is a fundamental scientific skill often neglected in schools. Readers will learn how to model change while also learning about actions we can take to preserve the health of our ecosystem. The book also gives you a password to access to online toy models that give further depth to the learning experience and enjoyment."}, {"id": "0141328738", "genre": "Children's Books", "title": "Moomin's Little Book Of Numbers", "description": "One Moomin, two trees, three umbrellas, four clouds . . . Count along with Moomintroll all the way from one to ten, and beyond. A companion volume to Moomin's Little Book of Words, this chunky little board book is just right for little hands and early learning - and there's plenty of Moomin magic along the way."}]