[{"id": "076133257X", "genre": "Children's Books", "title": "Magnetism (Science Factory)", "description": "This colorfully illustrated book provided middle readers with an introduction to magnetism and its important force on nature, complete with experiments and hands-on projects."}, {"id": "0613443780", "genre": "Children's Books", "title": "The Book Of The Lion (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Set in medieval England, young Edmund's life is forever changed when he joins Richard \"\"the Lionheart's\"\" army, fights in the Battle of Arsuf, and experiences the horrors of war."}, {"id": "1534411992", "genre": "Children's Books", "title": "Power Forward (Zayd Saleem, Chasing the Dream)", "description": "From the critically acclaimed author of Amina’s Voice comes the first book in an exciting new chapter book series about a fourth-grader with big dreams of basketball stardom.Fourth grader Zayd Saleem has some serious hoop dreams. He’s not just going to be a professional basketball player. He’s going to be a star. A legend. The first Pakistani-American kid to make it to the NBA. He knows this deep in his soul. It’s his destiny. There are only a few small things in his way. For starters, Zayd’s only on the D-team. (D stands for developmental, but to Zayd it’s always felt like a bad grade or something.) Not to mention, he’s a bit on the scrawny side, even for the fourth grade team. But his best friend Adam is on the Gold Team, and it’s Zayd’s dream for the two of them to play together. His mom and dad don’t get it. They want him to practice his violin way more than his jump shot. When he gets caught blowing off his violin lessons to practice, Zayd’s parents lay down the ultimate punishment: he has to hang up his high tops and isn’t allowed to play basketball anymore. As tryouts for the Gold Team approach, Zayd has to find the courage to stand up for himself and chase his dream."}, {"id": "1630762288", "genre": "Children's Books", "title": "Ranger Rick's Big Book Backyard Fun (Ranger Rick: Big Books)", "description": "Ranger Rick: Big Book of Backyard Fun is a collection of the best games, stories, and activities from Ranger Rick Magazine. Colorfully illustrated and full of exciting activities for kids, this is the perfect addition to any young explorer's library!Learn about common birds, bugs, and mammals that inhabit your backyard, and discover how to attract wildlife with easy-to-build bird feeders, bug hotels, and even a corny squirrel swing! Additional chapters on life after dark and your backyard during winter explore the animals that emerge at night, as well as the science of snow and ice. This book also includes a special section on backyard nature photography, including \"Six Tricks for Great Pix.\""}, {"id": "1538325357", "genre": "Children's Books", "title": "Deforestation and Habitat Loss (Earth's Environment in Danger)", "description": "Forests are essential to human and animal survival. Trees produce the oxygen animals need to live. They also provide homes for animals and resources for people. However, Earth's forests are under attack. Deforestation is caused by fires, clear cutting, logging, and climate change. Forests are important to mitigating climate change because they suck up harmful carbon dioxide. Without forests, many plant and animal species would be at risk of becoming endangered or extinct. Complete with manageable text and stunning photographs of forests, both healthy and threatened, this book covers essential concepts featured in elementary earth science curricula."}]