[{"id": "0763662518", "genre": "Children's Books", "title": "Bramble and Maggie: Horse Meets Girl (Candlewick Sparks)", "description": "Come along for a spirited ride as Bramble - a horse with interesting \"little ways\"- and her devoted girl, Maggie, make their debut in this inviting early reader.Maggie wants a pony to ride and take care of, and to prepare she's been reading a big book on horse care. Meanwhile, Bramble is bored with giving riding lessons and walking in circles. She's looking for just the right person to take her away from her routine. Is it a perfect match? Maggie loves Bramble as soon as she sees her, but there are some things Bramble has to be sure of. Will Maggie let Bramble venture into new places? Will she protect Bramble from strange objects in the yard? Will she, most importantly, know when Bramble needs her undivided attention? This charming and funny early reader is an ideal match for young animal lovers and anyone who has ever longed for a friend who truly understands."}, {"id": "1617832162", "genre": "Children's Books", "title": "African Animals", "description": "Dash with the cheetah and graze with the zebra! This vibrant series invites readers to travel to the continent of Africa and meet its most fascinating animals. Bold colors, easy-to-read text, and oversized, striking photos introduce readers to each animals body structure, diet, life cycle, social behavior, habitat, ways of communication, predators, methods of defense, and threats to its survival. Simple, labeled maps highlight the animals home territory. Interesting information about Africa is also given, leaving readers with a deeper understanding of this amazing continent and its incredible animals! Features include a table of contents, fun facts, maps, a glossary with phonetic spellings, and an index. Big Buddy BOOKS is an imprint of ABDO Publishing Company."}, {"id": "0061119733", "genre": "Children's Books", "title": "Biscuit Big Book (My First I Can Read)", "description": "Biscuit, the little yellow puppy, is so excited and energetic that he would rather play than go to bed, in an oversized read-aloud edition of a classic story for young children. Reprint."}, {"id": "B015ASXL4S", "genre": "Children's Books", "title": "Tadd Tyler: Love, Murder, and Runaways in New York", "description": "Cocksure Tadd Tyler is tired of his Mother trying to fix him up with domestically inclined Rebecca Scone. Yielding to his yen to travel he runs away with his friend , Matthew Custis,to the Pan American Exposition to see a working light bulb for the first time and to shake the hands of the President. On arrival Matt quickly is diverted by Running Water,descendant of a legendary Native American woman who founded the Iroquois Confederacy. Tadd becomes involved  with the man who intends to shoot President McKinley. Tadd's is the only person who can save the President. Will he succeed???"}, {"id": "1845079043", "genre": "Children's Books", "title": "Crocodiles Are the Best Animals of All! (Time to Read)", "description": "What a braggart is Crocodile! The animals watch in amazement as he demonstrates how he is \"the best animal of all.\" He can climb better than Mountain Goat; he can hop higher than Kangaroo; he can even swing through the trees better than Orangutan. But Donkey thinks he knows of something that Crocodile can't do and sets out to prove it. Is it true? Crocodile says no: \"I could eat you for breakfast with buttered toast!\" he roars. This funny and colorful story by writer-performance artist Sean Taylor features vivid artwork by rising children's book artist Hannah Shaw."}]