[{"id": "1403449929", "genre": "Children's Books", "title": "Jane Addams (American Lives)", "description": "Jane Addams set up a community center for immigrants, fought for women’s voting rights, and was part of the peace movement. Can you imagine what her life must have been like? What was she like as a person? Read this book in the American Lives series to get to know Jane Addams. Find out how she tried to make the world a better place. Find out why Jane thought of herself as an ugly duckling, how Jane got the idea to open Hull-House, and why Jane won the Nobel Peace Prize."}, {"id": "B00EJ62OMS", "genre": "Children's Books", "title": "The Ghost Files", "description": "Cherry blossom lipstick: check Smokey eyes: check Skinny jeans: checkDead kid in the mirror: check  For sixteen year old Mattie Hathaway, this is her normal everyday routine. She’s been able to see ghosts since her mother tried to murder her when she was five years old. No way does she want anyone to know she can talk to spooks. Being a foster kid is hard enough without being labeled a freak too.  Normally, she just ignores the ghosts and they go away. That is until she see’s the ghost of her foster sister… Sally. Everyone thinks Sally’s just another runaway, but Mattie knows the truth—she’s dead. Murdered. Mattie feels like she has to help Sally, but she can’t do it alone. Against her better judgment, she teams up with a young policeman, Officer Dan, and together they set out to discover the real truth behind Sally’s disappearance. Only to find out she’s dealing with a much bigger problem, a serial killer, and she may be the next victim… Will Mattie be able to find out the truth before the killer finds her?"}, {"id": "1542332532", "genre": "Children's Books", "title": "Momma, Did You Hear the News?", "description": "Little Avery becomes concerned after seeing another police shooting of an unarmed man. His parents decide it is time to have “The Talk”. They teach him and his brother a catchy chant to help remember what to do if approached by an officer, while also emphasizing that all policemen are not bad. A to the L to the I-V-E…come home ALIVE….THAT is the key!"}, {"id": "0786837489", "genre": "Children's Books", "title": "Edwina, the Dinosaur Who Didn't Know She Was Extinct", "description": "Everyone in town loves Edwina, a fun-loving dinosaur who makes scrumptious chocolate cookies, helps old ladies, and plays with the children, with the exception of Reginald Von Hoobie-Doobie who is determined to prove that dinosaurs are extinct! Teacher's Guide available."}, {"id": "B077KKFS9R", "genre": "Children's Books", "title": "2-1-2 : Children Volume 1", "description": "2-1-2 Christian Volume 1 is a Haiku Poem/Haiku Poetry e-book.It is a 2-1-2 Haiku Qualities Form/Haiku Quality Form."}]