[{"id": "B0711XF11G", "genre": "Children's Books", "title": "Chicken on Vacation (I Can Read Level 1)", "description": "Zoey the chicken needs a vacation!Zoey knows you don’t need to go to the shore to have the perfect beach day...but you do need a great imagination and a treasure map! Will Zoey lead her barnyard pals to buried treasure?Chicken on Vacation is a Level One I Can Read, which means it's perfect for children learning to sound out words and sentences.From the author-illustrator duo that brought you the hilarious Chicken in Space, Chicken in School, and Chicken in Mittens, a Level One I Can Read that School Library Journal calls “a fun book that is perfect for budding readers.”"}, {"id": "B0099K5GRO", "genre": "Children's Books", "title": "Lily Lemon Blossom A Picture Perfect Play Day: ( It's the Perfect Playdate for Lily and her Best Friend Emmy. Children's Book) - (Kids Book, Picture Books, Ages 3-5, Preschool Books, Baby Books)", "description": "Lily Lemon Blossom has a day of fun planned for her best friend Emmy. Join in the fun as Lily and Emmy share a whimsical day, filled with giggles and laughs, endless creativity, and tons of imagination."}, {"id": "1426320760", "genre": "Children's Books", "title": "National Geographic Kids Everything Vikings: All the Incredible Facts and Fierce Fun You Can Plunder", "description": "Hats with horns, flying dragons...you may think you know everything there is to know about Vikings, but think again! With stunning visuals and energetic, impactful design, and full of fun facts and surprises, readers won't stop until they've learned everything about Vikings."}, {"id": "B00BQAKZJ4", "genre": "Children's Books", "title": "Busy Babies Animals/Farm Animals Pack", "description": "• Two twin-packs of chunky firstbooks for babies, ideal for littlehands to hold• Each book has an extendablecord with a Velcro strap at eitherendto attach to baby’s stroller,highchair, wrist or crib, so thatwherever baby is, their favoritebook is always with them• The books have two contrastingstyles: Colors and Words featurefull-color photographs of familiarobjects with simple text labels; thetext-free pages of Farm Animalsand Zoo Animals are simplyillustrated in bold colors tocaptivate baby’s attention andstimulate their developing senses"}, {"id": "037595208X", "genre": "Children's Books", "title": "Super Friends: Flying High (DC Super Friends) (Step into Reading)", "description": "SOMETHING STRANGE HAS happened to the birds of GOTHAM CITY. Pigeons are causing traffic jams, seagulls are making trouble at a nearby beach, and ostriches have escaped from the zoo! THE PENGUIN has enlisted his fine feathered friends to distract the DC SUPER FRIENDS while he swoops in and plucks GOTHAM’s biggest bank clean! Will BATMAN, SUPERMAN, and the other DC SUPER FRIENDS get there in time?"}]