[{"id": "0613248309", "genre": "Children's Books", "title": "Diesel 10 Means Trouble (Turtleback School & Library Binding Edition) (Thomas and the Magic Railroad)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. When challenged by Diesel 10, Thomas and his fellow steam engines set out to prove him wrong by showing that they are simply better than diesel engines."}, {"id": "B071V5HQ3R", "genre": "Children's Books", "title": "Alexander Hamilton: A Plan for America (I Can Read Level 2)", "description": "The life of Alexander Hamilton, a key leader in the United States after the Revolutionary War, is introduced in this early reader biography.Alexander Hamilton was one of America’s founders. He was the first secretary of the treasury and George Washington’s right-hand man. But he also made some dangerous enemies during his short yet dramatic life.Beginning readers will learn about the milestones in Alexander Hamilton’s life in this Level Two I Can Read biography, which combines a traditional, illustrated narrative with historical illustrations and photographs at the back of the book—complete with a timeline, illustrations, and interesting facts.Alexander Hamilton: A Plan for America is a Level Two I Can Read, geared for kids who read on their own but still need a little help."}, {"id": "162779123X", "genre": "Children's Books", "title": "Goal!", "description": "Where there's a ball . . . there will always be someone who wants to play soccer. Whether in Tanzania or Togo, Burma or Brazil, children love soccer. GOAL! celebrates the sport's power to bridge cultural divides and bring together the many and diverse people of the world. Filled with fun facts and striking photos, this book is a poetic snapshot of soccer around the globe."}, {"id": "0374307547", "genre": "Children's Books", "title": "Hello, Fall!", "description": "A grandfather and his granddaughter welcome fall in this sweet, whimsical story about finding beauty and wonder in every moment. Fall is here! Colorful leaves whisper to each other. Geese honk as they flock across the sky. Pumpkins listen patiently from their patch. The season announces itself in all sorts of ways―if you stop to say hello! From New York Times–bestselling author Deborah Diesen and illustrator Lucy Fleming, Hello, Fall! is a touching story of the autumn season."}, {"id": "0545868181", "genre": "Children's Books", "title": "Superman: The Man of Tomorrow (Backstories)", "description": "How did a child from another planet named Kal-El become farm boy Clark Kent? What happened to his planet and family? What powers does he possess and what are his weaknesses? Who are his most trusted allies and fearsome foes? In this biography--complete with black-and-white illustrations, timelines, and fact boxes--young readers will delight in learning the complete history of Metropolis's fearless protector."}]