[{"id": "1464401810", "genre": "Children's Books", "title": "Ho-Ho-Ho Christmas Jokes to Tickle Your Funny Bone (Funnier Bone Jokes)", "description": "How much did Santa pay for his sleigh? Nothing, it was on the house! Author Amelia LaRoche has fun with corny, funny, and silly jokes, limericks, tongue twisters, knock-knock jokes, and fun facts in HO-HO-HO CHRISTMAS JOKES TO TICKLE YOUR FUNNY BONE. Also, discover how to make your own funny Christmas card!"}, {"id": "044847896X", "genre": "Children's Books", "title": "Who Was Marie Curie?", "description": "Born in Warsaw, Poland, on November 7, 1867, Marie Curie was forbidden to attend the male-only University of Warsaw, so she enrolled at the Sorbonne in Paris to study physics and mathematics. There she met a professor named Pierre Curie, and the two soon married, forming one of the most famous scientific partnerships in history. Together they discovered two elements and won a Nobel Prize in 1903. (Later Marie won another Nobel award for chemistry in 1911.) She died in Savoy, France, on July 4, 1934, a victim of many years of exposure to toxic radiation."}, {"id": "0766085538", "genre": "Children's Books", "title": "The Right to Privacy in the Home: The Third Amendment (Bill of Rights)", "description": "Under British rule, soldiers could show up at any Americans doorstep, demand shelter, eat all the food, and require the homeowner to provide anything they asked for or else the colonist would be punished by the military. After the Revolutionary War, the Founding Fathers would ensure no American would have to endure such abuse of power by ratifying the Third Amendment, which guarantees that soldiers cannot be quartered with American citizens during times of peace without the homeowners consent. Through full-color and black-and-white photos, engaging text, and primary sources, readers will learn the history behind this amendment and how it has affected modern society by giving rise to military bases all over the country."}, {"id": "B00B1Y35Y2", "genre": "Children's Books", "title": "Bella Sue and the St. Patrick's Day Hullabaloo (Holidays & Celebrations with Bella Sue Book 2)", "description": "Bella Sue's Mom has packed some special treats for the St. Patrick's Day Party at school. When Bella Sue takes them out to have a look, they spill everywhere! Can you help her find them all before the party starts?Young readers will love the colorful illustrations and simple rhymes of this delightful story for St. Patrick's Day."}, {"id": "B06XFQ9NJM", "genre": "Children's Books", "title": "Pedal Power: How One Community Became the Bicycle Capital of the World", "description": "Cycling rules the road in Amsterdam today, but that wasn't always the case. In the 1970's, Amsterdam was so crowded with vehicles that bicyclists could hardly move, but moms and kids relied on their bicycles to get around the city. PEDAL POWER is the story of the people who led protests against the unsafe streets and took over a vehicles-only tunnel on their bikes, showing what a little pedal power could do! Author and illustrator Allan Drummond returns with the story of the people that paved the way for safe biking around the world."}]