[{"id": "1624316050", "genre": "Children's Books", "title": "Penguins (21st Century Skills Library: Exploring Our Oceans)", "description": "This book takes readers on a journey under the sea to discover the fascinating facts about penguins, including physical features, habitat, life cycle, food, and more. Photos, captions, and keywords supplement the narrative of this informational text, while additional search tools--including a glossary and an index--help students locate and review important information."}, {"id": "0375871284", "genre": "Children's Books", "title": "Dr. Seuss's Second Beginner Book Collection", "description": "Want to give a gift that will make a lasting impression? This boxed set of of five beloved Beginner Books by Dr. Seuss—The Cat in the Hat Comes Back, Dr. Seuss's ABC, Oh Say Can You Say?, Oh the Thinks You Can Think!, and I Can Read with My Eyes Shut!—is perfect for new parents, birthday celebrations, and happy occasions of all kinds. Ideal for reading aloud or reading alone, it will be cherished by young and old alike. Begin a child on the adventure of a lifetime—with Beginner Books by Dr. Seuss!And if you want to make a REALLY BIG impression, consider gifting this along with a copy of our first boxed set of Beginner Books, Dr. Seuss's Beginner Book Collection. The two sets combined include all ten Beginner Books by Dr. Seuss!"}, {"id": "1426330693", "genre": "Children's Books", "title": "It's a Puppy's Life (Animals)", "description": "Have you ever wanted to know what goes on in the life of one of nature's most beloved animals--the puppy? Follow along in this sweet picture book featuring the unique photography of award-winning photographer Seth Casteel, whose Underwater Dogs became a book and Internet sensation.Follow several irresistible puppies as they play, go for walks, eat, sleep, and romp about adorably. Readers will be captivated by the incredible photography paired with witty text to illustrate a day in the life of a dog. Although written especially for young readers, this book will appeal to kids and adults of all ages, from tweens and teens to hipster parents and doting grandparents."}, {"id": "1548516678", "genre": "Children's Books", "title": "Easter is About Jesus: Family Devotions for the Easter Season", "description": "While our culture seems to have lost sight of the reason for the season, you can keep your family's focus on Jesus during the Easter season with the fifteen devotions included in Easter Is about Jesus: Family Devotions for the Easter Season. Each devotion shares a symbol of the season and More Time with God discussion questions and activity ideas to engage the whole family."}, {"id": "B008LO2G36", "genre": "Children's Books", "title": "The Abandoned (New York Review Children's Collection)", "description": "London hasn’t been kind to Peter, a lonely boy whose parents are always out at parties, and though Peter would love to have a cat for company, his nanny won’t hear of it. One day, as Peter is walking out the door, he sees a truck bearing down on a tabby. Dashing out to save the cat, he is struck by the oncoming truck himself.    Everything is different when Peter comes to: He has fur, whiskers, and claws; he has become a cat himself! But London isn’t any kinder to cats than it is to children. Jennie, a savvy stray who takes charge of Peter, knows that all too well. Jennie schools young Peter in the ways of cats, including how to sniff out a nice napping spot, the proper way to dine on mouse, and the single most important tactic a cat can learn: “When in doubt, wash.” Jennie and Peter will face many challenges—and not all of them are from the dangerous outside world—in their struggle to find a place that is truly home."}]