[{"id": "B0192CTMWI", "genre": "Science Fiction & Fantasy", "title": "Harry Potter and the Half-Blood Prince", "description": "\"There it was, hanging in the sky above the school: the blazing green skull with a serpent tongue, the mark Death Eaters left behind whenever they had entered a building … wherever they had murdered …\"When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny ...Pottermore has now launched the Wizarding World Book Club. Visit Pottermore to sign up and join weekly Twitter discussions at WW Book Club."}, {"id": "0843959134", "genre": "Science Fiction & Fantasy", "title": "2: People of the Dark (The Weird Works of Robert E. Howard)", "description": "Collects the author's works--restored to their original texts--from various pulp magazines, such as Weird Tales, and features five Conan stories as well as tales starring other barbaric heroes, including \"People of the Dark\" and \"The People of the Black Circle.\" Original."}, {"id": "B00MI5020I", "genre": "Science Fiction & Fantasy", "title": "The Adventures of Alan Shaw", "description": "For Alan Shaw, escaping the workhouse was only the beginning of the adventure.For an orphan growing up alone on the streets of Victorian London, staying alive is a daily battle, filled with choices a child should never have to make. This is Alan's lot in life, until he is offered more money than he can imagine; enough to take him to the new world to begin a new life. He only has to complete one task; something that could bring the British Empire to its knees. In a series of adventures that take him from sea to sky, from Brighton to Bombay, Alan grows up in a steam-driven era where Automatons walk the streets of London and dirigibles master the air. Pitted against mad alchemists, tentacled submersibles, bomb-wielding saboteurs and the apocalyptic army of the Ordo Fenris, Alan has his work cut out for him. With a past as dark as his, who knows what Alan might grow up to be?The Adventures of Alan Shaw is an epic Steampunk adventure spanning five incredible tales, from the author of Gothic Steampunk fable Greaveburn. “[Hallam is] a born storyteller”Richard Pierce, author of Dead Men"}, {"id": "1534620346", "genre": "Science Fiction & Fantasy", "title": "1: Absolutely Wild! Enchanted Faerie Portal Coloring & Creative Writing Pages (Absolutely Wild! Coloring & Creative Writing series) (Volume 1)", "description": "This coloring and creative writing book allows you to craft your very own Faerie’s Tale about each portal you color. It is part of the whimsy initiated by Cherie Scott when she read Ann Videan’s Song of the Ocarina fantasy novel. That first book in the Delfaerune Rhapsody series—which tells the story of New Zealand Fae who use music and Earth energy to create magic—inspired Cherie to craft a tiny faerie portal for Ann’s birthday. As a thank you note, the author wrote an original Faerie’s Tale back to her friend. After some hugs, a few tears, and a brainstorming session, the two Faerie Environmentalists originated Absolutely Wild! Enchanted Faerie Portals & Other Whimsy. The friends now joyfully handcraft coloring books, and custom faerie portals and Faeries' Tales based on information you provide. Absolutely Wild! supports emerging young writers. Ann and Cherie believe creative writing, encouraged from a young age, helps develop creative communication skills. Have fun practicing!"}, {"id": "B077TGGZSH", "genre": "Science Fiction & Fantasy", "title": "Survival: The Star Quest Trilogy, Book 3", "description": "When a human team is sent to scout a few hundred light-years in front of the death wave, it encounters a civilization far in advance of our own, a civilization of machine intelligences.These sentient, intelligent machines have existed for eons and have survived earlier \"death waves\" - gamma-ray bursts from the core of the galaxy. They are totally self-sufficient, completely certain that the death wave cannot harm them, and utterly uninterested in helping to save other civilizations, whether organic or machine. But now that the humans have discovered them, they refuse to allow them to leave their planet, reasoning that other humans will inevitably follow if they learn of their existence. "}]