[{"id": "0448483424", "genre": "Children's Books", "title": "Pig and Pug (Penguin Young Readers, Level 2)", "description": "A story of an unlikely, but adorable, friendship!Pig lives on a farm with lots of other animals. All the animals have friends, but Pig does not. One day a new animal comes to the farm. Pug has a curly tail like Pig. Pug plays in the mud like Pig. Pug even snorts like Pig. Pug is not a pig, but maybe, just maybe, Pig and Pug can be friends!"}, {"id": "B00DUEF1LG", "genre": "Children's Books", "title": "The Wonderful World of Water", "description": "Water is the source of life. It comes in many forms, and is used in many ways. This little book for elementary school children looks at the wonderful world of water!"}, {"id": "0602574234", "genre": "Children's Books", "title": "Pocket Reads Complete Easy Order Pack (POCKET READERS FICTION)", "description": "Part of the Pocket Reads collection, a superb range of 120 pocket-sized fiction and non-fiction readers which cannot fail to capture children's imaginations at Key Stage 2. They are especially attractive to children who are put off by too much text"}, {"id": "1626867631", "genre": "Children's Books", "title": "I Love You More", "description": "With a simple and touching rhyming story and vibrant illustrations, I Love You More is a timeless, interactive storybook perfect for bedtime reading. As the sun begins to set in the forest, all the animals hurry home to tuck in their little ones. Lift-the-flaps on every spread show how each animal parent says good night to their babies. Parents can snuggle up with their little ones and share this sweet story to remind them how much they are loved."}, {"id": "B0776GZBX9", "genre": "Children's Books", "title": "Al Capone Throws Me a Curve (Tales from Alcatraz)", "description": "Return to Al Capone's Alcatraz with Newbery Honor-winning author Gennifer Choldenko in this charming addition to the beloved series about the son of a prison guard.Moose Flanagan lives on a famous island in California: Alcatraz, home to some of the most dangerous prisoners in the United States in the 1930s. It's the summer before he starts high school, and Moose is going to play a lot of baseball and win a spot on the high school team. But he still needs to watch his special older sister, Natalie--and then the warden asks Moose to look after his two-faced, danger-loving daughter, Piper. In the cell house there are rumors that the cons will a strike, and that Moose's father might step up to a new job. Moose is worried: What will this mean for their family, especially for Natalie, who's had some scary run-ins with prisoners? Then the unthinkable happens: Natalie winds up someplace she should never, ever go. And Moose has to rescue her.Don't miss the rest of the Tales from Alcatraz series!Al Capone Does My ShirtsAl Capone Shines My ShoesAl Capone Does My Homework"}]