[{"id": "0688040721", "genre": "Children's Books", "title": "Three Days on a River in a Red Canoe (Reading Rainbow Books)", "description": "Follow the red canoe from page to page as it journeys down river carrying the family on a camping tour. It's the next best thing to paddling it yourself."}, {"id": "B06XL1GMQG", "genre": "Children's Books", "title": "Miraculous: Tales of Lady Bug and Cat Noir: Claws Out Vol. 3", "description": "Ladybug and Cat Noir must battle against the Pharaoh, a super-villain with the powers of the gods of Ancient Egypt; Copycat, a Cat Noir lookalike who frames him for theft; and Timebreaker, who uses her powers of time travel to go back in time, which means double the Timebreaker and double the Ladybug! Will Ladybug and Cat Noir’s Miraculouses finally fall into the hands of the nefarious Hawk Moth? There’s only one way to find out!  SPOTS ON, CLAWS OUT!  Collects MIRACULOUS #7-9."}, {"id": "B06XYJZSG3", "genre": "Children's Books", "title": "101 Knock Knock Jokes for Kids", "description": "Kids can't get enough of laughter--so they can't get enough of Sean Love's hilarious joke books! 101 Hilarious Knock-Knock Jokes for Kids is an all-new collection of knock-knock jokes that will have kids and kids-at-heart rolling in the aisles. Jokes likeKnock knock.Who's there?Dwayne.Dwayne who?Dwayne the bathtub, I'm dwowning!This new book from Sean Love is poised to reach and even surpass the more than 175,000 copies sold of his first book, Laughing and Laughing for gown-ups."}, {"id": "031251459X", "genre": "Children's Books", "title": "Smart Kids Space: For Kids Who Really Love Space!", "description": "Open your eyes to a world of discovery with this amazing fact-packed book. From the Solar System to the Milky Way, from Mars to Mercury, from UFOs to the Space Shuttle, Space is an ideal first guide to the mysteries and wonders of our incredible universe. Written in an accessible and fun style, the informative text is perfectly complemented by visually stunning, large-sized, full-color photography. Perfect book to introduce children aged three and over to the fascinating world above us."}, {"id": "1681198371", "genre": "Children's Books", "title": "We're Going on an Egg Hunt (padded board book)", "description": "We're going on an egg hunt. We're going to find them all. We're REALLY excited. Hooray for Easter Day!Join a family of bunnies as they set off on an exciting Easter egg hunt. There are ten eggs to find and count--but watch out for the obstacles along the way . . . Lambs, chicks, bees, and ducks await, and there's even a wolfish surprise, so be careful! This delightful, interactive read-aloud is the perfect springtime story to share."}]