[{"id": "0750294590", "genre": "Children's Books", "title": "Mad About: Gymnastics", "description": "If you're mad about gymnastics, this book will help you make the most of your favourite sport. Find out how to perfect your vaults and landings, as well as expand in to different areas such as acrobatics, rhythmic gymnastics and trampolining!"}, {"id": "0766028062", "genre": "Children's Books", "title": "Forensic Science Projects with a Crime Lab You Can Build (Build-a-Lab! Science Experiments)", "description": "By first explaining how to build or set up a simple science laboratory, each title then offers experiments that use the lab and that support the National Science Education Standards."}, {"id": "0794502113", "genre": "Children's Books", "title": "Halloween Activities (Usborne Holiday Titles)", "description": "This title contains easy step-by-step activities that include fancy dress ideas, pumpkin-carving techniques as well as lots of spiders, witches and bats to paint, print or make. There are also invitations, decorations and cooking activities, which are ideal for Halloween parties. It includes two pages of stickers to use with the projects or for your own picture and is filled with colourful illustrations and inspiring photographs."}, {"id": "1943145296", "genre": "Children's Books", "title": "The Dragon Slayer: Folktales from Latin America: A TOON Graphic", "description": "How would a kitchen maid fare against a seven-headed dragon? What happens when a woman marries a mouse? And what can a young man learn from a thousand leaf cutter ants? Famed Love and Rockets creator Jaime Hernandez asks these questions and more as he transforms beloved myths into bold, stunning, and utterly contemporary comics. Guided by the classic works of F. Isabel Campoy and Alma Flor Ada, Hernandez’s first book for young readers brings the sights and stories of Latin America to a new generation of graphic-novel fans around the world."}, {"id": "0999047906", "genre": "Children's Books", "title": "Bob's Spiritfly", "description": "Flap, Flap, FlitterIt's that special time of day! The clock strikes 8:08 And Bob has something to say! You'll learn that passings Don't have to be so tragic,  When you open your heart To the possibility of magic!This book tackles the very sensitive subject of losing a pet with poetic grace and inspiring illustrations!"}]