[{"id": "1911092464", "genre": "Science Fiction & Fantasy", "title": "Battle Beyond Earth: Revenge", "description": "Battle Beyond Earth: Revenge. The fifth instalment in an epic new series that tells of humanity's desperate struggle to survive in an uncertain and war-torn future.  The war appeared lost before it had begun, and the despotic Queen Bolormaa seemed unstoppable. Until an unlikely alien ally paved the way to victory. Zaya was the exiled son of the Mohrotan Queen. A powerful and resourceful fighter who could yet provide the key to victory, but at what cost? Zaya cared for nothing and nobody. He had a single ambition, to destroy his mother.  Earth's weakened fleet faces the terrifying prospect of another alien invasion. An invasion that it cannot hope to prevent. Colonel Mitch Taylor discovers that the President of the Alliance has become trapped during the battle. They must save him if there is to be any hope of holding the Alliance together. Taylor throws himself into the middle of a ground war on Earth. Although Bolormaa is not there to toy with her prey. She is closing in to destroy Taylor, and the survival of all humanity hangs in the balance. Taylor's fate lies in the hands of his friends, his comrades, and an alien ally who owes him nothing. Queen Bolormaa looks set to take her revenge.  Battle Beyond Earth is a futuristic sci-fi action adventure sequel. It is also a standalone story. It will give a new perspective and storyline to those readers who followed Mitch Taylor's exploits in the bestselling series 'Battle Earth.'"}, {"id": "B00RY87UIQ", "genre": "Science Fiction & Fantasy", "title": "Gears of Uriel: Luminous Bridges, Book 1", "description": "Visited by an angel Theodoros is instructed to make the Gears of Uriel, which is passed from one generation to the next for more than five hundred years. This family are the guardians who protect it from the evil enveloping our world, casting Theodoros' life into mayhem. Following each of his descendants and the danger often accompanying the device, this is a spiritual quest, exposing how religion has often cloaked the truth from mankind, with risk of death to the keepers of truth - those heretics who speak up against an organization claiming to be God's mouthpiece and ultimate authority. The spiritual conflict spans centuries, illustrating the nature of religious worship, from ancient times into the modern. No matter how much things change, they remain the same. Set in ancient Greece on the island of Antikythera, this is vivid, surreal, and a smorgasbord of antiquated ritual. Metaphysical historical fantasy has found a true home in this novel. Angels walk with men, the realm of gods has no boundary, and religious family feuds are the most misguided toxin of all. This is a profound tale which delivers a journey worthy of the saints."}, {"id": "B0786QGKXH", "genre": "Science Fiction & Fantasy", "title": "World Above (The Three Cities Series Book 1)", "description": "Put simply, young Russel Remington is satisfied. He lives in luxury, looks forward to a promising future, and has a best friend closer than a brother. He couldn't be further from the bloody origins of the underwater civilization he lives in, carved from a war against the extinct beings once known as the Gifted.He couldn't be further, that is, until strange dreams and stranger physical afflictions begin plaguing him. One by one, increasingly disturbing facts about himself and the home he thought he knew so well begin unraveling his world, forcing him into a secret race for both the truth, and a way to survive the ever-more hostile surveillance state all around him, and its newest, most promising officer: his own best friend."}, {"id": "1416555897", "genre": "Science Fiction & Fantasy", "title": "1635: The Dreeson Incident (The Ring of Fire)", "description": "1.  The latest in a New York Times best-selling series.2.  The Ring of Fire series is the most popular alternate history series going.3.  Advertising in Locus, Kliatt, more4.  Full-color series brochure5.  Special kit mailing6.  Co-op available7.  Teaser in mass market of 1634: The Baltic War8.  Special backlist discounts9.  Large 1,100+ mailing of ARCs10.  Trade advertising11.  Library marketing The Thirty Years War continues to ravage 17th century Europe, but a new force is gathering power and influence: the Confederated Principalities of Europe, an alliance between Gustavus Adolphus, King of Sweden, and the West Virginians from the 20th century led by Mike Stearns who were hurled centuries into the past by a mysterious cosmic accident.   While the old entrenched rulers and manipulators continue to plot against this new upstart nation, everyday life goes on in Grantville, the town lost in time, with librarians, firefighters, and garbage collectors trying to make do under unusual circumstances. And what better place for an undercover spy from France than working with the garbage collectors, examining 20th century machines that others throw out and copying the technology (though he wishes one device—the paper shredder—had been left behind in the future).   There are more sinister agents at work, however. One of them, Ducos, almost succeeded in assassinating the Pope, but his plan was ruined by quick action by a few Americans. Now, the would-be assassin not only has a score to settle, but has also decided on two excellent targets: Grantville’s leader Mike Stearns and his wife Rebecca. . . ."}, {"id": "B00TSONB28", "genre": "Science Fiction & Fantasy", "title": "653:  Rise Of The Sun (Cyborg Romance Book 1)", "description": "“For me,” she said, softly. “I want you to try for me. Because I don’t understand what’s happening, but know if you can’t, I’m going to cry.”She raised her head again, and their eyes met. “Become human for me.”-----A secret organization seeks to control the future. Cyborg 653’s task is to protect an aged priest, whose life is at risk. But his emotionless, machine-like existence changes the minute he meets human, Lexie Hollis. Feelings he’s never needed begin to form and with them comes knowledge. She encourages him to think on his own, form opinions, and most of all fall in love. With her.But what begins as something full of promise soon becomes a dangerous game that just might silence him and all of his kind … forever.Book 1 of 2, a wild ride in the world of science-fiction by best-selling author, SUZANNE D. WILLIAMS. 29,000 words."}]