[{"id": "1583407898", "genre": "Children's Books", "title": "4: The a to Z of Inventions and Inventors: M to P", "description": "Presents information about eighty-four commonly used modern inventions, with each entry examining who invented the item, how it was invented, how it works, how it has changed over time, and related inventions."}, {"id": "057808550X", "genre": "Children's Books", "title": "Murphy the Tennis Bear Visits The US Open", "description": "Murphy Bear and friends have a blast at Arthur Ashe Kids'Day US Open New York City. Murphy's nickname is MurphFit. A Brooklyn parrot adds frenzy while a mystery happens at the Storyteller booth. With simple text and vibrant illustrations the author weaves in tennis know-how. Both storytelling and art express that good character traits and a healthy lifestyle go hand in hand with the sport. Tennis tips and US Open trivia follow the story."}, {"id": "B074MBJHJZ", "genre": "Children's Books", "title": "All the Way to Havana", "description": "So we purr, cara cara, and we glide, taka taka, and we zoom, zoom, ZOOM! Together, a boy and his parents drive to the city of Havana, Cuba, in their old family car. Along the way, they experience the sights and sounds of the streets—neighbors talking, musicians performing, and beautiful, colorful cars putt-putting and bumpety-bumping along. In the end, though, it’s their old car, Cara Cara, that the boy loves best. A joyful celebration of the Cuban people and their resourceful innovation."}, {"id": "1543512267", "genre": "Children's Books", "title": "The Simple Science of Sound (Simply Science)", "description": "CRASH, BARK, BOOM! Sound is all around us. But what is it? How does sound work? Readers will learn the answers to these questions and more through easy-to-read text and vivid photographs. An experiment rounds out the book and provides a hands-on learning experience to encourage deeper understanding. Meets Next Generation Science Standards."}, {"id": "1562940589", "genre": "Children's Books", "title": "Eureka! It'S An Airplane (Inventing)", "description": "Uncovers the chain of discoveries--dating back to the ancient Greeks and including the contributions of the Wright brothers--that led to the invention of the modern airplane."}]