[{"id": "0008251193", "genre": "Children's Books", "title": "The Midnight Foxes (Tiger Days, Book 2)", "description": "Meet animal lover, Tiger Days! A heart-warming series about animals, friendship and adventure, by bestselling author Sarah Lean.Beautiful black-and-white illustrations throughout.When nine-year-old Tiger Days stays with her grandmother at Willowgate House she never knows what might happen… new friends to meet, animals to rescue and problems to solve!Tiger returns to Willowgate and discovers that a mysterious tunnel has appeared under the shed and someone – or something – has been burying eggs in the garden…Tiger and her friend Tom decides to become detectives – determined to crack the case!.At Willowgate House, no day is ever dull for Tiger!"}, {"id": "0618033149", "genre": "Children's Books", "title": "The Life and Times of the Peanut", "description": "What are peanuts - are they peas or are they nuts? Do they grow above or below ground? Who invented peanut butter? In the same spirit as his award-winning Life and Times of the Honeybee, Charles Micucci explores one of America's most favorite and enigmatic snack foods. This fascinating picture book, with its concise, detailed text and abundant illustrations, ranging from the humorous to the scientific, offers a spirited introduction to the life cycle, many uses, and historical influences of the peanut. Micucci's rare gift for making any subject engaging and accessible is again revealed in this truly witty, rich salute to the peanut."}, {"id": "149980556X", "genre": "Children's Books", "title": "The Color Factory", "description": "Introducing The Color Factory, an interactive and entertaining picture book in the vein of Hervé Tullet's Press Here and Mix It Up! and a wonderful follow-up to The Black and White Factory.Welcome to the Color Factory! Penguin, zebra, and panda will take you on a very special tour to see all the wonderful, factory-approved colors that are made here, like:  Robin’s Egg Blue  Canary Yellow  Chocolate Brown  Fire Engine Red  But when the tour gets to the perfect replicator machine, the factory workers mix Canary Yellow and Fire Engine Red only to find that the new color is not factory approved! It's up to the readers to help get the non-factory-approved colors off the page! But if they can't, the factory must be closed.  Can penguin, zebra, and panda come together to approve the new colors (which are fluorescent!)?"}, {"id": "B005Q6AZTY", "genre": "Children's Books", "title": "Lynn Visible", "description": "Lynn Vincent knows all the latest trends and isn't afraid to flaunt her funky style. The problem is, in small-town Pennsylvania, being fashion forward makes Lynn socially backward. And the queen bees at her high school won't let her forget it, especially when her dream of making the IT panel for GlITter Girl - the coolest fashion magazine in teendom - is crushed. But when one of Lynn's unique creations makes it into the hands of a famous designer and onto the runway, it seems that Lynn might finally get her moment in the spotlight."}, {"id": "B06XGL1VWD", "genre": "Children's Books", "title": "Louis Pasteur and the Science of Germs: A 15-Minute Biography (15-Minute Books Book 643)", "description": "Louis Pasteur was a scientist. When he tried to convince the medical establishment that germs caused disease, he was laughed at.Louis never accepted defeat. He discovered how to kill germs in liquids in a process we call “pasteurization”. He developed vaccines and encouraged the use of antiseptics and disinfectants.But he wasn’t always honest. He claimed credit for work that wasn’t his and sometimes lied about his results.Find out more about this man who discovered how to help keep foods safe, and how many germs worked in this 15-minute children's biography.Ages 10 and up.Reading Level: 6.9LearningIsland.com believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Many books are appropriate for hi-lo readers. Open the world of reading to a child by having them read for 15 minutes a day."}]