[{"id": "1937133257", "genre": "Children's Books", "title": "The Magic of the Unicorn (Choose Your Own Adventure)", "description": "Only a unicorn's horn can purify the water in your medieval village. Thus YOU set off on a quest to find the unicorn that can save your people, encountering many magical beings along the way."}, {"id": "B005MWLDX4", "genre": "Children's Books", "title": "Avengers Assemble, Vol. 1", "description": "Fan-favorite creators Kurt Busiek and George Pérez usher in a new era for Earth's Mightiest Heroes! Since the team's inception, the Avengers have always defended humanity against the forces of evil. When duty calls, these legendary champions answer, fighting valiantly until justice prevails. But what happens when their oldest foes strike directly at the team? On the eve of a huge Avengers gathering, an attack by the evil enchantress Morgan Le Fay sends these assembled heroes into a strange medieval reality where nothing is as it seems. Held under Le Fay's thrall, the Avengers have lost all memory of their true identities. Breaking free of Morgan's spell, Captain America and Hawkeye must fi ght to free their teammates before the Marvel Universe is altered forever! Plus: The Avengers take on the Squadron Supreme! AVENGERS MOVIE PREMIERES SUMMER 2012 COLLECTING: Avengers (1998) #1-11, Annual 1998; Iron Man (1998) #7;Captain America (1998) #8; Quicksilver #10"}, {"id": "B00M3I51ZQ", "genre": "Children's Books", "title": "Amazing Facts About Orangutans: Picture Book For Babies Toddlers and First Readers (Baby Look Around Series 2)", "description": "Are you or your child interested in orangutans?This lovely book covers amazing facts about orangutans including amazing photographs about the everyday life of these animals.The facts are captions which creates an easy fun comic style reading experience and makes the book more interesting for your baby, toddler or first readers."}, {"id": "1471868427", "genre": "Children's Books", "title": "Business Management for the IB Diploma Study and Revision Guide", "description": "This Study and Revision Guide will ensure you approach your exams feeling confident and prepared through the help of accurate and accessible notes, examiner advice, and exam-style questions on each key topic.- Practise and check your understanding on a range of Exam Practice questions- Be aware of the essential points with key terms and facts for each topic- Discover what you need to achieve certain grades with advice and tips, including common mistakes to avoid. Answers are free online at: www.hoddereducation.com/IBextras"}, {"id": "0448479176", "genre": "Children's Books", "title": "What Is the Statue of Liberty? (What Was?)", "description": "In 1876, France decided to give the United States a very big and very special present--the Statue of Liberty. The gift was to commemorate the 100th birthday of the United States, and just packing it was no small feat--350 pieces in 214 crates shipped across the ocean. The story of how the 111-foot-tall lady took her place in the New York Harbor will fascinate young readers."}]