[{"id": "1556341857", "genre": "Science Fiction & Fantasy", "title": "Car Wars: The Classic Game of Highway Combat", "description": "Car Wars is a game of freeways of the future where the right of way goes to the biggest guns. Players choose their vehicle, complete with weapons, armor, power plants, suspension, and even body style. Then they take them out on the road... to come home as \"aces\", or to crash and burn. If a driver survives, his abilities improve, and he can earn money to buy bigger and better cars. Advanced rules let you design your own customized cars, trucks, and cycles."}, {"id": "1492240486", "genre": "Science Fiction & Fantasy", "title": "Crimson Dahlia: Book #3 of the Svatura Series", "description": "Book #3 of the Svatura Series When Lila Jenner leaves her family and friends to start a new life for herself, Ramsey Pierce lets her go. Determined that the fire raging inside him will never harm her, he denies the magical bond that could be theirs alone. When an old enemy resurfaces and Lila suddenly disappears, Ramsey realizes that he'll do anything to win her back and keep her safe beside him. But Maddox, driven by a centuries-old quest for revenge, is stronger than they ever imagined. And Lila could be the key to his ultimate power. Friends and enemies must band together against this shared threat if any of them are to survive. Even then, they may all discover too late that one dragon is not always enough..."}, {"id": "1521549249", "genre": "Science Fiction & Fantasy", "title": "Star Force: Rift", "description": "The temporary truce between Star Force and the V'kit'no'sat sends shockwaves throughout the galaxy. No one has ever defied the V'kit'no'sat and lived, but now Star Force has and many races are taking notice...including one that no one expects, on either side."}, {"id": "1470078783", "genre": "Science Fiction & Fantasy", "title": "The Think System: A Light-Hearted Guide to Serious Double Deck Bid Euchre", "description": "With 60 years of double deck Bid Euchre experience between them, the authors have a bit of an obsession with the game. The game’s extensive use of strategy, the synergy of partnering, and the complexity of the game have made them double deck Bid Euchre zealots. Shocked and dismayed by the lack of literature on double deck Bid Euchre, the authors set out to correct this grievous wrong in the world of books on card games. This book starts off with a brief overview and analysis of the many versions of double deck Bid Euchre. Then it takes an in-depth look at a version of the game that is commonly played in the Midwest United States, and is often referred to as “Indiana Double Deck Bid Euchre”. Many of the concepts presented in the book are applicable to other versions of the game. The bulk of the book covers the bidding and play of the game, separated into sections on basic and advanced techniques. Examples are used extensively throughout the book to illustrate the concepts presented. Brief sections on areas such as history of the game, table etiquette, statistics, and a glossary are also included. This book provides practical advice on how to put the most into, and get the most out of, the game of double deck Bid Euchre. If you don’t already play, this book will open the doors of double deck Bid Euchre to you. And if you already play, this book will enhance the enjoyment you're already taking in the game."}, {"id": "0316394181", "genre": "Science Fiction & Fantasy", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon?, Vol. 8 - light novel (Is It Wrong to Pick Up Girls in a Dungeon?)", "description": "The Rakian Kingdom is on the march, a thirty-thousand-strong army headed by Ares, God of War. The target of their sudden invasion is none other than the world's greatest metropolis, Labyrinth City Orario. As the armed menace approaches in thunderous lockstep, the city's inhabitants can do nothing but...continue about their completely peaceful lives??? A prum proposes marriage, one sweet boy becomes a bodyguard, the city girl's secret comes to light, while mortals and gods alike are swept up in romance--these are the ordinary days of timeless deities and their dazzling children in the fateful city of Orario!"}]