[{"id": "0778734404", "genre": "Children's Books", "title": "New York Rangers (The Original 6: Celebrating Hockey's History)", "description": "Founded by a brash boxing promoter in 1926, the New York Rangers was the first U.S.-based NHL team to win the Stanley Cup. Packed with stories about quirky players, coaches, owners, and team rivalries, this book is a treat for hockey lovers and Rangers fans. Appealing historic and contemporary images mix with informative text and quick-reference infographic charts for statistics buffs."}, {"id": "1460275209", "genre": "Children's Books", "title": "How Did Grandpa Get His Food?", "description": "The first author lived in the country without electricity on a small farm near a river and lakes. This book describes how his family grew, raised, shot, and caught their food, and how billions of people today use the same methods to get their food. They don't have large grocery stores where they can buy what they need, so how do they get their food? It's hard work and takes many hours every week. This book will tell you what has to be done and how to do it."}, {"id": "1416978003", "genre": "Children's Books", "title": "Cat", "description": "From the #1 New York Times bestselling children’s book creator Matthew Van Fleet.Purrrrrfect fun for toddlers! In Matthew Van Fleet's captivating multiconcept book, watch twenty-two breeds of frolicking felines demonstrate synonyms, action words, opposites, and more. Cleverly designed pull tabs and flaps plus seven pettable textures and a push-button squeaker offer interactive treats that will have toddlers purring along from start to surprising finish. Meow...meow...meow...WOW!"}, {"id": "1499403259", "genre": "Children's Books", "title": "Invaders from Earth: Classroom Collection", "description": "If a species of fish, plant, or animal finds itself in a new area, the consequences can be drastic. Battles for dominance commence, food chains shift, and the effects of invasive species are often difficultif not impossibleto halt or reverse. With this collection, students will look to the skies, the forests, and even underwater to discover the brutal way nature wars against itself."}, {"id": "B00BKN7IJM", "genre": "Children's Books", "title": "Niall Horan: 125 Facts You Need To Know!", "description": "Discover 125 Amazing facts and secrets about Superstar Niall Horan!Do you know everything there is to know about Niall Horan? In 125 Facts You Need to Know about Niall, author and Directioner Jessica Stewart brings you 125 fantastic facts about your favorite hearthrob, including:What he looks for in a girlWhat his life was like before the fameHis weird hobbies and habitsHis best quotesWhat drives him crazyFunny StoriesAnd MUCH MORE!!Find out if you're a true Directioner!"}]