[{"id": "1556347324", "genre": "Science Fiction & Fantasy", "title": "GURPS GMs Screen", "description": "Put the amazing flexibility and power of GURPS at your fingertips with this data-packed GM's Screen. This four-panel screen features all the crucial charts, tables, and other essentials from GURPS Fourth Edition. . . . complete combat tables, reaction charts, and other references to make the GM's job faster and easier.  Also included is a copy of the new Fourth Edition version of GURPS Lite, the 32-page core of the GURPS rules. GURPS Lite is a valuable rules summary, but it's also designed, in particular, as a teaching tool . . . it makes it easy for an experienced player or GM to introduce others to the system.  This screen is beautiful, useful . . . and yes, you can use it to hide your die rolls, too."}, {"id": "0971323453", "genre": "Science Fiction & Fantasy", "title": "Swords of Power (d20 System)", "description": "Magical swords are the stuff of legends, and now there are details on over a hundred perfect weapons no one has ever seen before. Every single sword in this accessory can become an epic adventure in any referee’s gaming world. The detailed listing on these swords break new ground in fantasy role-playing and will be a must-have for players and referee’s alike. This d20 hardbound is packed with details on magical swords, their locations, their uses, and their guardians, providing thousands of hours of gaming fun in any fantasy campaign. This tome details 105 swords and daggers, all enormously powerful, every one an adventure. In addition to the wonderful descriptions in the book, these swords are all real! Each and every one has been forged by master craftsmen in cold, hard steel, and is available for purchase separately. Written by acclaimed fantasy authors James M. Ward, Timothy Brown, Lester Smith, and a host of others, this book will provide the gaming world with the first opportunity to quest for a sword - and be able to take it home!"}, {"id": "158846718X", "genre": "Science Fiction & Fantasy", "title": "Hunter: The Vigil", "description": "Candle in the Darkness The scales have fallen from your eyes. A fire is lit: is it a lamp perched over the inscription upon an ancient blade? Or a roaring conflagration consuming the house in which the howling fiends wait? Things will never be the same after this. You ve set forth on a damning path. Carry the Vigil. Fight back the shadows.Rulebook for Hunter: The VigilTMThis book includes: * A rulebook for playing hunters, those humans who have seen the truth of the World of Darkness and are spurred to action. * A many-faced Vigil for many types of hunter: characters might choose a path of violence, of investigation, or even of rehabilitation. Decipher mysteries and confront the horrors. * Provides new player types and antagonists for crossover- intensive chronicles as well as those chronicles focused only on hunters."}, {"id": "1588464466", "genre": "Science Fiction & Fantasy", "title": "Dark Factions (World of Warcraft RPG)", "description": "Crush the Alliance and Horde!  Naga and satyrs stir in dark places. Goblins invent crazy devices. The Atal’ai summon a bloodthirsty god. Azeroth is home to more than just the Alliance and Horde.  Discover eight new races and fifteen factions. New game elements ― classes, spells, technological devices, and the like ― further enhance these characters.  • Contains eight new races, including naga, pandaren and satyrs.  • Contains nine prestige classes, including the brewmaster, death knight, and naga anomaly.  • Includes variant classes, racial iconic classes, and creature classes, allowing you to play just the sort of character you want.  • Brims with new feats, spells, magic items, technologi-cal devices, and other abilities and items to decimate your opponents.  • Contains information on the fifteen factions unaffiliated with the Alliance or Horde, including their leaders and strategies, narrated by famed dwarven explorer Brann Bronzebeard.  • Includes two adventures to challenge heroes of any affiliation."}, {"id": "1948099357", "genre": "Science Fiction & Fantasy", "title": "Realm FM", "description": "Okay. Fine. Amy Holt swore on air. Surely that doesn't make her an inept radio host. Either way, she's desperate for work; and if she doesn't find something soon, it's back to Australia.When the job of her dreamish nightmares presents itself, Amy jumps at the opportunity, surprised to hear that the station is built on a wormhole, opening it up to infinite realms.Interviewing Bigfoot and her doppelganger aren't that problematic. Working for her sister's ex-boyfriend though, is a whole other matter. He's ridiculously charismatic. And good looking. Poor bugger is missing a six-pack, though.Suddenly, traveling through an apocalyptic wasteland and mollifying racist Bigfeet doesn't seem so hard.Trying to avoid Ryan's charm, though? Yeah, that wasn't in the job description."}]