[{"id": "1419729411", "genre": "Children's Books", "title": "Fruits in Suits", "description": "Have you ever seen a banana in a bikini? Or a tangerine in trunks? What about grapes in goggles? In this uproarious follow-up to Vegetables in Underwear, kids will learn that there are many kinds of suits—including suits for swimming, surfing, sunbathing, and scuba diving. But can you wear a business suit to the beach?  Fruits in Suits has the same irreverent silliness as Vegetables in Underwear and shows just how much fun swimsuits can be—and how important it is to hold on to them when you jump into the water!"}, {"id": "0766094464", "genre": "Children's Books", "title": "Zoom in on Educational Robots (Zoom in on Robots)", "description": "How would you like to have a robot for a teacher? While robots will never replace human teachers, they are helping students learn in and out of the classroom. Informational text, fun facts, and full-color images about educational robots stimulate the curiosity of young readers. A \"Words to Know\" feature helps students master new vocabulary. This cutting-edge book includes a fun activity that will help students learn about programming and supports the NGSS K-2 Engineering Design Standards."}, {"id": "1932799818", "genre": "Children's Books", "title": "Racing Cars (Look Inside Machines)", "description": "Providing support for National Curriculum Key Stage 1, an addition to the CUTAWAY series which explores the workings of some of the fastest vehicles ever built with the help of cut-away illustrations on colour photographs."}, {"id": "1499806604", "genre": "Children's Books", "title": "Karina Garcia's DIY Slime", "description": "Create your own slime at home by following these 15 easy, borax-free slime recipes from YouTube sensation Karina Garcia.Get ready to become a slime master with these fifteen DIY recipes from YouTube sensation Karina Garcia! This full color book, with step-by-step instructions, will teach you how to make Liquid Gold Slime, Glow-in-the-Dark Slime, Balloon Slime, and more! Along with four brand-new recipes, this book also includes tips on how to store your slime, all the amazing things you can do with slime, and fun, cool facts about Karina. All recipes are borax free."}, {"id": "1783445874", "genre": "Children's Books", "title": "There's a Walrus in My Bed!", "description": "Tonight, for the first time, Flynn is going to sleep in a proper big boy bed. But when bedtime rolls around, he just can't get to sleep. The reason? There's a walrus in his bed, of course! Mum and Dad play along while Flynn gives \"Walrus\" blankets, snacks, milk and a top-secret trip to the toilet, but it doesn't look like anyone is getting much sleep tonight."}]