[{"id": "054591387X", "genre": "Children's Books", "title": "Song of the Poison Dragon: A Branches Book (Dragon Masters #5)", "description": "Pick a book. Grow a Reader!This series is part of Scholastic's early chapter book line Branches, aimed at newly independent readers. With easy-to-read text, high-interest content, fast-paced plots, and illustrations on every page, these books will boost reading confidence and stamina. Branches books help readers grow!In book #5, the Dragon Masters are excited to meet the newest Dragon Master, Petra. But when she arrives at the castle, she doesn't fit in right away. She's a know-it-all, and she doesn't even try to connect with her four-headed dragon! Could the Dragon Stone have chosen her by mistake? Then something terrible happens to the king. Petra will have to work with the other Dragon Masters to save him before it's too late!"}, {"id": "B076WYBNWL", "genre": "Children's Books", "title": "Bee Facts For Kids is an animal facts book for kids ages 3-7: Knowledge about Bee  and with high quality pictures.", "description": "This book Learn about  Pride MattersLarge KittiesThreat AheadOn the Spot!Shout OutThe Mane TraitNonfiction books help children learn animal knowledge. Children are naturally curious about the world around them.Tags: Bee,Bee habitat,Bee pictures,Bee facts, Bee Fun facts, baby Bee, Bee photos"}, {"id": "1596433434", "genre": "Children's Books", "title": "Food For Thought: The Stories Behind the Things We Eat", "description": "Deliciously interesting, tasty morsels of cultural history combined with luscious photographs will leave readers hungry for more. \"Every kind of food has its story.\" Acclaimed photographer Ken Robbins guides us through the history, mythology, and literary significance of food. Fascinating factsÑit was an apple that started the Trojan War; oranges used to be so expensive that only the rich could afford them--and stunning photographs make Food for Thought a tasty read that will have everyone looking at their plates in a new way."}, {"id": "B01KP84ZX4", "genre": "Children's Books", "title": "Portal Police - The Complete Collection", "description": "UPDATED 2016  - GET 3 BOOKS FOR THE PRICE OF ONE - SAVE $5.98. OR READ IT FOR FREE On Kindle Unlimited.Get your hands on the complete and much loved Portal Police series from Barry J McDonald now. Made up of 3 books, this collection brings together Portal Police books 1 & 2 and the never before released book 3. If you love adventure, friendship and tons of action, you've come to the right place. Scroll up now, click the \"Buy Now\" button and let the adventure begin."}, {"id": "1538324644", "genre": "Children's Books", "title": "The Luiseño (Spotlight on the American Indians of California)", "description": "Between two and three thousand years ago, the ancestors of the Luiseos settled along the coast of what is now southern California. The Luiseos have faced many challenges since that time. Today, they're considered one of California's most notable Native American groups. Students will learn about the history, culture, and traditions of the Luiseos. Primary sources and full-color photographs add visual depth to the informative text. Readers will enjoy learning about the interesting lives of these American Indians of California."}]