[{"id": "1568821387", "genre": "Science Fiction & Fantasy", "title": "Beyond the Mountains of Madness: An Epic Campaign and Sourcebook (Call of Cthulhu Horror Roleplaying, #2380)", "description": "Beyond the Mountains of Madness continues the story begun in H.P. Lovecraft's novel \"At the Mountains of Madness\". It is the tale of the Starkweather-Moore Expedition of 1933 which bravely - and foolishly - seeks to finish what the Miskatonic University Antarctic Expedition began three years before. ~ The massive book consists of the following: * The adventure itself, in seventeen chapters * Seven appendices, discussing timelines, Antarctic exploration background, logistics, vehicles and more * Handouts and maps (including a fold-out map of Antarctica)"}, {"id": "B0161U5X6S", "genre": "Science Fiction & Fantasy", "title": "2113", "description": "The music of Rush, one of the most successful bands in music history, is filled with fantastic stories, evocative images, thought-provoking futures and pasts. In this anthology, notable, bestselling, and award-winning writers each chose a Rush song as the spark for a new story, drawing inspiration from the visionary trio Geddy Lee, Alex Lifeson, and Neil Peart.Enduring stark dystopian struggles or testing the limits of the human spirit, the characters populating 2113 find strength while searching for hope in a world that is repressive, dangerous, or just debilitatingly bland. Most of these tales are science fiction, but some are fantasies, thrillers, even edgy mainstream. Many of Rush’s big hits are represented, as well as deeper cuts . . . with wonderful results. This anthology also includes the seminal stories that inspired the Rush classics “Red Barchetta” and “Roll the Bones,” as well as Kevin J. Anderson’s novella sequel to the groundbreaking Rush album 2112.2113 contains stories by New York Times bestselling authors Kevin J. Anderson, Michael Z. Williamson, David Alan Mack, David Farland, Dayton Ward, and Mercedes Lackey; award winners Fritz Leiber, John McFetridge, Steven Savile, Brad R. Torgersen, Ron Collins, David Niall Wilson, and Brian Hodge, as well as many other authors with their imaginations on fire."}, {"id": "1616962186", "genre": "Science Fiction & Fantasy", "title": "Dreams of Distant Shores", "description": "Featuring three brand-new stories and an original introduction by Peter S. Beagle, author of The Last Unicorn.Bestselling author Patricia A. McKillip (The Riddle-Master of Hed) is one of the most lyrical writers gracing the fantasy genre. With the debut of her newest work, Dreams of Distant Shores is a true ode to her many talents. Within these pages you will find a youthful artist possessed by both his painting and his muse and seductive travelers from the sea enrapturing distant lovers. The statue of a mermaid comes suddenly to life, and two friends are transfixed by a haunted estate.Fans of McKillip’s ethereal fiction will find much to delight them; those lucky enough to be discovering her work will find much to enchant them."}, {"id": "095739991X", "genre": "Science Fiction & Fantasy", "title": "A Home by the Sea", "description": "In an idyllic home by the sea, a beautiful widow heals. But a dead man's coming. A dead man walking.* Irene Jacobs always wanted a home by the sea. A widow, pregnant with her dead husband's twins, she comes to the Blue House to heal and raise her babies. But a dead man's walking. He's a bad man. The worst. And he's come for her children. To survive she'll have to face him in the room where her husband died. The room where so many people died at the hands of a psychopath who's returned from the grave...in the Black Room she'll meet the worst of her fears. Sometimes, you have to lose everything to appreciate what's left."}, {"id": "0786965649", "genre": "Science Fiction & Fantasy", "title": "Hoard of the Dragon Queen (D&D Adventure)", "description": "Fight the War Against Draconic Oppression in this Adventure for the World’s Greatest Roleplaying Game In an audacious bid for power the Cult of the Dragon, along with its dragon allies and the Red Wizards of Thay, seek to bring Tiamat from her prison in the Nine Hells to Faerun. To this end, they are sweeping from town to town, laying waste to all those who oppose them and gathering a hoard of riches for their dread queen. The threat of annihilation has become so dire that groups as disparate as the Harpers and Zhentarim are banding together in the fight against the cult. Never before has the need for heroes been so desperate. • The first of two adventures in the Tyranny of Dragons™ story arc, Hoard of the Dragon Queen provides everything a Dungeon Master needs to create an exciting and memorable adventure experience.  • Fans of the Dungeons & Dragons® Roleplaying Game can get a sample of what this product has in store for them through the D&D Encounters™ in-store play program.    • Adventure design and development by Kobold Press."}]