[{"id": "162323512X", "genre": "Children's Books", "title": "St. Patrick's Day (Holidays and Celebrations)", "description": "Dress in some green, savor a slice of soda bread, and catch a little luck of the Irish! Kids will discover the history behind Saint Patrick's Day, and find out ways to celebrate on their own. Young readers learn about the festivities and traditions associated with this celebration of Irish culture."}, {"id": "B00CM18KOI", "genre": "Children's Books", "title": "Mexico for Kids! - Hispanic Heritage for Children", "description": "Explore the rich culture and history of Mexico.Children ages 6 to 10 will love the colorful pictures and easy-to-read language.Your kids will improve their reading skills and enhance their vocabulary while learning about the intriguing country of Mexico.Discover...* What do the colors on the Mexican flag stand for?* How did Mexico start?* Who were the first people in Mexico?* How did the Aztecs start Mexico City?* What unique writing system did the Mayas invent?* Which unusual foods are eaten in Mexico?* What is Dia de los Muertos (Day of the Dead)?* Which incredible butterfly flies to Mexico every year?* What is the strange Mexican creature known as the \"water monster\"?* Which tasty treat did the Aztecs discover?* Which amazing pyramid is found in Mexico?* What sports are popular in Mexico?* What are mariachis?* What delicious meals are popular in Mexico?...and Much, Much More!Grab \"Mexico for Kids\" and start your Mexico adventure!"}, {"id": "1626862524", "genre": "Children's Books", "title": "Junior Builder: Racing Machines", "description": "Junior Builder: Racing Machines is designed for curious youngsters aged 5 and up who want to know how all types of racing vehicles are built to reach incredible speeds. Kids can add to the excitement by assembling a 12-inch interactive model of a dragster.The kit includes:• 24-page book with information on a variety of racing vehicles• Pieces to assemble a 12-inch model of a dragster"}, {"id": "1408343290", "genre": "Children's Books", "title": "Beast Quest: Skrar the Night Scavenger: Series 21 Book 2", "description": "Battle Beasts and fight Evil with Tom and Elenna in the bestselling adventure series for boys and girls aged 7 and up!The second of Malvel's terrible Netherworld Beasts has come to attack Avantia. It's time for Tom and Elenna to battle Skrar, a Beast whose magical flames make him a fearsome enemy... There are FOUR thrilling adventures to collect in this series - don't miss out! Grymon the Biting Horror; Skrar the Night Scavenger; Tarantix the Bone Spider and Lypida the Shadow Fiend"}, {"id": "1521052115", "genre": "Children's Books", "title": "God Loves You", "description": "How does God love me? This book celebrates how God's love is shown through many aspects of a child's life, with a particular focus on nature and the people close to them. Also in song form, a hyperlink to a recording is provided in the text."}]