[{"id": "1101934654", "genre": "Children's Books", "title": "Green Vs. Mean (Teenage Mutant Ninja Turtles) (Little Golden Book)", "description": "Boys and girls ages 2–5 can meet Nickelodeon's Teenage Mutant Ninja Turtles in this all-new, full-color Little Golden Book."}, {"id": "0865050279", "genre": "Children's Books", "title": "Early Farm Life (Early Settler Life)", "description": "Describes the daily lives of early settlers, explains how they cleared land, built homes, plowed fields, and planted and harvested crops, and looks at the hardships and pleasures of farm life"}, {"id": "B01675A952", "genre": "Children's Books", "title": "Living in . . . Mexico", "description": "Discover what it’s like to grow up in Mexico with this fascinating, nonfiction Level 2 Ready-to-Read, part of a new series all about kids just like you in countries around the world!¡Hola! My name is Rosa, and I’m a kid just like you living in Mexico. Mexico is a country filled with beautiful art, incredible ancient ruins, and gorgeous beaches, rainforests, and deserts! Have you ever wondered what Mexico is like? Come along with me to find out! Each book in our new Living in… series is narrated by a kid growing up in their home country and is filled with fresh, modern illustrations as well as loads of history, geography, and cultural goodies that fit perfectly into Common Core standards. Join kids from all over the world on a globe-trotting adventure with the Living in… series—sure to be a hit with children, parents, educators, and librarians alike!"}, {"id": "043118948X", "genre": "Children's Books", "title": "A Basketball All-Star (The Making of a Champion)", "description": "Looks at how people succeed and reach the top of their chosen sport and what it takes to be World Class. Includes information from basic aptitude and ability, to techniques, fitness, diet and more. Contains fascinating facts about all aspects of each sport. Includes case studies, photographs and diagrams. Features champions and competitors from around the world."}, {"id": "0763632295", "genre": "Children's Books", "title": "The Snow Queen", "description": "A classic translation of one of the world's greatest fairy tales — a magical story of a young girl's quest to save the boy she loves.When Kay is lured from his home by the beautiful, cruel Snow Queen, his friend Gerda sets out on an epic journey to rescue him. As she searches, she encounters a series of strangers to whom she relays her plight. Charmed by her story and her innocence, each of them helps Gerda, so that at last she is able to find the Snow Queen's icy palace. But at the end of her epic journey, will Gerda manage to set Kay free? Soft, ethereal artwork and a faithful translation set the mood for a keepsake edition of Andersen's much-loved winter's tale."}]