[{"id": "B06XC1C8DG", "genre": "Children's Books", "title": "Looking Good in the Skin I'm In | Baby & Toddler Size & Shape", "description": "This Size and Shape Books edition features a wide range of people and culture all over the world. This will not only educate your babies and toddlers about the different sizes and shapes, this will also make them acknowledge other colors, tribes and beliefs. Familiarize them with the rest of the world at a young age. Get them a copy of this book now."}, {"id": "0312508700", "genre": "Children's Books", "title": "Wipe Clean Workbook Tracing and Pen Control (Wipe Clean Workbooks)", "description": "Wipe clean workbook full of tracing and pen control exercises and activities to help prepare children aged three and over for school."}, {"id": "B00HNE0VGO", "genre": "Children's Books", "title": "What's So Great About Walt Disney? A Biography of Walt Disney Just for Kids! (What's So Great About... Book 5)", "description": "Walt Disney was a man who had both an incredible artistic talent and a powerful imagination. His career as an artist began when he was just seven years old, living with his family in Marceline, Missouri. You may know his name, but perhaps you've wondered, \"What's so great about him?\"This book (part of the “What’s So Great About…”) series, gives kids insight into life, times and career of Walt Disney."}, {"id": "143924989X", "genre": "Children's Books", "title": "Knuckle Down", "description": "After ten-year-old Hannah loses her father’s lucky boyhood marbles, bad things start to happen. Hannah’s not-quite-right little sister almost chokes to death on one of the marbles left behind, Daddy’s Liberty ship sails off to points unknown, and her mother has little time or energy to deal with the strife on the homefront. Unable to stay out of trouble for long, Hannah learns about love, death, and sacrifice as she struggles to find her place in a world at war. Resorting to petty crime, she boards the Red Car to the Long Beach Pike and an exciting new life away from the battles at home. She soon discovers, however, that bad luck can follow anywhere. When a telegram arrives from the warfront, fulfilling the prophecy of a fortuneteller, Hannah is determined to change her luck and salvage her family. Unfortunately, “girls don’t play marbles,” and she challenges the worst Hannah-banana boy on one of the darkest days in American history."}, {"id": "039598405X", "genre": "Children's Books", "title": "The Great Mystery: Myths of Native America", "description": "This authoritative guide to Native American myth and legend explores the powerful themes and dramatic stories that explain the great mysteries of life, death, how the world was created, and how it will end. A description of the nature of Native American myths, examining the common themes found in the rich mythology of the First Nations, is followed by chapters on main culture groups that include numerous excerpts from the myths themselves, many of them humorous. Folklorist Neil Philip has created an enthralling and multilayered book, handsomely illustrated with photographs printed in duotone, that will be treasured by anyone intrigued by Native American culture or mythology."}]