[{"id": "0613720253", "genre": "Children's Books", "title": "13 Scary Ghost Stories (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Thirteen scary stories from around the world. \"\"[An] absorbing collection of ghoulish, accessible tales.\"\"--Booklist."}, {"id": "B00FFQ9ELA", "genre": "Children's Books", "title": "Remember When - Wilbur the Beach Pig (Living the Beach Life Book 2)", "description": "Wilbur the beach pig lived to almost 12 years old on the island of St Kitts. During his life Wilbur made many friends and had many adventures with the other animals he met on the beach; Lion Paw, Oliver and Shylo just to name a few. He was loved by all of his friends. In fact, if you visit Reggae Beach in St. Kitts you can see a beautiful memorial that Wilbur's friends have built in his honor. Wilbur wanted to share his memories with us so he left behind this fun photo journal of his life, \"Remember When\".   You can read more about Wilbur and his friends in other books in the 'Living the Beach Life' series like book 1, \"Lion Paw and Oliver, An Unlikely Friendship\"."}, {"id": "076362506X", "genre": "Children's Books", "title": "Piggy and Dad Go Fishing", "description": "After a close encounter with a smiling worm and a sad-faced fish, it's no wonder that Piggy and Dad invent a new form of fishing that's fair game for everyone!Piggy is going fishing with Dad for the very first time, and he couldn't be more excited. But when he comes face to face with the bait—an irresistibly cute worm — tenderhearted Piggy starts thinking about the sport in a whole new way. In this warm, funny father-son tale, the popular Piggy and Dad move on from a Brand New Reader format to their first full-length picture book, one that's sure to have loyal fans hooked — and that will reel in new friends as well."}, {"id": "1849410178", "genre": "Children's Books", "title": "555 Football Facts to Wow Your Mates!", "description": "Which football trophy has three handles? When was a match stopped because there was a solar eclipse? Which very famous ex-West Ham player's middle name is Chelsea? The answers to these questions and many more can be found in this funny, fascinating book. You might think you know football, but this book will turn you into the ultimate fan. Packed full of stuff on players, matches, positions and all the major competitions, it really does contain everything you could ever wish to know about your favourite sport."}, {"id": "0778741990", "genre": "Children's Books", "title": "Battle for the Atlantic (Graphic Modern History: World War II)", "description": "In the six titles comprising the Graphic Modern History series, each book begins with four pages of history detailing the events of World War II that occurred in a particular theater of war, or area of battle. The factual text, historic photographs and further information in these spreads set the stage for three compelling stories that follow which are presented in full-color graphic novel format. Simultaneous."}]