[{"id": "0898457467", "genre": "Children's Books", "title": "A Story of Hanukkah", "description": "A joyous celebration of Hanukkah that includes the story of Bubbie and Zadie, magical grandparents of Jewish children everywhere, and a spirited collection of songs and music.  This holiday collection is the perfect way for the whole family to rejoice in the miracle of Hanukkah.  "}, {"id": "0712356932", "genre": "Children's Books", "title": "Around the World in 80 Maps", "description": "Sumptuously illustrated with 80 maps from the British Library’s unrivaled collection, this gorgeous book whisks the reader around the globe. Like that of Jules Verne’s famous hero, the journey begins and ends in London, plotting an eastwards route with stop-offs at some of the world’s most fascinating cities and countries. There are extraordinary details to pore over, as well as stories about how and why these maps were made, and by whom. Fascinating snippets explore each place in more depth, revealing its history, famous people, landmarks, wildlife, culture or customs. Helpful fact files provide at-a-glance information to broaden geographical knowledge."}, {"id": "B074PJYLS3", "genre": "Children's Books", "title": "Cora The Mermaid: Helps A Friend (Book For Kids) (Fantasy Friends 3)", "description": "Someone is hurt and Cora the Mermaid rushes to the aid! Will Cora the Mermaid, Reesy the Unicorn and Pip the Dragon be able to help their hurt friend reunite with his family? Join the three best friends as they meet their new friend and go on a new adventure.I hope you enjoy book three of the Fantasy Friends series. Cora the Mermaid, Reesy the Unicorn, and Pip the Dragon will return in another adventure with more friends. This is a great book for young readers or as a wonderful bedtime story!"}, {"id": "0448443961", "genre": "Children's Books", "title": "It's Snow Joke (Katie Kazoo, Switcheroo No. 22)", "description": "Katie's actress friend Rosie invites her to a movie shoot at a ski lodge during winter break. Katie can't wait to hit the slopes for the first time. But unfortunately, the magic wind doesn't ever take a break. When Katie turns into the ski instructor, she lands in a very slippery situation. How will Katie fix her troubles this time?"}, {"id": "1558580093", "genre": "Children's Books", "title": "The Rainbow Fish", "description": "The Rainbow Fish is an international best-seller and a modern classic. Eye-catching foil stamping, glittering on every page, offers instant child appeal, but it is the universal message at the heart of this simple story about a beautiful fish who learns to make friends by sharing his most prized possessions that gives the book its lasting value.  A CHRISTOPHER AWARD WINNER  WINNER OF THE BOLOGNA BOOK FAIR CRITICI IN ERBA PRIZE  AMERICAN BOOKSELLERS ABBY AWARD WINNER  AN IRA-CBC CHILDREN'S CHOICE #1 PUBLISHERS WEEKLY BESTSELLER and WALL STREET JOURNAL BESTSELLER   "}]