[{"id": "1543501435", "genre": "Children's Books", "title": "Secret Service Agents (U.S. Federal Agents)", "description": "What do Secret Service agents do besides protect the president? Find out in this book! Readers will get a short introduction to the Secret Service, including what it does and a bit of its history. Then readers will learn the job functions of a Secret Service agent and what it takes to become one."}, {"id": "0613682378", "genre": "Children's Books", "title": "Frida Kahlo: The Artist Who Painted Herself (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Through original artwork as well as beautiful reproductions of Kahlo's paintings, the latest Smart About book explores the creative, imaginative world of Mexico's most celebrated female artist."}, {"id": "0671785451", "genre": "Children's Books", "title": "American Gymnasts: Gold Medal Dreams", "description": "They've set their sights on Sydney in 2000! During the Atlanta Summer Olympics, Americans were transfixed by the Magnificent Seven, the young women who led the United States to its first-ever team gold medal in gymnastics. Since that underdog win, U.S. gymnasts have continued to succeed in international competition, performing routines with power and grace. Just in time for the 2000 Sydney Olympics, here's the scoop on the American gymnasts who are front-runners in the race for Olympic gold, including: * Kristen Maloney, the two-time national champion who even has an uneven-bars move, \"The Maloney,\" named after her * Vanessa Atler, a three-time U.S. gold medalist and 1998 Goodwill Games champion, who has been called the new Mary Lou Retton * Elise Ray, the two-time U.S. gold medalist whose spectacular performance at the 1999 World Championships exceeded all expectations Plus Morgan White, Jennie Thompson, updates on 1996 gold medalists Dominique Moceanu and Amy Chow, and many more Olympic"}, {"id": "1842157817", "genre": "Children's Books", "title": "Exploration & Discovery: History Detectives Series", "description": "Read all about the great explorers - Columbus, Cheng Ho, Cabot and Captain Cook. Join these intrepid exploreres on their voyages into the unknown."}, {"id": "1534418040", "genre": "Children's Books", "title": "Night of the Zombie Zookeeper (Desmond Cole Ghost Patrol)", "description": "It’s Desmond and Andres versus the Zombie Zookeeper in the fourth book of the Desmond Cole Ghost Patrol chapter book series!Welcome to Kersville, a town with a spooky history and a collection of ghosts and spirits who are major mischief-makers. Most kids spend their days without ever seeing or dealing with a ghost, but some kids get stuck with a haunt. When that happens, they call Desmond Cole Ghost Patrol. There’s no job too spooky, icky, or risky for Desmond. I’m not like that at all. My name’s Andres Miedoso. I’m Desmond’s best friend and ghost patrol partner. For this case, we’re off to the zoo! Zoo field trips are the best. You get to ride in a bus, you get to spend the day outside, and all the animals are safely far away in their enclosures. Nothing scary here, right? Wrong! Leave it to Desmond Cole to find the one zookeeper who’s also a zombie. With easy-to-read language and illustrations on almost every page, the Desmond Cole Ghost Patrol chapter books are perfect for emerging readers."}]