[{"id": "1934246719", "genre": "Science Fiction & Fantasy", "title": "The Unrequited", "description": "The Unrequited is an incredible story of the turbulent years of the Indochina War seen through the multiple eyes of fictional French and Vietnamese. They live the historical times at the end of the Second World War through the decisive battle of Dien Bien Phu. In this time of revolutionary change French colonials and legionaries are pitted against the followers of Ho Chi Minh and General Giap. Nguyen van Phan, a reporter in exile, leads his new family from a rural village back to Ha Noi to report on the Vietnamese struggle for independence. His wife Thi reluctantly follows. Lieutenant Pasteur, a newly commissioned French Legionnaire seeking adventure, is posted to Ha Noi as a platoon leader. An aging Doctor Ashtray abandons all hope of returning to France and cares for the few remaining French civilians and the growing number of military casualties. The oprhan Lao survives in the streets until he is forcibly recruited by the Viet Minh. These lives and others are interwoven in the threads of history, their viewpoints colored by the past and the sights and sounds of the place and era that lead them on seperate parallel journeys. Through the years of conflict, they remain unrequited. Not for the faint of heart, this novel portrays the grim face of war. History proved the period just the first act of a much longer tragedy that might have been avoided if America had learned the lesson of those years."}, {"id": "1611099692", "genre": "Science Fiction & Fantasy", "title": "Brilliance (The Brilliance Trilogy)", "description": "In Wyoming, a little girl reads people’s darkest secrets by the way they fold their arms. In New York, a man sensing patterns in the stock market racks up $300 billion. In Chicago, a woman can go invisible by being where no one is looking. They’re called “brilliants,” and since 1980, one percent of people have been born this way. Nick Cooper is among them; a federal agent, Cooper has gifts rendering him exceptional at hunting terrorists. His latest target may be the most dangerous man alive, a brilliant drenched in blood and intent on provoking civil war. But to catch him, Cooper will have to violate everything he believes in—and betray his own kind.From Marcus Sakey, “a modern master of suspense” (Chicago Sun-Times) and “one of our best storytellers” (Michael Connelly), comes an adventure that’s at once breakneck thriller and shrewd social commentary; a gripping tale of a world fundamentally different and yet horrifyingly similar to our own, where being born gifted can be a terrible curse.A 2013 Edgar Award Nominee“The kind of story you’ve never read before.” —Lee Child, New York Times bestselling author of the Jack Reacher Series“Ridiculously good. I love this story so much.” —Gillian Flynn, New York Times bestselling author of Gone GirlNominated for the Edgar, Lovey, Sideways, and Prometheus awards."}, {"id": "0451419065", "genre": "Science Fiction & Fantasy", "title": "Shadow's Bane (Dorina Basarab)", "description": "Half-human, half-vampire Dorina Basarab is back--and facing her biggest challenge yet in the next urban fantasy in the New York Times bestselling series.Dorina Basarab is a dhampir--half-human, half-vampire. As one of the Vampire Senate's newest members, Dory already has a lot on her plate. But then a relative of one of Dory's fey friends goes missing. They fear he's been sold to a slaver who arranges fights--sometimes to the death--between different types of fey.As Dory investigates, she and her friends learn the slavers are into something much bigger than a fight club. With the Vampire Senate gearing up for war with Faerie, it'll take everything she has to defeat the slavers--and deal with the entirely too attractive master vampire Louis-Cesare...."}, {"id": "0441013813", "genre": "Science Fiction & Fantasy", "title": "Moon Called (Mercy Thompson, Book 1)", "description": "THE FIRST MERCY THOMPSON NOVEL!Moon Called is the novel that introduced Patricia Briggs’s Mercy Thompson to the world and launched a #1 bestselling phenomenon... Mercy Thompson is a shapeshifter, and while she was raised by werewolves, she can never be one of them, especially after the pack ran her off for having a forbidden love affair. So she’s turned her talent for fixing cars into a business and now runs a one-woman mechanic shop in the Tri-Cities area of Washington State.But Mercy’s two worlds are colliding. A half-starved teenage boy arrives at her shop looking for work, only to reveal that he’s a newly changed werewolf—on the run and desperately trying to control his animal instincts. Mercy asks her neighbor Adam Hauptman, the Alpha of the local werewolf pack, for assistance. But Mercy’s act of kindness has unexpected consequences that leave her no choice but to seek help from those she once considered family—the werewolves who abandoned her...“In the increasingly crowded field of kick-ass supernatural heroines, Mercy stands out as one of the best.”—Locus"}, {"id": "B00O5LTHYU", "genre": "Science Fiction & Fantasy", "title": "Starlight Symphonies of Oak and Glass: A Novel of the Great Lakes", "description": "A swirling chaos settles over a ship becalmed...A stirring novel of history, of magic, of the mysteries of the northern lakes, and the spell they cast over those who know them.An ordinary crossing from Detroit to Mackinac Island in a wild 19th century Michigan, turns desperate as the ship runs afoul of the weather. In turns the victim of a series of eerie calms and inexplicable storms, the schooner is a captive on the whims of the lake.The characters take turns telling the tale, each having their own story to reveal. The crushing obstacles of the voyage shine light on the past lives, loves, betrayals and misdeeds of all aboard. The brave company must find redemption, if they are ever to sail brightly toward their destiny."}]