[{"id": "B015W3PYUU", "genre": "Science Fiction & Fantasy", "title": "The Aftermath: Book Four of the Asteroid Wars", "description": "In the wake of the Asteroid Wars that tore across the solar system, Victor Zacharius makes his living running the ore-carrier Syracuse. With his wife and two children he plies the Asteroid Belt, hauling whatever cargo can be found. When the Syracuse stumbles into the middle of a military attack on the habitat Chrysalis, Victor flees in a control pod to draw the attacker's attention away from his family. Now, as his wife and children plunge into the far deeps of space, Victor has been rescued by the seductive Cheena Madagascar. He must do her bidding if he's to have a prayer of ever seeing his family again.Elverda Apacheta is the solar system's greatest sculptor. The cyborg Dorn was formerly Dorik Harbin, the ruthless military commander responsible for the attack on Chrysalis. Their lives and destinies have been linked by their joint discovery of the alien artifact that had, earlier, profoundly affected industrialist Martin Humphries. Similarly transformed by the artifact's mysterious powers, Apacheta and Dorn now prowl the Belt, determined to find the bodies of the many victims of Harbin's atrocities so that they can be given proper burials.Kao Yuan is the captain of Viking, owned by Martin Humphries, who's determined to kill Dorn and Elverda because they know too much about the artifact and its power over him. But Viking's second-in-command, Tamara Vishinsky, appears to have the real power on board ship. When Viking catches up to Apacheta and Dorn, their confrontation begins a series of events involving them, the Zacharius family, and Martin Humphries and his son in the transformation of the human solar system…At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."}, {"id": "0385538235", "genre": "Science Fiction & Fantasy", "title": "The Compleat Ankh-Morpork", "description": "A brand-new street directory of Discworld city Ankh-Morpork complete with a beautifully illustrated pull-out map. 'There's a saying that all roads lead to Ankh-Morpork. And it's wrong. All roads lead away from Ankh-Morpork, but sometimes people just walk along the wrong way.' Ankh-Morpork! City of One Thousand Surprises (according to the famous publication by the Guild of Merchants)! All human life is here! Although, if it walks down the wrong alley, often quite briefly! This is the city celebrated in Terry Pratchett's bestselling Discworld series as you've never seen it before. A stunning map and comprehensive street directory covering each and every district from Unseen University to the Shades, major landmarks like the Patrician's Palace to little-known, er, nooks like Dwarf Bread Museum in Whirligig Alley. See the notorious establishments and famous streets along which so many heroes have walked, in some cases quite hurriedly. As leading Ankh-Morpork entrepreneur CMOT Dibbler would say, 'A nip at any price -- and that's cutting our own throat. Well, close.'"}, {"id": "B017NZIO52", "genre": "Science Fiction & Fantasy", "title": "Serious Crimes: Policing Post-Apocalyptic Britain (Strike a Match Book 1)", "description": "Policing Post-Apocalyptic Britain.They called them Artificial Intelligences. Sentient viruses were closer to the truth. They spread throughout the world until every networked circuit was infected. Then they went to war. Millions died in the nuclear holocaust that brought an abrupt end to the AI’s brief reign of terror. Billions more succumbed to radiation, starvation, and disease. But millions survived, and they rebuilt.Twenty years later, a ceremony is being held to mark the first transatlantic broadcast since The Blackout. The Prime Minister of Britain and two of the Presidents of the United States will speak to an audience of nearly ten million people. Not all are celebrating. Crime is on the rise, and power is once again a prize worth murdering for.Ruth Deering, a new graduate from the police academy, doesn’t care about ancient history or current affairs. She only joined the force to escape the smog-infested city. Those hopes are dashed when she is assigned to the Serious Crimes Unit, commanded by the disgraced Sergeant Mitchell. Her first case seems like a simple murder, but the investigation uncovers a counterfeiting ring and a conspiracy that threatens to destroy their fragile democracy.A post-apocalyptic thriller set in a world of rationing and ruins, where a democracy struggles not to become a dystopia. The investigation continues in Counterfeit Conspiracy. (77,000 words)"}, {"id": "1601251653", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Chronicles: Dragons Revisited", "description": " The great dragons of Golarion dominate the hidden mountain valleys of the world and stand with serpentine grace at the center of the world’s most mysterious and potent legendry. Like the best-selling Classic Monsters Revisited, Dragons Revisited takes a deeper look at the ten canonical fantasy dragons (red, blue, green, black, white, gold, silver, bronze, brass, and copper), detailing the history, lore, ecological habits, and schemes of each draconic breed. Each mini-section of the book features never-before-revealed details about a specific dragon, adding a host of intriguing wyrms to any Pathfinder campaign. "}, {"id": "B071YB2MLS", "genre": "Science Fiction & Fantasy", "title": "Hellspawn Requiem", "description": "Blood from the epic battle stains the ancient stone, shed from both the living and the dead. The massive castle walls provide a period of respite from the unending terror and the group can finally honour the fallen. As Kurt and his family count the cost of securing their new sanctuary, new friends have joined the fray. Only by pulling together can they hope to have any kind of future in the apocalyptic world. A few short miles away, the psychotic lovers receive a victor’s welcome. Craig Arater, older sibling to Mike, rules the prison with an iron fist, meting out brutal punishments to those who fail him. Designed to keep the worst of humanity locked away, now it provides a haven for the evil in men to thrive. Winston has chosen a different path from his murderous companions. Faced with an uncertain future in the prison or solitude amongst the dead, he chose to go it alone. A rumour about the castle and its inhabitants gives him hope. The journey that awaits, however, will be more dangerous than anything he has faced before. "}]