[{"id": "B00GXGTASI", "genre": "Children's Books", "title": "Kids Book: Tino Dragon - A Reading Fiction Kids Book For Preschool, Kindergarten and First Graders With Pictures (Prime Books To Borrow For Free) (Prime Toddler Stories For Children 1)", "description": "Length: 20 Pages | Age Level: 2 - 8 | Grade Level: P - 3A Fun Kids Book for Preschool, Kindergarten and First Graders With Colorful Pictures For ReadingPrime Books To Borrow For FreeTino Dragon is a funny little rhyming dragon story for young kids. Tino Dragon is hilarious and he loves playing with his friends, but there’s one thing that always gets in the way—his big tail. This memorable and beautifully illustrated kid’s story unfolds as Tino stops at nothing to get a smaller tail. Kids are amused to learn more about Tino as he becomes more and more frustrated with his big tail. "}, {"id": "1561642665", "genre": "Children's Books", "title": "Dinosaurs of the South (Southern Fossil Discoveries)", "description": "Fossils of extinct animals are scarce in the southeastern United States, but archaeologists have uncovered enough evidence to know that a variety of dinosaurs lived in Southern forests and coastal lowlands. Large meat-eaters hunted plant-eating hadrosaurs. Ostrichlike dinosaurs darted after small prey, and armor-covered nodosaurs rambled through underbrush 75 million years ago. Giant reptiles that were not dinosaurs also lived in the South. The crocodile-like Deinosuchus, which grew to lengths near 40 feet, lurked along riverbanks. These giants probably ate dinosaurs! Pterosaurs, or flying reptiles, soared over the coast. One of the largest, Pteranodon, had a wingspan of 24 feet. Paleontologists have even identified some entirely new dinosaur species known only in the South."}, {"id": "1631138642", "genre": "Children's Books", "title": "Ahí viene el lobo gris / Here Comes the Gray Wolf (Spanish Edition) (Animales de America/ Animals of the Americas)", "description": "Wolves are strong, fierce, and cunning, but they are also playful and affectionate. This book provides information about the behavior of these wonderful animals and will teach you how wolves became endangered and how people are working to save them. Here you will find pictures and information about this noble animal and, following that, a story."}, {"id": "0692699406", "genre": "Children's Books", "title": "The Birth of a Champion", "description": "Lujien, my six-year-old daughter, came home one day with the idea of a story of a fish struggling in her school because she is weak. As a physician, I have seen firsthand how physical therapists work to help patients succeed. The idea of our book is to help children understand disabilities, and the role physical therapists play in helping them heal. By making the story about a small fish and (not a human), we hope that kids will better absorb and understand the idea of disability."}, {"id": "145940632X", "genre": "Children's Books", "title": "Annaleise Carr: How I Conquered Lake Ontario to Help Kids Battling Cancer (Lorimer Recordbooks)", "description": "Over eight months of planning, hundreds of hours of hard physical training, amassing a team of dedicated crewmates, approaching sponsors and collecting donations--and, finally, swimming for twenty-seven hours across the cold, rough waters of Lake Ontario. Why would a fourteen-year-old girl take on such a challenge? For Annaleise Carr, the motivation did not come from a desire for glory. Her ultimate goal was to raise money for her new friends at Camp Trillium, a charity that provides a camping experience for kids with cancer. What kept her going through the cold water, the exhaustion and the terrifying night swim was the thought of those kids and their families that she was helping. In August 2012, she became the youngest person to cross Lake Ontario. Readers will meet an extraordinary fourteen-year-old girl in this book. As she tells her story, it becomes clear how idealism and an intense desire to help others can lead a young teen to almost unimaginable achievements."}]