[{"id": "0809167670", "genre": "Children's Books", "title": "Prayer of St. Francis, The", "description": "Although the prayer of St. Francis is widely known and loved by people of all ages, here is a new slant on it a children's book that brings the prayer to life with tenderness, wonder, and joy. Accompanying each line of the prayer are sweet little animals paired with a wolf that can only be described at gentle and loving. Here is a wolf that is protector and helper to his little forest friends, bringing them light to banish the darkness, joy to counter their sadness, even contemplating the sunset with his arm around his friend the sheep. A short history of St. Francis and of the prayer is included to help readers put it in perspective.Children will be drawn into the warm, whimsical, and charming illustrations that truly make the prayer come alive. And as they read it to and with children, adults will find themselves smiling at and contemplating this book that will remind them of the beauty and simplicity of this prayer."}, {"id": "1974191885", "genre": "Children's Books", "title": "Positive Thinking Positive Outcome: Back To School Composition Notebook, 8.5 x 11 Large, 120 Pages College Ruled (Back To School Journal)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "0545160758", "genre": "Children's Books", "title": "Who Would Win? Killer Whale vs. Great White Shark", "description": "What would happen if a great white shark and a killer whale met each other?  What if they were both hungry?  What if they had a fight?  Who do you think would win?"}, {"id": "1452144842", "genre": "Children's Books", "title": "Curious Constructions: A Peculiar Portfolio of Fifty Fascinating Structures (Uncommon Compendiums)", "description": "Curious about constructions? Inside this book, you'll come face-to-face with 50 incredible structures, including: a fire-breathing octopus sculpture; the skateboard ramp you'd need to jump the Great Wall of China; a whole community of tree houses in Costa Rica; and a lifesize X-Wing Starfighter built of Legos. These and many more fascinating accounts of constructions both fantastically useful and gloriously unnecessary await inquisitive readers, aspiring engineers, and anyone who ever looked at a skyscraper and thought, \"Yeah, but what if it had a roller coaster on top?\""}, {"id": "0823408957", "genre": "Children's Books", "title": "Christopher Columbus: Great Explorer (First Biography)", "description": "A chronicle of the life and adventures of Christopher Columbus describes his early years in Genoa, his dreams of sailing, his four voyages to the Americas, and the indigenous peoples he encountered there."}]