[{"id": "1500711411", "genre": "Science Fiction & Fantasy", "title": "The 17", "description": "Zack Earnest may die today. That's okay. He'll be back from the dead tomorrow. You Only Live Once? Not here. Here the rules of life and death don't apply. Whisked away from his home, his only friend Caroline and his mother's scrumptious eggs, 17-year-old Zack finds himself a stranger in a strange land, surrounded by other teenagers from his world and many others, held hostage and thrust into barbaric games by an ancient species known only as the Ankhs. The Ankhs are in their death throes and seek a \"Spark\" to survive. Zack and sixteen others just like him may have it. Along the way Zack falls for the girl (in the solar system) next door, and they soon discover the Ankh's intentions are not what they seem. From the best-selling author of Nine Meals comes a story of hope and redemption, of patience and understanding, of acceptance and belonging and that, even in the center of the universe, love is a constant."}, {"id": "B00F1UI6S2", "genre": "Science Fiction & Fantasy", "title": "The Trap - Emancipation", "description": "The Trap – Emancipation is a tale of good versus evil, racial malevolence, good humor, warm characters, suspense, love, violence, and horror. Set during circa 1965 at the hotspot of the Civil Rights Movement in Mississippi and the swampy Atchafalaya Basin of Louisiana, The Trap - Emancipation is the first of a series and the debut novel by author, Dennis W. Headrick. Only eleven-year-old, Jesop Arnaud, has been gifted with supernatural powers that may prevail against the evil Swamp Queen, Eloise Chenault's, horrendous scheme - a curse that would have the bigoted bully, Johnny Salk, kill Jesop and many other innocents in Harvestown. Jesop must fight a hard battle and endure a horror no child should have to encounter. Jesop trusts in the avowal made by his Cajun Grandmawmaw, Rosaline St. Martin, of Boudoin, Louisiana that he has been chosen as her neophyte. Rosaline, a faithful Catholic, is also a spiritual medium and a skilled practitioner of good Vodun magic. Jesop boldly accepts the challenge and embraces his fate as Rosaline’s novice. But can a small boy, even an enchanted one, be victorious when pitted against both the murderous psyche of Johnny Salk and the Voodoo Queen Eloise’s demonic power?"}, {"id": "B01IPYUG4C", "genre": "Science Fiction & Fantasy", "title": "The 100", "description": "The Hunger Games meets Lost in this spectacular new series. Now a major TV series on E4. No one has set foot on Earth in centuries - until now. Ever since a devastating nuclear war, humanity has lived on spaceships far above Earth's radioactive surface. Now, 100 juvenile delinquents - considered expendable by society - are being sent on a dangerous mission: to recolonize the planet. It could be their second chance at life...or it could be a suicide mission. Clarke was arrested for treason, though she's haunted by the memory of what she really did. Wells, the chancellor's son, came to Earth for the girl he loves - but will she ever forgive him? Reckless Bellamy fought his way onto the transport pod to protect his sister, the other half of the only siblings in the universe. And Glass managed to escape back onto the ship, only to find that life there is just as dangerous as she feared it would be on Earth. Confronted with a savage land and haunted by secrets from their pasts, the 100 must fight to survive. They were never meant to be heroes, but they may be mankind's last hope. "}, {"id": "0739114379", "genre": "Science Fiction & Fantasy", "title": "Part Blood, Part Ketchup: Coming of Age in American Literature and Film", "description": "Part Blood, Part Ketchup analyzes novels by 20th century authors Edith Wharton, J.D. Salinger, Philip Roth, John Irving, and Jamaica Kincaid, uncovering trends that obliterate cultural divides. With unrestrained American voices, the collective pitch of their complaints soars, revealing an unmistakable formula of heightened self-exposure and fury."}, {"id": "B01N8TOLHQ", "genre": "Science Fiction & Fantasy", "title": "Bound by a Dragon (The Dragon Archives Book 1)", "description": "Keira is content in her small, medieval village - well, sort of. Her mother is pressing her to marry, but her suitors are less than desirable. So when handsome Aaron Drake arrives in the village and focuses his attention on Keira, she cannot help but be interested. But Aaron is not the only new arrival in the area - a fire-breathing dragon has also taken up residence in the mountains, not far from the remote alpine castle that Aaron calls home. What exactly is the connection between Aaron Drake and the dragon? Why is his arrival coincident with the arrival of a beast? And when the dragon rescues her from the unwanted attentions of some village boys, who will set out to rescue her from the huge, scaly, fire-breathing monster? Bound by a Dragon sweeps the reader far from the modern world into a world of castles, medieval markets and fantastical romance."}]