[{"id": "1329057546", "genre": "Science Fiction & Fantasy", "title": "Demon Meat for Dinner", "description": "After the sudden death of Lloyd Goddard, a well-respected man in idyllic Ivorygate, Mortimer Dane, a young farmhand, inherits Goddard Farm.And with it, the gate to Purgatory.As Mortimer begins adjusting to his new tumultuous life, he finds that his occupation includes keeping the peace in the supernatural community and defending the farm from demonic potential buyers, all while he sorts out his complicated relationship with his childhood friend, Gabriel. Along the way, Mortimer strikes up a friendship with Gerry Rigby-a newcomer to Ivorygate as well as the deacon's daughter-gains allies in strange places, and discovers that the people he is closest to have been keeping secrets from him for his entire life.And amid the chaos, a man named Fiddler arrives, claiming to represent a mysterious potential buyer named Luci.           "}, {"id": "0345347536", "genre": "Science Fiction & Fantasy", "title": "A Spell for Chameleon (Xanth, Book 1)", "description": "Xanth was the enchanted land where magic ruled--where every citizen had a special spell only he could cast. That is, except for Bink of North Village. He was sure he possessed no magic, and knew that if he didn't find some soon, he would be exiled. According to the Good Magician Humpfrey, the charts said that Bink was as powerful as the King or even the Evil Magician Trent. Unfortunately, no one could determine its form. Meanwhile, Bink was in despair. If he didn't find his magic soon, he would be forced to leave...."}, {"id": "078521741X", "genre": "Science Fiction & Fantasy", "title": "What Blooms from Dust: A Novel", "description": "Just as Jeremiah Goodbye is set to meet his fate in the electric chair, a tornado tears down the prison walls, and he is given a second chance at life. With the flip of a coin, he decides to return to his home town of Nowhere, Oklahoma, to settle the score with his twin brother Josiah. But upon his escape, he enters a world he doesn’t recognize—one that has been overtaken by the Dust Bowl. And the gift he once relied on to guide him is as unrecognizable as the path back to Nowhere.After one jolt in Old Sparky, Jeremiah sees things more clearly and begins to question the mysterious circumstances surrounding the murders he was accused of. On his journey home, he accidentally rescues a young boy who follows him the rest of the way, and the pair arrive at their destination where they are greeted by fearful townspeople. When the Black Sunday storm hits the very next day, the residents of Nowhere finally begin to let the past few years of hardship bury them under the weight of all that dust.Unlikely heroes, Jeremiah and his new companion, Peter Cotton, try to protect the townspeople from themselves, but Jeremiah must face his nightmares and free himself from the guilt of flipping the coin on those men who died.Filled with mystery and magic, What Blooms from Dust is the story of finding hope in the midst of darkness and discovering the beauty of unexpected kindness."}, {"id": "1535274611", "genre": "Science Fiction & Fantasy", "title": "1: Heirs of Camelot (Volume 1)", "description": "Noah Emrys is a teenage witch who has been keeping his powers hidden from his friends and family. On his 18th birthday, Noah decides to tell his family about his powers finally. When Noah tells his parents, he is attacked by Morgan Le Fay, who wants his powers to wipe out every mortal on Earth. To stop her, Noah must go back in time to find the magical sword Excalibur. With Excalibur and his mortal friends, Emma Jinni, and Joe King, Noah must stop Morgan Le Fay. While preparing to stop her, Noah must embrace who he is as Emma, Joe, and he discover secrets about each of them. Noah discovers a terrible family secret that might stop him from stopping Morgan Le Fay. Will Noah and his friends be able to stop Morgan Le Fay in time? Will Noah be able to handle his family secret? Will Noah come to grips with who he is?"}, {"id": "1543248330", "genre": "Science Fiction & Fantasy", "title": "Peace Is The Mission", "description": "Peace Is The Mission is about a group of tribal warriors called the Naguals. They form an alliance with a Vulcan general and a Kaal princess who seek refuge in their home upon the Mountain Top. The two star-crossed lovers flee their kingdoms only to find themselves at the forefront of a war. The Naguals seek to better the world and save it from the condemnation brought upon by the Vulcans and Kaal people. The world the Naguals love and live in is being destroyed by the lifestyles of the Vulcan and Kaal people. They are too naive to see the destruction they bring, and now the Naguals have no choice but to unite and fight for what they believe in and love. Will they have what it takes to secure a better future for all or will they fail as they face the vicious armies of their new enemies?"}]