[{"id": "0316361461", "genre": "Children's Books", "title": "Kubo and the Two Strings: Meet Kubo (Passport to Reading Level 2)", "description": "A level 2 reader based on the animated movie, Kubo and the Two Strings!©2016 LAIKA Entertainment. All Rights Reserved."}, {"id": "1421592231", "genre": "Children's Books", "title": "Pokémon Omega Ruby Alpha Sapphire, Vol. 4 (Pokemon)", "description": " Awesome adventures inspired by the best-selling new Pokémon Omega Ruby and Alpha Sapphire video games and picking up where the Pokémon Adventures Ruby and Sapphire saga left off!Ruby, Sapphire and Emerald face a new crisis of epic proportions: a giant meteor hurtling toward the planet! While Ruby, Emerald and Drake head for the village of the Draconids, Ultima attempts to decipher Zinnia’s mysterious scroll. Then, as if the world weren’t in enough danger of annihilation already, Blaise and Amber summon Groudon and Kyogre! The two Legendary Pokémon wrought chaos on the environment the last time they were awoken from their slumber… What will they do this time?! And who will prevent Zinnia from preventing the Devon Corp from blowing up the meteor…?!"}, {"id": "0787656348", "genre": "Children's Books", "title": "3: Science of Everyday Things: Real Life Biology", "description": "This 4-vol. set illustrates the importance of scientific and mathematical principles through their use in everyday life. Each volume focuses on a specific scientific discipline -- biology, chemistry, earth sciences and physics -- offering students an in-depth understanding of each discipline and its theories. Creating a sense of real-life relevance for students, the Science of Everyday Things expands on the explanations of scientific principles and concepts using a straightforward, step-by-step approach, and presents theories in their everyday applications. Some of the entries covered include: how osmosis is used in dehydrating fruit; how the principles of aerodynamics are applied to cars; Charles' law and the chemical reaction that sets off an airbag; how algorithms are used to figure out the NCAA playoff tournaments; and more. Each volume the Science of Everyday Things presents approximately 40-50 entries and includes photos, diagrams, sidebars containing short glossaries and interesting facts and details relating to each principle."}, {"id": "1432960040", "genre": "Children's Books", "title": "The Arab-Israeli War Since 1948 (Living Through. . .)", "description": "Why has the Arab-Israeli War lasted so long, and been fought in so many different ways? Why is it of such global importance? And how has it affected people on both sides of the conflict? This book seeks to relate the overall events and chronology of the war and shows its impact on everyday lives."}, {"id": "B00NN11I54", "genre": "Children's Books", "title": "100 Monsters But I Am Not Afraid: & The Monstrous Encyclopedia", "description": "There's no need to be afraid of the dark or things that go bump in the night. Explore the world of myth and monsters in this 2 for 1 book! Children will delight at this adorable rhyming book and monster encyclopedia. Each monster is fully illustrated in K. Ryan Henisey's award winning, watercolor and ink style. Children and families will sing along, listing all the classical creatures that don’t scare them at all. Both ‘100 Monsters’ and the ‘Monstrous Encyclopedia’ teach children not to be afraid. With sweet faces and bright smiles, each illustrated monster encourages bravery. Perfect for reading aloud, ‘100 Monsters’ allows low level readers the opportunity to read a book over 100 pages long! Parents and teachers can read the rhyming book aloud, leaving young readers the opportunity to explore the encyclopedia at their leisure. All of the monsters within the book are taken from global mythology, representing locations and stories from around the world."}]