[{"id": "1478788631", "genre": "Children's Books", "title": "LUC AND ZOË's BIG ADVENTURES: Luc and Zoë's First Cherry Blossom Festival", "description": "Join Luc and Zoe on their adventures through the Nation's Capital, Washington, DC. In this issue they discover the amazing National Cherry Blossom festival, what the festival represents, and how much fun it is!"}, {"id": "1432923595", "genre": "Children's Books", "title": "Classifying Invertebrates (2nd Edition) (Classifying Living Things)", "description": "What makes an invertebrate an invertebrate? How is an invertebrate different from a vertebrate? Why do insects molt? 'Classifying Invertebrates' looks at the amazing class of animals with no backbones. Find out how invertebrates are grouped into orders and how each one is different from the rest. From flatworms to roundworms and sponges to echnoderms, discover what makes invertebrates so special. Classifying Living Things investigates how and why we group animals. Each book focuses on a particular class of living things, looking at the key characteristics that set its members apart from those of other classes. Discover how classes of living things have evolved, and how species have adapted to suit their environments. Find out why certain invertebrates may show some characteristics of a particular class but actually belong to another."}, {"id": "1886184003", "genre": "Children's Books", "title": "The Adventures of Flumpa and Friends, Someday... Someday (with Audio Cassette)", "description": "The Adventures of Flumpa® and Friends, Someday...Someday, Book 1 is a large, imaginative picture book with cassette tape AND CD with something to teach about imagination, discovery and respect. In this engaging story of Flumpa, the adventurous little rain forest tree frog, children are entertained by the antics of the little frog, are given a sense of wonder through his innocent big blue eyes, and are subtly taught to heed their parents warnings and listen to their rules. And above all, they see and feel the warmth and comfort of a parent's love for their children. Colorful, detailed illustrations, six original “story songs” and narration with sound effects put the fun into learning to read. Made in the USA - ALL components. For ages up to 8, grades PreK-3rd. AWARDS & SELECTIONS A 1996 Parents’ Choice for audio Selected by the Parent Council as Outstanding 1997—The National Parenting Center Seal of Approval The Premier Print Award—Certificate of Merit, Juvenile Books"}, {"id": "0753400391", "genre": "Children's Books", "title": "Minibeasts in Close Up (Young Discoverers)", "description": "A combination of factual information and activities designed to encourage children to investigate and understand biology in different forms of life. A title in the YOUNG DISCOVERERS series."}, {"id": "0692938052", "genre": "Children's Books", "title": "The Shy Monster", "description": "The Shy Monster is a story about a little girl who struggles to overcome her shyness. Her shyness is depicted as a mean monster who bullies her, making her scared to speak up and go after her dreams. Thankfully, her mom puts her in an acting class, which helps her to become much more confident and brave. With her newfound courage, she is able to defeat the \"shy monster\" and achieve her dreams. This book models coping skills to help shy children overcome their fears. It also contains post-reading discussion questions and tips for teachers and parents of shy children. The story is engaging, the illustrations are vibrant, and the resources included will make a powerful positive impact on your child's social-emotional development."}]