[{"id": "B00QTXUIRW", "genre": "Children's Books", "title": "The Last Point", "description": "In her children’s story, The Last Point, author Alana Josephson gives an autobiographical account of an important tennis match, sharing with young readers the importance of perseverance in sports as well as in life.Having already won the local tournament, nine-year-old Alana continues on to play in the regional championships, excited for her chance to win there, as well. But can she win when her opponent in the final match starts cheating?! She’s faced with an even bigger challenge: Can she overcome her anger and win?  Due to her rival’s lies, her shot at the trophy begins to fade and she faces the age-old question: Can the honest player prevail? Wanting to be a good sport, she must up her game, while keeping her temper in check. Can Alana persevere through her frustration to win the trophy?By writing her personal experience with cheating as a children’s book, Josephson shows that it’s never too early to learn that cheating is harmful, or that good sportsmanship is an attitude worth applying to any situation you might face."}, {"id": "054598209X", "genre": "Children's Books", "title": "100 Blagues! Et Plus No 24 (English and French Edition)", "description": "See below for English description.Faits cocasses, blagues et charades, le tout rassemblé dans d'amusants petits livres format poche!  (English Description) Not published in English."}, {"id": "B073PV13DZ", "genre": "Children's Books", "title": "Swimming Pool Sports & Games", "description": "How to make and play games in an above and In-ground swimming pool. I show you how easy and inexpensive it is to make a water-ball, goal post, bases, net and basket for both above and in ground pools. The games in this book were written with all combination of age groups in mind. I have add suggestions and options to the games and races to make them equally challenging for the individual or teams as possible. This book will stimulate your imagination and even turn your ever day use and parties in to a splashing success."}, {"id": "0812462963", "genre": "Children's Books", "title": "Geraldine's Blanket", "description": "Geraldine loves her baby blanket. Trouble is, she's no baby, and her blanket is old and tattered. \"It looks silly,\" says her mother. \"There's hardly any blanket left,\"says her father. But geraldine refuses to part with her old friend. Will a new doll from Aunt Bessie at Christmas change her mind?"}, {"id": "1542529042", "genre": "Children's Books", "title": "106 Facts About Donald Trump: Donald Trump Biography for Kids, Teens & Adults", "description": "Donald John Trump is an American politician, businessman, television personality and President-elect of the United States who is scheduled to take office as the 45th President on January 20, 2017. Meet the world's newest most powerful man \"Trump\". Get to know the good, bad and ugly side of Donald Trump, who has been acclaimed as a man of controversies. From his multiple failed marriages, to multiple failed business ventures, to his boisterous nature, and to his careless choice of words. How much do you really know about Trump? Get all the facts you do or didn’t know about him. Get to know America's newest president, the most powerful country in the world!"}]