[{"id": "0988627485", "genre": "Children's Books", "title": "Bubbles (Adventures of Bubbles the Frog) (Volume 1)", "description": "Bubbles is causing a stink. And the other frogs are not happy. They tell him to stop bubbling the water or he'll have to leave Frog Pond. But he can't help it. He's been bubbling since he was a little tadpole. Will Bubbles have to leave Frog Pond? Where will he go? And what happens when danger comes? Find out in this fun picture book for all ages."}, {"id": "0439399300", "genre": "Children's Books", "title": "100 Words Kids Need To Read By 2nd Grade: Sight Word Practice to Build Strong Readers", "description": "Each workbook reinforces the100 words that children need to know – and it helps them master comprehension, spelling, writing, and usage of each word. Includes:• Fill-in-the-blank stories and sentences• Word riddles, games, and puzzles• Stories that present the words in context• \"Guess the Word\" activities• Word classifying and sorting activities• Practice using irregular verb forms• Proofreading practice For use with Grade 2."}, {"id": "0817250565", "genre": "Children's Books", "title": "The Aztecs (The Ancient World)", "description": "Recounts the story of the Aztecs' rise to power and describes various aspects of their civilization including religion, arts and crafts, daily life, and legacy."}, {"id": "B0109QO550", "genre": "Children's Books", "title": "The Lord Is My Shepherd", "description": "Rejoice in the Lord with this precious collection of Biblical rhymes! These captivating classics will help little ones to understand that it’s important to walk with the Lord because He is our Shepherd. They will also enjoy singing along to B-I-B-L-E, Isn’t He Wonderful, Jesus Loves the Little Children, I Love to Take a Walk, Climb Up Sunshine Mountain and God Made Me!"}, {"id": "1974193136", "genre": "Children's Books", "title": "Life Is Awesome! Trucks Just Makes It Awesomer!: Back To School Composition Notebook, 8.5 x 11 Large, 120 Pages College Ruled (Back To School Gifts)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}]