[{"id": "054521579X", "genre": "Children's Books", "title": "Clifford's Good Deeds (Clifford 8x8)", "description": "Read all about Clifford's BIG ideas! Classic Clifford reissued!It only takes a little to BE BIG!Clifford has a good heart, but whenever he tries to BE RESPONSIBLE and do good deeds for others, they always seem to backfire. In the end, he manages to save two children from a burning house, and then put out the fire. Finally, Clifford is a hero!The BE BIG campaign invites everyone, big and small, to take action and raise awareness for how CLIFFORD'S BIG IDEAS can make the world a better place."}, {"id": "0723241465", "genre": "Children's Books", "title": "The Peter Rabbit and Friends Cookbook", "description": "A cookery book for children containing 25 recipes suggested by Beatrix Potter's tales. Young readers can enjoy the fun of cooking with the help of Little Lucie, who introduces Peter Rabbit and his friends and the food they like to eat. This book is illustrated with pictures from the animated television series."}, {"id": "B003B652K8", "genre": "Children's Books", "title": "The Tallest Tree", "description": " Little Catfish knows that something is missing from his street. For one thing, there are hardly any stores—his grandma has to take two city buses to the market—and there is only one lonely tree left standing on the block. Even the Regal Theater is run-down. Little Catfish's friend Mr. Odell says that the biggest stars used to appear at the Regal, including the legendary Paul Robeson. Now it's only a shabby community center.   But what if Little Catfish can fix whatever's missing? What if he and Mr. Odell can find a hero to help, one who can do just about anything, like Paul Robeson? \"Yeah, right,\" say the older boys who claim the street as their own. Yeah, right.   But one early summer day, directly outside the Regal Theater, something new gets planted on Little Catfish's street. Something that has the power to grow and grow. As long as Little Catfish and Mr. Odell and the older boys and anyone else who comes to appreciate the majesty of its cool, dark shade tend to it. "}, {"id": "1426331401", "genre": "Children's Books", "title": "Absolute Expert: Dinosaurs", "description": "Tear through tons of facts, figures, timelines, and the most up-to-date intel straight from the field, with National Geographic explorer and paleontologist Steve Brusatte as your expert guide, in this cool book all about dinosaurs.Have you met Pinocchio rex? Meet this fascinating dino along with favorites, such as Tyrannosaurus, Stegosaurus, Triceratops, Velociraptor, Apatosaurus, Ankylosaurus, Giganotosaurus. Plus, check out some weird or newly discovered dinos you may not know about. See how fossils are formed. Learn about the epic, earth-shaking extinctions that paved the way for life today. Find out whether dinosaurs really had feathers, and so much more! All this, along with special features, awesome illustrations, sidebars, wacky trivia, and facts from experts in the field, make this the ultimate book to help YOU become an absolute expert on one of your favorite subjects."}, {"id": "1405246294", "genre": "Children's Books", "title": "Bristle and the Big Clean (Bob the Builder)", "description": "Bristle the street sweeper can't wait to make Bobland Bay spick and span. But is the new member of the team a little too keen to clean?"}]