[{"id": "B01MTCH0QD", "genre": "Children's Books", "title": "Sphero (21st Century Skills Innovation Library: Makers as Innovators)", "description": "Sphero is a robotic ball that can be controlled using a tablet or smartphone. With this book, students learn the art of innovation through detailed explanations and hands-on activities built to foster creativity and problem solving. Fun, engaging text introduces readers to new ideas and builds on maker-related concepts they may already know. Additional tools, including a glossary and an index, help students learn new vocabulary and locate information."}, {"id": "B00BAWE9J0", "genre": "Children's Books", "title": "Outfoxed", "description": "Quack, quack—woof? A quick-thinking duck keeps a fox on his toes in this witty romp from a New Yorker cartoonist.One dark night in the henhouse, a hungry fox in search of his dinner gets more than he bargains for. Instead of a chicken, Fox grabs a duck. A very smart duck. A duck so sly, he plans to convince Fox that he isn’t a duck but a—dog! Yes, a dog. This clever story and its accompanying visual narrative will delight readers young and old—because if it looks like a duck, and it quacks like a duck, it HAS to be a duck…right?"}, {"id": "0778741869", "genre": "Children's Books", "title": "Inventions and Inventors (Graphic America)", "description": "Edison, Marconi, and Bell. Inventors and Inventions brings these scientists and others to life. Young readers take a front row seat as Thomas Edison invents the light bulb. Theyll also listen in as Guglielmo Marconi tests his first wireless, and Alexan"}, {"id": "0764813366", "genre": "Children's Books", "title": "Every Day of Advent and Christmas, Year B: A Book of Activities for Children", "description": "Children in grades 1, 2, & 3 will love the games, puzzles, mazes, and activities designed to help them focus on the themes and traditions of the Advent season. Packed with colorful illustrations, Every Day of Advent and Christmas includes an Advent calendar to help children focus day by day on the meaning of Advent and Christmas in a way they are sure to enjoy and remember. 32-page booklet; 8-3/8 x 10-7/8"}, {"id": "1503946487", "genre": "Children's Books", "title": "The 2nd International Cookbook for Kids", "description": "This cookbook includes more than 60 recipes from India, Greece, Thailand, and Brazil that children and their families can make together as they follow easy step-by-step directions. Stunning full-color photographs accompany each recipe, and there are dishes for every time of day, from breakfast through dinner. Chef Matthew Locricchio emphasizes the use of fresh, organic vegetables and includes special sections on safety in the kitchen, cooking terms, and definitions. A great introduction to international cooking."}]