[{"id": "153949408X", "genre": "Children's Books", "title": "The Baby Biochemist: RNA (Volume 2)", "description": "The Baby Biochemist series explores basic concepts of biochemistry so that parents and children of all ages can discover this invaluable field. Also a great gift for expecting or parent biochemists, The Baby Biochemist series will give them a laugh while revisiting the foundations of their field with fun and adorable illustrations and descriptions, no matter how many times they are asked to read it. In this volume, the Baby Biochemist discovers the many roles of RNA in our cells. Learn what RNA is, what it does, and some of what we don't know! Inspire your older kids to dive into the unknown, or just enjoy the silly pictures with your baby. It is never too early to introduce concepts that will make our children better consumers of knowledge. Everyone should feel that science is in their grasp and we hope this series can help prepare kids (and adults!) for encountering these concepts in school and life."}, {"id": "1600141552", "genre": "Children's Books", "title": "Mini Bikes (Torque Books: Motorcycles)", "description": "Most kids dream of riding a full-sized motorcycle. Mini bikes make it possible for kids to enjoy a safe, motorized experience. Young learners will explore the different types of mini bikes and how they are raced in competitions."}, {"id": "157091348X", "genre": "Children's Books", "title": "Saint-Saëns's Danse Macabre", "description": "Camille Saint-Saëns was a brilliant French composer from the nineteenth century. In SAINT-SAËNS'S DANSE MACABRE, readers are transported to France in 1872 when Saint-Saëns visited the catacombs beneath the streets of Paris, known best as the final resting place of victims of the French Revolution. It was in this underground graveyard that Camille found the inspiration to compose Danse macabre, his spooky, mischievous masterpiece.Early performances of what would become Saint Saëns’s most well-known piece were met with brutal criticism. However, the composer paid the naysayers no mind—to him, the choice of instrumentation perfectly captured his vision of dancing skeletons, of Maestro Death coming to life. A true story of creativity and belief in one’s own ideas, SAINT-SAËNS'S DANSE MACABRE will inspire the innovative thinker in all of us.Back matter includes an author’s note with a brief summary of the historical events and figures mentioned in the text. A CD recording of Danse macabre is also included."}, {"id": "1783880171", "genre": "Children's Books", "title": "Sikhism in India (Families and their Faiths)", "description": "Follow Pulkit and her family in the Punjab. Join her as she makes flower garlands, celebrates Guru Nanak's birthday, and helps to make Langar, a feast at the Gurdwara."}, {"id": "1684150337", "genre": "Children's Books", "title": "Steven Universe: Warp Tour (Vol. 1)", "description": "Cartoon Network’s breakout hit begins all-new comic adventures here!In all new adventures in the world of Cartoon Network’s Steven Universe, Steven helps a baby songbird find its mother, takes part in a food truck competition, attends a Renaissance Faire, and visits possibly the scariest place of all--the Prom! Writer Melanie Gillman (As the Crow Flies) and artist Katy Farina (The Amazing World of Gumball) team up for the start of new adventures with Steven, the Crystal Gems, and all of Beach City."}]