[{"id": "B00M3DFD4U", "genre": "Children's Books", "title": "Magicians of the Deep (The Gates of Atlantis Book 4)", "description": "Thirteen-year-old Colin knew nothing of the magic world until he is bitten by a mischievous pixie. He meets thirteen-year-old Alleya on a secret website devoted to magical creatures. Before he knows it, Colin finds himself thrust into a whole new world.Alleya has been hidden away from the rest of Atlantis because she's half-mermaid, half-Atlantian. Her father tries to ease her boredom by getting her a computer and finally allowing her to go to school. She accidentally lets slip a dark secret—the gates to Atlantis are being shut and it's destroying magic. Alleya is exiled to Indiatlantis.There, she learns mermaids are getting sick because of the lack of magic, and the tunnels are beginning to collapse. Together, Colin and Alleya must find a way to bring back the old magic and fight to save Atlantis."}, {"id": "0865930074", "genre": "Children's Books", "title": "Dancing Drum: A Cherokee Legend (Native Americn Legends)", "description": "Retells the Cherokee legend in which Dancing Drum tries to make Grandmother Sun smile on the People again. Also describes the history, culture, and fate of the Cherokee Indians."}, {"id": "0061170712", "genre": "Children's Books", "title": "Hurricanes", "description": "Takes young readers on an in-depth exploration of one of the most awe-inspiring and devastating events in nature: hurricanesThis dramatic nonfiction picture book is intensified through arresting full-color photographs and satellite images. Award-winning science writer Seymour Simon explains what hurricanes are and how they develop; what storm surges are; and the basics of forecasting and precautions that families should take.Booklist commented: \"This is unsurpassed for kindling interest in a scientific subject and communicating an understanding of its scope and significance.\" "}, {"id": "1974294722", "genre": "Children's Books", "title": "6th Grade Teachers Are Fantastical & Magical Like A Unicorn Only Better: Thank You Gift For Teacher (Teacher Appreciation Gift Notebook)(8.5 x 11 Composition Notebook)", "description": "Do you need unique teacher gifts under $10?This awesome teacher appreciation gift is a simple 8.5” x 11”, 120 page lined journal notebook that beats a teacher thank you card any day. Let the teacher know how grateful you are and that their hard work is appreciated.These are also great teacher gifts to start the school year off with. You know as a pre-apology for your kids future behaviors. Always good to be prepared when going back to school.These composition notebooks make the perfect:End Of The Year Teacher BooksTeacher Appreciation GiftsTeacher Thank You GiftsFirst Day Of School Teacher GiftComposition Notebook For TeachersBack To School NotebookTeacher’s Planner & JournalScroll up today and give your teacher a gift they will actually use."}, {"id": "1508194599", "genre": "Children's Books", "title": "Princess Nika's Dog (Little Princesses)", "description": "Dogs can be great pets, but taking care of them is a lot of work. The young princess in this book gets a dog before learning all the work that being a pet owner requires. Readers follow the princess on her journey with the dog. Charming illustrations and accessible text will engage readers and animal lovers of many ages. This lovely story touches on important topics in pet care and responsibility. This colorful tale is sure to be a hit with animal lovers and young readers alike."}]