[{"id": "B007O0MR8M", "genre": "Children's Books", "title": "Freight Train", "description": "Red caboose at the back, orange tank car, green cattle car, purple box car, black tender and a black steam engine . . . freight train.In simple, powerful words and vibrant illustrations, Donald Crews evokes the rolling wheels of that childhood favorite: a train.This Calecott Honor Book features bright colors and bold shapes. Even a child not lucky enough to have counted freight cars will feel he or she has watched a freight train passing after reading Freight Train.Donald Crews used childhood memories of trains seen during his travels to his grandparents' farm in the American South as the inspiration for this timeless favorite."}, {"id": "B011WDS0DM", "genre": "Children's Books", "title": "Herobrine Comics Herobrine:Curse Of Wolfwater", "description": "Kindle Unlimited Readers Can Read This Herobrine Comic Issue 1 For FREE.Asked to retrieve a secret potion from Wolfwater, Herobrine sends Emman instead. Little does he know that this simple task is about to bring him into contact with a plague, that's about to hit their world. Called the \"Curse Of Wolfwater\" it turns players insane. Could this be too big a task for even him to take care of? Find out now in \"Herobrine Curse Of Wolfwater\" the latest series from Barry J McDonald. Scroll up and click the buy button now for your copy."}, {"id": "150301956X", "genre": "Children's Books", "title": "Aunt Susanna's Thanksgiving Dinner", "description": "A heartwarming holiday tale from the author of Anne of Green Gables.  Lucy Maud Montgomery was born at Clifton (now New London), Canada, on November 30, 1874. Before she grew up to be a best-selling author, young Lucy Maud Montgomery was raised by her grandparents on Prince Edward Island. Imaginative and tenacious, she loved to write. When Maud was sixteen, she published her first poem, but it took years of hard work and perseverance before she published her masterpiece, Anne of Green Gables, and its sequels. She was also a prolific writer of short stories and poetry. She published some 500 short stories and poems and twenty novels before her death in 1942. "}, {"id": "0764119125", "genre": "Children's Books", "title": "Zap! Blink! Taste! Think!: Exciting Life Science for Curious Minds", "description": "Here are great ideas for learning life science fundamentals at home or in the classroom! More than two dozen fun-to-do experiments both test and introduce kids to the five senses, as well as to botany, food chemistry, crime science, natural cycles, and human psychology. Young people learn to test their sense of depth perception, cultivate herbs, record and analyze fingerprints, assemble a home-made but accurate scale to balance weights, make a mini compost bin, prepare pickles and yogurt, and conduct many other science-based activities. The author presents ideas and instructions for science fair projects, including original experiments on enzyme action, decomposition, memory, and more. Attractive, easy-to-follow diagrams illustrate each step. Younger children will need adult supervision when carrying out many of these experiments. (Ages 11-15)"}, {"id": "1604131977", "genre": "Children's Books", "title": "Exploring the Pacific (Discovery & Exploration)", "description": "Each ship that ventured into the Pacific around the Cape of Good Hope, through the Strait of Magellan, or around Cape Horn carried the hope and ambitions of its sponsoring nation. The Pacific, perhaps even more so than the Americas or Africa, became the playing board for the global game of imperial chess. By the 20th century, only the most remote and inhospitable islands were free from American, European, or South American colonial administration. Exploring the Pacific, Revised Edition explains how explorers of the Pacific region expanded geographical knowledge and contributed to human understanding by generating maps, charts, paintings, and reports. The book covers such explorers as Bartolomeu Dias, Vasco Núñez de Balboa, Ferdinand Magellan, Álvaro de Mendaña, and James Cook.Coverage includes:Early Pacific navigationArt of the Pacific peoplesThe struggle between the Spanish and Portuguese to gain control of the spice tradeThe South Seas BubbleCaptain James Cook's three voyages in the PacificThe real Robinson Crusoe."}]