[{"id": "0794401112", "genre": "Children's Books", "title": "Space (Reader's Digest Pathfinders)", "description": "With a real hands-on approach to learning, a kid-friendly guide to outerspace includes superb illustrations, spectacular photography, stimulating text, and interactive features. Original."}, {"id": "0736427937", "genre": "Children's Books", "title": "VERY MATER CHRISTMAS", "description": "A Christmas-themed board book featuring Mater, Lghtning McQueen and friends from Disney/Pixar Cars! Lightning McQueen and Mater enjoy the holidays in Radiator Springs! Children ages 0-5 will love this board book which features sparkling glitter on the cover and on every page!"}, {"id": "0979767423", "genre": "Children's Books", "title": "Wacky Farm Wednesday", "description": "Wacky Farm Wednesday is the story of a mother, her triplets and a visit to the farm. There's only one reason to go to the farm and that is to hear the animals speak in their native tongue. Imagine then the triplet's disappointment when they arrive to see the farm critters asleep. That can be easily fixed by talking the animals awake but in doing so the triplets learn it is rude and messy to wake sleeping animals."}, {"id": "4805309962", "genre": "Children's Books", "title": "Peach Boy And Other Japanese Children's Favorite Stories", "description": "This colorfully illustrated multicultural children's book presents several Japanese fairy tales and other folk stories—providing insight into a rich oral culture.Welcome to a fantastic world populated by magical teakettles, long-nosed goblins, brave warriors, and a host of other beloved characters who have lived on for centuries in the traditional tales of Japan. Drawn from Japanese folklore that has been passed down from generation to generation, the nine enchanting stories collected in this volume have been lovingly retold just for today's readers. They make perfect new additions for story time or bedtime reading. Vibrantly illustrated and full of thrilling adventures, funny discoveries and important lessons, they're sure to become story time favorites. Included are some of Japan's best-loving children stories: Peach Boy The Magic Teakettle Monkey-Dance and Sparrow-Dance The Long-Nosed Goblins The Rabbit in the Moon The Rabbit in the Moon The Tongue-Cut Sparrow Sill Saburo The Toothpick Warriors The Sticky-Sticky Pine"}, {"id": "B06XCNC1KD", "genre": "Children's Books", "title": "Baby's First Book of Animals", "description": "Help stimulate your baby's brain development with high contrast black and white images of common animals and insects you will want them to be familiar with.Studies have shown young babies are drawn to black and white images, and prefer them over color images. Babies will spend more time looking at a black and white image than a color one.This book contains 100 unique animals!Key Benefits:Stimulates baby’s brain developmentSupports bonding with baby"}]