[{"id": "1846310024", "genre": "Science Fiction & Fantasy", "title": "3: Gateways to Forever: The Story of the Science-Fiction Magazines from 1970 to 1980 (Liverpool University Press - Liverpool Science Fiction Texts & Studies)", "description": "This third volume in Mike Ashley's four-volume study of the science-fiction magazines focuses on the turbulent years of the 1970s, when the United States emerged from the Vietnam War into an economic crisis. It saw the end of the Apollo moon programme and the start of the ecology movement. This proved to be one of the most complicated periods for the science-fiction magazines. Not only were they struggling to survive within the economic climate, they also had to cope with the death of the father of modern science fiction, John W. Campbell, Jr., while facing new and potentially threatening opposition. The market for science fiction diversified as never before, with the growth in new anthologies, the emergence of semi-professional magazines, the explosion of science fiction in college, the start of role-playing gaming magazines, underground and adult comics and, with the success of Star Wars, media magazines. This volume explores how the traditional science-fiction magazines coped with this, from the"}, {"id": "0991478878", "genre": "Science Fiction & Fantasy", "title": "Dungeon Chronicle - 100 Pages", "description": "Now Updated! Every RPG adventure deserves to be chronicled, and every chronicler needs a journal like this one designed specifically for role-playing games like Dungeons and Dragons or Pathfinder. Add the name of your adventure to the cover and spine. Log your heroic feats and devastating defeats as they happen. The fifty journal pages include windows for notes or sketches. Also keep track of: • GM, players, and characters. • Character details for up to 12 characters. • 2 pages for World History. • 2 pages for Notable People. • 2 pages for Worthy Adversaries. • 2 pages for Important Places. • 2 pages for Group items and equipment. • 3 pages for Group Treasure. • Space for 10 Group Magic Items. • A full page for each of up to 12 NPCs. • 8 grids for maps. • Player contact info. Keep your adventures as fresh as the day they occurred. Also available in a 300 page version for those epic adventures."}, {"id": "B002FL5J58", "genre": "Science Fiction & Fantasy", "title": "Hitchhiker's Guide to the Galaxy: Quintessential Phase (dramatization)", "description": "Panic! It's the last installment of The Hitchhiker's Guide to the Galaxy, with a brand new full-cast dramatization of Mostly Harmless, the final book in Douglas Adams' famous \"trilogy in five parts.\" While frequent flyer Arthur Dent searches the universe for his lost love, Ford Prefect discovers a disturbing blast from the past at The Hitchhiker's Guide HQ. Meanwhile, on one of many versions of Earth, a blonder, more American Trillian gets tangled up with a party of lost aliens having an identity crisis.A stolen ship, a dramatic stampede, and a new and sinister Guide lead to a race to save the earth...again. Presented dramatized on 2 CDs."}, {"id": "B019UKNB24", "genre": "Science Fiction & Fantasy", "title": "Athenian Steel: Roman Annihilation", "description": "A Greek alliance invades Republican Rome in a history-smashing assault up the Tiber.Alone and consigned to slavery in barbarian Italy in 423 BCE, the Athenian general Demosthenes lays eyes on the city destined to subjugate the known world. Once free, he leads a Greek army up the Tiber in a brutal assault on the young Republic. His star-born ally Thalassia, meanwhile, infiltrates the heart and household of a noble Roman Senator, her motives, as ever, her own.The ROMAN ANNIHILATION novella is an 'alternate vision' of what might have been had later drafts of Athenian Steel not taken a different path. It is thus recommended that you read the main novel, Book 1 of the Hellennium, first.The Hellennium, takes place in an ancient world depicted with brutal realism, weaving threads of cosmic SF into bloody and graphic historical fiction.  At the heart of the series is the ever-evolving, dysfunctional relationship between Demosthenes and Thalassia, whose 'anti-romance' will leave a trail of slaughter and ruin down the centuries.If you're a fan of David Drake's Northworld series, or Gene Wolfe's Soldier series, you'll want to join Demosthenes and Thalassia as they cut a bloody path of destruction through the ancient world. Frequent readers of David Weber, David Gemmell, Michael Moorcock, and even Bernard Cornwell have also found much to love."}, {"id": "0819563986", "genre": "Science Fiction & Fantasy", "title": "Critical Theory and Science Fiction", "description": "Carl Freedman traces the fundamental and mostly unexamined relationships between the discourses of science fiction and critical theory, arguing that science fiction is (or ought to be) a privileged genre for critical theory. He asserts that it is no accident that the upsurge of academic interest in science fiction coincides with the heyday of literary theory, and that likewise science fiction is one of the most theoretically informed areas of the literary profession. His readings of novels by five important modern science fiction authors (Stanislaw Lem, Ursula LeGuin, Joanna Russ, Samuel Delany, and Philip K. Dick) illustrate the affinity between science fiction and critical theory, in each case concentrating on a novel that resonates with critical theory concerns."}]