[{"id": "B00EJVIZ76", "genre": "Science Fiction & Fantasy", "title": "Lost Arcana: Threads of Heroes (Legends of Lost Arcana Book 2)", "description": "Lost Arcana: Threads of Heroes is a short collection of magic item descriptions for use in fantasy role-playing games, or as inspiration for other fantasy writing.  This is not a story book, but there are fragments and the beginnings of legends contained within.  The collection is quite short, currently only eight items, but the price is set at the minimum to cover the cost of production.  The intention is just to try out publishing a few items, and if it goes well there may be more added in the future."}, {"id": "1626491771", "genre": "Science Fiction & Fantasy", "title": "Prosperity", "description": "A breathtaking tale of passion and adventure in the untamed skies!  Prosperity, 1863: a lawless skytown where varlets, chancers, and ne’er-do-wells risk everything to chase a fortune in the clouds, and where a Gaslight guttersnipe named Piccadilly is about to cheat the wrong man. This mistake will endanger his life . . . and his heart.  Thrill! As our hero battles dreadful kraken above Prosperity. Gasp! As the miracles of clockwork engineering allow a dead man to wreak his vengeance upon the living. Marvel! At the aerial escapades of the aethership, Shadowless.  Beware! The licentious and unchristian example set by the opium-addled navigatress, Miss Grey. Disapprove Strongly! Of the utter moral iniquity of the dastardly crime prince, Milord. Swoon! At the dashing skycaptain, Byron Kae. Swoon Again! At the tormented clergyman, Ruben Crowe.  This volume (available in print, and for the first time on mechanical book-reading devices) contains the complete original text of Piccadilly’s memoirs as first serialised in All the Year Round. Some passages may prove unsettling to unmarried gentlemen of a sensitive disposition."}, {"id": "1494304031", "genre": "Science Fiction & Fantasy", "title": "The Plight of the Eli'ahtna (War of the Second Iteration) (Volume 3)", "description": "On a mission to bring aid to a beleaguered star system, John Knowles and Eb'shra Wirolen have been hurled by a freak accident across countless light years. They are marooned in uncharted space. As they work to repair their damaged ship, the Eli'ahtna, and the friends they've left behind launch a desperate rescue mission to bring them home, the castaways discover that although they are truly lost, they are not alone. In this third installment of the War of the Second Iteration, chance or fate lead to discoveries that promise to change everything Robert MacGregor and his friends think they understand. For the universe is about to reveal itself as more complicated, and dangerous, than they imagined."}, {"id": "1556342063", "genre": "Science Fiction & Fantasy", "title": "GURPS IOU (GURPS: Generic Universal Role Playing System)", "description": "Admit it. College would have been more fun if you were allowed to blow up the instructors. And you really would have liked to major in Military Biology, Anti-Social Sciences, Double-Entendre Bookkeeping, or Computer Wizardry. Too bad you didn't know about IOU.  Illuminati University is THE best place to learn Things Man Was Not Meant To Know. With departments like Weird and Unusual Science and Engineering, Inapplicable Mathematics, Misanthropology, and Zen Surrealism . . . not to mention extracurricular activities like Democrats for Cthulhu, Moopsball, and food fights that set off nuclear alerts . . . this is college as it should have been. And gadgets? Everything from the Crockpot of the Gods to the Enigmatic Alien Device Button-Pushing Table.  Illustrated by the one and only (two and only?) Phil and Kaja Foglio, this book supports three different campaign styles . . . Silly, Weird, and Darkly Illuminated. GURPS IOU takes you from creating a character to enrolling in classes, to study, finals, and the occasional academic blood feud, all the way to graduation.  If you survive."}, {"id": "1589946952", "genre": "Science Fiction & Fantasy", "title": "The Adventurer's Toolkit", "description": "As threats to the Empire's stability loom, some brave individuals step forward to lend their aid to the cause, while others are caught up in fate's plans to find themselves facing perilous adventures. The Adventurer's Toolkit lets players easily add more excitement and options to their Warhammer Fantasy Roleplay game. The Adventurer's Toolkit is also perfect for new players in your campaign. Inside you will find more that 50 action cards, 30 talent cards, 10 new careers, 4 new party sheets, a pad of character sheets, new character standups, extra tokens to help manage your heroes, and much more! With the The Adventurer's Toolkit, you can now play as a sturdy Dwarf Ironbreaker, a formidable High Elf Sword Master, a nimble Wood Elf Wardancer , or as a downtrodden Ratcatcher with a small but vicious dog - or as one of the other new careers introduced. The Adventurer's Toolkit let's you face your grim and perilous adventures with more options than ever before!"}]