[{"id": "B00JDSY9UM", "genre": "Science Fiction & Fantasy", "title": "Darkangel (The Witches of Cleopatra Hill Book 1)", "description": "Finding the man of your dreams can be a real nightmare….As the future prima, or head witch of her clan, Angela McAllister is expected to bond with her consort during her twenty-first year, thus ensuring that she will come into her full powers at the appointed time. The clock is ticking down, and her consort has yet to make an appearance. Instead, her dreams are haunted by a man she’s never seen, the one she believes must be her intended match.But with time running out, and dark forces attempting to seize her powers for their own, Angela is faced with a terrible choice: give up her dreams of the man she may never meet and take the safer path, or risk leaving her clan and everyone in it at the mercy of those who seek their ruin.Darkangel is the first book in the Witches of Cleopatra Hill, a paranormal romance series set in the haunted town of Jerome, Arizona."}, {"id": "1490553169", "genre": "Science Fiction & Fantasy", "title": "Conquered Armies: Rules for a Pathfinder Science Fiction Campaign (Conquered Armies Campaign)", "description": "Conquered Armies, Rules for a Pathfinder Science Fiction Campaign is the first of two books for role playing in the Conquered Armies Universe. This book sets out the modifications to the Pathfinder rules for creating characters and running adventures in the Conquered Armies Universe. New rules include conducting combat between spaceships, Alien technologies and their uses, new character classes such as Bounty Hunters and Science Techs, Technical skills and how to gain ranks in them and a straightforward means of giving characters background experience as part of the character creation process. Book two in this series will provide maps and details on alien empires, their ships, allies and systems and scenarios designed to introduce the players to the new rules as they start the campaign."}, {"id": "0316407267", "genre": "Science Fiction & Fantasy", "title": "Wrath of Empire (Gods of Blood and Powder)", "description": "The country is in turmoil. With the capital city occupied, half a million refugees are on the march, looking for safety on the frontier, accompanied by Lady Flint's soldiers. But escaping war is never easy, and soon the battle may find them, whether they are prepared or not. Back in the capital, Michel Bravis smuggles even more refugees out of the city. But internal forces are working against him. With enemies on all sides, Michel may be forced to find help with the very occupiers he's trying to undermine. Meanwhile, Ben Styke is building his own army. He and his mad lancers are gathering every able body they can find and searching for an ancient artifact that may have the power to turn the tides of war in their favor. But what they find may not be what they're looking for.Continue the pistol-packing fantasy series by the author whose debut novel Brandon Sanderson called \"just plain awesome!\"Gods of Blood and PowderSins of EmpireWrath of EmpireFor more from Brian McClellan, check out:Powder MagePromise of BloodThe Crimson CampaignThe Autumn Republic"}, {"id": "B007Z3QWN4", "genre": "Science Fiction & Fantasy", "title": "Tyrant Trouble (Mudflat Magic Book 1)", "description": "\"...Mudflat series is a supernatural comic romp full of non-stop action, fantastic characters and a hero you’ll love...\" 4.5 rating, RT Book ReviewsAt the corner of Seattle and Otherworld, magic meets mayhem.When a conman wants you as the patsy for a crime, you run, right? That’s what Claire decides. She makes it out of Seattle and into the arms of an Otherworld barbarian. Not much improvement there. One aims a gun, the other swings a broadsword. The barbarian’s world is filled with so much terror, it makes the conman and his threats look easy. This first novel of the Mudflat Magic series won the Eppie for Best Fantasy of the Year."}, {"id": "B0738KC9NW", "genre": "Science Fiction & Fantasy", "title": "A Veil of Spears (Song of Shattered Sands)", "description": "The third book in The Song of Shattered Sands series--an epic fantasy with a desert setting, filled with rich worldbuilding and pulse-pounding action.Since the Night of Endless Swords, a bloody battle the Kings of Sharakhai narrowly won, the kings have been hounding the rebels known as the Moonless Host. Many have been forced to flee the city, including Çeda, who discovers that the King of Sloth is raising his army to challenge the other kings' rule.When Çeda finds the remaining members of the Moonless Host, now known as the thirteenth tribe, she sees a tenuous existence. Çeda hatches a plan to return to Sharakhai and free the asirim, the kings' powerful, immortal slaves. The kings, however, have sent their greatest tactician, the King of Swords, to bring Çeda to justice for her crimes.But the once-unified front of the kings is crumbling. The surviving kings vie quietly against one another, maneuvering for control over Sharakhai. Çeda hopes to use that to her advantage, but whom to trust? Any of them might betray her.As Çeda works to lift the shackles from the asirim and save the thirteenth tribe, the kings of Sharakhai, the scheming queen of Qaimir, the ruthless blood mage, Hamzakiir, and King of Swords all prepare for a grand clash that may decide the fate of all."}]