[{"id": "1435897420", "genre": "Children's Books", "title": "Wind Energy: Blown Away! (Powering Our World)", "description": "Explains how wind energy is generated and used, discusses wind farms and turbines, and considers its use as a renewable resource."}, {"id": "B00I4EKH4S", "genre": "Children's Books", "title": "Mega-Awesome Adventures: 6 Tales of Mind-Bending, Heart-Pounding Action!", "description": "Mega-Awesome Adventures features thrilling excerpts from six fantastic novels, including a sneak peek at a complete story from Rick Riordan’s Percy Jackson’s Greek Gods! Explore this exciting sampler, which includes selections from internationally best-selling authors such as Eoin Colfer, author of the acclaimed Artemis Fowl series; Ridley Pearson, author of the Kingdom Keepers series; and Jonathan Stroud, author of the Bartimaeus series."}, {"id": "1494730162", "genre": "Children's Books", "title": "Andy Smithson: Venom of the Serpent's Cunning, Book 2", "description": "Ancient Secrets. The Alchemist's Creed. What Fate is Andy Mixed Up In?Resurrection stone? Almost. The Stone of Athanasia has kept the king and his wizard alive for over five-hundred-years, but a villain has stolen it, driving the pair to the brink of death. Andy must hunt down the Stone along with the next ingredient in the curse-breaking potion. But as Andy and his friend, Alden, scour the land, things get unbelievably weird when they visit Oomaldee's ancient library and find a portrait that looks exactly like Andy. Andy holds the fate of the monarchy in his hands. But what fate do the library's secrets hold for Andy? Venom of the Serpent's Cunning is the second novel in a coming-of-age, epic fantasy adventure featuring page-turning action, terrifying villains, and witty banter, mixed with tender exchanges that will grab your heart and make you beg for more. Author L. R. W. Lee's Andy Smithson series continues to grow in scope and excitement in this second installment. Buy Venom of the Serpent's Cunning to continue the thrilling adventure today!"}, {"id": "1911509209", "genre": "Children's Books", "title": "Physics Activity Book (STEM STARTERS FOR KIDS)", "description": "Little physicists will love the mix of information and activities in this educational science book full of zappy ideas. Fun games and puzzles teach boys and girls about sound waves, electricity and the different forces that we interact with every day. Start a lifelong passion for STEM subjects."}, {"id": "B077CM5JQJ", "genre": "Children's Books", "title": "The Three Little Superpigs", "description": "After defeating the Big Bad Wolf, the Three Little Superpigs spend their days fighting crime and enjoying their newfound fame. But one day, the Big Bad Wolf escapes from prison and plunges Fairyland into fear. Our curly-tailed friends soon discover that bricks are missing all over town. The Superpigs return to their homes to solve the mystery when they realize it has all been a trap!Join our new superheroes as they escape from the evil clutches of the Big Bad Wolf and save Fairyland in this first Superpigs adventure. Readers will huff and puff and laugh and laugh."}]