[{"id": "0996886206", "genre": "Science Fiction & Fantasy", "title": "Runtime Zero: Streaming The New Infinity (Dark Math Chronicles)", "description": "Runtime Zero, the opening salvo in Mick Brady's Dark Math series, traces the journey of a gifted young artist named Will Powers from his drug-fueled downfall in the streets of Manhattan to a future rebirth in a virtual paradise called SubVersa—a world where everything is possible and nothing is forbidden; where Chrome, his digital surrogate, finally lives out his maker's dream of becoming a master artist and in the process becomes a master programmer—a Code Warrior. But all is not well on planet Earth. A powerful virus called Dark Math has been embedded in the chain of human DNA by a band of biohackers, threatening to snuff out human consciousness itself. A cosmic rescue mission gets underway as Chrome, his beautiful muse Juliette, and their fellow Code Warriors begin travelling back in time to guide their makers on a harrowing journey to SubVersa, where they will finally be reunited with the dual aspects of their higher selves and begin streaming the new infinity. Unfortunately, the price of admission will be almost more than any human can endure."}, {"id": "1945863307", "genre": "Science Fiction & Fantasy", "title": "Tomorrow Factory: Collected Fiction", "description": "Twenty-three stories from one of science fiction’s up-and-coming stars, Pushcart and Journey Prize-nominated author Rich Larson. Welcome to the Tomorrow Factory.  On your left, post-human hedonists on a distant space station bring diseases back in fashion, two scavengers find a super-powered parasite under the waves of Sunk Seattle, and a terminally-ill chemist orchestrates an asteroid prison break.  On your right, an alien optometrist spins illusions for irradiated survivors of the apocalypse, a high-tech grifter meets his match in near-future Thailand, and two teens use a blackmarket personality mod to get into the year’s wickedest, wildest party.  This collection of published and original fiction by award-winning writer Rich Larson will bring you from a Bujumbura cyberpunk junkyard to the icy depths of Europa, from the slick streets of future-noir Chicago to a tropical island of sapient robots. You'll explore a mysterious ghost ship in deep space, meet an android learning to dream, and fend off predatory alien fungi on a combat mission gone wrong.  Twenty-three futures, ranging from grimy cyberpunk to far-flung space opera, are waiting to blow you away.  So step inside the Tomorrow Factory, and mind your head."}, {"id": "1548403806", "genre": "Science Fiction & Fantasy", "title": "The Harry Potter - Narnia Connection: Christian Virtues in Common", "description": "The Harry Potter - Narnia Connection: Christian Virtues in Common suggests a correlation between the spiritual values found in each of these much-loved book series. The author believes that a subsequent reading of these books can take on new and inspirational meanings when the seven traditional Christian Virtues (Faith, Hope, Charity, Fortitude, Justice, Temperance and Prudence) are looked for in the stories. Each of the seven books in each series can be imagined as promoting one of the virtues as a primary theme of that book. The virtues (and their opposing vices) are seen to affect the actions of the characters, and their consequences in the stories. In the case of Harry, he can be seen as learning and absorbing one of the virtues in each story starting with Charity in the first book and ending with Prudence in the seventh book. His personal development over the seven years of his struggle against evil earns him the wisdom and skills to defeat Lord Voldemort."}, {"id": "1500828971", "genre": "Science Fiction & Fantasy", "title": "1: Every One Fight (Threads of Canor) (Volume 1)", "description": "What becomes of a tough talkin' All Star Runner when she loses all pride and her beloved father? School is a passable distraction, but even her backup plan can't overcome her stubborn anger. Entrapped by an illegal street fight and forced to turn pro, Masurani is pitted against a tank wrestling cyborg for the secret to her father's death."}, {"id": "0765337568", "genre": "Science Fiction & Fantasy", "title": "Empire Games: A Tale of the Merchant Princes Universe", "description": "Charles Stross builds a new series with Empire Games, expanding on the world he created in the Family Trade series, a new generation of paratime travellers walk between parallel universes. The year is 2020. It's seventeen years since the Revolution overthrew the last king of the New British Empire, and the newly-reconstituted North American Commonwealth is developing rapidly, on course to defeat the French and bring democracy to a troubled world. But Miriam Burgeson, commissioner in charge of the shadowy Ministry of Intertemporal Research and Intelligence―the paratime espionage agency tasked with catalyzing the Commonwealth's great leap forward―has a problem. For years, she's warned everyone: \"The Americans are coming.\" Now their drones arrive in the middle of a succession crisis.In another timeline, the U.S. has recruited Miriam's own estranged daughter to spy across timelines in order to bring down any remaining world-walkers who might threaten national security.Two nuclear superpowers are set on a collision course. Two increasingly desperate paratime espionage agencies try to find a solution to the first contact problem that doesn't result in a nuclear holocaust. And two women―a mother and her long-lost daughter―are about to find themselves on opposite sides of the confrontation."}]