[{"id": "0812467299", "genre": "Children's Books", "title": "Visions: Nineteen Short Stories by Outstanding Writers for Young Adults", "description": "Imagine...Nineteen superb stories by today's best-known authors of young adult novels, coming together to create a window of the mind, a vision illuminating the joys and sorrows of young people.These nineteen splendid stories range from tales of tender romance and the delights of mystery and fantasy to the struggles of death, divorce, and growing up. Here are recollections from the past, stories of today, and visions of the future."}, {"id": "1477686185", "genre": "Children's Books", "title": "Bilal's Bakery (Mini Mu'min Du'a Series)", "description": "Mini Mu'min Du'a Series #4 (Supplications and manners related to eating)  Looking for something good to eat? Well, then let's take a trip to Bilal's very special bakery! Bilal has all kinds of delicious Halal treats, but Bilal also likes to remind us of how a Muslim eats. Come along for a visit and learn the manners and adi'yaa related to eating. Series Overview: The Mini Mu'min Du'a Series is a collection of 17 colorful storybooks that help your child learn over 40 essential Islamic supplications and how they fit into their everyday lives. Using easy to understand language and charming rhymes, this series is perfect for read aloud story time! Series Supplement: Don't forget to take a look at our Mini Mu'min Du'a Series: Coloring Workbook (260+ pages), available here on Amazon, to help your child review and reinforce information learned in the storybooks- plus hours of coloring fun!"}, {"id": "B00CBDC8RM", "genre": "Children's Books", "title": "Clara Dillingham Pierson's Complete Among the People Series", "description": "Collected here in one omnibus edition are all five of Clara Dillingham Pierson's Among the People series. Included are Among the Night People, Among the Meadow People, Among the Farmyard People, Among the Pond People, and Among the Forest People. These charming stories will delight your children while delivering a positive moral message to them."}, {"id": "1496557638", "genre": "Children's Books", "title": "DC Super Heroes Monster Jokes (DC Super Heroes Joke Books)", "description": "What hand should Superman use to pet Titano the Super-Ape? Someone else's! This official DC Comics joke book features 75+ laugh-out-loud jokes about MONSTERS, told by Superman, Batman, Wonder Woman, and other DC Super Heroes. With full-color art and enhanced back matter, fanboys and fangirls alike will be scared silly!"}, {"id": "0874419220", "genre": "Children's Books", "title": "This is the Challah", "description": "Bubbe is preparing for Shabbat and her granddaughter gets to help with a very important part: baking the challah. They work together with enthusiasm, even as the sugar spills, the baby cries, and eggs crack on the floor! Bubbe lovingly holds it all together as the chaos builds and then dissipates into a warm, loving family dinner. Told in a cumulative rhyme, This is the Challah makes a perfect read-aloud for bedtime or anytime!SPECIAL FEATURESBubbe s challah recipe make your own!Beautiful full-color illustrations bursting with energy and humor"}]