[{"id": "1627792996", "genre": "Children's Books", "title": "Who Says Women Can't Be Computer Programmers?: The Story of Ada Lovelace", "description": "A picture book biography of Ada Lovelace, the woman recognized today as history’s first computer programmer―she imagined them 100 years before they existed!In the early nineteenth century lived Ada Byron: a young girl with a wild and wonderful imagination. The daughter of internationally acclaimed poet Lord Byron, Ada was tutored in science and mathematics from a very early age. But Ada’s imagination was never meant to be tamed and, armed with the fundamentals of math and engineering, she came into her own as a woman of ideas―equal parts mathematician and philosopher.  From her whimsical beginnings as a gifted child to her most sophisticated notes on Charles Babbage’s Analytical Engine, this book celebrates the woman recognized today as the first computer programmer.  A Christy Ottaviano Book"}, {"id": "B075KJNR7T", "genre": "Children's Books", "title": "Google Adword Fundamentals Exam Prep Guide for Adwords Certification 2017", "description": "CONTENTSModule 1 Understanding the value of online advertising• Benefits of online advertising and AdWords• Google's advertising networks• Where your ads can appear• The quality of your ads• What you payModule 2 Setting up an AdWords campaign• Choosing a campaign type• Structuring your campaign• Targeting your audience• Setting bids and budgets• Creating ad groups• Tools to plan a campaignModule 3 Measuring and optimizing performance• Measure your results• Tools to measure your performance• Evaluate metrics relevant to your goals• Optimize your campaign"}, {"id": "140536257X", "genre": "Children's Books", "title": "Tractor", "description": "Take your baby on a touch and feel adventure on a Tractor.Stroke, tickle and touch the textures together with your baby and help them discover all about tractors. Let their little hands roam and feel the scratchy hay bales and journey through the tufty grass on the massive chunky tractor. They'll learn as you play.Twinkly, bumpy, scaly, silky, sandy, sticky and shiny textures in a chunky package: perfect for encouraging tiny fingers to explore and tiny minds to develop."}, {"id": "1467990531", "genre": "Children's Books", "title": "The Meaning of the Holy Qur'an for School Children", "description": "The Meaning of the Holy Qur'an for School Children is a graphic-intensive translation of the Qur'an tailored to the needs and interests of young readers."}, {"id": "1429646187", "genre": "Children's Books", "title": "Investigating UFOs & Aliens (Extreme Adventures!)", "description": "Investigate weird and wonderful ‘visitors’ from outer space. Find out if spacecraft really exist, what an alien body might look like, and how you can tell what’s fake and what’s not."}]