[{"id": "1785654748", "genre": "Science Fiction & Fantasy", "title": "War for the Planet of the Apes: Official Movie Novelization", "description": "Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet."}, {"id": "1941582869", "genre": "Science Fiction & Fantasy", "title": "Shadowrun Run Faster *OP", "description": "Every step, every advantage, every millisecond counts. The streets of the Sixth World are mean, and if runners want to stay alive, they need every advantage they can get to gain a step on the opposition. Fortunately, Run Faster is full of them. With it, players can learn about more metatypes for characters, acquire new qualities, and dabble with the dangerous and deadly Infected. Run Faster also has advice on fleshing out characters of different metatypes, expanded contact and lifestyle rules, and alternate character creation methods to help ensure that players can build exactly the character they want."}, {"id": "B004X6UMCS", "genre": "Science Fiction & Fantasy", "title": "The Adventures of HAL: The Second Hilarious Glothic Tale (The Glothic Tales Book 2)", "description": "Meanwhile, on Gloth…\"This hilarious sequel to \"February the Fifth\" shows Derek Haines at his absolute best.\"\"It's a mad world on Gloth as experienced through the eyes of Halbert Hoop, Hal to the reader.\"Millions of years before February The Fifth, Gloth was making a nice little profit from the planet Erde, with the help of some cunning Popes and the very, very secret Camera Stellata, sometimes better known as the Star Chamber. Being disowned by his father and booted out of his family manor in England, then transported off to the distant sun drenched shores of Australia didn’t sound like such a bad punishment for Hal. All things considered. Sydney however, didn’t prove to be his cup of tea, but a quick move to Brisbane leads Hal to a wonderful new life full of friends, back yards, barbecues, beer, surfing, The Breakfast Creek Hotel and Narelle. The idyllic life.For a short time unfortunately as so often happens, just when you think things are beautifully perfect, someone or something comes along to throw a spanner in the works. In  Hal’s case, his idyllic life gets hit by a number of airborne wrenches. Then when he thinks things are about as bad as they can get, they, of course, get a whole lot worse. Afflicted by an allergic reaction to dust and scary things, Hal does a lot of sneezing as he goes about trying to make the whole lot worse a whole lot better.Read The Adventures of Hal, a laugh a minute romp around the galaxy."}, {"id": "148146650X", "genre": "Science Fiction & Fantasy", "title": "The Strange Case of the Alchemist's Daughter (The Extraordinary Adventures of the Athena Club)", "description": "Based on some of literature’s horror and science fiction classics, this is the story of a remarkable group of women who come together to solve the mystery of a series of gruesome murders—and the bigger mystery of their own origins.Mary Jekyll, alone and penniless following her parents’ death, is curious about the secrets of her father’s mysterious past. One clue in particular hints that Edward Hyde, her father’s former friend and a murderer, may be nearby, and there is a reward for information leading to his capture…a reward that would solve all of her immediate financial woes. But her hunt leads her to Hyde’s daughter, Diana, a feral child left to be raised by nuns. With the assistance of Sherlock Holmes and Dr. Watson, Mary continues her search for the elusive Hyde, and soon befriends more women, all of whom have been created through terrifying experimentation: Beatrice Rappaccini, Catherin Moreau, and Justine Frankenstein. When their investigations lead them to the discovery of a secret society of immoral and power-crazed scientists, the horrors of their past return. Now it is up to the monsters to finally triumph over the monstrous."}, {"id": "1601253575", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Tales: Master of Devils", "description": " On a mysterious errand for the Pathfinder Society, Count Varian Jeggare and his hellspawn bodyguard, Radovan, journey to the distant land of Tian Xia, on the far side of the world. When disaster forces him to take shelter in a warrior monastery, “Brother” Jeggare finds himself competing with the disciples of Dragon Temple as he unravels a royal mystery. Meanwhile, Radovan — trapped in the body of a devil and held hostage by the legendary Quivering Palm attack — must serve a twisted master by defeating the land’s deadliest champions and learning the secret of slaying an immortal foe. Together with an unlikely army of beasts and spirits, the two companions must take the lead in an ancient conflict that will carry them through an exotic land, all the way to the Gates of Heaven and Hell and a final confrontation with the nefarious Master of Devils! From fan-favorite author Dave Gross comes a new fantastical adventure set in the award-winning world of the Pathfinder Roleplaying Game."}]