[{"id": "1445146258", "genre": "Children's Books", "title": "KIDWOW: Atchoo! How We Catch A Cold", "description": "Longlisted for the School Library Association Under 7s Information Book Award 2017! Follow the everyday adventures of brother and sister Ben and Jam, and their interactive friends Square Bear and Jiffy as they explore the world around them. Each KIDWOW book features mind-popping \"look through\" panels that help to reveal the hidden world around us, while the entertaining self-contained story brings science to life, and is perfect for sharing at home or in an early years setting.In Catch a Cold, Ben has a runny nose, and Jiffy can't understand how you can catch something you can't see. Square Bear explains where colds come from and how they affect our bodies."}, {"id": "155005094X", "genre": "Children's Books", "title": "Brady Brady and the MVP", "description": "Brady Brady and the Icehogs love to play hockey, and they love to play hockey together. Some players like Brady Brady and tes are stars. Others are not so talented on the ice, but have their own unique qualities to contribute to the team. Kev has been an Icehog from the very beginning, but he doesn’t get to play very much. Kev doesn’t care. He has never missed a game. He roots fro all the plays. He helps out in practice, and cleans up after the games. Everyone in the arena can always hear Kev yelling, \"Go, Icehogs, Go!\" Then kev is offered a starting position with another team. What to do? – stay with the Icehogs or move on and gain more ice-time? It is a difficult decision for Kev."}, {"id": "1561642959", "genre": "Children's Books", "title": "Those Funny Flamingos (Those Amazing Animals)", "description": "Ever wonder about those funny, big, pink birds that stand on one leg and eat upside down? This book answers 20 questions about flamingos to teach you a lot about those big pink birds. In addition to finally understanding why they stand on one leg and eat upside down, you'll learn the answers to questions like these:How do flamingos stay dry? Can flamingos salute? How can flamingos bend their knees backwards? Why do flamingos have webbed feet? How many eggs does a flamingo lay? Are baby flamingos pink? So come along and let's take a world tour to see where flamingos live and why they do what they do. you'll even learn how to draw them and how to make one from a candy cane.Click here to see more books in the Those Amazing Animals series."}, {"id": "0989436233", "genre": "Children's Books", "title": "Franklin Bean and Bubbie's Bullies: Franklin Bean - book 3 (Franklin Bean Superhero Series) (Volume 3)", "description": "In the third book of the Franklin Bean early chapter book series, John is settled in his new neighborhood and has a good friend in Addie. But all is not well. His much loved dog, Franklin Bean, goes missing before a dog rescue charity event. Panic follows. And although the bully troubles are different, they’re not over. Latino superhero Pancho Frijole continues saving victims caught in dangerous situations. The multicultural cast is in for more surprises and challenges. Addie suspects the real identity of Pancho Frijole. We meet a French bulldog with problems that might make her unadoptable. As part of a school assignment, John chooses to work with the canine bullies. But can he find a loving home for a dog with such serious problems? Two things for sure—danger lurks everywhere for kids and dogs—and Pancho Frijole will try to save the day with teamwork. No matter their ages, readers will come away feeling uplifted and ready to make the world a better place."}, {"id": "0822585146", "genre": "Children's Books", "title": "Marwe: Into the Land of the Dead [An East African Legend] (Graphic Myths and Legends)", "description": "From an East African village, into the Land of the Dead: Marwe lives in a village where food is scarce. She tries to be obedient, but it's hard to spend every day working in the fields. When her carelessness ruins the village's crops, she's too scared to face her angry family and runs away--to the strange Land of the Dead. Marwe knows she doesn't belong there. But can she find the right sort of courage to return to the land of the living?"}]