[{"id": "0399231722", "genre": "Children's Books", "title": "All about Hockey", "description": "A clear and comprehensive reference provides explanations of hockey terms, equipment, rules, tactics, and skills, as well as descriptions of the sport's history, organization of the professional leagues, and profiles of some of the greatest players of all time."}, {"id": "015202154X", "genre": "Children's Books", "title": "My Little Red Toolbox", "description": "Caldecott Honor illustrator Stephen T. Johnson's My Little Red Toolbox has all the tools a child needs to hammer, drill, and have hours and hours of fun! Each spread features a sturdy working tool that's easy to remove and great to play with. Kids will even learn about colors, shapes, and counting, too!My Little Red Toolbox features seven cardboard tools that really work!A pencil and an erasable slate, for drawing up plansA ruler to measure thingsA saw that makes noise when it cuts woodA drill with movable partsA screwdriver and screws that turnA wrench and bolts that turnA hammer for pounding nails"}, {"id": "B00RW9JRG0", "genre": "Children's Books", "title": "South American Fights and Fighters (Illustrated)", "description": "One of the commonly misunderstood phrases in the language is \"the Spanish Main.\" To the ordinary individual it suggests the Caribbean Sea. Although Shakespeare in \"Othello,\" makes one of the gentlemen of Cyprus say that he \"cannot 'twixt heaven and main descry a sail,\" and, therefore, with other poets, gives warrant to the application of the word to the ocean, \"main\" really refers to the other element. The Spanish Main was that portion of South American territory distinguished from Cuba, Hispaniola and the other islands, because it was on the main land.When the Gulf of Mexico and the Caribbean Sea were a Spanish lake, the whole circle of territory, bordering thereon was the Spanish Main, but of late the title has been restricted to Central and South America. The buccaneers are those who made it famous. So the word brings up white-hot stories of battle, murder and sudden death.The history of the Spanish Main begins in 1509, with the voyages of Ojeda and Nicuesa, which were the first definite and authorized attempts to colonize the mainland of South America..."}, {"id": "0600588602", "genre": "Children's Books", "title": "Snappy Jazzy Jewellery (Creative Crafts)", "description": "A title in the CREATIVE CRAFTS series, an illustrated step-by-step guide which demonstrates how to make a variety of durable items of jewellery, using materials such as paper, clay, metal, fabric, recyclable rubbish, shells, driftwood and nuts. With colour photographs by Peter Millard."}, {"id": "B075LNQM2J", "genre": "Children's Books", "title": "Ellie's Paris Adventure (Travel Through Art Book 1)", "description": "Twelve-year-old Ellie Taylor dreams of traveling the world. She wants to experience life, not read about it in a textbook. Forced to study boring paintings for an art history exam, she finds herself transported to 19th Century Paris and the world of the French Impressionists. There, Ellie befriends the famous American artist, Mary Cassatt, who needs help finding her runaway dog, Batty. Ellie chases the dog throughout the city, which also introduces her to such famous places as the Louvre museum, Notre Dame cathedral, and the Paris Opera House. In the end, Ellie discovers art is not dull, but rather filled with grand adventures to places she may never visit otherwise."}]