[{"id": "1409557278", "genre": "Children's Books", "title": "100 First French Words Sticker Book", "description": "An interactive first word book for English speakers to learn their first French words. There are a hundred French word and picture stickers to match up, which will help reinforce the learning of 100 everyday words."}, {"id": "1543505384", "genre": "Children's Books", "title": "Saber-toothed Cat (Little Paleontologist)", "description": "The fierce and deadly sabertooth cat pounced on its prey during the Ice Age. Readers learn about this prehistoric predator from engaging, carefully leveled text and bold illustrations reviewed by Smithsonian experts."}, {"id": "1932096655", "genre": "Children's Books", "title": "Ronald Reagan: Destiny at His Side (Heroes of History)", "description": "From his early days living in small-town poverty, young Dutch Reagan's thoughts were always on the future. Whether helping his family through financial hard times or doggedly pursuing opportunities reserved for the few, Dutch knew that all the knowledge that he had absorbed over the years was waiting inside of him for a chance to come out. Achieving success as an athlete, sports announcer, and actor, Ronald Reagan discovered his greatest role late in life, as the fortieth president of the United States and The Great Communicator, a man with the ability to reach out to the American people and leave a lasting legacy."}, {"id": "0375830073", "genre": "Children's Books", "title": "SNOWED UNDER BOBBLES", "description": "Bob and his dream-machine team are off to Bobblesberg, where the Winter Games will take place. There’s a lot to do to get ready! Will Bob and his crew finish in time? Fun, new characters and environments are introduced in this video tie-in. The embossed-foil cover with an eye-catching 3-D effect makes this book extra special."}, {"id": "0374318085", "genre": "Children's Books", "title": "Sit on a Potato Pan, Otis!: More Palindromes", "description": "Eegad, Agee!  Not another palindrome book!Well-known author and illustrator Jon Agee has been playing with words again, and now a third collection of clever, absurd, and hilarious reversible phrases is the result. These palindromes and their accompanying cartoons will inspire laughs long after first sight. One may feel compelled to go through the book again backwards -- appropriately palindromically -- to revisit his or her favorites. "}]