[{"id": "B008913B3U", "genre": "Science Fiction & Fantasy", "title": "Mythical (Stone Soldiers #1)", "description": "Colonel Mark Kenslir is the last of the Cold War supersoldiers--and he's just come back from the dead. Sent to Arizona to hunt a heart-devouring shapeshifter, Colonel Kenslir and his team of supernatural-smashing soldiers thought it was just another mission. But instead of stopping the monster's murderous rampage, Kenslir and his team became the latest victims in trail of carnage blazed across the southwest.Suffering from partial amnesia, with no weapons and no support, Kenslir must rely on two reluctant teens to help him remember his past, complete his final mission and avenge his men.(Warning! Contains extreme violence and pulp action that may be too intense for some readers.)"}, {"id": "B077PL27KF", "genre": "Science Fiction & Fantasy", "title": "Blind Spot (Deep State Apocalypse Book 0)", "description": "THE BEGINNING OF THE ENDArmy veteran Cash Bishop chases little white lines around the South and Midwest, working as a long haul trucker to make ends meet until the homestead he is building with his mother and sister can support the family. When a security breach at Hoover Dam takes all the U.S. hydroelectric power stations offline the day after a category five hurricane hits the Gulf of Mexico, cutting off electricity to millions and threatening an already compromised fuel supply, Cash figures it's time to chase those white lines home to Tennessee.By the time he hits Chicago, the lights are out across the country, throwing America into a new dark age in which only the strong and the prepared will survive.READER NOTE: This is Part One of the (separately available) three-part novel Long Haul Home"}, {"id": "B000QUCNZO", "genre": "Science Fiction & Fantasy", "title": "13 Bullets (Laura Caxton Vampire)", "description": "The first book in the Laura Caxton Vampire series from the author of the Monster Island trilogy.All the official reports say that vampires are dead--extinct since the late ’80s, when FBI agent Arkeley defeated the last vampire in a fight that nearly killed him. But when state trooper Laura Caxton calls the FBI looking  for help in the middle of the night, Arkeley is unsurprised to hear that it sounds like a vampire attack. He’s been expecting such a call to come eventually. Sure, it has been years since  any signs of an attack, but Arkeley knows what most people don’t: there is one left. In an abandoned asylum she is rotting, plotting, and biding her time in a way that  only the undead can. Laura Caxton is out of her league on this case and more than a little  afraid. Arkeley made it clear there is only one way out. The worst thing  is the feeling that the vampires want more than just her blood. They want her for  a reason, one she can’t guess; a reason her sphinxlike partner knows but won’t say;  a reason she has to find out-or die trying.From the Trade Paperback edition."}, {"id": "160125587X", "genre": "Science Fiction & Fantasy", "title": "Pathfinder Adventure Path: Wrath of the Righteous Part 6 - City of Locusts", "description": "— The heroes of the Fifth Crusade have risen to undreamed of heights of power and have dealt blow after blow to the demonic armies of the Worldwound. As they return from their last foray into the Abyss, however, they find that their enemies are no longer just sending minions after them-now they’ve drawn the attention not only of the leaders of the Worldwound, but even of their demonic patron, Deskari, Lord of the Locust Host. Permanently closing the Worldwound is within the heroes’ grasp, but in order to achieve their goal, they must venture where no crusader has ever returned from intact: the crumbling City of Locusts. There, they must defeat its powerful demonic ruler-yet even this is just a stepping stone to the final battle against Deskari himself!— This volume of Pathfinder Adventure Path concludes the Wrath of the Righteous Adventure Path and includes:•“City of Locusts,” a Pathfinder RPG adventure for 18th-level characters with 9 mythic tiers, by Richard Pett.•Suggestions on how to continue your mythic adventures after the campaign concludes, and what happens if the PCs fail, by Adam Daigle.•A look into the cults of Deskari, Lord of the Locust Host, and their desire to bring on the apocalypse, by Sean K Reynolds.•Death and theft in a demonic wasteland in the Pathfinder’s Journal, by Robin D. Laws.•Four new monsters, by James Jacobs, Nicolas Logue, Jason Nelson, and Tyler Pomplon."}, {"id": "B0773FM5HS", "genre": "Science Fiction & Fantasy", "title": "A Long Lonely Road, Homeward Bound, Book 59", "description": "John and his band are off to rescue more stranded Americans in the Middle East Along with fighting old enemies at home. Things are way more peaceful nowadays but still not perfect. A trip to Waco almost leads to a total war."}]