[{"id": "1544963386", "genre": "Children's Books", "title": "My Amazing Passover Activity Book- Black and White Version (Activity Book for Kids) (Volume 6)", "description": "This BLACK AND WHITE VERSION of Passover activity book for kids is a fun way to get familiar with the symbols of the holiday. Inside this book you will find 49 single sided activity pages of original handmade art work. It contains different kinds of puzzles, mazes, 3D paper models, bookmarks for coloring, find the differences, how to draw- a step by step guide, coloring pages, match items and even more fun activities. Start to enjoy the spirit of this special holiday. suitable for ages 5-10 years of age."}, {"id": "0531273504", "genre": "Children's Books", "title": "100th Day of School (Rookie Read-About Holidays)", "description": "This fact-filled Rookie Read-About Holiday book introduces the youngest readers to The 100th Day of Schoola holiday that celebrates students growth and development. Colorful photos and very simple nonfiction text encourage children to read on their own as they learn how to celebrate their academic accomplishments."}, {"id": "1904550916", "genre": "Children's Books", "title": "Bear And Turtle And the Great Lake Race (Tales With a Twist)", "description": "When Turtle challenges Bear to a race along the river, Bear is confident that he can beat Turtle, but Turtle is smarter than Bear can imagine."}, {"id": "1608181324", "genre": "Children's Books", "title": "Chicago Bulls (NBA Champions)", "description": "\"A basic introduction to the Chicago Bulls professional basketball team, including its formation in 1966, great players such as Michael Jordan, championships, and stars of today\"--Provided by publisher."}, {"id": "1547241381", "genre": "Children's Books", "title": "Notebook Journal Grid: Graph Paper Notebook, 8.5 x 11, 120 Grid Lined Pages (1/4 Inch Squares)", "description": "Perfect For All Your Grid Line Journaling & DrawingGraph Paper Journal Style book with 1/4 inch squares perfect for solving math problems, drawing and doodling or even journaling. Professionally designed covers make your book stand out from the rest.120 8.5” x 11” grid lined pages allows you to fill this book with your sketches, ideas, memories and much more. Makes a great gift for anyone who loves to journal."}]