[{"id": "0746036922", "genre": "Children's Books", "title": "Make This Viking Settlement (Usborne Cut Out Models)", "description": "-- Require only glue, scissors and a craft knife -- Most historical titles compatible with OO/HO scale to complement figures bought from model shops -- Fantasy models include moving parts and see-inside sections -- Each model includes full-color buildings, people and baseboard"}, {"id": "B073S75YF8", "genre": "Children's Books", "title": "Dreams Come True (Melowy #1)", "description": "Hidden somewhere beyond the highest clouds is the castle of Destino, a school for very special students. They’re the Melowies, little unicorns born with a symbol on their wings and a hidden magical power. But Destino is also a place where friendships are born, where the Melowies find their courage, and where they learn their path to growing up. Five of the students are Clio, Kora, Maia, Selene, and Electra. And the time destined for them to meet has now arrived."}, {"id": "133808951X", "genre": "Children's Books", "title": "The Witch Boy", "description": "In thirteen-year-old Aster's family, all the girls are raised to be witches, while boys grow up to be shapeshifters. Anyone who dares cross those lines is exiled. Unfortunately for Aster, he still hasn't shifted . . . and he's still fascinated by witchery, no matter how forbidden it might be.When a mysterious danger threatens the other boys, Aster knows he can help -- as a witch. It will take the encouragement of a new friend, the non-magical and non-conforming Charlie, to convince Aster to try practicing his skills. And it will require even more courage to save his family . . . and be truly himself."}, {"id": "B01MUSR8TW", "genre": "Children's Books", "title": "Children's Illustrated Biography of Donald J Trump", "description": "Donald J Trump is the 45th President of the United States. This Illustrated Biography for Children teaches kids about his early life, the history of the Trump family and his business success. Kids will learn about the controversies surrounding his early Presidency and be inspired and empowered to overcome their odds and make the world a better place."}, {"id": "B00RFXDM4Q", "genre": "Children's Books", "title": "Fidel Castro & the Cuban Revolution for Kids!: The Amazing and Controversial Story of Fidel Castro & the Cuban Revolution", "description": "Fidel Castro and the Cuban Revolution changed history forever in 1959.  It was the start of an amazing and controversial period that saw Cuba became the first Communist country in the Western Hemisphere and almost trigger a nuclear war between the United States and the Soviet Union.For nearly 50 years, Fidel Castro ruled the island with an iron grip.  He was loved by millions of Cubans for his social reforms but hated by countless others for his oppression of human rights and freedom of speech.Discover...* Who is Fidel Castro and how did he start the Cuban Revolution?* How did Castro go from a young lawyer to one of the most controversial dictators in history?* How Castro and his men started a guerilla army from scratch that went on to overthrow the Cuban government.* Why Castro became a hero when he \"defeated\" the United States?...and Much More!So scroll back up and download \"Fidel Castro and the Cuban Revolution for Kids.\""}]