[{"id": "0431020469", "genre": "Children's Books", "title": "Stars (Acorn: Space)", "description": "Read this book to find out about stars and galaxies. Books in this series introduce children to outer space. Each book uses simple, repetitive text to teach children basic vocabulary, and includes stunning photographs and artwork to show the main features of our Solar System. In Stars, children learn what stars are made of, what size and colour they can be, and how the Sun is a star."}, {"id": "075653304X", "genre": "Children's Books", "title": "Teens in Canada (Global Connections)", "description": "Living in the second largest country in the world, Canadian teens are spread across 10 provinces and three territories. They come of age in a diverse and multicultural nation, but they share many common experiences beyond cold winters and a love of hockey. They work part-time jobs, go shopping with friends, and celebrate Canada Day and other special occasions. Teens in Canada is part of Global Connections, a series that uncovers the challenges, pastimes, and customs of teens around the world."}, {"id": "1580894070", "genre": "Children's Books", "title": "Ancient Animals: Saber-toothed Cat", "description": "The saber-toothed cat was a fearsome prehistoric predator. Written for beginning readers, clear and succinct text explains how we think saber-toothed cats lived, hunted, and became extinct. Back matter explores other large-toothed predators and provides additional print, visual, and web resources."}, {"id": "0007181205", "genre": "Children's Books", "title": "Times Tables: Age 5-7 (Revise & Shine)", "description": "A fun and interesting series of two activity books that provides extensive practice of times tables skills. These books are an ideal home resource for extra practice and reinforcement of techniques covered at school. Revise and Shine Times Tables 5-7 combines a variety of puzzles, colouring and number pattern activities, providing extensive coverage of the two, five, ten, three and four times tables. Interesting activities, combined with fun illustrations, provide motivation to ensure multiplication success. A useful Did you know...? section clearly outlines underlying patterns and enhances key skills. Written by experienced teachers and designed to boost confidence, this book is ideal for encouraging home learning and supporting skills acquired at school."}, {"id": "B06XRQKVSX", "genre": "Children's Books", "title": "Song of the Sparrow", "description": "This eloquent and gripping addition to the Camelot canon  -- written in beautiful verse -- has received glowing, starred reviews and early awards buzz!Since the days of King Arthur, there have been poems and paintings created in her name. She is Elaine of Ascolat, the Lady of Shalott, and now there is a book all her own. The year is 490 A.D. and 16-year-old Elaine has a temperament to match her fiery red hair. Living on a military base with her father, brothers, and the rest of Arthur's army, Elaine pines for the handsome Lancelot, and longs for a female friend. But when the cruel, beautiful Gwynivere arrives, Elaine is confronted with startling emotions of jealousy and rivalry. Can Elaine find the strength to survive the birth of a kingdom?"}]