[{"id": "1560374128", "genre": "Children's Books", "title": "Born Wild in Colorado", "description": "Shattil and Rozinski always use ethical photographic techniques to capture these rare images of baby animals. Animals such as mountain goats, hummingbirds, red foxes, black bears, porcupines, burrowing owls, wild horses, curlews, and much more are featured in 97 high-quality color photographs."}, {"id": "0545166810", "genre": "Children's Books", "title": "Gregor the Underland Chronicles (5 Volume Set)", "description": "The complete box set of the five books in the New York Times bestselling series The Underland Chronicles – with gorgeous new box and cover art coming July 1st.When Gregor follows his little sister through a grate in the laundry room of their New York apartment building, he hurtles into the dark Underland beneath the city. There, a conflict is brewing between the humans and the giant creatures that live below. Gregor must find his place in the frightening prophecies he encounters, the strength to protect his family, and the courage to stand up against an army of giant rats.This is an action-packed and masterful series by bestselling author Suzanne Collins."}, {"id": "1400308461", "genre": "Children's Books", "title": "The Pumpkin Patch Parable: Special Edition (Parable Series)", "description": "The Pumpkin Patch Parable-This charming story for children illustrates how a loving farmer can turn a simple pumpkin into a simply glorious sight. In the same way, God's transforming love can fill each of our hearts with joy and light. Liz Curtis Higgs created this parable as a way to share the Good News with her own precious children each harvest season . . . and now with children everywhere."}, {"id": "0590117114", "genre": "Children's Books", "title": "I Spy Little Animals", "description": "Based on the best-selling I Spy books, a board book allows the youngest children to search for tiny animals with the help of age-appropriate rhyming clues and full-color photographs."}, {"id": "1504755170", "genre": "Children's Books", "title": "Marvel Avengers: Age of Ultron: Library Edition (Marvel Cinematic Universe: Phase Two)", "description": "Following the record-shattering successes of Marvel's The Avengers in 2012, The Avengers must reassemble to combat the robotic menace of Ultron! Acclaimed writer/director Joss Whedon and producer Kevin Feige return, along with the all-star cast of Robert Downey Jr. (Tony Stark/Iron Man), Chris Hemsworth (Thor), Mark Ruffalo (Bruce Banner/Hulk), Chris Evans (Steve Rogers/Captain America), Scarlett Johansson (Natasha Romanoff/Black Widow) and Jeremy Renner (Clint Barton/Hawkeye). They are joined by Emmy Award-winner James Spader (Lincoln, The Blacklist) as Ultron."}]