[{"id": "0606352945", "genre": "Children's Books", "title": "Roll Out And Read Adventures (Turtleback School & Library Binding Edition) (Transformers, Passport to Reading 2)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Did you love Transformers movies? Then get ready for this bind-up of illustrated, movie-based storybooks of the first three films! This collection is sure to thrill every young fan--Autobot or Decepticon!"}, {"id": "1592702341", "genre": "Children's Books", "title": "Dress Up and Let's Have a Party", "description": "John and his friends come together for a party, using the everyday things around them to construct inventive costumes on the spot. Pots and pans, an empty soap box, your mother’s clothes―these are all things you can wear to a dress-up party! Playing dress-up is a way to be a new self and to imagine for a moment that you are different from who you really are. It's a way to be extravagant or silly, a way to surprise yourself and have a great time!Written by the prolific and beloved Remy Charlip, Dress Up and Let’s Have a Party is a clever, playful reminder that the potential for fun is always at hand. Originally published in the United States in 1956, Dress Up and Let's Have A Party was his first book."}, {"id": "0307635791", "genre": "Children's Books", "title": "Fourteen Bears: Summer and Winter", "description": "Charming drawings and lively text relate the activities of Daddy and Mother Bear and their twelve children during the summer and winter months"}, {"id": "B00HETM076", "genre": "Children's Books", "title": "Discovery at Dawn (Gospel Time Trekkers #6)", "description": "In this sixth volume of the Gospel Time Trekkers series, children ages 6-9 are taken on a journey that imaginatively retraces the events surrounding Jesus's crucifixion and resurrection, revealing the ultimate meaning of giving up something for others."}, {"id": "1683423844", "genre": "Children's Books", "title": "Flowers (A Closer Look at Plants)", "description": "Flowers are more than just decoration. They have an important job. But they can’t always do it alone. Find out more about the work of flowers, how they attract help, and how they help plant species survive."}]