[{"id": "B01NAZ452R", "genre": "Children's Books", "title": "Spiders of Fire (Myke Phoenix Novelettes superhero adventures Book 7)", "description": "The annual Astor City Philanthropists’ Ball was going swimmingly until the giant spider spit flame and set everything on fire. When the city is threatened by unexpected things like giant spiders, they turn to Myke Phoenix. With the help of local scientists who just happen to be arachnologists, Myke races to stop the eight-legged monster before it can burn down the city or have baby spiders. Book 7 in the ongoing series of Myke Phoenix Novelettes superhero adventures."}, {"id": "1538351846", "genre": "Children's Books", "title": "Puzzle Pieces: Sticking to It (Computer Science for the Real World)", "description": "Computer science is all around us, at school, at home, and in the community. This book gives readers the essential tools they need to understand the concept of tenacity and perseverance. Brilliant color photographs and accessible text will engage readers and allow them to connect deeply with the concept. The computer science topic is paired with an age-appropriate curricular topic to deepen readers learning experience and show how tenacity and perseverance are helpful in the real world. In this book, readers will follow a narrator as they try to complete a difficult puzzle. This nonfiction title is paired with the fiction title Toms's Puzzle (ISBN: 9781538351826). The instructional guide on the inside front and back covers provides: Vocabulary, Background knowledge, Text-dependent questions, Whole class activities, and Independent activities."}, {"id": "0999113607", "genre": "Children's Books", "title": "The True Story of the Ugly Duckling: A tale of Transformation through self-love (1) (Volume 1)", "description": "With much fanfare an ugly duckling breaks out of her shell only to realize she doesn't quite fit in. Rejected by her family, she is disheartened by her reflection. She starts to believe that she truly is ugly, and doesn't deserve love.  What does she do next? How does she embrace herself and the world? This powerful retelling of a classic tells the story of her journey of transformation. Delightfully illustrated, children will love it, and the insightful message will resonate with adults of all ages."}, {"id": "B00O70IRQ8", "genre": "Children's Books", "title": "Alice Devises and the Kingdom of Lightwold", "description": "Alice is just a normal kid who's grown up in care. It's not her fault fires keep starting around her, but she gets the blame for them. Enter Lighthorne Herb - a mysterious man masquerading as her social worker - who informs her of her Ethereal heritage.  Herb whisks her away to the magical island of Hy Brasil, in order that she can learn to control her own powers.  During her many adventures, she befriends wood sprites, goblins, elves and genies, but, she discovers that even on the island she is not safe - especially as an ex Greek god is out to kill her."}, {"id": "B00BQAYWXE", "genre": "Children's Books", "title": "Escape of Marvin the Ape Board Book", "description": "An ape has escaped from the city zoo! No, it’s not Curious George. It’s another charmer named Marvin, and he’s celebrating his fifteenth year of silliness. This book was the very first collaboration for husband-and-wife team Mark and Caralyn Buehner, and their imagination and humor were already on full display. As gigantic gorilla Marvin manages to hide himself from the police on the subway, at the toy store, on the ferry, and at the ball game, the simple text and bold, funny illustrations are just right for this new board-book edition."}]