[{"id": "037582801X", "genre": "Children's Books", "title": "Weeds in Bloom: Autobiography of an Ordinary Man", "description": "With over 65 books published, including the breathtaking (and somewhat autobiographical) A Day No Pigs Would Die, Robert Newton Peck has enjoyed an illustrious writing career. Now, in an autobiography as unique as he is, Peck tells his story through the people in his life. From his roots as a poor Vermont farmer’s son to his years as a soldier in World War II, from his time slogging away in a paper mill to his semi-retirement in Florida, Peck shows us people who too often go unseen and unheard–the country’s poor and uneducated.“For decades, I’ve examined the autobiographies of my fellow authors. Bah! Many could have been titled And Then I Wrote . . . So instead of my life and lit, here is the unusual, a tarnished treasury of plain people who enriched me, taught me virtues, and helped me hold a mite of manhood. They’re not fancy folk, so please expect no long-stemmed roses from a florist. They are, instead, the unarranged flora that I’ve handpicked from God’s greenhouse . . . weeds in bloom.”"}, {"id": "0746074549", "genre": "Children's Books", "title": "Egyptians (Beginners)", "description": "\"Usborne Beginners\" are colourful information books for children beginning to read on their own. This title features vivid, full colour illustrations and photographs on every page, accompanied by short, informative text. It is developed with reading experts at the University of Roehampton. It contains carefully selected Internet links to exciting websites to find out more. It is great reading practice for children who prefer fact to fiction."}, {"id": "1429621192", "genre": "Children's Books", "title": "Disgusting Foods (That's Disgusting!)", "description": "Would you like fries with your boiled snail? Anything for dessert? How about fabulous roasted grasshoppers? Take a look at some of the disgusting foods people eat around the world. You may lose your appetite after ordering off of this menu."}, {"id": "1538213842", "genre": "Children's Books", "title": "Invisibility Cloaks (Science Fiction to Science Fact)", "description": "From Harry Potter to King Arthur, stories about invisibility cloaks have been around for hundreds or possibly thousands of years. It seems mere fantasy that something like that could exist, but today there are several different kinds of technology that could be used to make someone appear invisible, or at least very inconspicuous. Through direct explanations, this book covers the history of invisibility cloak stories and connects some of the coolest recent technology to these tales. Covering both STEM and literature components, this book will enchant sci-fi lovers and scientists alike."}, {"id": "B00A9YKU3Y", "genre": "Children's Books", "title": "Alexander Fleming : The Discovery Of Penicillin (A Short Biography for Children)", "description": "Alexander Fleming : The Discovery Of Penicillin (A Short Biography for Children)Sir Alexander Fleming was a Scottish bacteriologist best known for his discovery of penicillin.Best Children's Biographies : Write a biography for kids by thinking about what a child would enjoy learning about a person, covering important achievements, creating an outline and getting help from a child reader."}]