[{"id": "0590444964", "genre": "Children's Books", "title": "A Very Scary Jack-O'-Lantern (Glows in the Dark)", "description": "Provides young readers with a spooky Halloween tale, complete glow-in-the-dark skeletons, ghosts, spiders, bats, and more. Original."}, {"id": "0606404430", "genre": "Children's Books", "title": "Xander's Panda Party", "description": "Xander Panda wants to throw a party, but a panda party would have only one guest--himself. So, he decides to invite all the bears. But Koala protests. She's not a bear--she's a marsupial! Does that mean she can't come? Xander rethinks his decision to invite only bears, and \"Calling all bears\" evolves into \"Calling all creatures.\" The Newbery Medal author Linda Sue Park introduces animal taxonomy in a wonderfully engaging way, and the celebrated artist Matt Phelan's charming ink and watercolor paintings are the icing on the cake."}, {"id": "B071NHQKCC", "genre": "Children's Books", "title": "The Teen's Guide to Social Media... and Mobile Devices: 21 Tips to Wise Posting in an Insecure World", "description": "Ever regret something you’ve posted?Honestly? How smart are you being when it comes to streaming, messaging, gaming, commenting. . .?    The Teen’s Guide to Social Media & Mobile Devices will help you navigate the digital world with 21 refreshingly honest and humorous tips that will not only inform, but that also just might change the way you think about your social media interaction.      21 real-life tips including. . .Know the app before you snap.Don’t post anything you wouldn’t want Grandma, your boss, and Jesus seeing! (Jesus is on Insta, you know!)Peek at your privacy settings. . .so you know who’s peeking at you.Take more “selflessies.”Press pause before you post.  . . .and many more will provide just the information you need to post wisely in an insecure world.  "}, {"id": "0545467217", "genre": "Children's Books", "title": "Aesop's Fables - Library Edition", "description": "Aesop's fables are retold in kid-friendly text with black-and-white illustrations throughout!This 80-page edition of AESOP'S FABLES introduces young readers to Aesop's classic fables in a fun and accessible way. Ann McGovern retells the classic fables using kid-friendly language, and there are striking black-and-white illustrations throughout."}, {"id": "0340705191", "genre": "Children's Books", "title": "The Changing Highlands: Clearances and Crofting (Understanding People in the Past)", "description": "One of a series of Scottish history books developed to meet the requirements of the 5-14 curriculum in history. This volume focuses on changes in the Highlands during the 17th century, the causes of the Clearances and emigration, and how the changes have affected crofting communities."}]