[{"id": "B005GVDMKS", "genre": "Science Fiction & Fantasy", "title": "Time's Enemy: A Romantic Time Travel Adventure (Saturn Society Book 1)", "description": "One unwanted gift. Tony Solomon never wanted to be a time traveler. But a brush with death leaves him a time traveler—and an unwilling initiate in the Saturn Society, a secret society of those with his ability.One great wrong.Tony vows to use his gift to prevent his daughter’s murder—if he could figure out how. Never mind that this violates the Society’s highest law, branding him an Enemy for a crime he has yet to commit. Determined to thwart the Society, he seeks help from Charlotte, the woman whose life he saved decades before he was born.One chance to make things right…Tony jumps to 1933 in search of answers, but lands on the wrong side of the Society, a fugitive on the run. Thrilled, yet terrified to see her childhood hero, Charlotte offers him sanctuary…and unexpected love. But Charlotte hides a terrible secret: loyal to the Society, she must bring to justice those who manipulate time for their own gain. By sheltering Tony, she faces a terrible choice: condemn the man she loves and to whom she owes her life, or deny her deepest convictions by helping him escape, and risk sharing his sentence.Not your typical time travel romance, Time’s Enemy creates a wonderful blend of romance and science fiction, an exciting adventure through time rich in action, romance, and history."}, {"id": "1476799725", "genre": "Science Fiction & Fantasy", "title": "The Burning World: A Warm Bodies Novel (The Warm Bodies Series)", "description": "Library Journal’s Must-Have Spring Books, Editors’ Picks 2017 “A thrilling coast-to-coast journey.” —The Seattle Times “A richly imagined philosophical exploration.” —Bellingham Herald “Exciting action, intriguing characters, epic scale.” —Booklist (starred review) “Poignant and poetic...brings zombie lit back from the dead.” —The Stranger The New York Times bestseller Warm Bodies captured hearts worldwide in twenty-five languages, inspiring a major film and a cult fandom. Now R the reluctant zombie continues his journey in this much-anticipated sequel.Being alive is hard. Being human is harder. But since his recent recovery from death, R is making progress. He’s learning how to read, how to speak, maybe even how to love, and the city’s undead population is showing signs of life. R can almost imagine a future with Julie, this girl who restarted his heart—building a new world from the ashes of the old one. And then helicopters appear on the horizon. Someone is coming to restore order. To silence all this noise. To return things to the way they were, the good old days of stability and control and the strong eating the weak. The plague is ancient and ambitious, and the Dead were never its only weapon. How do you fight an enemy that’s in everyone? Can the world ever really change? With their home overrun by madmen, R, Julie, and their ragged group of refugees plunge into the otherworldly wastelands of America in search of answers. But there are some answers R doesn’t want to find. A past life, an old shadow, crawling up from the basement."}, {"id": "1530792142", "genre": "Science Fiction & Fantasy", "title": "Jolene, You're Not a Monster", "description": "Jolene’s lived for twenty-one years without ever having ridden a bike or swung on a swing. She’s never had a first date, gone to school or a prom. Scientists working for the military created her. She’s one of Military Intelligence’s most valuable assets, but one of those scientists believes she’s a monster, too dangerous to exist. He’ll do anything to fix his mistake and terminate the experiment, Jolene. When he nearly succeeds in Afghanistan, Jolene is forced to break all the rules and escape. Running in a world she’s only experienced in training and on missions, hunted by the military and the CIA, she’ll have to embrace the monster she was created to be if she is to survive. Jolene, You’re Not a Monster is a thrilling, action packed, emotional ride as a creation tries to be a good person. What people are saying: \"Holey Moley! What a story! The only thing I didn’t like about it was that it wasn’t written by me!\" \"I am excited this author integrated science fiction and humanity into a great story.\" \"If you're a Steven King fan you'll love this story!\" \"Part adventure, part horror, part romance, all riveting -- this creepy but masterful novel is full of wicked twists and turns...\""}, {"id": "0812993608", "genre": "Science Fiction & Fantasy", "title": "Welcome to the Monkey House, The Special Edition", "description": "Since its original publication in 1968, Welcome to the Monkey House has been one of Kurt Vonnegut’s most beloved works. This special edition celebrates a true master of the short-story form by including multiple variant drafts of what would eventually be the title story. In a fascinating accompanying essay, “Building the Monkey House: At Kurt Vonnegut’s Writing Table,” noted Vonnegut scholar Gregory D. Sumner walks readers through Vonnegut’s process as the author struggles—false start after false start—to hit upon what would be one of his greatest stories. The result is the rare chance to watch a great writer hone his craft in real time.Includes the following stories:“Where I Live”“Harrison Bergeron”“Who Am I This Time?”“Welcome to the Monkey House”“Long Walk to Forever”“The Foster Portfolio”“Miss Temptation”“All the King’s Horses”“Tom Edison’s Shaggy Dog”“New Dictionary”“Next Door”“More Stately Mansions”“The Hyannis Port Story”“D.P.”“Report on the Barnhouse Effect”“The Euphio Question”“Go Back to Your Precious Wife and Son”“Deer in the Works”“The Lie”“Unready to Wear”“The Kid Nobody Could Handle”“The Manned Missiles”“Epicac”“Adam”“Tomorrow and Tomorrow and Tomorrow”"}, {"id": "B01BWGKXCA", "genre": "Science Fiction & Fantasy", "title": "Colton Cyness and the Gunslingers (Children of the Empire Book 1)", "description": "Colt doesn’t want to be a farmer. He wants to explore the galaxy as his ancestors once did. In a moment of youthful exuberance, he is plunged into the brutal life of the Gunslinger Order — the mysterious keepers of the law. Colt is sent to the Gunslinger Academy on a distant world to learn what it takes to survive.And so begins a coming of age adventure series that will span across the worlds of the galaxy."}]