[{"id": "0648155005", "genre": "Children's Books", "title": "Why is Petey the Pelican so grumpy? (Stories from the Australian Great Barrier Reef)", "description": "Petey is a grumpy pelican who blames everyone else for his lack of friends. He has poor social skills and almost no emotional intelligence but of course, this is everyone else’s problem. Petey is a member of a thriving and diverse community of birds, crabs and fish but he is always looking out for himself and is greedy and deceptive about how he sneaks food. Petey’s self-centred view of the world is overlooked by his community and he is included in all their activities. However, when the community decides to protect the baby turtle hatchlings, Petey is caught in a dilemma as he doesn’t want to give up his favourite snack food, so he only pretends to help. Seamore and Sasha know this and gently help him learn about sharing and telling the truth. This is a story about redemption and the reestablishment of self-worth because of the help of a supportive community."}, {"id": "B01A2YIZ0U", "genre": "Children's Books", "title": "World's Favorite Pets: Pets in Every Home: Pet Books for Kids (Children's Pet Books)", "description": "When your child wants a pet, the first thing you need to do is to introduce the concept properly. You can use this educational book to teach your child that having pets come with the responsibility of caring for and feeding them. The many pictures and brief facts would also make it easier for your child to decide on which pet to have. Open this book today!"}, {"id": "1496559169", "genre": "Children's Books", "title": "Aerials and Envy (Jake Maddox JV Girls)", "description": "Tamaya Jackson works hard and likes being part of her gymnastics team, but sometimes she'd like more credit for her skills. When a news station interviews Tamaya for a feature on gymnastics, it seems she'll finally get the recognition she's been wanting. However, it all goes downhill when Tamaya realizes nothing comes without a price. In this case, it's extra pressure and jealous teammates. Can gymnastics be fun again? Reader support tools, including a glossary and questions, make this sports story a great choice for libraries."}, {"id": "0141308699", "genre": "Children's Books", "title": "Snakey Riddles (Easy-to-Read, Puffin Level 3)", "description": "An illustrated collection of riddles about snakes, including \"What kind of snake do you find on the front of your car? A windshield viper!\""}, {"id": "1942672985", "genre": "Children's Books", "title": "10 Little Monsters Visit Washington", "description": "10 Little Monsters, looking for fun,  Take a trip to Washington. 10 Little Monsters, they cant wait  'Cause Monsters love the Evergreen State From the Trail of Lewis and Clark to Mount Rainier and Pike Place Market, these 10 Little Monsters discover some of the most unique and interesting things about Washington and what it has to offer. Silly, over-the-top fun, and a bit macabre, 10 Little Monsters Visit Washington is the perfect book for every little boy and ghoul!"}]