[{"id": "1483596052", "genre": "Children's Books", "title": "Adventure At Sea With Sailor Marie", "description": "Fortified with a bountiful basket of goodies from her mother, little Marie meets adventures, but not quite of the exotic type she’d imagined. She is fearless and resourceful. Undaunted by a frustrating night on a tiny desert island, she captains her little sloop successfully back home to a happy surprise. Written in clever, well-crafted, natural verse and profusely illustrated with delightful pictures, this is definitely a read-aloud book. It’s a real charmer for any young child. The author avoids the impoverished vocabulary so commonly seen in children’s books. The young reader will learn a few new words (and maybe just a pinch about sailing). The voyage through Sailor Marie's thirty-six pages takes less than fifteen minutes\u0097a nice length for a bed-time story. It’s recommended for ages five to eight (but it’s not illegal to read it to any adult sweet-heart who retains a fondness for those really good children’s books)."}, {"id": "B072C91CWY", "genre": "Children's Books", "title": "Treasure Island", "description": "When young Jim Hawkins discovers a mysterious map in a dead man's sea-chest, he sets off on a thrilling adventure of pirates, treasure, and villainy. Hired as a cabin boy on the Hispaniola, Jim finds himself in the company of a frightening crew of seamen, and is soon taken under the wing of the charismatic but dangerous Long John Silver... One of the most famous adventure stories ever written, Robert Louis Stevenson's classic tale with delight young readers aged 8 and up. This edition also contains illustrations by the artist Walter Paget."}, {"id": "B0094GP9RK", "genre": "Children's Books", "title": "Stories for 2 Year Olds (Young Storytime)", "description": "When it’s time for a story, there’s no better place to find one than in this wonderful collection of original tales, written especially for two year olds. Told in a gentle and humorous way, the stories are beautifully illustrated and full of adorable characters that children will love. Meet the bear who can’t find his teddy, a tiger who doesn’t like the postman and a hippo who loves jumping in puddles! Come and join in the fun and make story time a special time for your two year old."}, {"id": "0679810528", "genre": "Children's Books", "title": "Wild, Wild Wolves (Step into Reading)", "description": "Illus. in full color. A fascinating introduction to the world of wolves, one of nature's most enduring and misunderstood creatures. Wolf-pack behavior, body language, and the meaning of howls are all demystified in this natural history."}, {"id": "0613002768", "genre": "Children's Books", "title": "Amber Brown Goes Fourth (Amber Brown (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Amber Brown isn't entirely ready for fourth grade. She has her pens, pencils, new clothes, and new shoes. But the one thing she doesn't have is her best friend, Justin Daniels. Justin has moved away."}]