[{"id": "0062497952", "genre": "Children's Books", "title": "Laugh-Out-Loud Awesome Jokes for Kids (Laugh-Out-Loud Jokes for Kids)", "description": "The #1 bestselling Laugh-Out-Loud Jokes for Kids series returns with a timeless collection of brand-new jokes for every occasion and every member of the family!Get ready for a barrel of laughs in a pint-sized package: the jokes, riddles, knock-knocks, and puns don’t stop coming in Rob Elliott’s newest collection of never-before-heard instant classics. Fresh and clean, this book is for good times with the whole family that will never grow old.Q: Do you want to hear a pizza joke? A: Are you sure? It’s gonna be cheesy!"}, {"id": "0998943509", "genre": "Children's Books", "title": "Brother Yun: The Heavenly Man of China (Potter's Wheel) (Volume 4)", "description": " Yun lived in the time of the Cultural Revolution of China–no Bibles were to be found anywhere,  because all of them had been burned and the families who owned them had been severely beaten or killed.    But through a dream and a miracle, God provided Yun with the Bible he needed.    Yun began to preach all over China. He was captured, but amazingly escaped, again and again. Thousands of people came to Christ, and together the Chinese Christians saw many miracles. "}, {"id": "1410407799", "genre": "Children's Books", "title": "Medusa Jones (Thorndike Press Large Print Literacy Bridge Series)", "description": "In ancient Greece, Medusa Jones, a gorgon, and her friends, a minotaur and a centaur, are mocked and sneered at by the other Acropolis Academy children whose parents are kings and gods, but when they go on a school camping trip together, the \"freaks\" become true heroes."}, {"id": "0147517990", "genre": "Children's Books", "title": "Froggy's Birthday Wish", "description": "It's Froggy's birthday, but it seems that everyone has forgotten... No one seems to remember that it's Froggy's special day. Mom and Dad don't say a word, and all of his friends are busy elsewhere. Until he gets back home to find everyone waiting to surprise him with a party, complete with a piñata filled with chocolate-covered flies! \"Froggy's natural exuberance and excitement are infectious...\"—School Library Journal on Froggy Plays T-Ball\"Perfect to comfort any kid a little hesitant at the first swimming lesson. Giggles come with the lesson.\"—The Orlando Sentinel on Froggy Learns To Swim"}, {"id": "1911287788", "genre": "Children's Books", "title": "The Official Queens Park Rangers Annual 2018", "description": "QPR - Queens Park Rangers Football Club 2018 Annual Yearbook - official licensed product"}]