[{"id": "1481457713", "genre": "Children's Books", "title": "The Pegasus Winged Collection Books 1-3: The Flame of Olympus; Olympus at War; The New Olympians", "description": "Embark on legendary adventures with a winged horse, a girl, and the gods of Olympus with the first three books of the Pegasus series, now together in a collectible boxed set.In The Flame of Olympus, when an injured Pegasus lands on the roof of Emily’s Manhattan apartment building, she is drawn into a war between the gods of Olympus and the warrior Nirads. Then in Olympus at War, Emily is living on Mt. Olympus, but her father is being held by a secret government agency called the CRU—so she plans to sneak back to New York to save him. And in The New Olympians, Emily, Joel, Paelen, Pegasus, and the sphinx Alexis return to Earth to investigate strange rumors surrounding an amazing racehorse called Tornado Warning."}, {"id": "1680486837", "genre": "Children's Books", "title": "The History of Latin America (Exploring Latin America)", "description": "This title authoritatively recounts the main events in the history of Latin America and highlights the men and women who played key roles in the establishment and growth of the region. Though long inhabited only by various Amerindian tribes, Latin America was transformed by the arrival of Europeans, who built colonial empires across the region beginning in the sixteenth century. Much of Latin America secured its independence in the early nineteenth century, but the new countries were plagued by political and economic instability, some of which continues today. Readers will get a full picture of Latin Americas complex history and an understanding of how it affects the present-day region."}, {"id": "0316404489", "genre": "Children's Books", "title": "A Big Mooncake for Little Star", "description": "A gorgeous picture book that tells a whimsical origin story of the phases of the moon, from award-winning, bestselling author-illustrator Grace Lin Pat, pat, pat...Little Star's soft feet tiptoed to the Big Mooncake.Little Star loves the delicious Mooncake that she bakes with her mama. But she's not supposed to eat any yet! What happens when she can't resist a nibble?In this stunning picture book that shines as bright as the stars in the sky, Newbery Honor author Grace Lin creates a heartwarming original story that explains phases of the moon."}, {"id": "1449477917", "genre": "Children's Books", "title": "Razzle Dazzle Unicorn (Phoebe and Her Unicorn Series Book 4): Another Phoebe and Her Unicorn Adventure", "description": "Get ready to be bedazzled!Dana Simpson's Phoebe and Her Unicorn is back with more sparkles than ever! In this fourth volume, join in the adventure as Phoebe and Marigold confront messy rooms, trouble at school, and a nasty case of “Sparkle Fever.” Follow the pair back to Camp Wolfgang, where their old pals Sue (a.k.a. “Monster Girl”) and Ringo, the lake creature, remind them that being weird is WAY more fun than being normal."}, {"id": "1599533294", "genre": "Children's Books", "title": "The Detroit Lions (Team Spirit)", "description": "\"Presents the history and accomplishments of the Detroit Lions football team. Includes highlights of players, coaches, and awards, quotes, timeline, maps, glossary and websites\"--Provided by publisher."}]