[{"id": "B077SN6F44", "genre": "Children's Books", "title": "Naptime for Animals (Baby's Bookshelf Book 3)", "description": "NAPTIME FOR ANIMALSFull color and beautifully photographed, this bedtime book is sure to delight children ages 0 -3. It features a variety of cute animals in the stages of going to sleep - yawning, laying down, eyes closed. Read your child to sleep with Naptime for Animals.Excerpt:“The animals are getting sleepy.Time for a nap.Shhhh! We must be very quiet.Red panda yawns.”BABY’S BOOKSHELF series aims to provide babies and toddlers the opportunity to explore their world through images, language, rhyme, shape, color, patterns, opposites and more. For more in this series visit ellesimms.com or find us on Amazon."}, {"id": "1783120770", "genre": "Children's Books", "title": "The Official 2014 FIFA World Cup Brazil™ Kids' Handbook", "description": "This is the World Cup companion every kid needs while watching the world's most exciting sports competition! Official mascot Fuleco, a friendly armadillo, tells children all about his home and the host country, Brazil, and there's everything a fan needs to know about the stadiums, top players, and statistics. Adding to the fun are quizzes, games, stickers, a tricky double-page search-and-find puzzle, and a foldout back jacket with a fill-in progress chart—so soccer-crazy kids can record match results as the games progress."}, {"id": "030702105X", "genre": "Children's Books", "title": "My Little Golden Book About God", "description": "This poetic book illustrates how even the tiniest things that we might take for granted, like the “jewels on the insect’s back,” are part of God’s great plan. A comforting, gentle introduction to the concept of God, it is one of the most beautifully written and illustrated books on the Golden list."}, {"id": "0887431453", "genre": "Children's Books", "title": "Big Preschool Workbook", "description": "BIG Preschool Workbook is packed with 300+ colorful exercises that make learning fun!These proven activities will help prepare your child for success by teaching colors, shapes, alphabet, basic phonics, numbers, early math and more! 320-pages Grade: PreschoolAges: 3 - 5"}, {"id": "B00HNXC23A", "genre": "Children's Books", "title": "#10 Sherlock Holmes and the Boscombe Valley Mystery (On the Case with Holmes and Watson)", "description": "James McCarthy is the only suspect in his father’s murder. Yet Sherlock Holmes and James’s childhood friend Alice Turner believe he is innocent. Can Holmes unveil the real story behind the murder in Boscombe Valley in time?"}]