[{"id": "1934649279", "genre": "Children's Books", "title": "The 5,000 Friends of Veronica Veetch", "description": "Precocious Veronica Veetch is worldly beyond her years. She talks about opera and oysters. She fences, ballroom dances, and ties nautical knots. When her classmates decide she's too snooty to be their friend, Veronica invites them to her house to embark on an around-the-world trip. Their surprise at what they find there is surpassed only by their newfound love of literature. This ode to bookish friendships, written in Seussian verse, turns ideas about social class on their heads and encourages children to look beyond the surface and into the heart."}, {"id": "1547015624", "genre": "Children's Books", "title": "NAPI and The Rock: Level 3 Reader", "description": "When NAPI gives his robe away to a rock -- then takes it back -- he learns a valuable lesson about sharing. This Level 3 book is perfect for the \"Eager Reader\". High interest stories for the developing reader. New vocabulary and longer sentences."}, {"id": "B00OBOALDW", "genre": "Children's Books", "title": "The Octopuppy", "description": "Can the OCTOPUPPY be the perfect pet?Edgar wanted a dog. Instead, he got an octopus named Jarvis.Jarvis is brilliant and does his best to act like the dog Edgar wants, but nothing he does is good enough to please Edgar. Ultimately, Edgar recognizes that while Jarvis might not be the dog he wanted, he is special in his own endearing way. Young readers will love the funny, imaginative illustrations that are paired with a relatable lesson of appreciating the greatness of what we have in front of us."}, {"id": "B005SN36KU", "genre": "Children's Books", "title": "Wild West (100 Facts)", "description": "Ride out along the Wild West trail and experience life on the American frontier!  The thrilling story of the Wild West is explored in detail through one hundred facts, fantastic images, and fun cartoons.  Read about Native American peoples and pioneers, learn how to pan for gold and take a closer look at cowboys, sheriffs, and notorious outlaws."}, {"id": "0613221028", "genre": "Children's Books", "title": "Nino and La Nina (Weather Channel)", "description": " It has been called the biggest weather phenomena of the century. And yet scientists don't know exactly what triggers it. What is El Niño and why does it result in such weather extremes? What is the difference between El Niño and La Niña? These questions and many more are answered in this book chock-full of fascinating facts, colorful photographs -- and so much more!"}]