[{"id": "0984516441", "genre": "Children's Books", "title": "Fish the Goldfish", "description": "Based on the real life of a little boy’s pet goldfish, this story tells a meaningful tale about the value of loving others more than self. Enjoy the vibrantly charming illustrations that bring this clever little fish to life, and watch how he transforms--both inside and out--as he travels from bowl, to tank, to pond!"}, {"id": "B0727PXF7B", "genre": "Children's Books", "title": "Cinco de Mayo for Beginner Readers (Seasonal Easy Readers for Beginner Readers Book 9)", "description": "Do you know why we celebrate Cinco de Mayo? Flo doesn't know, so she asks her Dad for help in finding out more about Mexico. Together they learn about the Battle of Puebla, which took place on 5 May, 1862."}, {"id": "0545056578", "genre": "Children's Books", "title": "Sign Language: My First 100 Words", "description": "A fresh new beginner's guide to American Sign Language--with a poster of the sign language alphabet!Featuring cool computer-generated illustrations and a simple kid-friendly design, this reference book for the youngest readers makes learning sign language fun and easy!  Learn 100 basic signs for everyday use in helpful categories, such as Food, Colors, Animals, In the Classroom, and more!  Also included are instructions on how to fingerspell the entire alphabet and numbers.For quick reference, this book also comes with a bonus full-size poster of the ASL alphabet--perfect for home or the classroom!"}, {"id": "0545685397", "genre": "Children's Books", "title": "Winter Turning (Wings of Fire, Book 7)", "description": "Daring mission... or deadly mistake?Winter has been a disappointment to his royal IceWing family his whole life. When his sister, Icicle, runs away from Jade Mountain Academy, fleeing terrible crimes and possibly planning to commit more, Winter knows that they both need a second chance to make things right -- if only he can find her.Winter’s new clawmates, Moon, Qibli, and Kinkajou, won’t let him make this dangerous journey alone. They don’t seem to understand that IceWings, the most superior of all dragon tribes, can fix their own problems. When their search leads the dragonets straight into Queen Scarlet’s vicious talons, Winter is grateful to have some help. But even the bravest dragons can’t follow him to the Ice Kingdom, where he’ll have to face the greatest threat of all: his own family."}, {"id": "0553523139", "genre": "Children's Books", "title": "Castle Caper (Wallykazam!) (Pictureback(R))", "description": "This full-color deluxe pictureback based on the Nickelodeon animated series Wallykazam! features over 30 stickers, collector cards, and a poster! Boys and girls ages 3 to 7 will love this book starring Wally Trollman and his pet dragon Norville."}]