[{"id": "1622850904", "genre": "Children's Books", "title": "Smokin' Muscle Cars (Fast Wheels!)", "description": "America's love affair with cars is most passionate when it comes to the fastest, most powerful, and coolest-looking models on the nation's roads. Author Bob Woods takes readers through the history of flashy \"muscle\" cars, such as the Pontiac GTO, Ford Mustang, Chevy Camaro, Dodge Charger, and Chevy Corvette."}, {"id": "B00K9NXPDM", "genre": "Children's Books", "title": "13: Volume One", "description": "\"13\" is a comic book series about a world where everyone receives a super power for one year at age 13. There are no rules for this year, however at age 14 your power leaves and you receive a score based on how you chose to live that year. That score stays with you for the rest of your life and determines every aspect of your place in society. \"13: Volume One\" contains issues 1 -5 plus bonus materials."}, {"id": "B00JETU3U0", "genre": "Children's Books", "title": "Fish On! (Lucky Luke's Hunting Adventures Book 5)", "description": "A perfect day on a magical lake filled with fish. The smell of pine trees, the bright sunshine, a nice breeze:  the stage is set for a great adventure! Join Luke at his grandparents' lake cabin, tucked way back in the woods, as he experiences an amazing morning of fishing. Luke has to find the hot spots, pick the right lures, and chase a lunker that steals his lucky Basserino. It's the kind of morning anyone who's ever held a rod dreams of!"}, {"id": "0996768327", "genre": "Children's Books", "title": "Ann Riley: The Irish Girl (First Children of Farmington)", "description": "How can Ann find a grandfather who's just right?With so many aunts and uncles, why doesn't Ann Riley have a grandfather? Her friend, Katie Murphy, has a special grandfather who tells stories and remembers all the things he did at home in Ireland. When Katie's little sister tells Ann that everyone has to have a grandfather, Ann decides to find one of her own. She asks all her neighbors to be her grandfather. But Green Leaf's grandfather doesn't speak the same language, the miller is too busy, the store owner too important, the cooper too fussy, the bagpipe player too loud, and Father Rehrl away too much. Who can be Ann's grandfather?"}, {"id": "0075692465", "genre": "Children's Books", "title": "Open Court Reading, Level 3, Book 1 (IMAGINE IT)", "description": "Designed for use during Workshop, workbooks provide quick support and extension activities for students."}]