[{"id": "087935089X", "genre": "Children's Books", "title": "Archaeology for Young Explorers: Uncovering History at Colonial Williamsburg", "description": "This well-illustrated book gives an insiders look at the work of archaeologists. Where do they dig? What do they find? How do they study the artifacts they discover? Grades 4-8, 67 pages."}, {"id": "0020420404", "genre": "Children's Books", "title": "Molly Pitcher: Young Patriot (Childhood of Famous Americans)", "description": "A childhood biography of the Pennsylvania German woman who became a Revolutionary War heroine when she carried water to American soldiers and even fired a cannon herself during the Battle of Monmouth."}, {"id": "B018U3NPOQ", "genre": "Children's Books", "title": "Surf Turf (Dogga Book 1)", "description": "Dogga is a cool surfing dude that all boys want to be and all girls want to be with.Dogga just wants to surf with his mates and have fun.  Is that enough or should he take responsibility for looking after others as well? Should we all make an effort to look after our planet?An enjoyable read for stage 3 readers as well as teenagers.  The book deals with relevant life issues for the young Australian."}, {"id": "B00LU4QX06", "genre": "Children's Books", "title": "Twenty-Four Henri Matisse's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Henri Matisse's Paintings. Twenty-Four Henri Matisse's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}, {"id": "0756947766", "genre": "Children's Books", "title": "Love to Mama: A Tribute to Mothers", "description": "Pat Mora edited and contributed to this beautiful and celebratory collection, in which thirteen poets write with joy, humor, and love about the powerful bond between mothers, grandmothers, and children. These poets represent a wide spectrum of Latino voices, from award-winning authors to a 15-year-old new talent. They write passionately about their Puerto Rican, Cuban, Venezuelan, and Mexican American backgrounds and the undeniable influence of their mothers and grandmothers. Illustrated with exuberance by Ecuadorian artist Paula S. Barragán M., Love to Mamá is sure to be embraced and treasured by everyone who wants to recognize mothers as one of our universal role models."}]