[{"id": "B01LTHXK6I", "genre": "Children's Books", "title": "Terminal: A Virals Novel", "description": "The gripping finale to Kathy and Brendan Reichs’ New York Times bestselling VIRALS seriesThe Virals are back—but they’re not the only pack in town anymore. Terminal finds Tory Brennan and the rest of the Morris Island gang tracking a pack of rogue Virals who call themselves the Trinity. The new pack was infected by a strain of supervirus created by Tory’s nemesis and sometimes-crush, Chance Clayborne, who accidentally infected himself, too.These red-eyed Virals have openly challenged Tory’s pack for domination of Charleston, and they’ll stop at nothing to bring their rivals down—even if that means giving them up to a shadowy government agency intent on learning the secret to the Virals’ powers. Surviving it all is going to test the limits of the gang’s abilities.In the riveting conclusion to the Virals series, Tory and the others are nearing an impossible choice—and the ultimate showdown."}, {"id": "1426303025", "genre": "Children's Books", "title": "Swifter, Higher, Stronger: A Photographic History of the Summer Olympics", "description": "Let the games begin again! Acclaimed sports writer Sue Macy’s comprehensive portrait of the Summer Olympics has now been fully updated for the 2008 games in Beijing, China. This new edition includes a complete retrospective of the 2004 Olympics in Athens, Greece. The new text will also incorporate updates to all charts and records, as well as fun facts and anecdotes from the most recent Olympics and training, making this a perfect Olympics history handbook as the 2008 Games unfold historically in China.Swifter, Stronger, Higher (Updated Edition) paints a dramatic and fascinating picture of the Summer Olympics. Absorbing narrative and vivid photographs tell stories of tragedy, triumph, scandal, and of course, action from over a century of the modern games! A foreword by sportscaster Bob Costas, five new interior photos (more than 100 total), at-a-glance information on each Olympiad, a map of Olympic sites, a chart of record-setters, and a rich guide to further resources round out this exceptional update to a gold-medal title."}, {"id": "1634712765", "genre": "Children's Books", "title": "Computer Store (21st Century Junior Library: Explore a Workplace)", "description": "Readers are introduced to the many careers available at a computer store. Colorful sidebars encourage children to think, create, guess, and ask questions about a career working in a computer store."}, {"id": "053122564X", "genre": "Children's Books", "title": "Mike Trout (Real Bios)", "description": "A latest entry in the accessible series describes how the Major League center fielder dreamed of following in his father's footsteps to become a professional player, sharing fun facts about his favorite foods, personal hobbies, secret fears and achievements with the Angels. Simultaneous."}, {"id": "1622432401", "genre": "Children's Books", "title": "Great Wall of China (Ancient Wonders, Reading Level 2)", "description": "Describes the Great Wall of China, an ancient wonder of the world, including the dynasties behind its construction, how it was constructed, what it was used for, and what it's like today."}]