[{"id": "B076GLF6WJ", "genre": "Science Fiction & Fantasy", "title": "The Shadow Weave (Spell Weaver Book 2)", "description": "Clio might be a nymph living in exile among humans. And she might possess the rare ability to mimic any magic she sees. And she might have just seriously ticked off the most powerful family of spell weavers in the Underworld.But she is not in love with an incubus.Lyre is the rebellious black sheep of said weaver family, and he's the only reason she survived her recent Underworld \"vacation.\" He's also the sexiest thing she's ever seen. Together, they have to track down a catastrophically dangerous magic—a magic he created, she sort of stole, and they both lost—before his family gets their hands on it. And that means fighting alongside him in a desperate attempt to avert complete disaster.But she is definitely not in love with him. At least, she's pretty sure she's not.Mostly sure.Maybe sure?…Crap.--The Spell Weaver Trilogy:The Night RealmThe Shadow Weave"}, {"id": "1560252715", "genre": "Science Fiction & Fantasy", "title": "Magic: The Gathering -- Official Encyclopedia, Volume 5: The Complete Card Guide", "description": "In association with Wizards of the Coast, the creators of Magic: The Gathering, and the Magic experts at Top Deck (Wizards' official trading-card game magazine) Thunder's Mouth Press announces the next volume in the essential reference series Magic: the Gathering-the Official Encyclopedia Volume 5. Magic: the Gathering, Encyclopedia 5 includes full-color reproductions of every new Magic card released since last October. Magic: the Gathering has sold billions of cards all over the world in English and dozens of translations. The huge number of Magic cards makes these encyclopedias must-haves for any serious player. They are invaluable reference guides, collecting all the cards in the latest expansions and including information crucial for collectors as well as history, rules, strategies, and techniques for playing the hottest fantasy game of the 90's - and of the new century."}, {"id": "B00CZFBDGI", "genre": "Science Fiction & Fantasy", "title": "A Tale of Two Dragons (Dragon Kin series)", "description": "\"A hot, hot series.\" --Library Journal\"Sizzling.\" --RT Book ReviewsBraith of the Darkness likes going through life unnoticed. Not an easy task for a She-dragon of royal descent. But the evil plots of her father are turning her quiet, boring life upside down, and she has now become the enemy of the most vicious queen her kind has ever known. But for once, Braith won't have to fight alone. Not when the warrior dragon of her dreams is willing to risk everything to save her neck. Addolgar the Cheerful wishes he could say he's helping the pretty royal strictly for honorable reasons--but he'd be lying. It's not his fault, though! He didn't tell Braith of the Darkness to have the most delicious tail he's ever seen! Yet before Addolgar can get his very strong claws on that tail, heads are going to roll. Just hopefully not theirs.  .  .\"A chest thumping, mead-hall rocking, enemy slaying brawl of a good book.\" --All Things Urban Fantasy on The Dragon Who Loved Me53,813 Words"}, {"id": "B01D8OPVSU", "genre": "Science Fiction & Fantasy", "title": "Knights of Black Swan (9 Book Series)", "description": "From Book 1: Winner BEST PARANORMAL ROMANCE SERIES the past four years in a row! - Reviewers Choice Awards, The Paranormal Romance Guild.  “My God, this is spectacular.” - Quote the Raven  New York Times and USA Today bestseller, Victoria Danann, introduces the epic saga that reset the gold standard for paranormal romance.   ***The knight who saved her life.  ***The sexy vampire hunter who believes she's his mate.  ***The sizzling hot, six-hundred-year-old vampire.  What's a girl who's an accidental traveler from another dimension to do? Elora Laiken escaped assassination in an experimental device that left her broken, physically and emotionally. She was deposited within the walls of a secret society of vampire hunters and paranormal investigators.  \"Rivals Black Dagger Brotherhood.\" - Fanatical Paranormal Romantical  Start reading TODAY! Find out why My Familiar Stranger has been called awesome, enchanting, enthralling, engrossing, and thrilling. And why it has OVER 1000 aggregate *****FIVE STAR REVIEWS."}, {"id": "B01D29CO0E", "genre": "Science Fiction & Fantasy", "title": "Children of Avalon: The Traveller Series Book One", "description": "In an alternate realm a darkness is stirring.On Earth a four year old Kyah was found in an abandoned house with no memory of who she was or how she got there. But all that changes twenty-one years later when she is shoved through a shimmering door into a realm of fantasy that she thought only existed as stories. Handed a mission by ancient powers, she must figure out how to defeat those intent on bringing the darkness into the light.In the realm of Avalon, Kyah finds strange and legendary new friends along with new found powers. These powers will help her and her new friends fight the darkness and save a town and its children. If she survives the encounter with the darkness she will be set on another path to find out who and what she is. This action-packed fantasy blurs the lines with science fiction twisting legendary heroes and mythical stories into a whole new multiverse.˃˃˃Scroll up and grab a copy today!"}]