[{"id": "B00WS1PAWC", "genre": "Children's Books", "title": "Rock-a-Bye Romp", "description": "Turning a beloved lullaby on its head, this wonderful read-aloud pairs playful text and enchanting paintings to create a rollicking escapade with a clever premise and a cozy conclusion.   “Rock-a-bye, Baby, in the treetop. How did you ever get so high up?”  That’s a good question—and this delightful book weaves a gentle fantasy around the baby who finds himself in that very predicament! A marvelous adventure ensues, taking Baby from the tree branches to a farm full of animals to a ride down the river, and finally on a flight through the night sky into the safety of Mama’s arms."}, {"id": "1882513983", "genre": "Children's Books", "title": "1: Short Stories", "description": "Short Stories /// This is a great Christian product sourced from BIML - Bible In My Language, the leader in foreign language Bibles and outreach materials from Baltimore, Maryland in the USA. BIML stocks Bibles in more than 600 languages."}, {"id": "1524716707", "genre": "Children's Books", "title": "Monster Mayhem! (Teenage Mutant Ninja Turtles) (Big Golden Book)", "description": "When a vampire and a werewolf attack New York City, it’s up to Nickelodeon’s Teenage Mutant Ninja Turtles to mash the monsters. Boys and girls ages 3 to 7 will be thrilled with this full-color Big Golden Book.   Jump into action with Nickelodeon’s Teenage Mutant Ninja Turtles! These four ninja brothers stand together to protect their city—and their planet—from the forces of evil! Join Leonardo, Raphael, Michelangelo, and Donatello for nonstop ninjutsu action as they face off against mutants, aliens, and The Shredder himself!"}, {"id": "0894905171", "genre": "Children's Books", "title": "Top 10 Hockey Scorers (Sports Top Ten)", "description": "Profiles ten professional hockey players who have compiled the highest individual scoring records, from Phil Esposito and Wayne Gretzky to Bobby Orr and Maurice Richard"}, {"id": "154042071X", "genre": "Children's Books", "title": "2: Best Loved Bedtime Stories: Second Volume (Volume 2)", "description": "This second book contains a collection of beautiful bedtime stories. Please see below table of contents: Youth without Age and Life without Death - 03 The Princess and the Fisherman - 12 The Little Purse with Two Half-Pennies - 17 Cunning Helen - 21 The Fairy Aurora - 31 Tellerchen - 65 Mother’s Darling Jack - 73 The Poor Boy - 83 The Two Step Sisters – 98 The Morning Star and the Evening Star - 104 The Pea Emperor - 110 The Old Woman and the Old Man - 116 The Voice of Death - 118 Little Wild-Rose – 121 Marivaux and His Son - 130 The Twins with the Golden Star - 135 The Wonderful Bird - 143 Stanley the Silly Man - 152"}]