[{"id": "B075G4NP5N", "genre": "Children's Books", "title": "I Love You, Michigan Baby", "description": "“Michigan Baby, I love you so much. My love for you is longer than the Mackinac Bridge and taller than a lighthouse. My love for you is brighter than the city lights and as peaceful as a day in our Michigan forests.” And so it reads in this adorable book about all things Michigan. Cuddly and warm illustrations capture the joy and excitement of being a baby in the Great Lakes State, and the loving text and sweet verses make I Love You, Michigan Baby a love letter to all of Michigan’s newborns and tiny visitors alike.  "}, {"id": "0545909570", "genre": "Children's Books", "title": "Set the Stage! (Tiny Geniuses #2)", "description": "Great minds think alike . . . Jake's class is gearing up for Living History Night. Every student has to do a report about a famous person in history on stage, in front of the whole school. But Jake has major stage fright . . . POP! Fortunately, Jake has some tiny geniuses to help him break a leg! First Lady of Song Ella Fitzgerald and Founding Father Benjamin Franklin know just what Jake needs. But can they help him without spilling the secret of the magic wishing well?"}, {"id": "1772780278", "genre": "Children's Books", "title": "The Theory of Hummingbirds", "description": "\"Hummingbirds and angels don't need two good feet. They have wings.\" That's what Alba's mother always says. Of course, Alba doesn't have wings or two good feet: she has Cleo. Cleo is the name Alba has given to her left foot, which was born twisted in the wrong direction. When she points this out, though, her mother just smiles like the world has some surprise in store she doesn't know about yet.Well, Alba has her own surprise planned. After one final surgery and one final cast, Cleo is almost ready to meet the world straight on―just in time to run in the sixth grade cross-country race. Unfortunately, Alba's best friend Levi thinks there's no way she can pull it off. And she thinks there's no way he’s right about the school librarian hiding a wormhole in her office. Tempers flare. Sharp words fly faster than hummingbirds. And soon it looks like both friends will be stuck proving their theories on their own. (Publisher)"}, {"id": "0375869573", "genre": "Children's Books", "title": "The Tree Doctor (Dr. Seuss/Cat in the Hat) (Step into Reading)", "description": "Join Dr. Seuss'  Cat in the Hat as he and Dr. Twiggles help Sally and Nick figure out why their tree won't grow in this Step-Into-Reading book that's perfect for springtime reading, and yes-even pancake breakfasts!A trip underground in the Thinga-ma-jigger is undertaken, and sure enough, the maple tree needs water (which Things One and Two procure in ridiculous overabundance) and sun (which the Cat suppliments with a Brighta-ma-lighter). But as for getting syrup from the young sapling? That will take some 40 years! Written specifically for children learing how to read with help, this Step into Reading book is based on an episode of the PBS Kids preschool science show The Cat in the Hat Knows a Lot About That! It is perfect for springtime reading, Earth and Arbor Day celebrations, and yes—even pancake breakfasts!"}, {"id": "B003F3FJVY", "genre": "Children's Books", "title": "A Spotlight for Harry (A Stepping Stone Book(TM))", "description": "Harry Weiss—later known as Harry Houdini—is enthralled when the circus comes to his Wisconsin town. He loves all the acts, but his favorites are the tightrope and the amazing trick where a man hangs from a rope by his teeth! Harry and his brother decide to try circus tricks in a nearby barn, and although Harry’s headstrong determination leads him into trouble, it also opens up a whole new world. In this evocative story, Eric A. Kimmel tells how Harry Weiss discovered his love for performing, many years before he became world famous. History Stepping Stones now feature updated content that emphasizes Common Core and today’s renewed interest in nonfiction. Perfect for home, school, and library bookshelves!"}]