[{"id": "0446675601", "genre": "Science Fiction & Fantasy", "title": "Midnight Robber", "description": " \"Deeply satisfying...succeeds on a grand scale...best of all is the language....Hopkinson's narrative voice has a way of getting under the skin.\"--The New York Times Book Review\"Caribbean patois adorns this novel with graceful rhythms...Beneath it lie complex, clearly evoked characters, haunting descriptions of exotic planets, and a stirring story...[This book] ought to elevate Hopkinson to star status.\" --Seattle TimesIt's Carnival time and the Caribbean-colonized planet of Toussaint is celebrating with music, dance, and pageantry. Masked \"Midnight Robbers\" waylay revelers with brandished weapons and spellbinding words. To young Tan-Tan, the Robber Queen is simply a favorite costume to wear at the festival--until her power-corrupted father commits an unforgiveable crime.Suddenly, both father and daughter are thrust into the brutal world of New Half-Way Tree. Here monstrous creatures from folklore are real, and the humans are violent outcasts in the wilds. Tan-Tan must reach into the heart of myth and become the Robber Queen herself. For only the Robber Queen's legendary powers can save her life . . . and set her free."}, {"id": "1568820917", "genre": "Science Fiction & Fantasy", "title": "Pulp Cthulhu (Call of Cthulhu Roleplaying)", "description": "Pulp Cthulhu is a game of two-fisted adventure, weird science, dark deeds, and brave heroes. With this book, some roleplaying dice, and the Call of Cthulhu Rulebook, you have everything you need to adventure and explore games set in the pulp genre. Tired of your investigators dying in quick succession when jaunting around the world in a desperate bid to save humanity? Wishing that sometimes your investigator could make a stand instead of hiding and waiting for the eldritch horror to pass? Pulp Cthulhu ups the ante and provides you with tougher, more capable heroes ready to take on the villainous machinations of the Cthulhu Mythos! Here you will find an adapted character generation system, rules for psychic powers, sanity, augmented skills, and weird science, as well as tips for Keepers on developing and running pulp-style games. Also, you will find information on the Pulps themselves and the 1930s era when America was in the grip of the Great Depression and on the road to World War II. A collection of pulp villains and monsters, and a range of pulp organizations provide the Keeper with a firm basis for running pulp style scenarios and campaigns. Four action-packed scenarios round out the book, getting your Pulp Cthulhu games started with a bang. The guidance in this book means that you can apply the Pulp Cthulhu rules to any setting and time period, enabling Keepers to bring the flavor and action of pulp to the classic 1920s or modern-day eras, as well as anywhere else they see fit. A Time For Heroes And A Time For Adventure!"}, {"id": "B00HWNQ70U", "genre": "Science Fiction & Fantasy", "title": "The Bogs of Barf", "description": "A writer needs to write a book and ends up having a crazy, hilarious ride through the Bogs of Barf!  Three-eyed tax collectors, crazy despots and talking cats are just some of the bizarre things encountered...\"This has to be one of the funniest books I've ever read.  I laughed out loud so many times I almost got myself thrown out of Starbucks.  I’m a 64-year-old writer of kids' books and this book is perfect for the kid at the center of my being.  It’s beautifully written, witty, and irreverent, very well-plotted—two worlds that begin to leak into each other and a hero with a wicked sense of humor, and if you love in-jokes about the world of writing this is the book for you.  I couldn't recommend it more highly.\"  — S. Kehde (Max Beetle and The Magnificent Mutants)"}, {"id": "1501117041", "genre": "Science Fiction & Fantasy", "title": "Of Love and Shadows: A Novel", "description": "This profoundly moving tale of love, bravery, and tragedy by New York Times bestselling author Isabel Allende brings to life a country ruled with an iron fist—and the men and women who dare to challenge it.Irene Beltrán is a force to be reckoned with. As a magazine journalist, an unusual profession for a woman with her privileged upbringing, she is constantly challenging the oppressive regime. Her investigative partner is photographer Francisco Leal, the son of impoverished Spanish Marxist émigrés. Together, they are an inseparable team and—despite Irene’s engagement to an army captain—form a passionate connection. When an assignment leads them to uncover an unspeakable crime, they are determined to reveal the truth in a nation overrun by terror and violence. Together, they will risk everything for justice—and, ultimately, to embrace the passion that binds them."}, {"id": "1549603221", "genre": "Science Fiction & Fantasy", "title": "5e Mythic Classes (Heroic 5e)", "description": "Command the fury of storms, summon your own sentient weapon, learn the secrets of shapeshifting, or forge a wondrous suit of mechanical armor! For the first time, 5e Mythic Classes has the tools players and Game Masters need to create characters who can master all of these abilities (and more!), with five all-new mythic character classes. Each mythic class features a complete character advancement path that includes new abilities at every level, from 1st to 20th level."}]