[{"id": "1538456915", "genre": "Children's Books", "title": "Control Freak: Library Edition (King of Bench)", "description": "In the second book of this new middle grade series by the nationally syndicated cartoonist of In the Bleachers, Steve reprises his role as perpetual bench-warmer. Perfect for fans of Timmy Failure and Diary of a Wimpy Kid, King of the Bench is an ode to teammates, underdogs, and bench-warmers everywhere.Steve is King of the Bench. No brag. That's just a fact. And this season, Steve and his friends are ready to sit on the sidelines of the Spiro T. Agnew Middle school football field. But then they stumble upon an old-school video game controller, and they become convinced it can control sports plays. With it, Steve might become King of Football too!Oh, and if you're wondering why Steve would write a book and tell complete strangers about a mysterious magic device that pretty much controlled his first season on the football team, too bad! It's a strict rule when writing a book that you have to build suspense first."}, {"id": "168415006X", "genre": "Children's Books", "title": "Over the Garden Wall Vol. 2", "description": "Two lost brothers venture across a strange forest and discover incredible and bizarre things on their journey home in a style reminiscent of The Wind in the Willows and Sleepy Hollow.Wirt and Greg find themselves at a crossroads in the Unknown and it looks like the brothers will each have to take his own path. With the liklihood they’ll come across fantastical creatures or ghastly towns, it doesn’t matter which path is chosen when something far more sinister is on their tail... Eisner Award-winning cartoonist Jim Campbell returns To Over the Garden Wall with short stories by Danielle Burgos (Over The Garden Wall), Cara McGee (Clarence), George Mager (Uncle Grandpa), and introducing Kiernan Sjursen-Lien, in these not-to-be-missed adventures based on the Emmy award-winning show from Cartoon Network."}, {"id": "1538214830", "genre": "Children's Books", "title": "Forces (Science in a Flash)", "description": "Anyone who learns about the force of gravity in our lives has probably wondered what it's like to be weightless. In this volume, readers can find out the incredible impact gravity and other forces, such as magnetism, have on their life every day. Each chapter gives an accessible overview of the topic and then invites readers to dive deeper with relatable photographs, diagrams, sidebars, and fun facts. Through riddles, pop quizzes, and simple experiments, the book encourages readers to engage with the information they're learning in order to understand it better for both class and life on Earth."}, {"id": "B009PFN83C", "genre": "Children's Books", "title": "Say Good-bye #5 (Vet Volunteers)", "description": "Yum-Yum is an adorable shih tzu and one of Zoe’s favorite clients. When Zoe and Yum-Yum visit a ward of cancer patients, she is amazed by how much joy the tiny dog can spread in an instant. But then Yum-Yum is diagnosed with cancer himself. How can Zoe help the little dog pull through?"}, {"id": "0060765461", "genre": "Children's Books", "title": "The Lion, the Witch and the Wardrobe Movie Tie-in Edition (The Chronicles of Narnia)", "description": "They open a door and enter a world. Narnia ... the land beyond the wardrobe, the secret country known only to Peter, Susan, Edmund and Lucy ... the place where the adventure begins. Lucy is the first to find the secret of the wardrobe in the Professor's mysterious old house. At first, no one believes her when she tells of her adventures in the land of Narnia. But soon Edmund and then Peter and Susan discover the magic and meet Aslan, the Great Lion, for themselves. In the blink of an eye, their lives are changed forever. Enter this enchanted world countless times in The Chronicles of Narnia. There are seven books in all: The Magician's Nephew The Lion, the Witch and the Wardrobe The Horse and His Boy Prince Caspian The Voyage of the Dawn Treader The Silver Chair The Last Battle "}]