[{"id": "B0178I4ICC", "genre": "Children's Books", "title": "Tess and Her Talking Kittens:  \"We Can Cheer You Up, Tess!\"", "description": "This is a book about a little girl named Tess.  A few weeks ago, Tess became a big sister to her new little brother.  Tess loved her little brother, but she found herself a little jealous of the time Mom and Dad spent with him.  Tess spent a lot of time outside playing with her four kittens.  She loved her kittens very much.  The kittens sensed that Tess was sad, and they decided to help cheer her up.  That was when Tess discovered that her kittens could talk.  The kittens helped her to understand that her parents loved her just as much as they loved her little brother.  Tess was so excited that her kittens could talk.  She couldn't wait for all the adventures they would have in the future.  This is a great book for kids 4-10 years old.  It has lots of cute, colorful illustrations."}, {"id": "B00GVDEOSE", "genre": "Children's Books", "title": "Artist You Should Know: Profiles for Kids", "description": "This book contains six short profiles of six famous artist. Included profiles:CaravaggioClaude MonetEdvard MunchFrida KahloRembrandtSalvador Dali"}, {"id": "0544785835", "genre": "Children's Books", "title": "Charlotte the Scientist Is Squished", "description": "Charlotte is a serious scientist. She solves important problems by following the scientific method. She has all the right equipment: protective glasses, a lab coat, a clipboard, and a magnifying glass. What she doesn’t have is space. She has so many brothers and sisters (she is a rabbit, after all) that she is too squished to work on her experiments! Can she use science to solve her problem? This funny, satisfying story is a playful introduction to the scientific method and perfect for sparking an interest in STEM subjects.  "}, {"id": "1633624110", "genre": "Children's Books", "title": "Mammoth and Mastodon (21st Century Junior Library: Dinosaurs)", "description": "In this book, simple, age-appropriate text introduces readers to mammoths and mastodons, from what they looked like to how they lived. Large, exciting images fill the pages, while sidebars encourage students to ask questions and think critically about information presented in the text. Additional tools, including a glossary and index, help students build new vocabulary and locate information."}, {"id": "0198452098", "genre": "Children's Books", "title": "Oxford Reading Tree: Stage 5: More Storybooks: Teaching Notes B", "description": "\"Teacher's Note Booklet\" is included free in every pack of six \"Oxford Reading Tree\" stories from Stage 1-9. They are also available to buy singly. For easy classroom management, each booklet is the same size as the pupil books at that stage. Every story has individual notes and suggested activities for group and independent reading, speaking and listening, and writing. Cross-curricular links are also suggested. Each \"Teacher's Note Booklet\" contains a vocabulary chart of NLS high frequency words and context words, and a curriculum coverage chart for England, Wales, Northern Ireland and Scotland."}]