[{"id": "1554484642", "genre": "Children's Books", "title": "The 10 Vilest Movie Villains", "description": "Profiles ten characters that filmgoers most love to hate, including the Wicked Witch of the West, the Terminator, and the great white shark from \"Jaws.\""}, {"id": "1941697216", "genre": "Children's Books", "title": "DLee's Snow Day: The Snow Kids & Curious Cat Bilingual Story", "description": "A winter tale featuring the character DLee, her brother Angel, and her curious cat, Mr. Mustache. Published as a bilingual story, in both English and Spanish, this story captures the beauty and magic of a child's first snowfall.     "}, {"id": "1477788123", "genre": "Children's Books", "title": "Hernan Cortes: Conquistador, Colonizer, and Destroyer of the Aztec Empire (Spotlight on Explorers and Colonization)", "description": "The legacy of Hernán Cortés, who famously conquered the formidable Aztec Empire, lives on to this day. This title traces his eventful life, introducing readers to an array of intriguing figures, such as Moctezuma, La Malinche, Cuautemoc, and Diego Velázquez de Cuéllar. Learn how important the alliances that Cortés made with the Aztecs’ native enemies proved and how the initially cordial relationship between the Spanish and the Aztecs deteriorated. The title explains how Cortés, like many conquistadors, became a polarizing figure in the centuries after his deeds and death and explores the reasons for the controversy surrounding him."}, {"id": "B00BRA521Y", "genre": "Children's Books", "title": "Sharks and Other Fish (Adapted for Success)", "description": "Sharks are among the most ferocious predators in the oceans, but how have they, and other fish, adapted to become so successful? The series explores how some of our favorite animals are uniquely adapted to their environment. Each book looks at the various ways in which different species have adapted to their surroundings and covers habitat, defenses, camouflage, and the way animals find food."}, {"id": "050065106X", "genre": "Children's Books", "title": "The Big Book of Beasts", "description": "A beautifully illustrated, informative book for children introducing them to a fascinating cast of beastsIn The Big Book of Beasts Yuval Zommer’s wonderful illustrations bring to whimsical life some of the grizzliest, hairiest, bravest, wiliest, and most fearsome beasts in the animal kingdom. Brimming with interesting facts from beast consultant Barbara Taylor, this charming picture book is a beautiful way for parents to introduce young children to the animal world―and for older children to learn by themselves.In the first pages children learn that beasts are wild animals that can’t be tamed and that they all defend themselves in different ways. As the book continues young readers meet specific beasts, including armadillos, bears, tigers, and the Tasmanian devil. The Big Book of Beasts also approaches the world of beasts thematically, looking at mythical beasts, Ice Age beasts, beasts on your street, and how to save beasts in danger of extinction.The funny and conversational text, amazing facts, and glorious and quirky pictures will draw in young children over and over again. Illustrated in color throughout"}]