[{"id": "B00DGZKTAW", "genre": "Children's Books", "title": "A Mom For Umande", "description": "The heart-tugging true story of how a baby gorilla found love in the arms of a surrogate mom When Umande was born, his mother didn’t know how to take care of him. So, he was hand-reared by keepers at the Cheyenne Mountain Zoo in Colorado Springs. For eight months, the keepers crawled on the ground with him to show him how to walk; coughed in his face to teach him discipline; and gave him happy gorilla grumbles to encourage him. But for Umande, something was still missing. Luckily, a thousand miles away at the Columbus Zoo, a mom was waiting just for him.This touching true story about finding a family will resonate with animal lovers and adoptive families alike. Share this book with fans of Owen & Mzee, Tarra & Bella, and Knut."}, {"id": "0688125921", "genre": "Children's Books", "title": "Favorite Fairy Tales Told in Germany (Favorite Fairy Tales Series)", "description": "Seven well-known German tales: The Frog Prince, The Elves and the Shoemaker, Rapunzel, The Cat and the Mouse in Partnership, Rumpelstiltskin, Hansel and Gretel, and The Bremen Town Musicians."}, {"id": "0749630701", "genre": "Children's Books", "title": "The Heart (Under the Microscope)", "description": "Under the Microscope is a series which provi des a close-up view of the human body and how it works. This title looks at the heart and how blood gets around the body . '"}, {"id": "0756612098", "genre": "Children's Books", "title": "Let's Go to the Ballpark (DK READERS)", "description": "Follows a family to a baseball game where they root for the home team, sing the National Anthem, catch a fly ball, and buy some souvenirs."}, {"id": "0307264033", "genre": "Children's Books", "title": "The Magic of Merlin", "description": "In the days of knights and castles, one man knew all the secrets of magic. His name was Merlin. Merlin saw the future. He cast powerful spells. He brought King Arthur to the throne and helped him rule England. Together Merlin and Arthur made history—and became legend.Kids who love magic won’t want to miss this story of Merlin, the greatest magician ever, and his friendship with the once and future king, Arthur, with its beautiful full-color illustrations of Camelot, magic objects, and knights in shining armor.Stephanie Spinner is the author of the popular early chapter book trilogy Aliens for Breakfast, Aliens for Lunch, and Aliens for Dinner, as well the well-reviewed novel for children, Quiver. The author lives in New York, NY.Russian-born Valerie Sokolova is finding a new home in the American publishing industry with her elaborate illustrations, such as the ones in the Golden Treasury of Christmas Joy. She lives in Brooklyn, NY."}]