[{"id": "141090363X", "genre": "Children's Books", "title": "Space (Extreme Survival)", "description": "Research on the Edge: Space is a gripping look the vital research scientists carry out in the final frontier, and the incredible technology that enables them to live and work in such a dangerous place. Space also explains how this research can increase our understanding of other planets, expand our knowledge of the universe, and discover untapped resources. Sidebars highlight the latest technologies and perils scientists face."}, {"id": "1465429239", "genre": "Children's Books", "title": "Children's Book of Philosophy", "description": "Children are great at asking the big questions: Where did I come from? Why does the world exist? What is real? Encourage your child's curiosity with DK's Children's Book of Philosophy, a kid-friendly handbook to some of life's biggest questions - because it's never too early to start thinking about thinking. The Children's Book of Philosophy lays out philosophical questions with engaging graphics that are fun and easy for kids to process. We've included biographical information, timelines, and conceptual thinking, all with inviting images. Children learn that their questions are important and have been pondered by famous philosophers for years. The content is geared toward the specific questions of 21st-century kids, so the information is relevant and interesting. Looking for a child's first philosophy book to encourage your young thinker? With the Children's Book of Philosophy, you've found it!"}, {"id": "0312674309", "genre": "Children's Books", "title": "The Fantastic Secret of Owen Jester", "description": "Owen Jester wishes his family hadn't moved to his grandfather's house after his dad lost his job. For one thing, his grandfather's live-in nurse sure knows how to ruin anyone's idea of a good time. And then there's Viola, the girl next door, who can't ever mind her own business. She even thinks Owen should put his freshly captured bullfrog back into the pond. Then late one night, Owen hears a curious noise when the train passes by his grandfather's house. Something mysterious and wonderful has fallen off the train. When Owen finally discovers what it is, he realizes he just might need a know-it-all after all. But can he trust Viola keep the most fantastic secret to ever tumble into Carter, Georgia?This title has Common Core connections."}, {"id": "B00TCOZUYQ", "genre": "Children's Books", "title": "JAPANESE FAIRY TALES (Annotated)", "description": "This is a book of \"beautiful legends and fairy tales of Japan\" that were collected, translated and retold by the author, Yei Theodora Ozaki, who states: \"...in telling them I have also found that they were still unknown to the vast majority, and this has encouraged me to write them for the children of the West.\" In part, the project was the result of a suggestion made by her friend Andrew Lang, another collector of fairy stories, who printed his stories in the many Colored Fairy Books."}, {"id": "1593598890", "genre": "Children's Books", "title": "Good To Go! Placemat Activity Set (Activity Books)", "description": "Family eating out? Serve up 48 placemats of fun! Good to Go! Placemats are packed with connect-the-dots, mazes, riddles, mindbenders, word searches, Sudoku, and coloring pages. Peel placemats off the hard-backed pad and you'll have enough activities to keep kids occupied through many a mealtime! Easy to store in the car for fun on the road, whether on vacation road trips or cross-town errands. Ages 3 and up. 48-1/2'' wide x 9'' high placemats with 24 different pages of games and 4 different coloring page designs. Includes 8 crayons and see-through 13'' wide x 10'' high plastic carrying case with handles."}]