[{"id": "0001979086", "genre": "Children's Books", "title": "Castles (Faxfinder)", "description": "Contains useful facts, useless facts and humorous facts for children to collect, organize and personalize. The book is one of a series and can be used to build a personalized encyclopaedia. This edition looks at castles."}, {"id": "1368010261", "genre": "Children's Books", "title": "Vampirina Vee is for Valentine: 8x8 with Punch-out Cards", "description": "What could be more fun than celebrating Valentine's Ghoulentine's Day with Vampirina and her friends? This adorable tale is based on a Valentine's Day-themed episode and comes with punch out cards!"}, {"id": "0762401850", "genre": "Children's Books", "title": "The Classic Hans Christian Andersen Fairy Tales (Children's storybook classics)", "description": "Presents versions of Andersen's beloved tales, including \"The Emperor's New Clothes,\" \"Thumbelina,\" \"The Little Mermaid,\" \"The Ugly Duckling,\" and others."}, {"id": "B0731L556F", "genre": "Children's Books", "title": "The Dream of the African Child", "description": "Sitting and waiting for something good to happen to you might turn out to be an effort in futility. This is the story of chinedu Ibe, a young African graduate who left school and searched for job. He moved from one church to another in search of God's favour and grace, but when it dawned on him that he needed to make changes in his pursuits. His decision led him to creating a multi-billion Naira company in Nigeria. He shares his story in this book to inspire millions of Africans and other young adults in search of happiness."}, {"id": "193520453X", "genre": "Children's Books", "title": "The Storyteller: My Years with Ernest Thompson Seton", "description": "In the 1930s, the parents of six-year-old Leila sent her from their home in California to live with relatives in New Mexico, hoping the drier climate would restore her health. Reluctant to leave her family, she soon realized she had embarked on a grand adventure. She spent the next three years living with her aunt Julie and her uncle, whom she called ''Granddaddy.'' The rest of the world knew Granddaddy as Ernest Thompson Seton, noted author, artist, environmentalist, and co-founder of the Boy Scouts of America. Throughout the years Leila lived with him, he taught her about the wildlife in the area, took her on exciting trips, and shared both his reverence for all living things and his profound respect for Native American cultures. Granddaddy was also a masterful storyteller, and excerpts of his stories--which remain as fresh and enchanting as ever more than 100 years after their publication--are adroitly woven into the memoir. This chapter book will appeal to children and adults alike."}]