[{"id": "1610803493", "genre": "Children's Books", "title": "Your Healthy Plate: Protein (21st Century Basic Skills Library, Level 3)", "description": "This new series highlights the five food groups and oils contained in the new dietary guidelines for Americans, launched in January 2011 by the FDA. This leveled reader series helps young children understand the importance of a balanced diet."}, {"id": "1423640748", "genre": "Children's Books", "title": "All Aboard! New York: A City Primer", "description": "From bestselling children's cookbook author Barbara Beery comes a delightful new cookbook created just for aspiring sprites, elves, gnomes and nymphs! Fairies Cookbook brings a bit of fantasy and magic to everyday snacks and treats, while teaching valuable cooking skills and encouraging kids to develop a love for creating their own food. Fairies Cookbook transforms everyday fare into mystical treats for birthday parties, sleepovers, and special occasions-and these recipes are easy enough to use everyday! Fairies Cookbook offers recipes such as Cookie Fairie Masks, Fairie Fruit Wands, Sugar Cone Fairie Hats, Fruity Fairie Castles, Raindrop Punch, and many more. Children's cooking expert Beery also includes dozens of tips and ideas for creating a variety of enchanting fairie-themed parties. "}, {"id": "0375856633", "genre": "Children's Books", "title": "Calendar Mysteries #3: March Mischief", "description": "It's a mystery every month from popular A to Z Mysteries author Ron Roy! With the younger siblings of the A to Z Mysteries kids!March is for Madness...In the third book of the Calendar Mysteries - an early chapter book mystery series - it's St. Patrick's Day in Green Lawn. Bradley, Brian, Nate, and Lucy dress up a leprechaun statue for the town's yearly contest. They leave it out on the porch overnight, but the next morning, it's missing! And theirs isn't the only one. All over town, leprechauns are disappearing. Who is behind the mischief? It will take four kids and the luck of the Irish to find out. Parents, teachers, and librarians agree that these highly collectible chapter books are perfect for emerging readers and any kid who loves mysteries!"}, {"id": "B007MDF850", "genre": "Children's Books", "title": "A Rumor of Real Irish Tea", "description": "A twist in fortune has landed Oliver Dunn and his handler Emily at the Prometheus Institute's F Campus, where aspiring delinquents and bureaucratic red tape abound. Meanwhile, Oliver's sworn enemies, Hawk, Hummer, Honey, and Happy West, continue to chase rumors of the mysterious Altair, much to the ire of the GCA. When a stringent military general decides to end the Wests' mischief once and for all, Oliver is again enlisted to help. Together with a disgruntled classmate, a charming news reporter, and a know-it-all administrative assistant, Oliver must outsmart the Wests to restore order and his tarnished reputation in this follow-up adventure to A Boy Called Hawk."}, {"id": "B00G08TIEU", "genre": "Children's Books", "title": "It's a Day for Ski and Play", "description": "Follow this delightful illustrated children's book as a young girl wakes one morning to find new snow and blue skies, explaining to all that it's a \"Bluebird Powder Day\". As the family makes their way to their favorite ski area to play in the new snow, they enjoy both their time to be young at play and their precious time together. The musical rhymes and tactile illustrations easily transport you to that special place where you act and feel like a kid enjoying a day in the mountains. It's a Day for Ski and Play ends with the feeling of contentment as Brother collapses in bed with his best friend dreaming of his next big adventure. Author Terri Woods lives in the heart of the Cascade Mountains with her favorite ski partners, her husband and her two boys. This book was written especially for all the future little skiers out there and their families to remember, never stop playing….."}]