[{"id": "B005MWKIHQ", "genre": "Children's Books", "title": "100  Prayers God Loves to Hear, 100 Praise Songs", "description": "In 100 Prayers, 100 Praise Songs, best-selling author Stephen Elkins brings an exciting and educational way for children to learn about prayer by teaching them 100 prayers to pray to God and providing 100 songs to sing Him praises. God loves to hear from His children and this book will help kids feel comfortable talking to God and singing praise to Him.  Prayers include classic prayers such as \"Now I Lay Me;\" Biblical prayers such as \"The Lord's Prayer;\" topical prayers such as how to pray when I am afraid or what to pray when I am thankful; and prayers from famous believers.  Familiar Bible verses tell of God's promises and encourage little ones to talk to Him every day. This is a great resource to help kids memorize 100 Bible verses.  Includes two CDs with 100 new praise songs written and recorded by Grammy-nominated producer, Stephen Elkins."}, {"id": "1538211394", "genre": "Children's Books", "title": "Hockey Stats, Facts, and Figures (Do Math With Sports Stats!)", "description": "Hockey is an exciting sport that takes place entirely on ice. It's also full of math. From the goals and assists that fill the scoresheet to the fractions and other math concepts that come from percentages, hockey has a litany of numbers to explore. Readers take the ice for themselves and solve problems that puzzle scorekeepers and hockey superfans, learning the math they need to keep up with their favorite sport."}, {"id": "197427067X", "genre": "Children's Books", "title": "Welcome Back To School Journal: Back To School Notebooks (School Supplies For Students)(Notebooks for School)(Composition College Ruled 8.5 x 11)(V35)", "description": "Cute & Cool Composition College Ruled NotebooksThis awesome school journal for kids and college students has 120 lined pages measuring 8.5 x 11 with a matte cover people will be jealous of. Stop buying those boring composition books and grab one of these funny themed school notebooks.Great gift ideas for teachers, kids, teens, women and men. Perfect for back to school supplies, birthday gifts, Christmas gifts or even Coaches gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "0613061209", "genre": "Children's Books", "title": "The Victorian Home (Turtleback School & Library Binding Edition) (Historic Communities (Pb))", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Takes a look at the various rooms in a grand Victorian house, explaining the design and purpose of each and describing the furniture, lighting, and decorations used in the context of daily life during the second half of the nineteenth-century."}, {"id": "1551436825", "genre": "Children's Books", "title": "Lucky's Mountain (Orca Young Readers)", "description": "The year is 1935 and Maggie Sullivan's world has fallen apart. Maggie has grown up in a close-knit mining community perched atop a mountain in British Columbia. But now her father has been killed in a mine explosion and she is being forced to leave the only home she has ever known. To make matters worse, she must also leave behind her best friend Lucky, the three-legged dog that was a special gift from Pa."}]