[{"id": "1684151619", "genre": "Children's Books", "title": "Charles M. Schulz' Snoopy (Peanuts)", "description": "Charles M. Schulz's Peanuts continue with brand new adventures and classic tales! Featuring a best of collection Snoopy’s comic book adventures.Celebrate over sixty-five years of Charles M. Schulz’ Snoopy with this jam-packed collection of stories starring everyone’s favorite beagle! From the top of the dog house to the skies with the World War I Flying Ace, these adventures are not to be missed."}, {"id": "1781992681", "genre": "Children's Books", "title": "The Story of Saint Patrick", "description": "Kidnapped as a boy and sold into slavery in Ireland, Patrick spent many brutal years away from his family and friends and should have hated the Irish people. Yet having escaped, he was drawn back to challenge the High King, his warriors and the great druids who fought against him with all their magic powers. This was a battle Patrick had to win and it changed a way o f life forever."}, {"id": "0997033460", "genre": "Children's Books", "title": "Reptiles vs. Amphibians", "description": "GECK, PYRO, CAMILIA, AND THORN; who are they? They are the Reptiles, of course! These four mutated teenagers have joined together to defeat the evil Amphibians. Which side is superior? Find out in...Reptiles vs. Amphibians."}, {"id": "1621271994", "genre": "Children's Books", "title": "The Migration North (Black History)", "description": "\"Presents information regarding the migration of African Americans from the southern states to the northern states from 1916 to 1970, including key events, and influential people and groups. Intended for fifth to eighth grade students\"--Provided by publisher."}, {"id": "0756645212", "genre": "Children's Books", "title": "DK Readers L1: LEGOÂ® DUPLO: Around Town", "description": "Together with LEGO(r) DUPLO(r) hugely popular building-bricks brand for preschoolers-DK brings stories, coloring, stickers, and building fun to the youngest of readers.  In Let's Build! cranes, backhoes, bulldozers, and more build their way through a construction site.  LEGO, the LEGO logo and DUPLO are trademarks of the LEGO Group. (r) 2009 The LEGO Group. Produced by Dorling Kindersly under license from the LEGO Group."}]