[{"id": "1554550467", "genre": "Children's Books", "title": "Tim Horton: From Stanley Cups to Coffee Cups (Larger Than Life)", "description": "  Rocky Mountain Book Award Shortlist, 2011    No Canadian can fail to recognize the name Tim Horton. For many, however, the name suggests coffee and donuts, especially \"donuts with sprinkles\". But Tim Horton was more than that. He was a tough but fair sportsman renowned as the \"strongest man in hockey\". This junior biography presents his true story to young Canadian readers.   "}, {"id": "1938591194", "genre": "Children's Books", "title": "Neymar The Wizard", "description": "Neymar the Wizard is the fascinating coming-of-age story of Neymar da Silva Santos Junior, the skinny kid from Mogi das Cruzes, who has been called the next Pelé. Neymar has taken Brazil and the world by storm and continues to inspire millions of fans around the world with his talent, heart, and winning smile. Following the international bestsellers, The Flea the Amazing Story of Leo Messi and Ronaldo The Rise of a Winner, by Michael Part, Neymar The Wizard is the heart warming and emotional story of a father and son, who, against all odds, made the journey from the edge of poverty, to international stardom, through love, conviction, and a young boy s belief in himself."}, {"id": "1619135965", "genre": "Children's Books", "title": "J.K. Rowling (Remarkable People)", "description": "J. K. Rowling has brought magic to millions of people. In the mid-1990s, she was a single mother struggling to publish her first novel. Today, she is a celebrity with fans around the world."}, {"id": "1548939463", "genre": "Children's Books", "title": "Alexis Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Girls", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "1416949348", "genre": "Children's Books", "title": "Counting Kisses: A Book and Rattle Gift Set", "description": "This Karen Katz favorite is now available as a part of an adorable gift set that both babies and parents are sure to love! From ten little kisses on teeny, tiny toes to one last kiss on Baby's sleepy, dreamy head, this concept board book counts down from ten as each kiss helps lull Baby to sleep. Perfect for Valentine's Day or any day of the year, babies will love playing with the brightly patterned kitty cat rattle while this story is read aloud.This 4.5 X 5.375 board book and kitty-cat rattle comes packaged in a sturdy vinyl bag with header card and slip sheet."}]