[{"id": "B00FNQNETK", "genre": "Children's Books", "title": "What's So Great About Da Vinci? A Guide to Leonardo Da Vinci Just For Kids!", "description": "Everyone says Leonardo Da Vinci is one of the greatest artist whoever lived…but why? What makes him so great? At a single glance, the Mona Lisa just looks like a normal painting of a woman. Why is his artwork celebrated around the globe, and for hundreds of years?This book introduces you to the life and work of Da Vinci, and helps show what made him so important to the world."}, {"id": "1434365247", "genre": "Children's Books", "title": "The Little Light Shines Bright: A True Story about the World's Longest Burning Lightbulb", "description": "The Little Light Shines Bright celebrates the world¿s longest burning lightbulb at a fire station in Livermore, California. The hand-blown lightbulb has been burning since 1901 and is declared the oldest known working lightbulb by the Guinness Book of World Records. The little light¿s journey started more than 100 years ago before the start of airplanes, automobiles and radio. Tourists from around the world have visited the little light ¿ a light that has provided comfort to firefighters all of these years and shows no signs of turning off! Through the eyes of a little boy we learn about the little light that shines bright . Included is a timeline showing all of the history making events and inventions that have happened throughout the little lights lifetime. Included in the book are real photos of the light and fire trucks at Fire Station 6 ! You can see the light through its live \"bulbcam\" at www.centennialbulb.org ."}, {"id": "B009D019N0", "genre": "Children's Books", "title": "Caring for your bicycle - Your expert guide to keeping your bicycle in tip-top condition", "description": "This step-by-step guide is packed full of information and tells you all you need to know about caring for your bicycle. It covers everything from the basics of why maintenance matters and which tools you should use, to vital safety checks and more advanced maintenance tasks, even the fitting of accessories. Advice on how to adjust your bike to fit you, how to clean it efficiently, and how to keep it running in top condition, lets you get more enjoyment from your bicycle for longer, more safely, and with the sense of satisfaction that comes from knowing you can fix or prevent problems that may arise yourself – you could even save yourself a small fortune in repair bills. With information on maintenance scheduling, troubleshooting advice, and electric bicycles, this book is the perfect companion for every cyclist. eBook ISBN: 978-1-845845-42-1 (9781845845421)Print ISBN: 978-1-845844-77-6 (9781845844776)"}, {"id": "1365861848", "genre": "Children's Books", "title": "Solar the Polar", "description": "Solar the Polar is a fun winter romp about a snowboarding polar bear and a skier girl who is missing her legs below the knee. This tale gives a gentle nod to Arctic warming, snow safety, and enjoying a life with a disability. Winter is no time to hibernate, so go for a ride with the polar inside. "}, {"id": "1432953516", "genre": "Children's Books", "title": "Life Cycles (Acorn Watch It Grow)", "description": "Whether you're watching a seed sprout, an egg hatch, or a puppy grow, the process of a new life starting is endlessly fascinating. This series provides a first introduction to plant and animal life cycles, exploring how living things grow and reproduce. Readers will learn how new life begins and develops, with an emphasis on the cyclical nature of life."}]