[{"id": "1618684124", "genre": "Science Fiction & Fantasy", "title": "Jagannath", "description": "The monster from your nightmares is here. It's destroying civilization. Soon the human race will be extinct.The year is 2037, and Corporal Kimi Jayden has one chance to rescue the lone refugee girl who is miraculously immune to Reaper absorption. Thirteen-year-old Lily walks the deserted streets of Savannah alone, ever since the Reaper absorbed her family - and tried and failed to absorb her - a year ago. An amorphous creature that has nearly wiped out civilization, growing as it feeds, the Reaper assimilates its prey's intelligence when it consumes flesh and blood. Growing smarter with each human it absorbs, the Reaper transforms into monsters created from our darkest nightmares - and it loves tormenting its victims. Kimi and her fellow survivors in the North Georgia Renegade Enclave believe Lily's DNA holds the key to mankind's survival. But the Reaper covets and abducts Lily, and Kimi must battle a ghastly horde of Reaper incarnations to preserve humanity's last hope against extinction. JAGANNATH reveals the resilience and determination of the human spirit in an action-filled tale of terror, selfless courage, and ultimate triumph and redemption."}, {"id": "B013EEIWTE", "genre": "Science Fiction & Fantasy", "title": "Abilities 3: The Sun of All Fears", "description": "Michael and Mitchel are back and this time there is no good versus evil. It is every man for himself.Michael's returned from 1981 only to be told that Mitchel has kidnapped his girlfriend. The only way to get her back is to work for the very same people that are out to kill him. Mitchel and William have finally escaped the TDAA but are still on the run, but this time Mitchel is out to make things right with his estranged family, even if it means tearing another family apart. As The Brothers Of The Sky get closer to their transformations into the Moon and the Sun, they only hope to fade off into the distance, but the only thing on the horizon is war."}, {"id": "1936876663", "genre": "Science Fiction & Fantasy", "title": "Battletech Field Manual 3145", "description": ">Field Manual: 3145 is the next installment of the Field Manual series set in the latter years of the Dark Age Era first described by WizKids MechWarrior collectible miniatures game. This sourcebook provides a complete summary of the military readiness of the various factions in the BattleTech universe in the year 3145, shortly after the events described in Steven Mohans Bonfire of Worlds epub novel, when the various factions of the Inner Sphere battle one another around the crumbling remains of the Republic of the Sphere."}, {"id": "1590413261", "genre": "Science Fiction & Fantasy", "title": "Marvel HeroClix: X-Men Danger Room Game", "description": "Just in time for the summer movie extravaganza comes the Marvel HeroClix X-Men Danger Room Game! The X-Men Danger Room Game contains everything you need to enter the world of 3-D super-hero combat. There are six exclusive X-Men figures in all, including Cyclops, Jean Grey, Angel, Beast, Colossus and Storm! New 3-D objects and a new Danger Room map round out the game with updated rules and a new powers and abilities card. The eye-popping diorama of the Marvel HeroClix X-Men Danger Room Game is a showpiece display in its own right. Providing a personal command window over the training exercises of your X-Men, it's a must-have for any X-Men fan! Whether you're looking to beef up your X-team, want to join the exciting HeroClix game, or want to introduce your friends to HeroClix, training in the Danger Room is the way to go!"}, {"id": "1620409674", "genre": "Science Fiction & Fantasy", "title": "The Bedlam Stacks", "description": "The eagerly anticipated new novel from the author of THE WATCHMAKER OF FILIGREE STREET--a treacherous quest in the magical landscape of nineteenth-century Peru.In 1859, ex-East India Company smuggler Merrick Tremayne is trapped at home in Cornwall after sustaining an injury that almost cost him his leg. On the sprawling, crumbling grounds of the old house, something is wrong; a statue moves, his grandfather's pines explode, and his brother accuses him of madness.When the India Office recruits Merrick for an expedition to fetch quinine--essential for the treatment of malaria--from deep within Peru, he knows it's a terrible idea. Nearly every able-bodied expeditionary who's made the attempt has died, and he can barely walk. But Merrick is desperate to escape everything at home, so he sets off, against his better judgment, for a tiny mission colony on the edge of the Amazon where a salt line on the ground separates town from forest. Anyone who crosses is killed by something that watches from the trees, but somewhere beyond the salt are the quinine woods, and the way around is blocked.Surrounded by local stories of lost time, cursed woods, and living rock, Merrick must separate truth from fairytale and find out what befell the last expeditions; why the villagers are forbidden to go into the forest; and what is happening to Raphael, the young priest who seems to have known Merrick's grandfather, who visited Peru many decades before. The Bedlam Stacks is the story of a profound friendship that grows in a place that seems just this side of magical."}]