[{"id": "1620862352", "genre": "Children's Books", "title": "Hook 'Em's Game Day Rules", "description": "Come along with Hook 'Em as he takes you through a game day filled with fun! Along the way, Herky taches manners and good sportsmanship in the traditional University Texas way!"}, {"id": "0984436669", "genre": "Children's Books", "title": "The Elves' First Christmas", "description": "\"How did the elves first meet Santa? The believable story reads like a traditional tale, and the detailed paintings of elves at work and play are filled with tiny details that make their world convincing. Kids will enjoy this view of the North Pole's shortest residents.\"—Kirkus ReviewsAtsuko Morozumi grew up in Japan. She graduated from the Royal College of Art in London and is now a major children's artist published in over twenty countries. Her first book, One Gorilla, was on the New York Times list for \"10 Best Illustrated Books of the Year.\""}, {"id": "1577650441", "genre": "Children's Books", "title": "Explorers (Frontier Land)", "description": "In this series readers are guided through the lives of the people that pushed westward and expanded a new nation from sea to shining sea.-- Easy-to-read maps trace the routes of explorers-- Fact-filled text brings the day-to-day struggles of pioneers to life-- Supports American history, geography, and Native American history curriculum"}, {"id": "B01FNJ546C", "genre": "Children's Books", "title": "Diary of an Angry Alex: Book 12 [An Unofficial Minecraft Book] (Minecraft Tales 83)", "description": "Searching for Herobrine.Herobrine has left Alex and Steve and took the dragon egg with him. Worried that he's going to hatch another ender dragon they set out to find him. He's out there somewhere and he's angry, but so is Alex. Will they be able to find him on time? Find out what happens in the Diary of an Angry Alex 12!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books, minecraft story mode, minecraft gift."}, {"id": "9654830051", "genre": "Children's Books", "title": "10 Great Jewish Children's Stories", "description": "Reprint. Double-spread Shabbat and Holiday stories with simple \"Do You Know That...\" facts at the end of each story. The illustrations have hidden holiday items scattered throught the pictures."}]