[{"id": "B00865VYV0", "genre": "Science Fiction & Fantasy", "title": "Ace Cameron and the Red Peril", "description": "Leeds Angeles, 2019:It is the best of times and the worst of times. The gap between rich and poor has never been greater. The rich live in gated communities out in the countryside, living the cosseted lives they deserve because they’ve been bred that way. The Dickensian poor have been allowed to remain in the cities, but the cities are not comfortable places. They’ve been left to stagnate into a state of managed decline. Buildings and hopes are collapsing. Perimeter fencing, curfews and sheer poverty are the only things which have kept the peasants from revolting, until now… Now something is changing. The Reds, led by a sinister man known only as X, have infiltrated the city and are polluting the minds of the citizens. Ace Cameron, a bounty hunter extraordinaire from the old, bold days, has been brought back from retirement, back into the loop... Back from the dead, some of his colleagues say. Only Ace has the wherewithal and classical training, the ruddy chutzpah, to be able to face up to X. A battle for the souls of humanity will come to pass…From the mind that brought you Paint this town Red, Bully, Perfect World, The Black Book, The Haunting of Annie Nicol, and The Magpie Trap, comes the comic, hard-boiled superhero for our uncertain times..."}, {"id": "1541457110", "genre": "Science Fiction & Fantasy", "title": "The Reapers (Neuro)", "description": "Alex and Enea are back in the Crystal Sphere, where, in their absence, a catastrophe has struck. Virtual reality is now controlled by the Reapers: hybrid identities evolved from high-level NPCs who kill human players to harvest their neurograms. Reapers are constantly on the prowl for more neurograms. No one is safe from their cannibalistic greed. Survival in this new world becomes an ever-increasing challenge. A Reaper army is about to invade the Agrion cluster. Rion Castle has become the players' last outpost-but the struggle is too unequal."}, {"id": "0761500472", "genre": "Science Fiction & Fantasy", "title": "Command & Conquer Secrets & Solutions: The Unauthorized Edition (Game Buster Get a Clue)", "description": "Why stop at naked aggression? Engineer your rise to military brilliance with this book's ruthless strategies and battle-cracking secrets. Turn these pages and discover:Strategies for EVERYmission, including the new Covert Operations missions Detailed battlefield maps and mission briefingsIllustrious maneuvers for dominating network play Dirty tricks that will unravel the toughtest enemy assault Super-secret tactics to render computer opponents powerlessStunning battle tactics demand forethought and genius, the kind of genius you just won't find in any other strategy guide. Take command of your fate with these crushing strategies and powerpacked secrets!"}, {"id": "1935563912", "genre": "Science Fiction & Fantasy", "title": "Angel Moon: Book 2 Blood and Sunlight (Volume 2)", "description": "Kirsten Tyler has been obsessed with angels since she was a child. When she was just a baby, her mother died. When she was five years old, her father and older brother were violently murdered while she was hiding in the house. Although she hadn’t been harmed, she’d been treated in the hospital for severe and unexplained blood loss, and the details of what happened that horrible night always remained fuzzy in her mind. Soon after she went to live with her aunt and uncle in a neighboring town, the angels came to visit her. Every night they would tuck her in and read her bedtime stories. She lived a quiet, protected life with her loving aunt and uncle, but she couldn’t wait for the secret of the nighttime – when her mysterious angels would come through the open window to see her. They promised they would always be there for her. But then, suddenly, they were gone, and she was alone. For the next ten years, Kirsten studied everything she could about angels, in hopes of finding her guardians again. During that time, she always had the feeling someone was watching over her ... or maybe just watching her. In college now, she continues her search for the truth about angels, but every obscure text, every clue, leads to a dead end. She’s ready to give up until the people closest to her start turning up dead. Again. These bloodless unexplained murders will force Kirsten to deal with the terrible truth about her past – and who the angels really are."}, {"id": "099707311X", "genre": "Science Fiction & Fantasy", "title": "The Fire Within (Kell of the Deep Space Corps) (Volume 1)", "description": "23-yr-old Kell Stark’s dream is to captain a ship of the Deep Space Corps, but the Corps hides alien threats — until her cybernetics genius leads to catching Skirrl dragonlords circling Sol System like vultures. If they are not stopped, the Skirrl will mentally enslave the human race.  Kell believes she was genetically enhanced in the womb, but she can’t get her powerful family to admit it. Shifting sexual preferences don’t worry her, but she’s often angry and changeable, almost two different people. Vicious telepathic assaults bring her inner conflicts to a head, with shocking results.  Aided by a young woman of the Corps and a bionic commando with PTSD and a shadowy past, Kell must save herself and the human race the only way she can — starting with mastering her own mind.  She has a fire in her belly; she will not yield."}]