[{"id": "0860375447", "genre": "Children's Books", "title": "Makkah and Madinah Activity Book (Discover Islam Sticker Activity Books)", "description": "Explore the wonders of Makkah and Madinah with this fun sticker activity book. It features dot-to-dot drawings, coloring fun, puzzles to solve, and over sixty stickers to stick.This book introduces children to the sacred mosque in Makkah, the Kaaba, Zamzam water, the cave of Hira, the Prophet's Mosque in Madinah, and more by taking the reader on a tour that follows the path of a pilgrim.The Discover Islam Sticker Activity Book Series aims to introduce some important places in Islam and the main actions of Muslims, such as praying and fasting, to young readers. Developed to be fun for a wide readership, these books will be excellent resources to introduce the Muslim faith in classrooms, homes, and with religious groups."}, {"id": "1426310269", "genre": "Children's Books", "title": "National Geographic Kids Everything Money: A wealth of facts, photos, and fun!", "description": "All you need to know about money can be found in the pages of this colorful, energetic, and accessible book. Kids will also learn about money around the world from a National Geographic expert, featured in \"Explorer's Corners\" throughout the book. Packed with fun facts and amazing photographs, this book gives kids an in-depth look at this fascinating and important topic.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "1465422668", "genre": "Children's Books", "title": "DK Eyewitness Books: Dinosaur", "description": "Now in Paperback! Be an eyewitness to the prehistoric beasts that once ruled the earth and find out how ancient fossils and footprints can reveal their awesome world. From their evolution to their extinction, see what dinosaur skin was like, find out how a fossil can show if a dinosaur was a carnivore or herbivore, study claws and tails and how they were used and more in this latest edition of an Eyewitness favorite. For over 25 years, DK's Eyewitness books have been the most trusted nonfiction series in classrooms, libraries, and homes around the world. In summer 2014 this award-winning series will get a fresh new look both inside and out. The introduction of paperback editions, eye-catching jackets, and updated interiors ensure that the Eyewitness series will continue to be relevant in the ever-changing world of education and remain the go-to source for homework help, research projects, reluctant readers, ESL students, and, as always, to satisfy the minds of curious kids. Supports the Common Core State Standards."}, {"id": "1569767084", "genre": "Children's Books", "title": "Survivor Kid: A Practical Guide to Wilderness Survival", "description": "Anyone can get lost while camping or on a hike and Survivor Kid teaches young adventurers the survival skills they need if they ever find themselves lost or in a dangerous situation in the wild.Written by a search and rescue professional and lifelong camper, it s filled with safe and practical advice on building shelters and fires, signaling for help, finding water and food, dealing with dangerous animals, learning how to navigate, and avoiding injuries in the wilderness. Ten projects include building a simple brush shelter, using a reflective surface to start a fire, testing your navigation skills with a treasure hunt, and casting animal tracks to improve your observation skills.For ages 9 and Up."}, {"id": "B01N0KH1BO", "genre": "Children's Books", "title": "The Adventures of Algernon", "description": "The adventures of Algernon is a story about a little mouse and his friends who live in the Australian Bush. The characters in this story are all introduced to the reader, some before the story, some after, and with each introduction the character gives a little bit of information on their particular species. From Algernon, to Fergus the frog, Betty the butterfly, Benny the bandicoot, and others, the reader will be enchanted by their sharing their little bits of information. As well as an entertaining book, The Adventures of Algernon is also a learning process of the wonderful animals that inhabit the Australian Bushland."}]