[{"id": "B00GBAN0DW", "genre": "Children's Books", "title": "Palace Pets: Blondie: A Regal Pony for Rapunzel (Disney Storybook (eBook))", "description": "Enter the enchanted world of Disney Princess Palace Pets! Disney Princesses have always loved animals. Now, just like the princesses, you can play, nurture, style, and love all of their pets! In this book, meet Blondie, a little pony with big dreams of meeting Rapunzel and becoming a royal horse."}, {"id": "1599616556", "genre": "Children's Books", "title": "3: Indiana Jones and the Kingdom of the Crystal Skull", "description": "The man who single-handedly defined \"adventure\" for an entire generation returns--hat and all--in this action-packed adaptation of 2008's silver-screen megahit! Dr. Henry Jones Jr. is at it again, this time on the trail of a discovery unlike any in his illustrious career. Yet more than one player is out to win this game, and with stakes this high, not everyone is going to play fair! Will Indiana Jones's greatest adventure be his last? Spotlight editions are printed on high-quality paper and with reinforced library bindings specifically printed for the library market. Grades 6-12."}, {"id": "1681522535", "genre": "Children's Books", "title": "Baby Hippos (Spot)", "description": "What's cuter than a baby animal? Another baby animal. In this super-cute series, a search-and-find feature guides early readers as they learn new vocabulary pertaining to different baby animals, their habitats, body parts, food, and more. Carefully chosen photos and words are sure to captivate kindergarteners and other readers alike! This search-and-find book invites emergent readers to look for new vocabulary words and pictures while giving simple facts about the fascinating world of the baby hippo, including information about where they live and what they eat."}, {"id": "B073PML1KN", "genre": "Children's Books", "title": "Tilly the Turtle", "description": "Tilly the Turtle feels she needs a new hat. So, she heads to town. She sees her friends but feels she has no time to spend with them. She learns a lesson when all of her friends do a little to help a lot. This is a story of friendship, love and learning what true friendship is."}, {"id": "1416948856", "genre": "Children's Books", "title": "Turtle Tales: An Insider's Guide by LeonardoÂ™ (Teenage Mutant Ninja Turtles (8x8))", "description": "Leonardo describes how he and his brothers became the Teenage Mutant Ninja Turtles, with each of his brothers chipping in more information about their lair, their training, and their enemies."}]