[{"id": "1467721417", "genre": "Children's Books", "title": "Abby Wambach (Amazing Athletes)", "description": "Right out of college, Abby Wambach shot to fame in the United States soccer scene. In 2002, she was picked second in the Women's United Soccer Association draft by the Washington Freedom. She also became a leading scorer on the US Women's National Team. After winning the 2012 FIFA Women's World Player of the Year award and two Olympic gold medals, Abby is still going strong. She holds the world record for international goals. Follow Abby's story from her beginnings at University of Florida to becoming an international soccer superstar."}, {"id": "1547081368", "genre": "Children's Books", "title": "Happy Birthday 1: Birthday Gifts For Kids, Birthday Journal Notebook For 1 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "B01N051PT0", "genre": "Children's Books", "title": "I Found My Dreidel", "description": "While Josh helps his mom prepare the menorah for Hanukkah, his younger sister Sarah finds a small red dreidel in a box. While their mom prepares the special Hanukkah dinner for the whole family, Josh teaches Sarah how to play the dreidel game."}, {"id": "0763695904", "genre": "Children's Books", "title": "Fantastic Beasts and Where to Find Them: Newt Scamander: A Movie Scrapbook", "description": "Learn all about Newt Scamander and the incredible film from J.K. Rowling's Wizarding World, Fantastic Beasts and Where to Find Them. Peer inside Newt Scamander's enchanted suitcase, encounter marvelous creatures, roam the streets of 1920s New York City, and meet Newt's fascinating friends! This magical scrapbook takes readers on an interactive adventure through Fantastic Beasts and Where to Find Them. Filled with removable artifacts, such as wizarding newspapers, posters, and other fascinating finds, this book has something for everyone!"}, {"id": "0836217888", "genre": "Children's Books", "title": "Make Way for the King of the Jungle", "description": "If ever there is an iconic comic strip, it is Peanuts. What began in the funny pages in 1950 has developed into an enduring classic. Whether you're persnickety like Lucy, a philosopher like Linus, a joyous Flying Ace like Snoopy, or a lovable underdog like Charlie Brown, there is something to touch your heart or make you laugh in Peanuts."}]