[{"id": "1465417176", "genre": "Children's Books", "title": "10 Minutes a Day: Math, Third Grade (Math Made Easy)", "description": "Place value, rounding, solving problems, line graphs, and more are all featured in 10 Minutes a Day: Math Grade 3 to help boost math skills in third graders. Accompanied with a digital timer, the 10 Minutes a Day series provides quick exercises testing a range of skills and knowledge. Each spread takes a maximum of ten minutes to complete, with a mix of problems that can be quick to answer, or take a little longer. Complete with parents' notes including tips, guidance, and answers, these workbooks are the perfect reinforcement aids for help at home. Supports the Common Core State Standards."}, {"id": "0689845049", "genre": "Children's Books", "title": "Girl Who Loved Wild Horses (Richard Jackson Books (Atheneum Hardcover))", "description": "Though she is fond of her people, a girl prefers to live among the wild horses where she is truly happy and free."}, {"id": "1937615235", "genre": "Children's Books", "title": "Space Cop Zack, Protector of the Galaxy: A Kids' Book about Using Your Imagination", "description": "Space Cop Zack, Protector of the Galaxy is a celebration of the power of imagination. Join Zack and his faithful robot sidekick GARG as he chases the terrible Dr. Dogbreath across the galaxy. Together they brave bad smells, squishy slime, giant ocean monsters, and motion sickness. Will Zack and GARG finally capture Dr. Dogbreath or will he escape their grasp? That will all depend on where your imagination takes you."}, {"id": "0976478870", "genre": "Children's Books", "title": "Coloring Book: My Surf Lesson, Look Before You Leap (Olas Surfing Book)", "description": "My Surf Lesson- Look Before You Leap is written to teach children about Ocean Safety. We believe that it is never too early to learn about the dangers as well as the joys of the sea. Our story rhyme inspires respect for the ocean s power while entertaining young readers and encourages children to always be cautious at the beach.Studies show that children who are encouraged to read at a young age are successful in their school careers. By sharing this book with children, you encourage them to read and by reading together, you teach them through examples."}, {"id": "B003ZK5PJ8", "genre": "Children's Books", "title": "Children's Islamic Bedtime Stories 5", "description": "Muslim heritage is rich with stories meant to inculcate Islamic morals and virtue as well as serve as an example of exemplary piety and righteousness. Unfortunately these have not been widely available in the english language until now. This series translated by Mufti Elias is perfect for reading at bedtime for the muslim family."}]