[{"id": "1538326078", "genre": "Children's Books", "title": "Freshwater Crisis (Earth's Environment in Danger)", "description": "There is a limited supply of freshwater on our planet. However, many people think that it is much easier to come by than it actually is. All living things depend on water and yet more than 1.1 billion people worldwide lack daily access to freshwater. Some water is contaminated with water-borne diseases and in some places such as the Sahara Desert there just simply isn't any water for people. This book explores the causes of the freshwater crisis and ways students can participate in being more mindful of water availability and their own personal water use."}, {"id": "B017MW4I7Y", "genre": "Children's Books", "title": "Sir Walter Raleigh   Who Was Sir Walter Raleigh: Biography, Q&A’s, Timeline and Activities", "description": "Specially written to engage young readers (8 – 12yrs)With over 34 images that can be colored in to help children remember the life and times of Sir Walter Raleigh. Plus inside the book is a unique link that will allow you to print out further copies of the coloring sheets, crosswords and word searches if you would like them. Perfect if you don’t want to mark the book, print out extras for the class or simply color them in as many times as you want.Sir Walter Raleigh - explorer, politician, spy, writer and poetWhat readers have said about our series“Great book and really helped my son on his school project” Clare MacLachlan“My daughter loved coloring in the images and it helped to get her involved in the book” Karen Slade“Our kids love these books - very informative, easy to understand, good activities” Agnes Naylor"}, {"id": "0692568409", "genre": "Children's Books", "title": "ABC's for Boys (Alphabet Book, Baby Book, Children's Book, Toddler Book)", "description": "This one of a kind, hand illustrated alphabet book combines letters with all of boys' favorite things--airplanes, dump trucks, and more! Makes a special baby shower, birth, and birthday gift! Perfect for kids ages 0-5."}, {"id": "0060554479", "genre": "Children's Books", "title": "Reaching for the Moon", "description": "I walked on the moon. This is my journey. But it didn't begin when I stepped on board Apollo 11 on July 1, 1969. It began the day I was born.Becoming an astronaut took more than education, discipline, and physical strength. It took years of determination and believing that any goal is possible—from riding a bike alone across the George Washington Bridge at age ten to making a footprint on the Moon. I always knew the Moon was within my reach—and that I was ready to be on the team that would achieve the first landing. But it was still hard to believe when I took my first step onto the Moon's surface. We all have our own dreams. This is the story of how mine came true."}, {"id": "B01I85NQ9U", "genre": "Children's Books", "title": "Man's Search for Meaning: Young Adult Edition: Young Adult Edition", "description": "A young readers’ edition of the best-selling classic about the Holocaust and finding meaning in suffering, with a photo insert, a glossary of terms, a chronology of Frankl’s life, and supplementary letters and speechesThe Library of Congress called it “one of the ten most influential books in America”; the New York Times pronounced it “an enduring work of survival literature”; and O, The Oprah Magazine praised it as “one of the most significant books of the twentieth century.” Man’s Search for Meaning has long riveted readers with its descriptions of life in Nazi death camps and its lessons for spiritual survival. This new young readers’ edition brings a beloved classic to a new generation of readers, offering a universal tribute to coping with suffering and finding one’s purpose. An abridged text of the original book (emphasizing Frankl’s personal story, while omitting some material on his psychological theory of logotherapy) is presented here, along with supplemental materials that vividly bring Frankl’s story to life, and a foreword by prominent young adult author John Boyne. Man’s Search for Meaning: A Young Readers’ Edition will help readers ages twelve to eighteen grasp Frankl’s enduring lessons on perseverance and strength with clarity and depth."}]