[{"id": "0516260294", "genre": "Children's Books", "title": "Tony Meola (Grolier All-Pro Biographies)", "description": "A biography of soccer player Tony Meola, an Italian American who rose to fame in college soccer and was goalie for the U.S. national soccer team in the 1994 World Cup competition."}, {"id": "1840594209", "genre": "Children's Books", "title": "Milet Flashwords (English–Urdu) (Milet Flashwords series)", "description": "Featuring words and pictures from the popular Milet Picture Dictionary series, these bilingual flashcards make learning and practicing languages fun."}, {"id": "1584150742", "genre": "Children's Books", "title": "Dr. Seuss (Real-Life Reader Biography)", "description": "Profiles the author who wrote \"Green Eggs and Ham\" and \"The Grinch Who Stole Christmas,\" and describes how he devoted his career to writing and illustrating fun books that helped children learn to read."}, {"id": "B00BNDWONO", "genre": "Children's Books", "title": "How to Draw Manga Eyes! 50 Easy Step-by-Step Lessons for the Beginner", "description": "*Special introductory price for a limited time only!*If you're seriously interested in becoming a true manga artist, it starts with learning how to to draw the eyes.Designed specifically for the beginner in mind, the lessons are straightforward and easy-to-follow, so you'll see remarkable results immediately.With 50 ways to draw eyes, this book is an invaluable tool to help unleash your creativity.You'll discover how easy it is to draw manga eyes, see for yourself."}, {"id": "0761357602", "genre": "Children's Books", "title": "Danica Patrick (Revised Edition) (Amazing Athletes)", "description": "Danica Patrick is the most popular driver in the Indy Racing League (IRL). She has won fans with her skill, toughness, and charm. In 2008, Danica rewarded her fans by doing something that no other woman had ever done--she won an IRL race. Danica amazed her supporters again in 2009 when she announced that she would race in some NASCAR events starting in 2010. Read this book to learn more about car racing's most dynamic driver."}]