[{"id": "1851034536", "genre": "Children's Books", "title": "What Animals Eat (My First Discoveries)", "description": "Each double spread explores a different ecosystem: the kitchen garden, woodland, seashore, savannah, jungle, polar, and marine systems. On the left-hand page, color-coded diagrams and arrows show the different food chains that exist within each ecosystem. On the right-hand page captivating full-page lifelike illustrations show the ecosystems in all their detail. Readers use a “magic flashlight” (in the form of a piece of card) to “light up” and explore these darkened transparent pages, enabling them to focus on one detail at a time."}, {"id": "0613121767", "genre": "Children's Books", "title": "Temptations (African American Achievers)", "description": "The Temptations--Eddie Kendricks, Paul Williams, Otic Williams, Melvin Franklin, and David Ruffin--met the challenge by making themselves the best in the business. They perfected their vocal technique and used costume and dance to create a sexy, elegant stage presence.Their hard work paid off, but success had a price of its own. Drug abuse and arrogance destroyed friendships and force personnel changes. The Temptations also struggled to keep up with changing musical tastes. These setbacks proved to be temporary, however, in a triumphant career that has spanned more than 30 years."}, {"id": "0448436256", "genre": "Children's Books", "title": "Bratz Boyz: Bikin' with the Boyz", "description": "Cade, the newest member of the Boyz, will introduce you to the world of bikin’—from the different types of bikes out there, to superstylin’ biking fashion, and more. He’ll also get you ready to ride with tips and tricks for tearin’ it up!"}, {"id": "1618891480", "genre": "Children's Books", "title": "Sam the Auto Mechanic (Little Master)", "description": "This series is great for little readers who love to build and repair things. Sam is not only a skillful master builder but also a good teacher. In these books he shows kids how to repair a car or build something special. Books also include the sounds of tools, amusing melodies, and colorful pictures."}, {"id": "1421588641", "genre": "Children's Books", "title": "Super Mario Adventures", "description": "Super Mario Adventures, inspired by the bestselling Super Mario video game franchise, is a collection of comics that originally ran in Nintendo Power magazine in 1992-93.  The peril-plagued Princess Toadstool is kidnapped by the diabolical deadbeat Bowser but super plumbers Mario and Luigi hatch a plan with their new friend Yoshi to rescue her. Are the Super Mario Bros’ plans a pipe dream? Can they stop the Koopa King before he forces the Princess to be his bride?!  Long out of print, this stunning, full-color graphic novel is now available once again!"}]