[{"id": "0439129265", "genre": "Children's Books", "title": "My First Kwanzaa Book", "description": "A vibrant picture book brings to life the Kwanzaa holiday during the last week of December as Grandma brings special food, Grandpa lights the candles, and the whole family celebrates their heritage. Reprint."}, {"id": "1771084065", "genre": "Children's Books", "title": "Anne of Avonlea", "description": "Now sixteen, Anne is grown up―sort of. The second novel in L. M. Montgomery's classic series follows Avonlea's red-headed darling as she begins her new job as a schoolteacher, and becomes curious about the strange yet handsome Gilbert Blythe. As she enters adulthood, she does so with humour and a sense of adventure."}, {"id": "B00BR9Y70M", "genre": "Children's Books", "title": "Ancient Maya (People of the Ancient World)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Creates a portrait of life in the ancient Mayan civilization. Each chapter focuses on a different part of society, such as peasants, scholars/scribes, priests, soldiers, rulers, and more."}, {"id": "0374380694", "genre": "Children's Books", "title": "The Pilot and the Little Prince: The Life of Antoine de Saint-Exupéry", "description": "Antoine de Saint-Exupéry was born in France in 1900, when airplanes were just being invented. Antoine dreamed of flying and grew up to be a pilot―and that was when his adventures began. He found a job delivering mail by plane, which had never been done before. He and his fellow pilots traveled to faraway places and discovered new ways of getting from one place to the next. Antoine flew over mountains and deserts. He battled winds and storms. He tried to break aviation records, and sometimes he even crashed. From his plane, Antoine looked down on the earth and was inspired to write about his life and his pilot-hero friends in memoirs and in fiction. Peter Sís's remarkable biography celebrates the author of The Little Prince, one of the most beloved books in the world. This title has Common Core connections.A Frances Foster Book"}, {"id": "0718090144", "genre": "Children's Books", "title": "One Christmas Bear", "description": "Count the Blessings of ChristmasFollow the merry adventures of a polar bear and the artic animals as they enjoy winter fun! From crunchy candy canes and frosty snowballs to friends to play with and a family to love, your little one will enjoy counting God’s wonderful gifts. Anne Vittur Kennedy has been delighting young children with her humorous and playful books for thirty years. Her awards include American Library Association’s Notable Books List, Teacher’s Choice, The Green Earth Book Award, and The Green Prize for Sustainable Literature."}]