[{"id": "0399169628", "genre": "Children's Books", "title": "Princess Posey and the First Grade Ballet (Princess Posey, First Grader)", "description": "Princess Posey's glittery tutu is extra busy in the ninth book in the chapter book series.Valentine’s Day is coming! Posey is so excited about her special ballet recital and giving cards to everyone at school. Then she learns that one of her classmates doesn’t have any valentines to give out. Can Princess Posey and her tutu find the perfect way to help?"}, {"id": "B00GIRTC3K", "genre": "Children's Books", "title": "#2 Rooftop Cat (Miss Annie)", "description": "Miss Annie is just a kitten, but she loves having adventures on the rooftops outside her home. When a gang of dangerous alley cats invade her street, Miss Annie will have to prove her bravery and determination...and her loyalty to her very best friend, a mouse. Can one little cat stand on her own?"}, {"id": "0789447622", "genre": "Children's Books", "title": "Time Traveler: Children Through Time (Eyewitness Readers, Level 3)", "description": "Sophie and Jake, who don't find history interesting, test a computer program that shows what life was like in ancient Rome, Viking times, the Renaissance, the Gold Rush era, World War Two, and into the space age"}, {"id": "0764126008", "genre": "Children's Books", "title": "Eight Lights for Eight Nights (Let's Celebrate Series)", "description": "Here is a wonderful, beautifully illustrated book to help inspire Jewish children in celebration of Hanukkah, the festival of lights, while also telling boys and girls of all faiths the fascinating story and traditions connected with this festive holiday. The book’s first part tells the story, taken from The Book of Maccabees and other historical sources, of how Antiochus of Syria invaded the land of Judea and forbade the Jews to perform their religious rites, which included lighting the menorah. The story goes on to tell how the Syrians were ultimately defeated and driven away by the Maccabees, and how the Temple of Jerusalem was restored and its menorah lighted and miraculously kept burning. This book’s remaining pages describe the joyful Hanukkah rituals meant to commemorate the miracle of the menorah. Children read about the special foods for Hanukkah, learn to light Hanukkah candles, make lots of fun, innovative crafts, play dreidel with chocolate Gelt,  and generally celebrate this joyous holiday. Includes sidebars with cool facts! (Ages 6–9)"}, {"id": "B06XCG8VR3", "genre": "Children's Books", "title": "Where Does Christmas Come From? | Children's Holidays & Celebrations Books", "description": "Little kids want to know who Santa is so this book will serve as an excellent introduction. With the help of this book, you will be humanizing a special character that brings so much merriment during the Christmas season. Read this book to add to your child’s knowledge and to encourage reading skills, too. So go ahead and grab a copy now!"}]