[{"id": "1627791299", "genre": "Children's Books", "title": "John Deere, That's Who!", "description": "Back in the 1830s, who was a young blacksmith from Vermont, about to make his mark on American history? John Deere, that’s who!Who moved to Illinois, where farmers were struggling to plow through the thick, rich soil they called gumbo? Who tinkered and tweaked and tested until he invented a steel plow that sliced into the prairie easy as you please?Long before the first tractor, who changed farming forever? John Deere, that’s who!Beautiful illustrations―including spectacular landscapes―reflect the time period and bring John Deere's remarkable story to life."}, {"id": "184443088X", "genre": "Children's Books", "title": "BMX Biking (Extreme Sports)", "description": "This series gives readers the low-down on some of the world's most exciting sports. Each title looks at sports that readers can do themselves, from skateboarding on the street to BMX tricks, and explores how the sport has developed. Each book: - Offers an introduction to extreme sports and also extra information for those already involved - Provides advice on safety, equipment and the importance of proper training - Contains spectacular photographs that bring each sport to life"}, {"id": "1524773468", "genre": "Children's Books", "title": "Rocket the Brave!", "description": "Kids are learning to read with Rocket! Tad Hills, the #1 New York Times bestselling author, is back with another easy-to-read story featuring the beloved dog Rocket, this time about overcoming fear and being brave.Rocket, the star of the New York Times bestselling picture books How Rocket Learned to Read and Rocket Writes a Story, returns in an all-new, easy-to-read book. Rocket is happily chasing a butterfly through the meadow when it disappears into the woods. As much as Rocket wants to follow the butterfly, the woods look dark and scary. Can Rocket overcome his fear? With predictable patterns, simple words, lots of repetition, and bright, colorful illustrations, young readers will love this new Rocket book, which they can read all by themselves!"}, {"id": "0988147831", "genre": "Children's Books", "title": "The Alphabet Stones", "description": "The Alphabet Stones is about three families, one of them supernatural, and how they intertwine-with each other and with the land, a moody eastern Ontario of communes, music festivals and cedar swamps; stony farms and muddy rivers. This is a story about enchantment-how the land enchants us, how we enchant one another-why it's necessary that we do, and dangerous when we don't. Like 14 year old Jody, we learn not just the names of trees and stars and birds, but also of \"the gate between worlds,\" a place she stumbles across in a forgotten back pasture, both ordinary and powerfully mysterious. \"Quietly beautiful, *The Alphabet Stones* is magical and ethereal yet also deeply evocative of, and grounded, in place.\" -Jan Thornhill \"Ursula Pflug's writing is the kind you want to carry around with you for those days when it feels like you're living in a strange and incomprehensible world.\" -Mathew Cheney"}, {"id": "1548936200", "genre": "Children's Books", "title": "Benjamin Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Boys", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}]