[{"id": "B06Y31P418", "genre": "Children's Books", "title": "The Walrus Fact and Picture Book: Fun Facts for Kids About Walruses (Turn and Learn)", "description": "The Walrus Fact & Picture Book will allow your child to learn more about this world we live in, with a fun and exciting approach that will trigger their imagination.We're raising our children in an era where attention spans are continuously decreasing. Turn & Learn provides a fun, and interactive way of keep your children engaged and looking forward to learn, with beautiful pictures, coupled with the amazing, fun facts.Get your kids learning today! Pick up your copy of Turn & Learn's WALRUS Fact and Picture book now!"}, {"id": "1439511144", "genre": "Children's Books", "title": "Seven Spools of Thread: A Kwanzaa Story", "description": "In an African village live seven brothers who make family life miserable with their constant fighting. When their father dies, he leaves an unsual will: by sundown, the brothers must make gold out of seven spools of thread. If they fail, they will be turned out as beggars."}, {"id": "0008195390", "genre": "Children's Books", "title": "KS3 History The American Revolution (Knowing History)", "description": "Ready-made high quality KS3 history lessons on the American Revolution \u0096 topic booklet perfect for a half term’s work.         Give every student access to high quality KS3 History textbook content with this topic booklet on the American Revolution.         Chapter 1: The American ColoniesChapter 2: No Taxation without RepresentationChapter 3: Declaration of IndependenceChapter 4: War of IndependenceChapter 5: America’s \u0091Manifest Destiny’         \u0095 Fits into the school timetable with ease with 5 high quality lessons, perfect for a half term         \u0095 Ignites an interest in history through extraordinary people, amazing facts, and a distinctly engaging narrative         \u0095 Helps all students to think critically about the past by focusing on the knowledge they need and then checking their understanding         \u0095 Aids pupil memory with a \u0091knowledge organiser’ at the back with key dates, vocabulary and significant people.         \u0095 Delivers excellent lessons and saves time planning with the Teacher Guide available free on Collins.co.uk, containing teaching ideas, suggested sources, assessment, answers, essay titles and extended writing examples"}, {"id": "0780719409", "genre": "Children's Books", "title": "Milk from Cow to Carton (Let's Read-And-Find-Out Science (Pb))", "description": "Aliki takes readers on a guided tour that begins with grazing cows, proceeds through milking and a trip to the dairy, and ends with some different foods made from milk. This revised edition of Aliki's 1974 Green Grass and White Milk is an even more fun-filled and informative explanation of milk's trip from green grass, to cow, to a cool glass on the table."}, {"id": "1410931404", "genre": "Children's Books", "title": "Asia's Most Amazing Plants (Plant Top Tens)", "description": "Why was teak used to build the RMS Titanic? How can a mangrove grow in saltwater? Why does a pitcher plant grow in the shape of a cup? Asia has many landscapes, from sky-scraping mountains to blazing deserts, and from tropical rainforests to bogs. Discover how Asias most incredible plants make their home here."}]