[{"id": "B01MCR8JT3", "genre": "Science Fiction & Fantasy", "title": "Magical Girl Dallas Episode 2", "description": "With a new threat appearing to quash his evil plans, The Masked Sorrow sends out Taru to nip Dallas' career as a magical girl in the bud. However, Dallas is in the middle of work and can't afford to be away too long without his manager getting upset. Will he be able to take care of Taru and get back to work without getting in trouble, or will Taru and The Masked Sorrow succeed in Dallas' demise?"}, {"id": "0192828398", "genre": "Science Fiction & Fantasy", "title": "Twenty Thousand Leagues Under the Sea (Oxford World's Classics)", "description": "The classic tale of Captain Nemo and the submarine the Nautilus, this is the quintessential translation by the internationally renowned Verne scholar, William Butcher. This edition of Twenty Thousand Leagues under the Sea reports the very first study of Verne's manuscript and is packed with detail on artistic and scientific references."}, {"id": "1534301933", "genre": "Science Fiction & Fantasy", "title": "Descender Volume 4: Orbital Mechanics", "description": "Tim-21, Telsa and Quon finally escape the Machine Moon and head out on a quest to find the ancient robot who may hold the key to the Harvesters. Meanwhile Andy and his rag-tag team close in on Tim, but their fragile alliance is shattered by Driller's revealtions. A new chapter of the heartfelt Sci Fi epic begins here by superstar creators JEFF LEMIRE and DUSTIN NGUYEN Collects issues 17 through 21."}, {"id": "0553568027", "genre": "Science Fiction & Fantasy", "title": "Wedge's Gamble (Star Wars: X-Wing Series, Book 2)", "description": "Sleek, swift, and deadly, they are the X-wing fighters. And as the battle against the Empire rages across the vastness of space, the pilots risk both their lives and their machines for the cause of the Rebel Alliance. Now they must embark on a dangerous espionage mission, braving betrayal and death on the Imperial homeworld to smash the power of a ruthless foe!It is the evil heart of a battered and reeling Empire: Coruscant, the giant city-world from whose massive towers the Imperial High Command directs the war. The Rebels will invade this mighty citadel in a daring move to bring the Empire to its knees. But first Wedge Antilles and his X-wing pilots must infiltrateCoruscant to gain vital intelligence information. Capture means death, or worse--enslavement by the vicious leader known as \"Iceheart,\" Ysanne Isard, nowEmperor in all but name. And one of Rogue Squadron's own is already her slave, a traitor hidden behind a mask of innocence, working to betray both colleagues and the Rebellion itself."}, {"id": "0446602329", "genre": "Science Fiction & Fantasy", "title": "Ravengers (Cyberpunk 2.0.2.0.)", "description": "A gang of rejects led by byteboi and bytegirl attempt to create a new world based on classical values and culture--but the corporate soldiers will tolerate no threats to the reigning pop culture of sex and violence. Original."}]