[{"id": "1507819919", "genre": "Science Fiction & Fantasy", "title": "The Fen of the Five-Fold Maw", "description": "In this deadly new adventure by TPK Games, the players must delve deep into the Sorrowfen, an ancient swamp infested with lizardmen who have suddenly risen to threaten the beleaguered nearby village of Wyverglynn. The village needs aid from a aged witch that lives deep in the swamps and sends the heroes to seek her out. But will the swamp devour them before they can come to the aid of Wyverglynn, or will the fervored tribe of lizardmen within flay them alive? Do battle against the environs and hazards of the swamp along with an entire tribe lizardmen, baby froghemoths, poisonous insects, ancient crocodiles, bullywugs and of course, the legendary Five-Fold Maw itself! This adventure concludes with an amazing chase scene that will challenge even the most heroic of characters. Do you have what it takes to brave the Sorrowfen?"}, {"id": "1400078776", "genre": "Science Fiction & Fantasy", "title": "Never Let Me Go", "description": "From the winner of the Nobel Prize in Literature and author of the Booker Prize–winning novel The Remains of the Day comes a devastating novel of innocence, knowledge, and loss.    As children Kathy, Ruth, and Tommy were students at Hailsham, an exclusive boarding school secluded in the English countryside. It was a place of mercurial cliques and mysterious rules where teachers were constantly reminding their charges of how special they were. Now, years later, Kathy is a young woman. Ruth and Tommy have reentered her life. And for the first time she is beginning to look back at their shared past and understand just what it is that makes them special—and how that gift will shape the rest of their time together. Suspenseful, moving, beautifully atmospheric, Never Let Me Go is modern classic."}, {"id": "1503949052", "genre": "Science Fiction & Fantasy", "title": "Punishment (Detective Barnes Series)", "description": "Do you want to know what it’s like to die, to kill, to really fear for your life? Then get hooked…Detroit-based homicide detective John Barnes has seen it all—literally. Thanks to a technologically advanced machine, detectives have access to the memories of the living, the dying, and the recently dead. But extracting victims’ experiences firsthand and personally reliving everything up to the final, brutal moments of their lives—the sights, the sounds, the scents, the pain—is also the punishment reserved for the criminals themselves.Barnes has had enough. Enough of the memories that aren’t his. Enough of the horror. Enough of the voices inside his head that were never meant to take root…until a masked serial killer known as Calavera strikes a little too close to home.Now, with Calavera on the loose, Barnes is ready to reconnect, risking his life—and his sanity. Because in the mind of this serial killer, there is one secret even Barnes has yet to see…"}, {"id": "1515901653", "genre": "Science Fiction & Fantasy", "title": "Caretaker", "description": "Ethan Bryant was supposed to fall asleep on a ship leaving Earth and wake up fifty years later with his family on the planet Minea. Instead, after the ship's caretaker-the lone human in charge of monitoring the ship's vital systems-suddenly died, the ship's computer locked Ethan out of his stasis chamber and gave him the job. That was five years ago. Five years of checking to make sure everything runs smoothly on a ship Ethan knows almost nothing about. Ethan is resigned to his fate, until the ship suddenly wakes up another passenger: a beautiful engineer who, along with Ethan, soon discovers a horrible secret-a navigation room hidden from even the ship's computer. The ship is not bound for Minea but somewhere far more dangerous. With the ship nearing its sinister destination, Ethan soon learns that he is the only one who holds the key to saving all 4,000 passengers from a highly-advanced, hostile alien race."}, {"id": "0786901640", "genre": "Science Fiction & Fantasy", "title": "Siege of Darkness (Forgotten Realms: Legacy of the Drow, Book 3)", "description": "The premium line of Salvatore hardcover releases continues with this haunting tale.This new release of the classic R.A. Salvatore novel continues the tale of Salvatore’s signature dark elf character Drizzt Do’Urden™. The series has now been re-numbered to tell the story of Drizzt’s life in chronological order rather than initial release order. Each title in the series showcases these top-selling novels in new, deluxe hardcover editions which feature brand-new cover art by Todd Lockwood and new introductions written by those who have become familiar with Salvatore and Drizzt over the years.R.A. Salvatore was born in Massachusetts and still makes his home there. He has published numerous Forgotten Realms novels with Wizards of the Coast, Inc., most of which have been New York Times best-sellers. He is also know as the best-selling author of the Star Wars Episode II: Attack of the Clones novelization from Del Rey.From the Hardcover edition."}]