[{"id": "077874874X", "genre": "Children's Books", "title": "Joshua Wong: Student Activist for Democracy (Remarkable Lives Revealed)", "description": "Joshua Wong was born in Hong Kong less than one year before China took back control of the city from the United Kingdom. While the handover was peaceful, Hong Kongs citizens lost their right to fully democratic elections. Joshua's leadership as an activist came to international attention in 2014, during pro-democracy protests in Hong Kong. The protest became known as the Umbrella Movement. Although Joshua and his student organization called Scholarism promoted peaceful protest, he was jailed for his participation. Undiscouraged, Joshua continues to advocate for full and free elections in Hong Kong. He has been the subject of a documentary called Joshua: Teenager vs. Superpower, and has been recognized for his work with many awards including TIME magazines 25 Most Influential Teens."}, {"id": "133803278X", "genre": "Children's Books", "title": "How Do Dinosaurs Choose Their Pets?", "description": "\"Can I keep it? It's so cute!\" Brimming with laugh-aloud humor, enormous dinosaur children surprise their parents by bringing home a wild menagerie of highly unusual pets! What would happen if your child walked in the door with a pet tiger? Or an elephant, boa constrictor, zebra, or kangaroo? Would you smile?Perfect for every child who has ever loved or yearned for a pet, this new uproarious book delights readers of all ages as they peek into the mischievous world of Jane Yolen and Mark Teague's bestselling dinosaur series. In the end, children and dinosaurs both learn which animals make the most practical pets, and the best places to find them-- including shelters and pet stores.Wonderfully silly, here is the perfect book for little dinosaurs who may soon have a furry, feathery, or scaly new friend in the house. If you were as big as the dinosaurs in this book, what pet would be your first choice?"}, {"id": "B005WK6KSO", "genre": "Children's Books", "title": "The Brightest Town...An Interfaith Holiday Story", "description": "The Brightest Town is an entertaining and educational story for children of all ages and faiths! Follow along with Miss Carrie and her young students as they share their school projects and learn how similar their beliefs and holiday traditions are in the process."}, {"id": "0635015358", "genre": "Children's Books", "title": "Father Claude Allouez: Jesuit Missionary (66) (1000 Readers)", "description": "Father Claude Allouez was a Jesuit missionary to New France. He was smart and brave. He stuck with his mission even though he had few converts. His dedication was impressive.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}, {"id": "0635028611", "genre": "Children's Books", "title": "Sarah Palin: Governor of Alaska (236) (1000 Readers)", "description": "These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group-reading programs, centers, library programs, and have many other terrific educational uses. This reader is perfect for kids following the 2008 presidential race!"}]