[{"id": "B00JEN6J8G", "genre": "Science Fiction & Fantasy", "title": "Eternal Starling (Emblem of Eternity Trilogy Book 1)", "description": "\"Eternal Starling will pull on your heart as it rockets through danger, conspiracy, and truly eternal love.\"—Aprilynne Pike, #1 New York Times bestselling author of the Wings seriesA love so strong, even eternity can't separate them. Evie Starling has lived a relatively uneventful life hanging out with friends, gossiping about boys, and driving her 1966 Mustang. All of that changes when she moves to Gunnison, Colorado, to start college and meets two mysterious men. For centuries, Alex Night and Emil Stone have yearned for Evie but they each have their own reasons for wanting to be with her. When both men claim to be her soul mate and tell her about an unbelievable past, Evie learns that she's not the person she thought she was. Soon, Evie finds herself in the middle of an age-old battle between the Amaranthine Society--the soul protectors, and the Daevos Resistance--the soul destroyers. With a past she doesn't understand, and a future rife with danger, Evie has to decide who she can trust. But Alex and Emil aren't the only ones who want Evie, and her soul is about to become the rope in an eternal tug-of-war.Emblem of Eternity Series Reading OrderEternal Starling, Book 1Eternal Echoes, Book 2Book 3, Coming 2017"}, {"id": "1501133225", "genre": "Science Fiction & Fantasy", "title": "Original Sin (Star Trek: Deep Space Nine)", "description": "Continuing the Deep Space Nine saga—an original novel from New York Times bestselling author David R. George III!At the end of 2385, in a significant shift of its goals from military back to exploratory, Starfleet sent Captain Benjamin Sisko and the crew of the U.S.S. Robinson on an extended mission into the Gamma Quadrant. Tasked with a yearlong assignment to travel unknown regions, they set out to fulfill the heart of Starfleet’s charter: to explore strange new worlds, and to seek out new life and new civilizations. But now three months into the mission, their first contact with an alien species comes in the form of an unprovoked attack on the Robinson. With the ship’s crew suddenly incapacitated, seventy-eight of the 1,300 aboard are abducted—including Sisko’s daughter, Rebecca. But Rebecca had already been kidnapped years earlier by a Bajoran religious zealot, part of a sect believing that her birth fulfilled the prophecy of the arrival of the Infant Avatar. Does her disappearance now have anything to do with the harrowing events of the past? And for what purposes have these enemies taken Sisko’s daughter and the rest of the missing?"}, {"id": "1631422006", "genre": "Science Fiction & Fantasy", "title": "Human++", "description": "What if technology could change your brain?A venture capitalist with a brain-damaged motherAt thirty-five, Mike Cohen lives the American dream. With billions in the bank and his own venture capital firm, he’s succeeded beyond his Russian immigrant mother’s wildest hopes. The only problem? A car accident that leaves Mike’s mother with memory problems.A technology that can transform the worldBrainocytes, a new technology developed by one of Mike’s portfolio companies, may be the answer to his mother’s injury—and offer applications that push the limits of the human mind. Only Mike isn’t the only one who sees its potential.A ruthless enemy with a dark agendaWhen a routine hospital trial turns into a violent kidnapping, Mike is plunged into a criminal underworld darker than anything he could’ve imagined. From the streets of Manhattan to the nightclubs of Moscow, Mike and his allies will have to use all their ingenuity to survive... and save the one he loves."}, {"id": "B019HOJLEU", "genre": "Science Fiction & Fantasy", "title": "god is a tuscaloosa drug addict", "description": "ZJ feels lost in a world that seems too evil for redemption. Arielle is a Cardinal-Bishop in the Roman Catholic Church with very peculiar ideas about faith and the role of religion. When the two meet for coffee one evening, their lives are forever intertwined. In Arielle, ZJ sees the light he searches for so desperately – something good he can cling to when the world is at its darkest. However, the closer Arielle and ZJ become, the harder it is for Arielle to hold onto her faith, until eventually there’s nothing left. In desperation, ZJ removes himself from existence. To save him Arielle must traverse Heaven and Hell to restore her lost faith. If she fails, history will be rewritten without the Crucifixion, without Christianity, and without her."}, {"id": "1582970262", "genre": "Science Fiction & Fantasy", "title": "The Writer's Complete Fantasy Reference", "description": "Do you know what a murder hole is?Or why a chimera is three times worse than most monsters?What would be better for storming castles, a trebuchet or a kopesh?To find the answers to these questions, you need this fascinating guide to transport yourself to fantasy's mysterious worlds. Featuring an introduction by mega-best-selling author Terry Brooks, the Writer's Complete Fantasy Reference reveals the facts behind the fantasy, giving you the details you need to make your fiction vibrant, captivating and original.From classic medieval witchcraft to ancient Mesoamerican civilizations, every chapter will spark your creativity. An invaluable resource, it will also help you fill your writing with inventive new ideas rooted in accurate descriptions of the world's most intriguing legends, folklore and mysticism.Take this guide, venture into the fantastic, and create magical realms alive with detail. Great stories await you!"}]