[{"id": "0439443008", "genre": "Children's Books", "title": "Nba's Awesome Duos Poster Book", "description": "The NBA (National Basketball Association) continues to score with its bestselling books on one of America's most popular sports.The photos in this 9 x 12 poster book capture all the energy, the excitement, the unbeatable power of NBA's dynamic duos who work together to bring their teams to victory.Stunning photograph will make readers fell like they're courtside, watching players such as Kobe Bryant & Shaq (L.A Lakers); Jason Kidd & Kenyon Martin (NJ Nets); and Michael Jordan & Richard Hamilton (Washington Wizards) shoot and score! The lively text highlights the terrific tandem performances of dynamic duos on 15 NBA teams."}, {"id": "1550742876", "genre": "Children's Books", "title": "Franklin's School Play", "description": "In this Franklin Classic Storybook, Franklin has been chosen to play the Nutcracker Prince in his class's production. But will he be too nervous to say his lines when the big night arrives?"}, {"id": "1911509039", "genre": "Children's Books", "title": "First Spanish Words (First Word Board Books)", "description": "More than 100 useful words, beautifully illustrated with bright, cheerful pictures, and cuddly teddy bears. This large, durable format is perfect for sharing with little ones to start their first steps in Spanish, and is ideal for kindergarten."}, {"id": "B00GSHWRB4", "genre": "Children's Books", "title": "Jimmy's Monster Truck (Jimmy the Racing Frog Book 2)", "description": "After winning every jumping competition in the world, Jimmy struggles to find something meaningful to do with his life.  When he enters the world of monster truck racing he discovers that the most meaningful moments can happen as he cares more about others than himself."}, {"id": "1511434449", "genre": "Children's Books", "title": "Liam, Are You Thankful?: A Thanksgiving Book for Children", "description": "Liam, Are You Thankful?: A Thanksgiving Book for Children  Best-selling author and illustrator Luis C. Lewis celebrates Thanksgiving with this delightful children's story. Little Liam has a mind of his own but will he learn the true meaning of Thanksgiving?  Liam, are you ready for Thanksgiving? Nope.  Join Liam in this cute new bedtime story for kids and discover whether or not Liam gets it his way.  32 pages Measures 6\"x9\" Full Matte Color Exterior Full Color Interior"}]