[{"id": "0794430163", "genre": "Children's Books", "title": "1 2 3 Count with Me!", "description": "This sturdy board book helps teach numbers with bright colors and cute illustrations.1, 2, 3 . . . counting is colorful fun in this brightly illustrated book of numbers. From four turtles to fourteen candies, and other vibrant pictures, kids will love learning numbers up to one hundred!"}, {"id": "9383145587", "genre": "Children's Books", "title": "Beasts of India", "description": "Here are India’s best-known beasts ― tiger, elephant, deer, snake... rendered by a variety of folk and tribal artists. Each of their artistic traditions conceives of the beast in distinctive ways, as original in the imagining as it is in the rendering. This handmade book is a new updated version of our classic Beasts of India, long out of print. Individually screenprinted on handmade paper, this wonderful introduction to Indian painting styles is an art and book lover’s dream."}, {"id": "1562942581", "genre": "Children's Books", "title": "Henry David Throeau (Gateway Biographies)", "description": "An illustrated presentation of the life and beliefs of Henry David Thoreau explores Thoreau's relationship with nature on Walden Pond and much more."}, {"id": "0516251228", "genre": "Children's Books", "title": "Pompeii: City Of Ashes (High Interest Books: Digging Up The Past)", "description": "Introduces the fateful days in 79 A.D. when Mt. Vesuvius erupted and the people in the ancient town of Pompeii perished."}, {"id": "193511882X", "genre": "Children's Books", "title": "Abraham Lincoln Was Here! A Kid's Guide To Washington D. C.", "description": "Washington D.C. is our nation's capitol, and it's a very exciting place.  Even though we aren't as old as Paris, London or Rome, we definitely have a history to be admired.  People come from all over the world to visit our nation's capitol, and the reasons are many. Known as the city of trees, Washington D.C. has trees from every state, and trees from many countries.  You can see embassies from other countries, the Whitehouse, Capitol Hill and more.  And while you are there, everyone is telling you about their city; and there is so much you and your kids can learn. Don't waste your vacation time with your children. Feed their minds, their souls and their imaginations.  Use this book as an introduction to D.C. and give your child an advance peek at what is ahead, use this book to talk about your trip, or use it as another learning resource and a step-off point for discussion.  Let your children know how much fun learning really is! Enjoy the poetry of award winning author and former teacher and  attorney, Penelope Dyan, and the wonderful photography of John D, Weigand, and have fun with yet another book from Bellissima meant for kids that looks perfect on your coffee table!"}]