[{"id": "0635005328", "genre": "Children's Books", "title": "Hawaii Survivor: A Classroom Challenge! (3) (Hawaii Experience)", "description": "The Survivor GameBook is reproducible and allows kids to learn about their state through timed activities, prize suggestions and an official survivor certificate. The book includes timed, multiple-choice questions, fill in the blank questions, choose the appropriate dates and matching that are challenging and fun to answer. This book covers fascinating state facts and meets state standards."}, {"id": "0316255149", "genre": "Children's Books", "title": "Boo, Boo, I Love You!", "description": "A bright and bold interactive experience for babies, enhanced with touch-and-lift fluffy animal shapes and a bright red heart, can be opened like an accordion or hung on the wall for decoration."}, {"id": "073584013X", "genre": "Children's Books", "title": "999 Tadpoles", "description": "“We’ll have to move,” says Mother, after realizing the pond is too small.  But moving a family of 999 young frogs is fraught with danger! Hungry snakes are crawling through the grass. Hungry hawks are flying through the sky. A young frog makes a mighty tasty morsel.  Never underestimate the quick wits of 999 young frogs!"}, {"id": "B06XCLVK6C", "genre": "Children's Books", "title": "The Five Senses for Kids | 2nd Grade Science Edition Vol 1", "description": "Let’s learn about the five senses that help you discover the world around you. They help you experience what life has to offer, and form good memories to treasure, too. At the end of this book, your child should be able to identify the body parts responsible for the five senses. You can use this book as a tool for discussing related school curriculum. Buy a copy now!"}, {"id": "B015424R6G", "genre": "Children's Books", "title": "Brendon & Carson's Ninja Adventures: The Great Grandmaster Rescue (Brendon and Carson's Ninja Adventure Series Book 4)", "description": "Picking up right where Book #3 left off.  Brendon, Carson, and the rest of Ninja Force must take on Bad Boys Inc new #1, Ninja JW, and save the grandmaster.  An Interactive story book for martial artist of all ages."}]