[{"id": "1554531411", "genre": "Children's Books", "title": "Looking Closely along the Shore", "description": "Look closely. Look very closely. Is it ? a string of beads? Stars in the sky? Give up? Just turn the page and, lo and behold, it's an ochre sea star! See what looks like a bird's beak revealed as a gooseneck barnacle, blades of grass as a blue mussel, and many more surprises when you look closely along the shore. The Looking Closely series takes children on a journey of discovery through four environments -- the forest, the shore, the desert and the garden. Frank Serafini's camera lens enlarges each world through the magic of close-up photography. Young eyes will rediscover our planet as a place of beauty, mystery and delight. Readers are first challenged to guess the identity of each close-up photograph. The next page reveals the entire photograph of the plant, animal or natural object accompanied by a simple but detailed description of the habitat. By inspiring children to ask questions and use their imaginations, these books help build problem-solving skills. They also encourage curiosity about environments that, examined this closely, are full of unexpected wonders."}, {"id": "0590680528", "genre": "Children's Books", "title": "The Names Upon The Harp: Irish Myths And Legends", "description": "Provides readers of all ages with an illustrated collection of Irish myths and legends, including \"The Birth of Cuchulain\" and \"Oisin in the Land of Youth.\" By the illustrator of When Jessie Came Across the Sea. 35,000 first printing."}, {"id": "B001AOK1EA", "genre": "Children's Books", "title": "Friends of the Round Table", "description": "In the twelfth century, Geoffrey of Monmouth wrote a series of tales that we have come to know as Arthurian Legend. In the absence of proof, no one can say whether his stories were fact, based on fact or outright fiction. In \"Friends of the Round Table,\" the mystery is solved when three adventurous adolescents vacationing in Cornwall, discover in a lakeside cave an ancient sword that they surmise can be none other than the legendary Excalibur. The sword immediately reveals its power by transporting them to sixth century Britain where the early days of the Dark Ages find the land to be a dangerous place of thieves, rogue knights and constantly warring kings. Gwen, Roger and Peter soon realize that Excalibur has a special purpose for them. Their mission involves helping a boy named Arthur to attain his kingdom and bring the country of Britain together as one nation so it will be strong enough to protect itself against the imminent invasion of Saxon armies."}, {"id": "0689863772", "genre": "Children's Books", "title": "Duck for President (A Click, Clack Book)", "description": "My fellow Americans:  It is our pleasure, our honor, our duty as citizens to present to you Duck for President. Here is a duck who began in a humble pond. Who worked his way to farmer. To governor. And now, perhaps, to the highest office in the land.  Some say, if he walks like a duck and talks like a duck, he is a duck.  We say, if he walks like a duck and talks like a duck, he will be the next president of the United States of America.  Thank you for your vote."}, {"id": "0195126114", "genre": "Children's Books", "title": "The Young Musician's Survival Guide: Tips from Teens & Pros", "description": "This lively book can help young people with some of the hassles involved in learning an instrument. It is filled with practical tips from older teens and from professional musicians, including Wynton Marsalis, Paula Robinson, James Galway, Andre Watts, Joshua Bell, and Evelyn Glennie, who tell how they handled learning-an-instrument problems as kids--and how they deal with some of those same issues today."}]