[{"id": "1683041585", "genre": "Children's Books", "title": "Jackson's Blanket / La mantita de Jackson", "description": "Jackson loves his blanket more than anything in the world. He's had it since he was born, and he brings it everywhere - to grandma's house, on vacation, to the doctor's office. His parents tell him he's too big to be carrying his blanket with him all the time, but he's just not ready to put it away! One day, when he finds a cold, lonely little kitten in the snow, Jackson realizes that sharing his blanket might be more important than keeping it all to himself. From Nancy Cote: \"As Jackson discovers, it's so easy to make the world a better place. Wrap your love around a homeless pet. Support your local animal shelter!\""}, {"id": "0971416109", "genre": "Children's Books", "title": "Miranda and Starlight (The Starlight Books, 1)", "description": "Ten-year-old Miranda Stevens is sent to live with her grandparents and when she accepts a dare, the consequences begin a chain of events that tests her courage and spawns some unexpected friendships."}, {"id": "1496541758", "genre": "Children's Books", "title": "Into the Storm: A Mermaid's Journey (Dark Waters)", "description": "When a hurricane threatens to harm the underwater homes of the merpeople, it is up to India Finch, a part-human/part-mermaid teenager, to warn her ocean friends. The mer decide to seek calmer waters, and as they travel, they are  attacked by a giant squid, with India at the center of harm's way. Gravely injured, India depends on the merfolks' willingness to risk their own safety to get her ashore where her injuries can be treated. Will the prejudice many mer hold against humans leave India at the end of her journey?"}, {"id": "1629917834", "genre": "Children's Books", "title": "The Smurfs: The Village Behind the Wall (The Smurfs Graphic Novels)", "description": "The world of the Smurfs expands as a Brainy Smurf, Smurfette, Hefty Smurf and Clumsy Smurf discover a new village filled with a whole population of girl Smurfs! A whole new world of challenges and adventures awaits the Smurfs!"}, {"id": "0833568175", "genre": "Children's Books", "title": "Murder in the Middle Pasture (Hank the Cowdog 4)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Hank the Cowdog is head of Ranch Security in this action-packed adventure series that will tickle funny bones of adults and children alike."}]