[{"id": "1535306505", "genre": "Children's Books", "title": "Motorcycles for Kids: A Children's Picture Book about Motorcycles: A Great Simple Picture Book for Kids to Learn about Different Types of Motorcycles", "description": "What is a touring motorcycle? And what is a sports bike? A touring motorcycle is a motorcycle especially designed for long range travel both on roads and off roads. This type of motorcycle has an upright seating position, larger fuel capacity, bigger displacement fairings and windshields to make long travel comfortable. A sports bike does not give much importance to riding comfort and fuel economy. It is designed to give great speed and acceleration. More trivia and fascinating information about motorcycles are featured in this book especially made for young learners. Over 90 motorcycles –touring, sports bike, street bike, dual sport motorcycle, cruisers and other types of motorcycles, from classic motorcycles to the newest ones, different brands, and more are presented in this book. Each motorcycle comes with its beautiful picture and easy to understand fun fact to fuel your child's fascination with motorcycles. It is truly great book for children to enjoy with the family."}, {"id": "B00OHWSIRY", "genre": "Children's Books", "title": "My Cats: Fun Reading Picture Book for Kids (Cute Animal Photos)", "description": "MY CATSDo you love cats and kittens?Cute cats and adorable kittens in this picture book are bound to bring a smile to your face and brighten up your day!  Your child's smile is also definitely worth more than anything!My daughter loves the cats and kittens in this picture book.So, why not take a look at these adorable cats and have fun reading together with your child!"}, {"id": "1476552193", "genre": "Children's Books", "title": "The Making of the Social Network: An Interactive Modern History Adventure (You Choose: Modern History)", "description": "It’s a great way to keep in touch with your friends 24/7―even if they live thousands of miles away! But the social network can also expose your life to others in a way you’d never dreamed could happen. Will you: Be a college student who designs a social media site that has the potential to make you a millionaire? Work for a government agency that develops a computer program to monitor people’s social network activity? Join a school club that uses social media to spread its message―but can also use it to hurt and bully others? Experience situations taken from real life. YOU CHOOSE what you’ll do next. The choices you make will either lead you to success―or to failure."}, {"id": "0545317584", "genre": "Children's Books", "title": "Chuggington: Brewster's Little Helper", "description": "Let's Ride the Rails!An ABSOTOOTLY appealing story featuring Chuggington's biggest and smallest chuggers! Zephie wants to pull freight just like the big chuggers. When she tries to pull one of Brewster's loads, she gets pulled right off the tracks! In the end, she learns that no chugger is too small to make a difference."}, {"id": "1486708064", "genre": "Children's Books", "title": "See How They Work & Look Inside Diggers: Big Rigs, Fire Trucks, Diggers, Farm Equipment (World of Wonder)", "description": "Presents some of the different types of vehicles that are designed for moving the earth, knocking down buildings, building roads and tunnels, mining, and other purposes, and describes their parts and how they are used."}]