[{"id": "0823956326", "genre": "Children's Books", "title": "Florence Griffith Joyner: Olympic Runner (Great Record Breakers in Sports)", "description": "A biography of the United States Olympic track and field star known as \"Flo Jo.\""}, {"id": "B073G33LXZ", "genre": "Children's Books", "title": "The Withers Awaken: Wither War Book Two: A Far Lands Adventure: An Unofficial Minecrafter’s Adventure", "description": "Krael, the Wither King, has been trapped deep underground, ending his reign of terror, and all the NPCs of the Far Lands have all put away their swords in peace except Watcher; the young archer still suspects Krael has bigger plans.He’s right. In the darkness of the Cave of Slumber, Krael awakens the imprisoned wither horde, and with the help of creepers and endermen, the wither army is released from their rocky jail. They spread across the Far Lands, searching for the ancient Vault of Weapons which will make the army of withers indestructible. But one man alone holds the secret to the Vault’s whereabouts: the Far Land’s last living NPC wizard. Watcher and his friends must race to find the wizard before Krael and his army of monsters. But if they fail, a wave of destruction, led by the King of the Withers, will sweep across the landscape, destroying everything—and everyone—they know."}, {"id": "0823957101", "genre": "Children's Books", "title": "Meet Beverly Cleary (About the Author)", "description": "A simple biography of the prolific children's author, Beverly Cleary, whose prize-winning writing career spans fifty years."}, {"id": "0750015225", "genre": "Children's Books", "title": "Buildings By Design Business Finance (Information Books - Science & Technology - by Design)", "description": "A colour illustrated guide to architecture from the first bare shells to the sophisticated structures of today, comparing how animal builders cope with problems in a similar way."}, {"id": "1547086149", "genre": "Children's Books", "title": "Happy Birthday 91: Birthday Books For Adults, Birthday Journal Notebook For 91 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]