[{"id": "0431013942", "genre": "Children's Books", "title": "Rain Forest Food Chains (InfoSearch: Protecting Food Chains)", "description": "The foliage is eaten by a mouse, that's eaten by a bat, that's eaten by a snake. This book explores the species and food chains and webs within a rain forest habitat, and discusses why these food chains and webs need to be protected."}, {"id": "0836843401", "genre": "Children's Books", "title": "Hockey (My Favorite Sport)", "description": "My Favorite Sport is an exciting series for young readers that brims with information about six popular sports. In each book, carefully matched text and photographs of participants-ranging from kids to college players and the pros-animate the history, objectives, exciting plays, and championships that characterize each sport. Each book also features a clear and colorful diagram of the field, court, or arena in which each sport is played."}, {"id": "B00MWAY3WW", "genre": "Children's Books", "title": "Two of Us", "description": "Can't wait to read We Can Work It Out? Return to the world of Penny Lane Bloom with three all new e-book short stories that pick up right where The Lonely Hearts Club left off!Penny Lane Bloom founded The Lonely Hearts Club, which means that she basically doesn't date. She's got her awesome girls to hang out with, she's got her hilarious (and sometimes annoying) family, she's working towards high grades to get into a great college - she'd never give up any of that to be with a boy.But (spoiler alert!) all of a sudden, the rules of the Club have changed and Penny's not only allowed to date - she's going out with Ryan Bauer, longtime friend, all-around amazing guy, and her best friend Diane's ex-boyfriend. It's not like Penny hasn't been on plenty of first dates before, and it's not like she hasn't seen Ryan practically every day for years . . . so could someone please let the butterflies in her stomach know it's okay to calm down?Don't miss all three e-shorts from romantic comedy superstar Elizabeth Eulberg. Each one contains a sneak peek at an excerpt from her return to the world of the LHC, We Can Work It Out!"}, {"id": "0742433021", "genre": "Children's Books", "title": "100+ Series: Spanish / English Math Practice, Grade 2 (The 100+ Series™) (English and Spanish Edition)", "description": "     This reproducible math workbook contains teaching instructions, examples, directions, and answers in both Spanish and English to address the needs of a growing diverse population. Each page is designed to address all subject areas of NCTM Standards. Activities focus on even and odd numbers, place value, grouping, regrouping, word problems, three-digit addition and subtraction, line segments and more. The icons at the top of each page make it easy to identify effective activities using Problem Solving, Reasoning and Proof, Communication, Connections, and Representation. Includes an introduction and answer key in both English and Spanish, pretests and post tests, skill checks, and cumulative tests.   "}, {"id": "1489637419", "genre": "Children's Books", "title": "H Is for Hockey: An NHL Alumni Alphabet (Av2 Fiction Readalong, Set 5)", "description": "Where was the first organized indoor hockey game played? When did the tradition of engraving winners' names on the Stanley Cup start? Which six brothers collectively played in more than 5,000 NHL games? Answers to these questions and many more can be found in H is for Hockey: An NHL Alumni Alphabet. Formed in 1999, the National Hockey League Alumni Association is affectionately known as \"Hockey's Greatest Family\" for good reason. Members of the NHL Alumni are considered hockey ambassadors, supporting the game and its history through many charitable causes and programs. Written by one of the game's foremost historians, this book pays tribute to them and the sport they love. Adding a personal touch are the memorable quotes sprinkled throughout the text. When 17-year-old Sidney Crosby was drafted by the Pittsburgh Penguins in 2005, he said, \"This is amazing. It's been a lot of hard work and a lot of sacrifices. It's unbelievable!\""}]