[{"id": "B00153BI0C", "genre": "Children's Books", "title": "My Larger Education", "description": "Booker T. Washington became one of the most important figures of the early 20th century America.  Despite being born a slave, Washington believed in peaceful protest.  Washington wrote extensively on his time as a slave as well as other parts of his life.  This edition of Washington’s My Larger Education includes a table of contents."}, {"id": "1628325135", "genre": "Children's Books", "title": "Boxers (Fetch!)", "description": "From playful boxers to people-pleasing pugs, there are dogs to match the lifestyles and personalities of many people. The newest Fetch! titles help future pet owners retrieve basic knowledge about the traits and history of four more popular dog breeds. Dynamic photos bound off the page, and the text gently instructs young owners in the care and responsibility of pets. At the end of each book is a panel about a famous pop-culture example of the breed, from Buster to Gidget. A brief overview of the physical characteristics, personality traits, and habits of the boxer breed, as well as descriptions of famous pop-culture boxers such as Wilson."}, {"id": "1432924397", "genre": "Children's Books", "title": "Ancient Africa (Africa Focus)", "description": "Where in Africa can you find the world's largest mud-brick building? Why did the Ancient  Egyptians mummify bodies? Who gave a giraffe to the Sultan of Tunis? Africa Focus offers  fascinating and detailed coverage of a diverse and complex continent. The four titles examine  different aspects of Africa and its interaction with the world."}, {"id": "1508177104", "genre": "Children's Books", "title": "A Visual Guide to Rocks and Minerals (Visual Exploration of Science)", "description": "By studying rocks, we can reconstruct the history of the earth. Even the most insignificant rocks can tell stories about other times because rocks have been around since the beginning of the universe. They provide clues about previous geological events and about what the earth's surface was like in the past. In addition, nearly all the modern products that surround us have elements provided by rocks and minerals, including aluminum cans, copper cables, and titanium spaceships. In this lavishly illustrated volume loaded with timelines, infographics, and diagrams, readers will find invaluable information about the language of rocks and will learn to identify the most important minerals, know their physical and chemical properties, and discover the environments in which they form."}, {"id": "031250215X", "genre": "Children's Books", "title": "Bright Baby Bilingual Touch & Feel: Numbers: English-Spanish Bilingual (Bright Baby Touch and Feel) (Spanish Edition)", "description": "This book will increase your child's vocabulary in English and Spanish by associating numbers with beautiful pictures and touch and feel elements."}]