[{"id": "B007SF8YBC", "genre": "Children's Books", "title": "Drawing Poesy: Dog Days2", "description": "A fancy story expressed by faburous drawings. One day, a little dog and his girl friend were playing in the woods. They met a squirrel who was crying. The squirrel led them into the deep woods. There was a problem of a pile of coconuts. They helped each other and learned how joyful to make effort together... You can enjoy this story without reading \"Dog Days (1)\". Readable in English and Spanish (Legible en Inglés y Español). Taste the world of poesy drawn."}, {"id": "0692587047", "genre": "Children's Books", "title": "Environmental Ant", "description": "Environmental Ant is a superhero who wants to take care of the environment. He is just not quite sure what the environment is. So he sets out with his best friend P-Yu,a stale cheese puff, to figure it out. Along the way they discover that even though they are small, they can do big things for the earth."}, {"id": "1974239616", "genre": "Children's Books", "title": "Composition Notebook: Grade 6 Notebooks For School or A Cool Journal For Kids (Back To School Notebooks)(Composition College Ruled 8.5 x 11)", "description": "Composition Notebooks For The Back To School is Cool KidsWhether it is the start of the school year or half way through it these school journals are great gifts for boys and girls, students of any age and teachers.Filled with ruled paper this school workbook is a must have for every student whether they are Grade 1, 2, 3, or even 6. It is 8.5 x 11, with 120 pages offering ample room for school homework and notes.These back to school journals work great for:Back to School Memory BookBack to School Supplies & EssentialsSchool Year Keepsake BookSchool Record & PlannerHomeschooling School SuppliesComposition Books & HomeworkTeachers Gifts & Stocking StuffersBirthday Gifts for KidsAnd much more…..Scroll up and grab a cool and unique school notebook for kids today!"}, {"id": "1400071542", "genre": "Children's Books", "title": "The Orphan King: Book 1 in the Merlin's Immortals series", "description": "The future of the Immortals is in the hands of an orphan My greatest fear was that they would find us and make of us a sacrifice beneath a full moon. Now you, Thomas, must help us destroy the circle of evil. The last words of a dying woman would change the life of young Thomas. Raised behind monastery walls, he knows nothing of his mysterious past or imminent destiny. But now, in the heart of medieval England, a darkness threatens to strangle truth. An ancient order tightens their ghostly grip on power, creating fear and exiling those who would oppose them. Thomas is determined fulfill his calling and bring light into the mysterious world of the Druids and leaves the monastery on an important quest. Thomas quickly finds himself in unfamiliar territory, as he must put his faith in unusual companions—a cryptic knight, a child thief, and the beautiful, silent woman whom may not be all she seems.  From the solitary life of an orphan, Thomas now finds himself tangled in the roots of both comradery and suspicion. Can he trust those who would join his battle…or will his fears force him to go on alone?"}, {"id": "0761139788", "genre": "Children's Books", "title": "Fandex Family Field Guides: Africa", "description": " Africa What do you know of Liberia and the American idealists who founded it? What do you know of Rwanda, the Sudan, Mogadishu? What do you know of the rare wild life of Madagascar, the Olduvai Gorg, Nelson Mandela and apartheid, the Pygmies, Timbuktu? What do you know of Congolese rain forests, Ethiopia's ancient Solomonic Dynasty, and Libya's Great Man-Made River, one of the world's most ambitious Engineering projects? A hand-held encyclopedia, AFRICA brings the wonders of this vast continent—people, geology, wildlife, history, folklore, and politics—to your fingertips. Includes dozens and and dozens of full-color illustrations, vital stats (capital, currency, flag and languages) and a map for every country.  50 INDIDIVIDUALLY DIE-CUT CARDSFULL COLOR THROUGHOUTKNOWLEDGE AT YOUR FINGERTIPS FOR THE WHOLE FAMILY"}]