[{"id": "1465408991", "genre": "Children's Books", "title": "DK Eyewitness Books: Electricity", "description": "The most trusted nonfiction series on the market, Eyewitness Books provide an in-depth, comprehensive look at their subjects with a unique integration of words and pictures. Eyewitness: Electricity presents the story of electricity — from the earliest discoveries to the technologies of today — explaining how our eyes receive light rays and turn them into electrical signals, how the chemicals in batteries work, how the invention of electric motors allowed for the creation of household appliances, what happens when you tune in the radio, and more."}, {"id": "1429652934", "genre": "Children's Books", "title": "How to Make Bubbles (Hands-On Science Fun)", "description": "This great how-to book will teach young learners how to make super soap bubbles! The simple text, clean layout, and clear pictures make this appropriate for kindergartners and up."}, {"id": "0606352678", "genre": "Children's Books", "title": "After A While, Crocodile (Turtleback School & Library Binding Edition) (Jake and the Never Land Pirates)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Tick tock! Tick tock! Captain Hook has a beastly time hunting for treasure in Crocodile Creek. Will Jake and the crew be able to save Hook from the Croc in the nick of time?"}, {"id": "1781212317", "genre": "Children's Books", "title": "War in the Pacific 1941-1945 (World War II: The Full Story)", "description": "World War II defined the lives of a generation and shaped the modern world. This new series gives readers an accessible summary of the war and an understanding of what the experience was like for those who lived through it-from the perspective of soldiers, generals, nurses, politicians and civilians."}, {"id": "1547109793", "genre": "Children's Books", "title": "Happy 62nd Birthday: Birthday Memory Book, Birthday Journal Notebook For 62 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}]