[{"id": "B01BJXYG9M", "genre": "Science Fiction & Fantasy", "title": "Dead Hunger IX: The Cleansing", "description": "Haven't read Book 1 in the series yet? Get it FREE on Amazon here: https://www.amazon.com/Dead-Hunger-Flex-Sheridan-Chronicle-ebook/dp/B005SHO3BC**COMPLETE 10-BOOK SERIES. No need to wait for the next book!**THE CLEANSING HAS BEGUN.Since 2011, Flex, Gem, Hemp, Charlie and their families have struggled to survive in a world gone dead.  Nearly twenty years later, at the dawning of 2029, they are under siege yet again.  After more than a decade of relative calm in the fortified city of Kingman, Kansas, A new onslaught of the walking dead has our heroes struggling to understand the reasons behind it.  There is no time to come up with a plan.  The fences appear inadequate and the Mothers and Hungerers are dead set on getting to the nourishment within . . . Everyone must band together and use their skills if they are to defeat the hordes of walking dead.Join them as they give it their all ... one last time."}, {"id": "B071P4QN3W", "genre": "Science Fiction & Fantasy", "title": "Pewfell in Drain of Chaos", "description": "The world's most irresponsible wizard, is about to face his greatest challenge yet: fatherhood! His wife pregnant and his home collapsing, wizard Pewfell takes a job with the Spirekassle City sewer patrol. But with a zombie-mad dictator running the government and a bloodthirsty army of chaos outside the gates, this may not be the best time to start a family. Join our hero as he deals with dirty diapers, unreliable contractors, idiotic co-workers, and a diminutive blue lodger hell-bent on a career in musical theater...A compilation of issues #15-20 of the Pewfell comic book series."}, {"id": "B00DLK6QP4", "genre": "Science Fiction & Fantasy", "title": "The Ascent (The Dragon Chronicles Book 2)", "description": "The battle for Eirenoch continues as the Knights of the Dragon take the fight into the Southern Kingdom. Still seeking his sixth and final knight, Prince Eamon frees the cities of the south one by one, incurring the wrath of The Lifegiver himself. His dark servant, The Prophet, arrives to show her support to Queen Maebh, Siobhan's twin sister, and finds that the estranged Queen has a pleasant surprise in store for her.Meanwhile the rebel Jindala, Khalid, is greeted at Tel Drakkar by Erenoth, and is taught to follow the Path of the Dragon. His training will test his strength, resolve, and dedication to The Dragon.Farouk, having been initiated by Jodocus as the Great Druid's apprentice, continues his training in the ways of nature. His innate abilities and gift of understanding attract the attention of the Great Mother, who begins to suspect that his uncanny gifts will be a valuable tool in the battle against evil.Behind the scenes, Garret embarks on the quest bestowed upon him by his Queen, and discovers the existence of an underground society that could be recruited to aid in the battle.New characters, exciting battles, and startling revelations await you in this second installment of The Dragon Chronicles."}, {"id": "0738856967", "genre": "Science Fiction & Fantasy", "title": "Eternity's Hope", "description": "The story opens with Prince Nirron, successor to the crown, mourning the great loss of his father, Stalaran's King. Through a magical messenger of his own, Nirron sends the white dove to his brother James in Camelot, requesting relief from the monstrous Dark Army who are bringing unbearable suffering to the people of Stalaran. Meanwhile, Camelot is rising with renewed strength. Then the dove arrives from Stalaran to whisper her message to James. Unable to control his grief and wait for the support of his fellow Knights, James heads to Stalaran first, to fight beside Nirron and defend his homeland. Although James has been warned he would face unparallel evil on the road to Stalaran, he will not be left to face it alone. Not only does he meet the beautiful Saraina who was sent by the Ancient One to protect him, but King Stefan and his Knights are also quick on his heels."}, {"id": "0765319233", "genre": "Science Fiction & Fantasy", "title": "Chronicles of the Black Company", "description": "Darkness wars with darkness as the hard-bitten men of the Black Company take their pay and do what they must. They bury their doubts with their dead.Then comes the prophecy: The White Rose has been reborn, somewhere, to embody good once more…This omnibus edition comprises The Black Company, Shadows Linger, and The White Rose―the first three novels in Glen Cook's bestselling fantasy series."}]