[{"id": "039958546X", "genre": "Science Fiction & Fantasy", "title": "Power Game (A GhostWalker Novel)", "description": "In this sizzling and suspenseful GhostWalker novel by the #1 New York Times bestselling author of Spider Game, two lovers discover there’s no telling who will come out on top.   When radical terrorists take hostages in Indonesia, Captain Ezekiel Fortunes is called to lead the rescue team. Part of a classified government experiment, Zeke is a supersoldier with enhanced abilities. He can see better and run faster than the enemy, disappear when necessary and hunt along any terrain. There are those in the world willing to do anything for power like that...   A formidable spy genetically engineered to hide in plain sight, Bellisia rarely meets a man who doesn’t want to control her or kill her. But Zeke is different. His gaze, his touch—they awaken feelings inside her that she never thought possible. He’s the kind of man she could settle down with—if she can keep him alive..."}, {"id": "078692893X", "genre": "Science Fiction & Fantasy", "title": "Monster Manual: Core Rulebook III  v. 3.5 (Dungeons & Dragons d20 System)", "description": "Fearsome and formidable foes lurk within. Encounter a horde of monsters armed and ready to battle your boldest heroes or fight alongside them. The fully illustrated pages of this book are overrun with all the creatures, statistics, spells, and strategies you need to challenge the heroic characters of any Dungeons & Dragons roleplaying game.Over 200 creeps, critters, and creatures keep players on their toes. From aboleths to zombies, the revised Monster Manual holds a diverse cast of enemies and allies essential for any Dungeons & Dragons campaign. There are hundreds of monsters ready for action, including many new creatures never seen before. The revised Monster Manual now contains an adjusted layout that makes monster statistics easier to understand and use. It has 31 new illustrations and a new index, and contains expanded information on monster classes and playing monsters as heroes, along with information on how to take full advantage of the tie-in D&D miniatures line planned for the fall of 2003 from Wizards of the Coast, Inc."}, {"id": "1466485795", "genre": "Science Fiction & Fantasy", "title": "Coren: Remnants of Betrayal: Book One", "description": "Ages have passed into time immemorial since the Ancient Ones displaced the Old Magic of the Dragons with their New Magic. But the New Magic fostered enmity between factions, who warred until they were reduced to only myth and legend - now nearly forgotten. And the New Magic faded.       But there was a time to come. . . a time for healing and renewal. And there were those Chosen to protect the relics from generation to generation until the time of prophecy should be fulfilled. Until the time of Coren.    COREN is the story of Ben, the chosen of the descendants of the Aldimahr, as well as the culmination and rediscovery of the fate and stewardship of Finaerhlann of Hailitheone.  Ben is destined to return the balance to Talamhsaol almost three thousand years after the land was shaken by the vast destruction caused in the last days of the Aldimahr and King Aeraethel.  He must do so by not only finding and claiming the six talismans used in the High King’s final betrayal, but also by harnessing the last of the New Magic which resides within them to seal the rift between the Dream World and this one.  In the process his potential is fully realized as he struggles to discover the truth about the importance of healing the rift between Talamhsaol and the Dream World, and his role in the events that unfold."}, {"id": "1492230340", "genre": "Science Fiction & Fantasy", "title": "Dusties (Spire Mystery)", "description": "The answer is there, in the dark... “So, your story is that you’re a Dustie?” said the shattered man. “A Dustie?” “Yes, of course a Dustie – a speck of human dust blown here by capricious winds…” In a world that has lost its light, among humans that have lost their memories, a tiny colony of newly awakened and isolated young Dusties struggle to make sense of and survive their bizarre surroundings. But as the survivors penetrate the enveloping darkness and tug at the mysteries around them, they begin to discover both a deadly threat and the elusive pattern that could save their existence. Set in a fascinating, uniquely eccentric setting beyond the realms of fantasy and science fiction, driven by an optimistic sense of adventure despite the dark surroundings, Dusties -- Book 1 of the Spire series -- is a thoroughly satisfying blend of action, layered mystery and pleasant romance that begins quietly, weaves its mysteries delightfully, and builds to a thrilling rush of unexpected discovery. At the end you will be eagerly awaiting your next visit with the circle of unforgettable characters. Cast off who you are and what you know, and gather together in the dark with the Dusties."}, {"id": "0989046621", "genre": "Science Fiction & Fantasy", "title": "Flying Away: Book One of the Flykeeper Chronicles", "description": "When Iolani Bearse was five years old, she lost her father to war. When she was nine, her mother died in a freak car accident. When Lani was fourteen, eerie green lights invaded, tearing her from the only home she had left.  Living as a runaway, dragging a horse and her cousin Eleanor across the countryside, Lani must learn to survive. Now Lani is the only person between the horrible, greedy lights and the last bit of family she has left. Her own heart is barely beating, but powerful memories pull her to Malcolm St. John. She fights what she feels, buried deep within her shattered soul.  Malcolm St. John always held his feelings in, especially about Iolani. So when she shows up on his doorstep, desperate and determined, Mal must decide if the wild tales she spins are the fragments of insanity or the last hope for a dying nation. This Lani is different from the child he knew. Something is coming for her, for him, and will not be stopped  If the cousins and Malcolm can't escape the grasping hunters who hound them, the future of a broken America will be destroyed. Everything Lani has ever loved will burn with them. Somehow, she must find a path through friendship and loyalty to save them all."}]