[{"id": "B01A2YJC1Q", "genre": "Children's Books", "title": "Forget Me Not: The World's Archaic Animals: Extinct Animals Books (Children's Zoology Books)", "description": "There are animals that no longer live but have contributed greatly to the evolution of the world. It is not right to just forget about them. That is why this picture book is dedicated to some of the world's archaic animals. It's going to be blast to the past so get a copy of this book now!"}, {"id": "1550051377", "genre": "Children's Books", "title": "Black Heritage (Discovering Canada)", "description": "  Black Heritage, the story of Canada's Black heritage is filled with important events and amazing people who helped shape the country's history and culture - people like:    Rose Fortune, North America's first policewoman,   Harriet Tubman, the Underground Railway's legendary \"conductor\",  Newspaper editor Mary Ann Shadd,   Elijah McCoy, the brilliant inventor who was \"the real McCoy\",  Alberta cowboy John Ware,  and Fergie Jenkins, the first Canadian elected to the Baseball Hall of fame.    "}, {"id": "0613262506", "genre": "Children's Books", "title": "Momentos Magicos/Magic Moments (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. A collection of fifteen Latin American folktales which include some variations on traditional stories as well as Aztec and Mayan creation myths and ghost stories."}, {"id": "B01LSVRYF8", "genre": "Children's Books", "title": "Live Fast, Die Young: a novella", "description": "Molly Corbett can’t stand seeing her childhood pal Alex Gibson destroy himself. He’s gone from straight-A student to rebel without a cause. With so much at stake, some serious interference is called for—or at least Micromanaging Molly thinks so. Alex needs to get back on the path to the Ivy League. But the harder Molly pushes Alex, the harder he pushes back.Alex has a secret. Well, two secrets. Number one: He has terminal melanoma. With six months to live, Alex hasn’t got a second to waste. And hanging around hospitals when his friends think he’s cutting school definitely counts as wasted time. Instead, he’s going to drop out, surf, drive fast cars…and finally put secret number two out there. He’s in love with Molly and he’s going to tell her before it’s too late."}, {"id": "0750251298", "genre": "Children's Books", "title": "What Happens When We Move? (How Your Body Works)", "description": "Well-annoted diagrams and vibrant photographs show both the internal and external workings of each system. This book compares humans with animals and provides fun health tests and checks. It is ideal for key stage 2 science curriculum."}]