[{"id": "1508163944", "genre": "Children's Books", "title": "Majority Rule Vs. Individual Rights (Spotlight on Civic Action)", "description": "The U.S. government is commonly characterized as being comprised of the Republican Party and the Democratic Party. These two parties have differing views of how the government should be run, therefore creating a divide in legislative processes. Majority rule refers to a democracy being governed by decisions upon which a greater portion of people has agreed. However, U.S. citizens have basic and inalienable rights that can't be violated by the government. This book explores these basic and inalienable rights in relation to majority rule, and provides insight to how these concepts are laid out in the U.S. Constitution."}, {"id": "1562392344", "genre": "Children's Books", "title": "Maya Lin: Honoring Our Forgotten Heroes (Everyone Contributes)", "description": "Presents the life of the young architect-sculptor who designed the controversial memorial honoring United States soldiers who served in the Vietnam War"}, {"id": "0606366997", "genre": "Children's Books", "title": "500 Hats Of Bartholomew Cubbins (Turtleback School & Library Binding Edition) (Classic Seuss)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Each time Bartholomew Cubbins attempts to obey the King's order to take off his hat, he finds there is another one on his head."}, {"id": "B009OUY1IE", "genre": "Children's Books", "title": "10 Little Pumpkins (A Counting Picture Book Book 7)", "description": "Teach your child how to count to ten with this fun '10 Little Pumpkins: A Counting Picture Book' featuring Jack O' Lantern pumpkins with different faces. Watch the delight in your child's face as he or she counts the Jack O' Lanterns on each page up to the number ten.Check out the other count to ten books in Ashley's 'Counting Picture Book' series while the introductory prices are still low. 10 Little Zebras10 Little Cows10 Little Hippos10 Little Pigs10 Little Penguins10 Little Elephants10 Little Ghosts10 Witch Hats10 Black Cats"}, {"id": "0448431319", "genre": "Children's Books", "title": "Smart About the Fifty States: A Class Report (Smart About History)", "description": "The kids in Ms. Brandt's class create a special report on the United States of America, with each child doing research on ten states. There's a double-spread map of the whole U.S. and a page for every state jam-packed with trivia, interesting facts, handwritten captions, and jokes. At the end of the book is a map showing how the United States grew over time, a spread on the presidents and what states they hailed from, as well as a \"bibliography\" of books the kids used in their research. Written by a team of well-known author/artists, this 64-page Smart About History book is a great guide for kids."}]