[{"id": "1906140383", "genre": "Science Fiction & Fantasy", "title": "A Tale to Be Remembered", "description": "A tale to be remembered begins in the quadrangles of Oxford University and the trail of events originates with a research project into the society and history of two very different islands believed to have existed in the mid nineteenth century in the mysterious region of the Bermuda Triangle.  Elsa Spencer is an unwanted orphan being brought up by her austere and remote Aunt Charlotte. Fate forces her to break free from her unhappy environment in Possia and she emigrates to the abandoned All Saint's Land to discover a different side to life. Over the years, she becomes a prosperous farmer and political leader. Her personality and her values bring her into conflict with the tyrannical autocratic loan shark, Vincent. He is determined to put Elsa and her 'democratically subversive' supporters back in their box: Elsa will do no such thing. The friction between them raises the temperature and the seams of their society are splitting. Only one side can win: freedom or tyranny. And the fate of their country will be determined."}, {"id": "1905850026", "genre": "Science Fiction & Fantasy", "title": "Babylon 5: The Rim (Babylon 5)", "description": "The Rim Beyond known space, there lies the Rim. There are a million stories about what lies out there - dead worlds, alien civilisations, impossible spacecraft, unimaginable treasures - but there is only one thing that all the tales agree on, and that's the danger. Far from the well-travelled jump routes and civilised planets of the core systems, the Rim is lawless, mysterious and deadly. As the Earth Alliance pushes out towards the Rim, in search of new colony worlds, new resources and new technologies, they risk awakening the ancient powers that slumber in this dark region of space. This is a not a safe place to be. This is the Rim... the Edge of the Abyss. The Rim Sourcebook for Babylon 5 opens up a whole new section of the galaxy for adventure and exploration. From the EarthForce Explorer Corps and the corporations who are funding Humanity's expansion into this region, to many new worlds and strange new races, the Rim expands the setting of the Babylon 5 rpg into worlds only briefly glimpsed during the series."}, {"id": "087462018X", "genre": "Science Fiction & Fantasy", "title": "The Lord of the Rings 1954-2004: Scholarship in Honor of Richard E. Blackwelder", "description": "Hammond (rare books librarian at Williams College, US) and Scull (former librarian of Sir John Soane's Museum, UK) present the 20 papers presented at the eponymous Marquette University Tolkien conference, held in October of 2004 in honor of the late entomologist and zoologist turned J.R.R. Tolkien scholar, Richard Blackwelder, whose collecting activities provided the foundation of Marquette University's Tolkein collection. About half of the papers focus on Tolkien's major work, The Lord of the Rings trilogy, while the others discuss other topics, including the rhetorical evolution of Tolkein's essay on Beowulf, Tolkien as a linguist, the role of Tolkien in education, and special collections in the service of Tolkien studies. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)"}, {"id": "B076L6LC4K", "genre": "Science Fiction & Fantasy", "title": "The Search for Cleo (The Last Time Traveler Book 4)", "description": "Repeatedly outsmarting a super genius is no easy task. This is true even when you happen to be the most intelligent man who ever lived. Robert Nathaniel Hood just happens to be that man. However, when someone is constantly scheming in the shadows, it's only a matter of time before they get the drop on you.Sometimes they sabotage your ship. Sometimes they clone your crew. Sometimes they do something completely unexpected. Fortunately for the universe, not to mention time itself, Rob always 'expects the unexpected'... Except when he doesn't."}, {"id": "140007780X", "genre": "Science Fiction & Fantasy", "title": "Einstein's Dreams", "description": "A modern classic, Einstein’s Dreams is a fictional collage of stories dreamed by Albert Einstein in 1905, about time, relativity and physics. As the defiant but sensitive young genius is creating his theory of relativity, a new conception of time, he imagines many possible worlds. In one, time is circular, so that people are fated to repeat triumphs and failures over and over. In another, there is a place where time stands still, visited by lovers and parents clinging to their children. In another, time is a nightingale, sometimes trapped by a bell jar.Now translated into thirty languages, Einstein’s Dreams has inspired playwrights, dancers, musicians, and painters all over the world. In poetic vignettes, it explores the connections between science and art, the process of creativity, and ultimately the fragility of human existence."}]