[{"id": "B06XSH112D", "genre": "Children's Books", "title": "10-Minute Tests for 11+ Maths Ages 8-9 - CEM Test", "description": "This CGP 10-Minute Test book is perfect for helping pupils aged 8-9 prepare for the Maths element of the CEM 11+ test.  It contains over 30 bite-sized tests, each one covering a variety of important Maths skills.  You can find complete answers for every question in a pull-out section at the back of the book, along with a progress chart so you can keep track of where your child is up to. And to help keep them motivated, there are fun, maths-based puzzle pages spread throughout the book."}, {"id": "B00P04YSPO", "genre": "Children's Books", "title": "The Arabian Peninsula in  Age of Oil (Making of the Middle East)", "description": "The Arabian Peninsula in the Age of Oil examines the impact this valuable resource has had on the political and social development of the region."}, {"id": "1433960230", "genre": "Children's Books", "title": "Samuel Adams and the Boston Tea Party (Graphic Heroes of the American Revolution)", "description": "Describes one of the most famous events in United States history, and explains in graphic novel form the role of Samuel Adams."}, {"id": "1435223047", "genre": "Children's Books", "title": "Batman: How to Draw", "description": "Dramatic action.  Amazing gadgets.  The thrill of super-villains being shut down by the guardian of Gotham City's shadows.  That's right -- THE BATMAN is back!Learn to draw the Caped Crusader!  By following the easy-to-use full-color instructions inside, you will be drawing Batman, villains such as Joker and Penguin, and incredible gear like the Batmobile like a pro faster than you ever thought possible!"}, {"id": "1894974697", "genre": "Children's Books", "title": "Gold Fever: Incredible Tales of the Klondike Gold Rush (Amazing Stories)", "description": "In 1897, tens of thousands of would-be prospectors flooded into the Yukon in search of instant wealth during the Klondike Gold Rush. In this historical tale of mayhem and obsession, characters like prospectors George Carmack and Skookum Jim, Skagway gangster Soapy Smith and Mountie Sam Steele come to life. Enduring savage weather, unforgiving terrain, violence and starvation, a lucky few made their fortune, and some just as quickly lost it. The lure of the North is still irresistible in this exciting account of a fabled era of Canadian history."}]