[{"id": "0375914595", "genre": "Children's Books", "title": "Chewing the Cud: An Extraordinary Life Remembered by the Author of Babe--The Gallant Pig", "description": "A candid and very funny memoir from beloved children’s book author Dick King-Smith.Before he was a children’s book author, Dick King-Smith was a soldier, a farmer, a salesman, a factory worker, and a teacher. But he was always a devoted family man who loved the countryside he lived in and the animals he kept. In this insightful memoir, Dick King-Smith recounts the joys and failures of his life with equal humor and candor. And he remembers a delightful cast of animal characters–from Anna, the dachshund who turned out to be just stubborn, not deaf, to the 600-pound pig Monty, who liked to be scratched on top of his head, to Wilhelmina, a pet badger who was fond of love bites. As readers delight in recognizing the inspiration behind many of Dick King-Smith’s books, they’ll also see how a collection of experiences made a man a writer.From the Hardcover edition."}, {"id": "0545889545", "genre": "Children's Books", "title": "Graveyard Shakes", "description": "Katia and Victoria are sisters and scholarship students at a private boarding school. While Victoria tries to fit in, Katia is unapologetic about her quirks, even though their classmates tease her. After a big fight, Katia runs away from school. And when Victoria goes looking for her, she accidentally tumbles into the underworld of a nearby graveyard. It is inhabited by ghosts, ghouls, and a man named Nikola, who is preparing a sinister spell that's missing one key ingredient.Victoria teams up with adorable Little Ghost and Nikola's kindhearted son, and together they search for Katia. They must find her before she becomes Nikola's next victim!"}, {"id": "1492659398", "genre": "Children's Books", "title": "Tiny the Mississippi Easter Bunny", "description": "It's Easter morning in Mississippi,and Tiny is out for a jog,but he STOPS in his tracks and discoversthe Easter Bunny STUCK in a log!With the Easter Bunny trapped, it's up to Tiny to save Easter in Mississippi! But being a bunny isn't as easy as it looks, especially for an elephant. In this fun and playful story, find out how Tiny uses his own special talents to save Easter!"}, {"id": "1454903570", "genre": "Children's Books", "title": "Tiger's Voyage (Book 3 in the Tiger's Curse Series)", "description": "The third book in the blockbuster Tiger's Curse series is now available in paper!  With a head-to-head battle against the villainous Lokesh behind her, Kelsey confronts a new heartbreak: after his ordeal, her beloved Ren suffers from amnesia and no longer knows who she !is. As she, Ren, and Kishan continue toward their goal of breaking the curse by challenging five cunning and duplicitous dragons, the two tiger princes once again vie for her affections—leaving Kelsey more confused than ever. This fast-paced novel includes a smartphone Tag code that links to the series website."}, {"id": "0816742057", "genre": "Children's Books", "title": "Icr Prehistoric Animals - Pbk (Deluxe) (I Can Read About Series)", "description": "Tells about the animals that lived seventy million to four hundred million years ago, and how they developed and lived"}]