[{"id": "0439916178", "genre": "Children's Books", "title": "I Am A Dump Truck", "description": "A board book shaped like a dump truck!I am a dump truck.See me dump the dirt.The backhoe digs up the dirt, the bulldozer pushes the dirt, the front loader lifts the dirt, and the dump truck carries the dirt. Little truck drivers will love learning the names of their favorite vehicles and seeing them in action!A book and toy in one!"}, {"id": "1429601264", "genre": "Children's Books", "title": "Being Famous (10 Things You Need to Know About...)", "description": "Do you dream of walking the red carpet? If youve got stars in your eyes and the desire for fame, heres what you need to know about life in the spotlight. From designer clothes to the celebs favorite hangouts, youll get the inside scoop on what being famous is all about."}, {"id": "0439568498", "genre": "Children's Books", "title": "Just For You!: Hurry Up!", "description": "The JUST FOR YOU!(tm) series features 24 beginning readers written and illustrated by people of color. Young readers will see themselves and their experiences reflected in these delightful books. They will read about how the characters spend their time with family and friends-at home, in school, at the park or barber shop, and other places in their community. These age-appropriate stories include books at three different reading levels. Plus, each book contains instructional-and fun-material for caregivers that targets comprehension and key vocabulary. For use with Grades K-1."}, {"id": "077871358X", "genre": "Children's Books", "title": "Medieval Medicine and the Plague (Medieval World (Crabtree Hardcover))", "description": "Illustrates how death and incurable disease were considered a common part of medieval life. This book covers topics such as: a timeline of medical changes through the Middle Ages; common medieval diseases and their causes, such as smallpox, tuberculosis, diphtheria, and leprosy; The Back Plague; the Four Humors; and, operations and treatments."}, {"id": "0756604478", "genre": "Children's Books", "title": "Maquinas Duras / Tough Machines (My 1st Board Books)", "description": "Diggers and tractors are hard at work in this little bilingual first word book.  Busy, tough, speedy, and rescue machines fill these little board books. Each spread features vivid photographs of a different type of vehicle, accompanied by a simple bilingual label. Building a vocabulary in Spanish and English is fun with these little books of things that go."}]