[{"id": "1580370896", "genre": "Children's Books", "title": "Africa, Grades 5 - 8", "description": "Explore Africa’s heritage and regional diversity through map activities, review questions, and in-depth questions for class discussion. A time line of African history by region and answer key are included."}, {"id": "1499419090", "genre": "Children's Books", "title": "Ancient Aztec Geography (Spotlight on the Maya, Aztec, and Inca Civilizations)", "description": "Geography and history come together as readers explore the ways the land and landscape influenced the ancient Aztec people. These two important social studies curriculum topics are presented in a fresh way as readers explore this fascinating ancient civilization. The detailed text is presented in an accessible way and alongside vibrant photographs and historical images, including carefully selected primary sources. Readers will enjoy learning about the ways water sources, landforms, and other geographical features played a part in creating the ancient Aztec civilization still studied by historians today."}, {"id": "B007FI0JXI", "genre": "Children's Books", "title": "The Cup Final Mouse Who Did It", "description": "A charming tale about a footballing mouse called 'Tiny Adams'. His manager 'Mr Mousinho' won't play him until one special day, Cup Final day. An injury to star player 'Rataldo' means Tiny will start his first game ever. But will Tiny succeed or fail?"}, {"id": "0791043908", "genre": "Children's Books", "title": "Superstars of Women's Golf (Female Sports Stars)", "description": "Discusses the history of women in professional golf and profiles such players as Babe Didrikson Zaharias, Nancy Lopez, Besty King, Pat Bradley, and Patty Sheehan."}, {"id": "0689850255", "genre": "Children's Books", "title": "Who'll Light the Chanukah Candles?", "description": "For eight nights, the menorah glows.Who will light it tonight?No on knows!Besides playing dreidel, eating latkes, and singing songs, everyone wants a turn to hold the shamash and light the Chanukah candles. You can celebrate the holiday by decorating with the shimmery foil stickers anywhere that needs a little Chanukah warmth!"}]