[{"id": "0545619416", "genre": "Children's Books", "title": "Duck on a Tractor", "description": "David Shannon's wildly popular, award-winning Duck on a Bike left children begging him to tell them another story about Duck after seeing him pictured alongside a shiny red tractor. Now Duck is back and turning the farm upside down! Flushed with the success of his trailblazing bike ride around the farm, Duck decides he's ready to drive the tractor. As in the bestselling Duck on a Bike, all the barnyard animals share their humorous comments as they watch Duck do the unthinkable. Then, one by one, they join him on the tractor for a ride!But what happens when Duck drives the big red tractor through town, past the popular diner where all the locals are having lunch? What will those folks really think when they see Duck and all the other animals riding around on Farmer O'Dell's tractor? Filled with entertaining detail and sly jokes, readers will pore over each picture again and again. Perfect for reading aloud!"}, {"id": "0439813786", "genre": "Children's Books", "title": "The Invention of Hugo Cabret", "description": "Orphan, clock keeper, and thief, Hugo lives in the walls of a busy Paris train station, where his survival depends on secrets and anonymity. But when his world suddenly interlocks with an eccentric, bookish girl and a bitter old man who runs a toy booth in the station, Hugo's undercover life, and his most precious secret, are put in jeopardy. A cryptic drawing, a treasured notebook, a stolen key, a mechanical man, and a hidden message from Hugo's dead father form the backbone of this intricate, tender, and spellbinding mystery."}, {"id": "0763666882", "genre": "Children's Books", "title": "Stink and the Freaky Frog Freakout", "description": "Croak! Squeenk! Ribbet! After a close encounter with a mutant amphibian makes him freaky for frogs, water-shy Stink becomes a swimming success.Stink may be super smart, and Stink may be uber clever, but he's been in the Polliwog swim class frog-ever and he still can't bear to put his face in the water. Why would he want a geyser up his nose, on purpose? But then something weird happens: Stink starts to see frogs everywhere — in the locker room, in his boot, in the bathtub. And when a freaky blue frog licks his arm, his froggy senses start tingling! He has an urge to slurp up raisins (that look like flies). He can't wait to play in the rain and mud. He's a wiz at identifying frog calls. And he has become very interested in the local frog population. Could it be that Stink is turning into . . . the amazing Stink-Frog, fighter of slime? Pree-eep! Craw-awk!"}, {"id": "0545348285", "genre": "Children's Books", "title": "Zane, Ninja of Ice (LEGO Ninjago: Chapter Book)", "description": "Masters of Spinjitzu: a new force to save the world!Sensei Wu wants Zane to become a Master of Ice -- but he's already a master of snow. There's no mountain anywhere that's a match for his snowboard. But he'll need more than his passion for sports to master Spinjitzu. . . ."}, {"id": "198151175X", "genre": "Children's Books", "title": "The Nutcracker (Christmas Stories) (Volume 2)", "description": "“The Nutcracker and the Mouse King” written in 1816 by E.T.A. Hoffman, is the story of little Marie weaving around the most cheap toy received as a Christmas gift - a nutcracker - a magical world full of charm and bewitched princes ... From the Christmas party with which Marie's journey begins up to the fantastic Realm of Sweets, all the important moments of this story fit perfectly into the winter holiday atmosphere. The coloring book \"The Nutcracker\" is very suitable for little ones, but also a great gift for Christmas holidays."}]