[{"id": "1534401067", "genre": "Children's Books", "title": "This Little Trailblazer: A Girl Power Primer", "description": "Learn all about influential women who changed history in this engaging and colorful board book perfect for trailblazers-in-training!Paving the way to a future that’s bright. Helping the world with their skills, smarts, and might.  Little trailblazers cause great big changes. In this follow up to This Little President and This Little Explorer, now even the youngest readers can learn all about great and empowering female trailblazers in history! Highlighting ten memorable women leaders who paved the way, parents and little ones alike will love this girl power primer full of fun, age-appropriate facts and bold illustrations."}, {"id": "0792274431", "genre": "Children's Books", "title": "How to Be an Ancient Greek Athlete", "description": "Athletes Needed—apply at your local gymnasium. Do you have what it takes to represent Athens at the great games at Olympia? The ancient Greeks believed in training the mind and body together, so once you start your training you'll study grammar, music, citizenship, and philosophy. At the same time, you'll be expected to develop all of your athletic skills: boxing, running, wrestling, the long jump, and the pentathlon.Once every four years the great games at Olympia take place. If you're good enough, you'll join athletes from all over the Greek world for a month of special training. Athletes must work hard—there is no second or third place.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "B01A3VU0S2", "genre": "Children's Books", "title": "The Skunk that Wants a Hug", "description": "A story that teaches us to allow time for others see who we are inside, and for us to take the time to get to know others when we meet them, beyond what we think we already know about them.  A children's story book about a skunk who experiences a surprise reaction to his friendly approach and learns through the gentle guidance of forest friends how to let others get to know who he is inside, and a life lesson about making friends. 18 beautiful color illustrations.  A book that the very young will love having read to them, and that early readers will enjoy reading for themselves."}, {"id": "1772271853", "genre": "Children's Books", "title": "A Walk on the Tundra", "description": "Follow Inuujaq, a little girl who travels with her grandmother onto the tundra, where she learns that the tough little plants she sees are much more important to Inuit than she originally believed. In addition to an informative storyline that teaches the importance of Arctic plants, this book includes a field guide with photographs and scientific information about a wide array of plants found throughout the Arctic."}, {"id": "1847807070", "genre": "Children's Books", "title": "Nature's Day: Discover the world of wonder on your doorstep", "description": "This first book of nature helps young readers to discover the world of wildlife on their doorstep. Beginning in spring, this book revisits nine different places, including the farm, the back yard, and the woods, during each of the four seasons through the year and explores the changing scenery and animal life found there. Informative and fun text teamed with gorgeous, decorative illustrations make this the perfect book to celebrate each season with."}]