[{"id": "B01A5C2JQ0", "genre": "Children's Books", "title": "A Riddle in Ruby #2: The Changer's Key", "description": "The Riddle in Ruby trilogy takes readers on a rip-roaring adventure through an alternate version of colonial America, where magic and science meet, and where one young thief carries a secret everyone wants. In this second volume, Ruby Teach has become the enemy’s prisoner. She bargained with her freedom to protect her friends—but her friends aren’t about to abandon her, either. That’s not what friends do.Ruby’s blood holds a secret, one that could turn the tides of the looming war for whomever unlocks it first. Ruby’s father, former pirate Captain Teach, and her friends—a motley crew made up of a young aristocrat, a servant, and an apprentice alchemist—must race against time to locate the hidden fortress where she’s being held. But the one person who could help them is Ruby’s mysterious and powerful mother, and no one has seen her since Ruby’s birth.Kent Davis sweeps our heroes through cities and the deepest wilderness with imagination, humor, and magic that fans of Jonathan Stroud and Terry Pratchett will devour. "}, {"id": "1770922385", "genre": "Children's Books", "title": "Cold!: Could You Stay Warm in the World's Wildest Places? (Survival Challenge)", "description": "Describes the effects of extreme cold on humans; explains how hikers and accident survivors can keep themselves warm by lighting a stove or fire, keep it going, and extinquish it safely; and recounts real-life survival stories."}, {"id": "B0711HL2JS", "genre": "Children's Books", "title": "Sammy the Scarecrow", "description": "Fun and fear mix charmingly in this tale of a scarecrow's unexpected Halloween night's adventure. Follow Sammy the Scarecrow as he experiences all the thrills and chills this holiday has to offer. This book is sure to become a seasonal favorite of all children."}, {"id": "0802852394", "genre": "Children's Books", "title": "Waiting for Noel: An Advent Story", "description": "As Nodl's family lights the Advent candles each week before Christmas, Nodl's father tells her the special story of the year her family waited and prepared for her birth on Christmas Day. Reprint."}, {"id": "184732973X", "genre": "Children's Books", "title": "Blackbeard's Pirateworld: Cut-Throats of the Caribbean", "description": "Blackbeard: his very name conjures up the glint of a razor-sharp cutlass, a sinister eye-patch, and trembling victims walking the plank. No ship was safe from him and his fellow scoundrels, and tales of their villainy have passed into legend. As rich and tantalizing as the very treasures Blackbeard seized, this swashbuckling storybook captures all the danger and adventure of life on the high seas With its lavish art--including illustrations of mysterious objects that may have belonged to Blackbeard himself--it's sure to rouse the spirits of all pirate enthusiasts!"}]