[{"id": "047134527X", "genre": "Children's Books", "title": "Kids Around the World Celebrate!: The Best Feasts and Festivals from Many Lands", "description": "Everyone loves a reason to have a good time, and although cultures around the world have their own unique feasts and festivals, we all share many of the same reasons to celebrate. Now you can learn about the many ways people from around the globe celebrate their special days, and join in the fun!  Celebrate Chinese New Year while making chiao-tzu dumplings, then pop over to Saudi Arabia and taste delicious date-nut cookies called ma amoul while celebrating Eid ul-Fitr. Make an elaborate Venetian mask to wear at a masquerade ball in Venice during carnevale, then pound out a festive rhythm on the Igbo drum you ve made and celebrate the Iriji festival in Nigeria. Eat, drink, and make merry with the many diverse and exciting crafts, recipes, and activities in this book. No matter what language you say it in, celebrations are fun!"}, {"id": "B076N2JFRC", "genre": "Children's Books", "title": "Hippomottie Learns To Get Dressed (Hippomottie Adventures Book 2)", "description": "Children's rhyming picture adventure story book for young readers. Suitable for ages 2 to 7. Makes a great bedtime story to encourage kids to love literature. The second title in the Hippomottie Adventure series. The book is about an adventurous hippopotamus who gets help learning to get dressed from a very special friend. Easy reading fiction book, beautifully illustrated with dozens of cute and adorable pictures."}, {"id": "0340589116", "genre": "Children's Books", "title": "Helping Children to Draw and Paint in Early Childhood (0-8 Years)", "description": "Interprets the meaning of children's drawing and painting within the context of their overall development. The book shows that drawing has meaning for children from their earliest years and explains the relationship between graphic representation and play."}, {"id": "1502632861", "genre": "Children's Books", "title": "Warriors of the Plains Tribes (Native American Warfare)", "description": "Crazy Horse and Sitting Bull are just two of the famous leaders of the plains tribes renowned for their prowess on the battlefield. This book looks at the military accomplishments of tribes living in the Great Plains of the United States and Canada. The book explores the integral role of warriors in Native American culture, describes prominent conflicts and wars, and provides biographical information about the warriors themselves."}, {"id": "1365861473", "genre": "Children's Books", "title": "LaDonna Plays Hoops", "description": "This is an inspirational and contemporary story of a young, African-American girl who goes to visit her grandma for a family reunion.  While there, she tries to become the family hoops star.  She wonders if she has the skill and the will.  The story presents subtle, everyday events that teach life lessons."}]