[{"id": "0881062928", "genre": "Children's Books", "title": "Alaska", "description": "Blending poetry and humor, Alaskan author and adventurer Shelley Gill explores the 49th state's history, culture, wildlife, and geography. Explosive volcanoes, extreme climates, massive mountains, shimmering Northern Lights, and dog-mushing races are just some of the sights captured in crisp photographs."}, {"id": "0008244626", "genre": "Children's Books", "title": "Ready, Steady, Practise! – Year 2 Comprehension Teacher Resources: English KS1", "description": "Clear guidance and creative activities in this pick-up-and-go resource help you to teach KS1 comprehension. Fully in line with the new National Curriculum. * Teaching notes, examples and photocopiable resources minimise preparation time.* Creative activities and games focus on using and applying knowledge to secure pupils' understanding.* An end-of-year test to assess pupils' understanding and recap on their learning.* Answers are provided at the back of the book for easy reference."}, {"id": "1426329849", "genre": "Children's Books", "title": "National Geographic Kids Guide to Genealogy", "description": "Inspired by the growing ancestry and DNA-testing crazes, this guide helps readers dig into the past and learn more about their own family history.What does your family tree look like? Where do its roots lead? Are you related to royalty? Start your very own journey and find out with this activity-packed guide to genealogy! This lively guide will get you started on researching your family's past and let you in on the newest and most up-to-date technology for genealogy research. Get tips on how to interview family members, create a family tree, and much more. Fun facts, lists, and sidebars offer additional tips and bring the dusty past to vivid life!"}, {"id": "0382391802", "genre": "Children's Books", "title": "Charlie Sheen, Emilio Estevez & Martin Sheen (Star Families)", "description": "Narrates the lives and acting careers of the Sheen family including references to the social justice issues which concerned Martin and which he instilled in his children"}, {"id": "B077R23ZJC", "genre": "Children's Books", "title": "The Lost Christmas Gift : (Children's book about Christmas, Bedtime Story, Picture Books, Ages 4-8, Preschool Books, Kids Book)", "description": "Just a great Christmas bedtime story for your little ones.Let's make this christmas special.\"All  children need  to get gifts for Christmas! Dreams must come true!”"}]