[{"id": "150554940X", "genre": "Children's Books", "title": "Rani Celebrates Holi (Little Princess Rani and the Palace Adventures)", "description": "Little Princess Rani and her friends are excited to celebrate the spring festival of colors, Holi, except her pet elephant, Bindi. Bindi is a very clean elephant and does not like to get messy by playing with colored powder in this festival. But Rani has an idea that will convince Bindi to take part in the Holi festivities. Find out how Rani convinces Bindi to enjoy the Holi fun in this very colorful adventure."}, {"id": "0590446894", "genre": "Children's Books", "title": "The Magic School Bus in the Time of the Dinosaurs", "description": "To celebrate its 20th anniversary, Scholastic is re-releasing the ten original Magic School Bus titles in paperback. With updated scientific information, the bestselling science series ever is back!The classroom is decorated as Dinosaur Land, but Ms. Frizzle-inspired by an archeological dig-craves a more authentic experience. The Magic School Bus turns into a time machine and transports the class back millions of years to an adventure where they learn about dinosaurs, their habitats and diets, and even a Maiasaura nesting ground."}, {"id": "0316758612", "genre": "Children's Books", "title": "Fiddle-I-Fee", "description": "In this cumulative nursery rhyme and folk song, a parade forms when several farm animals join a boy as he dances around the farmyard feeding the animals."}, {"id": "1631401505", "genre": "Children's Books", "title": "Adventures In Oz, Vol. 1", "description": "In the marvelous land of Oz, magic is always around the next corner. Dorothy, the Scarecrow, and their many friends can't stop plunging into one adventure after another in this collection by award-winning artist Eric Shanower. Includes “The Enchanted Apples of Oz,” “The Ice King of Oz,” plus an extras gallery featuring character designs, short stories, and more!"}, {"id": "B0774YCC7F", "genre": "Children's Books", "title": "The Smurfs (Issues) (23 Book Series)", "description": "Far away from here, in a land almost no human has ever seen, live the fantastically funny Smurfs! Only three-apples high, The Smurfs live in mushroom houses, eat sarsaparilla and cake, and speak their very own Smurfy language. But life in the village isn't always fun and fancy-free, not with the villainous sorcerer Gargamel and his snarling cat Azrael nearby! Papercutz is proud to present the complete collection of classic Smurf-tastic adventures from world-renowned cartoonist Peyo in this graphic novel series. These charming stories are some of the Smurfiest comics ever made!"}]