[{"id": "1635175607", "genre": "Children's Books", "title": "Cristiano Ronaldo", "description": "Introduces readers to the life and career of football star Derek Carr. Colorful spreads, fun facts, interesting sidebars, and a map of important places in his life make this a thrilling read for young sports fans."}, {"id": "0749655747", "genre": "Children's Books", "title": "Brunel the Great Engineer (Ways into History)", "description": "This text explores the life of this famous man, looking at how he created his work, and how he influenced the engineers who followed him. Readers are introduced to very basic engineering concepts and are encouraged to predict the outcomes of his projects."}, {"id": "1426301170", "genre": "Children's Books", "title": "World History Biographies: Joan of Arc: The Teenager Who Saved her Nation (National Geographic World History Biographies)", "description": "Around 1412, a baby girl was born in the village of Domremy who would change France forever. A farmer's daughter, she seemed destined for an unremarkable life. But as the dramatic narrative of this World History Biography reveals, Joan’s life was anything but ordinary. By the age of 13, she knew her destiny—to drive the English invaders from France. By 17, she had led an army to victory at Orleans. Captured in battle, and too poor to be ransomed, Joan was burned at the stake before her 20th birthday.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information."}, {"id": "1534411631", "genre": "Children's Books", "title": "Olivia 5-Minute Stories (Olivia TV Tie-in)", "description": "Twelve of Olivia’s favorite adventures are now available in one dazzling edition!Olivia loves to do it all! And with her great big imagination, Olivia can go anywhere. Would you like to come along? This treasury includes twelve of Olivia’s favorite adventures, each of which can be read aloud in five minutes. This sweet collection is perfect for busy little ones who are always on the go! Olivia’s 5-Minute Stories includes: OLIVIA Acts Out OLIVIA the Ballerina OLIVIA and the Haunted Hotel OLIVIA the Superhero Dinner with OLIVIA OLIVIA and the School Carnival I Can Do Anything! OLIVIA and Her Alien Brother OLIVIA Leads a Parade OLIVIA Makes Memories OLIVIA Dances for Joy OLIVIA Says Good Night OLIVIA TM Ian Falconer Ink Unlimited, Inc. and © 2018 Ian Falconer and Classic Media, LLC"}, {"id": "0448444127", "genre": "Children's Books", "title": "After School Rules (Miss Spider)", "description": "After school on a crisp, bright day in Sunny Patch, the kids are itching to get outside. But when half the group wants to play basketberry and the other half wants to play soccerberry, an argument ensues. Come along as the kids learn a lesson about friendship and compromise—and how great it is to have fun . . . together!"}]