[{"id": "B00VPFVW74", "genre": "Children's Books", "title": "Lion King: Book For Kids (Bedtime stories book series for children 4)", "description": "The Lion KingThese stories are great for quick bedtime stories and cute tales to be read aloud with friends and family!This is a “feel good” story with a moral. Children and adults will see a similar pattern of a child growing up in the world.Free Kindle Unlimited Books"}, {"id": "1577191587", "genre": "Children's Books", "title": "The Tale of Benjamin Bunny", "description": "Old Mr. Benjamin Bunny must hop to the rescue when Peter Rabbit and his cousin are caught in Mr. McGregor's garden. Full-color illustrations."}, {"id": "0486403033", "genre": "Children's Books", "title": "Sports Activity Book (Dover Little Activity Books)", "description": "Forty-eight puzzles challenge young players to race cars through a maze, identify the running shoe that's different from the others, locate 5 hidden golf balls, and much more. Solutions."}, {"id": "0316307564", "genre": "Children's Books", "title": "CatStronauts: Robot Rescue", "description": "In the fourth book in the CatStronauts graphic novel series, the stalwart Cat-Stro-Bot is stranded, and the CatStronauts have to stage an off-the-books robot rescue! Cat-Stro-Bot has been with the CatStronauts through it all. But now he's stranded on Jupiter's coldest moon after a mission gone wrong--and his best friend/creator Blanket isn't about to leave him behind. When CATSUP refuses Blanket's rescue mission request, he creates robo-stand-ins for the team so they can sneak off into space. Soon, the rest of the CatStronauts, Major Meowser, Pom Pom and Waffles, are off on their longest journey ever with experimental new technology. The robot rescue is afoot! In this full-color graphic novel, author/illustrator Drew Brockington takes the CatStronauts to new heights, adding in mounds of robot glitches, wonky cover-ups, and fish jokes by the ton!Also available simultaneously in hardcover."}, {"id": "0385392087", "genre": "Children's Books", "title": "The Little Airplane", "description": "Take flight with Pilot Small’s classic aerial adventure—now available as a board book! Tag along as Pilot Small takes his little red airplane up, up, up for a joyride! Newly simplified text, paired with Lois Lenski’s bright and charming art, makes an irresistible choice for youngsters already reaching for the sky!"}]