[{"id": "0688155669", "genre": "Children's Books", "title": "Amazing Graces: Prayers and Poems for Children", "description": "Timeless verses by Robert Browning and Ralph Waldo Emerson, modern reflections from Madeleine L'Engle and Nikki Grimes, and endearing works by young poets combine to make a delightful collection of poems and prayers for children and their parents. 50,000 first printing."}, {"id": "1680100769", "genre": "Children's Books", "title": "There Was an Old Giant Who Swallowed a Clock", "description": "There once was a giant who swallowed a clock. So he swallowed some knitting to muffle the ticking of the clock. Then he swallowed a moth to munch through the knitting, and then some honey to trap the moth! A hilarious retelling of There Was an Old Lady Who Swallowed a Fly."}, {"id": "1538323362", "genre": "Children's Books", "title": "Life As a Nigerian American (One Nation for All: Immigrants in the United States)", "description": "As immigration becomes an increasingly important issue in the United States, this timely book empowers readers to learn about the lives of Nigerian immigrants who have made new homes in America. Readers will learn about critical moments in modern Nigerian history that provide context for current events in the United States and around the world. They'll explore the complex issues affecting Nigerian Americans today and see the vivid, valuable ways Nigerian and American culture meld and interact. Powerful photographs bring this important issue into sharp focus, while fact boxes highlight key points. Accessible and highly relevant, this thoughtful book handles complex topics with sensitivity and helps readers develop greater cultural awareness."}, {"id": "1629914711", "genre": "Children's Books", "title": "Minnie and Daisy #1: Best Friends Forever", "description": "A collection of graphic novel stories starring best friends Minnie Mouse and Daisy Duck describes how they team up to have their own adventures when Mickey and Donald are away, solving the problems they encounter in their own fashion-forward ways. Simultaneous."}, {"id": "4805314400", "genre": "Children's Books", "title": "All About Japan: Stories, Songs, Crafts and Games for Kids", "description": "**2012 Creative Child Magazine Preferred Choice Award Winner!**A cultural adventure for kids, All About Japan offers a journey to a new place—and ways to bring it to life! Dive into stories, play some games from Japan, and learn some Japanese songs. Two friends, a boy from the country and a girl from the city, take us on a tour of their beloved land through their eyes. They introduce us to their homes, families, favorite places, school life, holidays and more!  Celebrate the cherry blossom festival Learn traditional Japanese songs and poems Make easy recipes like mochi (New Year's sweet rice cakes) and okonomiyaki (Japanese pizza or pancakes) Create origami frogs, samurai helmets and more!Beyond the fun and fascinating facts, you'll also learn about the spirit that makes Japan one-of-a-kind. This is a multicultural children's book for families to treasure together."}]