[{"id": "0545550440", "genre": "Children's Books", "title": "The Reading Race (Ready, Freddy! #27)", "description": "Freddy's class is competing in a read-a-thon, and the student who reads for the most minutes will win five free books -- and the class will win an author visit, too! Freddy plans to win this contest . . . even if it means staying up all night!"}, {"id": "0448407396", "genre": "Children's Books", "title": "The Bunnies' Easter Bonnet (All Aboard Book)", "description": "When twin bunnies Clarence and Clarissa Cottontail set out to win a bicycle built-for-two in the Easter bonnet contest for the Alfaville Easter Parade, they have lots of competition from other animals who are putting together fantastic creations."}, {"id": "B00BUGDW1M", "genre": "Children's Books", "title": "Benny the Bonny Bunny and the Easter Surprise", "description": "Everyone loves the Easter bunny - especially when he's taking over from his Dad. Benny the Bonny Bunny is given the chance to be the Easter bunny, which is a huge responsibility. Will he do it right? What calamities might possibly happen to him on his first day in the job?Written in playful rhyme, and illustrated with comic-book-style cartoons, this book is a pleasure to read aloud with young children.In fact, you won't want to just keep it to Easter. Read it again and again, throughout the year."}, {"id": "1521762473", "genre": "Children's Books", "title": "Garby The Garbage Truck", "description": "Teach your child about recycling and the environment. Join Garby as he picks up garbage and finds out the landfill is full. After a bump in the road, he realizes that it isn’t all garbage afterall."}, {"id": "0679890521", "genre": "Children's Books", "title": "Trail of Tears (Step-Into-Reading, Step 5)", "description": "In 1838, settlers moving west forced the great Cherokee Nation, and their chief John Ross, to leave their home land and travel 1,200 miles to Oklahoma. An epic story of friendship, war, hope, and betrayal."}]