[{"id": "0688136478", "genre": "Children's Books", "title": "Seeing Is Believing (Greenwillow Read-Alone)", "description": "Two folktales, one from Ireland and one from Cornwall, about Tom and his encounters with a leprechaun and piskies, which convince him that they are real. \"The visual balance of text and illustration completes the elegance of the book.\" --Booklist"}, {"id": "1467778494", "genre": "Children's Books", "title": "The Flower Girl Wore Celery", "description": "Emma can't wait for her cousin Hannah's wedding. She's going to be the flower girl. That means she'll wear a celery dress and walk down the aisle with the ring bear, leading the way for the happy bride and groom. Or at least, that's what Emma assumes. But nothing turns out to be quite what she's expecting."}, {"id": "B00A4172SI", "genre": "Children's Books", "title": "Little White Duck: A Childhood in China", "description": "The world is changing for two girls in China in the 1970s. Da Qin—Big Piano—and her younger sister, Xiao Qin—Little Piano—live in the city of Wuhan with their parents. For decades, China's government had kept the country separated from the rest of the world. When their country's leader, Chairman Mao, dies, new opportunities begin to emerge. Da Qin and Xiao Qin soon learn that their childhood will be much different than the upbringing their parents experienced."}, {"id": "B075M2VRKZ", "genre": "Children's Books", "title": "Abby's World: Elephant, Please Go Back to the Zoo!", "description": "Abby finds an elephant in her house and calls the zoo to find out how it got there. She learns that several other animals have also gone missing and is asked to find them and send them home. After searching she finds all of them. They will not leave, however, until she asks nicely. A fun short story teaching the use of manners."}, {"id": "0439057469", "genre": "Children's Books", "title": "Home Run Heroes: Mark McGwire and Sammy Sosa", "description": "In back-to-back format, describes the efforts of Mark McGwire of the Cardinals and Sammy Sosa of the Cubs to break the record of 61 home runs hit in 1961 by Roger Maris."}]