[{"id": "B003T0GA2U", "genre": "Children's Books", "title": "The Magic Bean Tree: A Legend from Argentina", "description": "In the middle of the wide Argentine pampas there once grew a magic tree. Above this tree slept a bird so evil it could stop the rain from falling. And not far from this tree lived a brave boy who one day set out to save his village and all the creatures from dying of thirst. Illustrated with charming folk-art-like paintings and retold with simplicity and drama, this legend of a child's courage and faith explains why Argentineans believe that good luck can be found in the shade of a carob tree."}, {"id": "141143482X", "genre": "Children's Books", "title": "Subtraction (Flash Kids Flash Cards)", "description": "Flash Kids Flash Cards offer essential practice in key concepts such multiplication, division, the alphabet, sights words, and state capitals. Containing 88 cards in each package, these cards are sturdier than others on the market. "}, {"id": "1589526597", "genre": "Children's Books", "title": "Coretta Scott King (Discover the Life of an American Legend)", "description": "A brief biography of the wife of the Reverend Martin Luther King, Jr., who shared his dedication to working peaceably to achieve equality for all Americans."}, {"id": "1470748525", "genre": "Children's Books", "title": "Is Anyone Out There? (Best of Buddies)", "description": "It doesn’t matter how big you are — there’s always something bigger. As Bubba swims the endless ocean, he loses his way and gets lonely. But with every bubble he blows and every flip of his fin, Bubba remembers God never leaves his side. Kids learn in Is Anyone Out There? that God is always with them.  Check out the entire Best of Buddies series, including:• I’ve Got This! • I Was Born for This! • Uh-Oh! I Did It Again! • I Can Do Anything!(The Buddies featured in the Best of Buddies series are from Group’s Maker Fun Factory Vacation Bible School)  "}, {"id": "B073V866CM", "genre": "Children's Books", "title": "Confronting the Wizards of Erda (Jewels of Erda Book 2)", "description": "Two of the Jewels have no Holders and they must be found. The Brotherhood of Wizards also seeks to find them. Jindera is one of the pair and she must escape her cruel uncle. She wishes to find her twin brother taken by the Wizards who will use him in their attempt to destroy the Jewels of Erda. As twins, they can speak via the Inner Path. The Wizards hope to use this.Mara, is a clanless desert dweller and faces life as the abused plaything of a future clan leader. She flees into an unknown future. On the winds, the crystals call this pair."}]