[{"id": "1530080681", "genre": "Children's Books", "title": "Big Chinese Workbook for Little Hands (Kindergarten Level, Ages 5+) (Volume 1)", "description": "www.BigChineseWorkbook.com A new approach to writing characters (simplified). A breakthrough in teaching Chinese to young learners. Fun and easy to learn. Designed for kids living in English speaking countries and/or regions, Chinese heritage or non-Chinese heritage. Fulfilled with fun activities that provide training in pre-writing skills (6 basic strokes and 19 most commonly used compound strokes), language skills such as colors, shapes, numbers, dates, and sight words (most frequently used characters). Also introduces the unique measure word system in Chinese.  Recommended by teachers and linguists to be used for self-study or in supplement to any Chinese school curriculum. No textbook is required for using this workbook. This book uses simplified characters."}, {"id": "B01N9BLJB1", "genre": "Children's Books", "title": "Toby Goes Bananas", "description": "Toby may be the class clown, but he's smart enough to know what's what.  Whether he's late for school, early for recess, or just in time to fail the next quiz, he's always got something to say about it. But even though his friends think he's funny, the adults in his life aren't laughing--mostly because they're not in on the jokes.  No matter!  Toby makes the best of it as he coasts through the day on his wit and good humor!"}, {"id": "1421523299", "genre": "Children's Books", "title": "The Legend of Zelda, Vol. 3: Majora's Mask", "description": "R to L (Japanese Style)The manga adapation of the legendary video game series, now available in English for the first time! Become part of the Legend – the Legend of Zelda!The Legend of Zelda is a high-fantasy adventure based on the wildly successful and long-running video game series by game designer Shigeru Miyamoto. In February 2000, Shogakukan began publication of manga artist Akira Himekawa's adaptation of nine of the most well known Nintendo games in the series. Each story follows the adventures of Link, the hero of the video game series, as he battles the forces of evil to save the Sacred Realm. Majora's Mask:After sealing Ganondorf in the Sacred Realm, Link returns to the time when he was a boy. Peace has returned to Hyrule, but his old friend Navi is missing. While wandering the forest in search of Navi, he meets Skull Kid, who is wearing Majora's Mask, an artifact said to grant your wishes. The mischievous Skull Kid steals the Ocarina of Time from Link and turns Link into a Deku Nut!"}, {"id": "0843133554", "genre": "Children's Books", "title": "Grand Slam Mad Libs", "description": "Put on your jersey and step up to the bat for some fill-in-the-blanks about America's favorite pastime. With 21 stories about the game, the ballpark cuisine, the legends, and the glory, you'll be singing, \"Take me out to the __________________ [noun] game!\""}, {"id": "B06XCF8H6J", "genre": "Children's Books", "title": "Birds That Live at the Water's Edge | Children's Science & Nature", "description": "Open the world of birds to your kids with this book. This book features birds that specifically live at the edges of water formations. Add another group of animals to your children’s science and nature vocabulary with this wonderfully illustrated animal book. Grab a copy for your little one today!"}]