[{"id": "1855612313", "genre": "Children's Books", "title": "GUGLIELMO MARCONI AND RADIO (SCIENCE DISCOVERIES S.)", "description": "-- Clear and concise biographies of the world's most important and influential scientists -- Traces the development of revolutionary ideas and inventions that continue to shape the way we live -- Complemented by full-color paintings, drawings, and photographs Learn about the innovative Italian scientist who ushered in the era of wireless communication."}, {"id": "0061131679", "genre": "Children's Books", "title": "Firestar's Quest (Warriors Super Edition)", "description": "An epic stand-alone adventure in Erin Hunter’s #1 nationally bestselling Warriors series!Set just after the events of Warriors #6: The Darkest Hour, this Super Edition follows the ThunderClan leader Firestar on a quest to uncover a long-forgotten truth.It is a time of peace between the warrior Clans, and all four are thriving. Then Firestar, leader of ThunderClan, discovers a terrible secret: the warrior ancestors of StarClan have lied to him. Firestar must embark on a perilous journey to right their wrong—and nothing will ever be the same again.Join the legion of fans who have discovered the epic adventures, fierce warrior cats, and thrilling fantasy world of the mega-bestselling Warriors series. This stand-alone entry is perfect for new readers and dedicated fans alike. "}, {"id": "1423391756", "genre": "Children's Books", "title": "Crows & Cards", "description": "Three warnings for listeners who hate surprises:1. Beware of slivers,2. and gamblers,3. and aces.Zebulon Crabtree found all that out the hard way back in 1849 when his mother and father shipped him off to St. Louis to apprentice with a tanner. Too bad he had serious allergies to fur and advice from his parents. Hearing the beat of a different drummer, Zeb takes up with a riverboat gambler who has some special plans for him, crosses paths with a slave who turns out to be a better friend than cook, and learns that some Indian medicine men can see even though blind. And then there’s the Brotherhood―the one that Zeb can’t seem to get out of.…"}, {"id": "B01LY78VA5", "genre": "Children's Books", "title": "Nighttime Play (Stories of the Magic Sword Book 2)", "description": "This is the second book in a series about a stuffed blue elephant named Rementa and his magic sword. The stories come from our family bedtime ritual and are told by my five and six year old sons with some help from me. The ritual was born out of a desire to let them participate in the story telling but also because of a lack of 'entry level' chapter books for readers of that age."}, {"id": "B00LPP38EO", "genre": "Children's Books", "title": "Twenty-Four Pierre-Auguste Renoir's Paintings (Collection) for Kids", "description": "Have you ever wanted to enrich your child with the arts and humanities? or Have you ever wanted to decorate your child's room with great paintings from one of your favorite painters? Well, you can start with Pierre-Auguste Renoir's Paintings. Twenty-Four Pierre-Auguste Renoir's Paintings (Collection) for Kids There are colorful, youthful, and inspirational."}]