[{"id": "B076X6DF1V", "genre": "Children's Books", "title": "African Penguin Facts For Kids is an animal facts book for kids ages 3-7: Knowledge about African Penguin  and with high quality pictures.", "description": "This book Learn about  Pride MattersLarge KittiesThreat AheadOn the Spot!Shout OutThe Mane TraitNonfiction books help children learn animal knowledge. Children are naturally curious about the world around them.Tags: African Penguin,African Penguin habitat,African Penguin pictures,African Penguin facts, African Penguin Fun facts, baby African Penguin, African Penguin photos"}, {"id": "1943145288", "genre": "Children's Books", "title": "The Dragon Slayer: Folktales from Latin America: A TOON Graphic", "description": "How would a kitchen maid fare against a seven-headed dragon? What happens when a woman marries a mouse? And what can a young man learn from a thousand leaf cutter ants? Famed Love and Rockets creator Jaime Hernandez asks these questions and more as he transforms beloved myths into bold, stunning, and utterly contemporary comics. Guided by the classic works of F. Isabel Campoy and Alma Flor Ada, Hernandez’s first book for young readers brings the sights and stories of Latin America to a new generation of graphic-novel fans around the world."}, {"id": "0143783777", "genre": "Children's Books", "title": "The Lina Stories: 4 Books in One (Our Australian Girl)", "description": "It's 1956 . . . and Lina dreams of being a writer, but her strict Italian parents have other ideas. Now that she's won a scholarship to an expensive girls school, Lina has other troubles, too. But the Melbourne Olympic Games could be an opportunity for Lina to follow her dream of working on the school paper. Journey with Lina across all four exciting stories about a passionate girl finding a place to belong. Includes Meet Lina, Lina's Many Lives, Lina and the Games, and A Lesson to Lina—and a bonus chapter telling readers what happened next for Lina!"}, {"id": "0843183535", "genre": "Children's Books", "title": "Diary of a Wimpy Kid Mad Libs", "description": "Fans of the Diary of a Wimpy Kid book series will go crazy for our brand new Mad Libs, featuring 21 fill-in-the-blank stories starring Greg, Rowley, Manny, and the rest of the gang!"}, {"id": "B00BQ8RE5O", "genre": "Children's Books", "title": "Orwell's Luck", "description": "When a wounded wild rabbit is found in the front yard, he is given a good home and a memorable name by a twelve-year-old with a liking for basketball, the trombone, and the newspaper’s daily horoscope. But Orwell is no ordinary rabbit. It soon seems that he is attempting to reward his young caretaker by mysteriously sending coded messages in the form of predictions: the final score of the Super Bowl, advance notice of a pop quiz at school, tomorrow’s winning lottery number! Can this little rabbit foretell the future? Can Orwell actually make luck happen? Here is a magical and heartwarming story about kindness, friendship, and hope in the shadow of fortune’s ever-turning wheel."}]