[{"id": "0670881813", "genre": "Children's Books", "title": "Mark Twain and Huckleberry Finn", "description": "Examines the personal life and literary career of Samuel Clemens, the American humorist and author of many well known books, including the somewhat controversial title, The Adventures of Huckleberry Finn. "}, {"id": "1974315711", "genre": "Children's Books", "title": "Best Coach Ever: Baseball Coach Gifts (Baseball Notebook Journal)(Baseball Books For Kids)(V24)", "description": "The Best Gift Ever For Baseball CoachesDo you have that special baseball coach in your life and need an awesome coach’s gift for them? Stop buying them useless cards and weight gaining donut gift cards.This journal is 6x9 108 lined pages making it perfect for writing down coaching notes, player’s names and what crazy parents to avoid. Oh come on you know they are out there.Your baseball coach will appreciate the thoughtful gift and use it for seasons to come.With the phrase Best Coach Ever and dozens of different cover options there is sure to be one to appeal to any baseball player’s tastes. Great baseball books for kids to give as gifts.Grab your baseball notebook journal today."}, {"id": "1543506143", "genre": "Children's Books", "title": "Football's Best and Worst: A Guide to the Game's Good, Bad, and Ugly (The Best and Worst of Sports)", "description": "Football is a game of touchdowns and fumbles, first downs and failures, wins and losses. Check out the very best and worst that football has to offer with Football’s Best and Worst."}, {"id": "0316557552", "genre": "Children's Books", "title": "My Little Pony: The Movie: Friends and Foes (Passport to Reading Level 2)", "description": "An exciting leveled reader based on My Little Pony: The Movie, releasing in theaters October 2017. Join Twilight Sparkle, Rainbow Dash, Pinkie Pie, Applejack, Rarity, and Fluttershy on the adventure of their lives!Passport to Reading Level 2 © 2017 Hasbro. All Rights Reserved."}, {"id": "1847806279", "genre": "Children's Books", "title": "My Village: Rhymes from Around the World", "description": "In a new edition of this special book, 22 nursery rhymes from Iran to Iceland and Samoa to Switzerland have been carefully chosen and beautifully illustrated by Mique Moriuchi. A celebration of cultural diversity, each poem appears in its original language (19 languages are included) next to an English translation so young children can delight in quirky, touching and funny verses from all over the world."}]