[{"id": "152023774X", "genre": "Science Fiction & Fantasy", "title": "Fall of Zona Nox (Warpmancer Series)", "description": "Zona Nox is on the verge of annihilation…Life on the frontier of human space is tough. Life in Galis City, capital of Zona Nox, is tougher. For James, it’s just life.James is one of the many gangsters who fight over the seas of shanties that dominate Zona Nox. He’s a master thief. One of the best. In this city of gangsters, James is a legend. But legends can fade.Xank, a mysterious alien empire, have invaded Zona Nox. Troopers, Zona Nox’s self-styled protectors, can’t stop the invaders. The gangs of Galis are too busy fighting to realise their days are numbered.In the fires of war, James could disappear into the mass graves, forgotten. Or, he could become greater than even before.Zona Nox is on the verge of annihilation. Will a criminal be able to save it?"}, {"id": "B0786HXFC8", "genre": "Science Fiction & Fantasy", "title": "Cure the Enemy (A Steampunk Novella)", "description": "Inside the city of Dirth, Isobella is a master chemist. She's well-known among the human race . . . that is, until Romaine turned her into a werewolf and uses her knowledge to begin the ending of the werewolf clan's struggle for power over the city's territory. Isobella finds the cure, while discovering what Romaine truly is. Will she be able to turn the tables, using the cure for werewolf-ism against her new foe?"}, {"id": "078693977X", "genre": "Science Fiction & Fantasy", "title": "1: Saving Solace (Dragonlance: Champions, Vol. 1)", "description": "Solace is booming out of control. An important temple dedication is bringing merchants, dignitaries, and a host of ne’er-do-wells and surprise visitors to the fabled tree-top town. And lately there have been a series of mysterious incidentsÉ.Palin has sworn off magic and nowadays acts as town mayor. He desperately needs a new sheriff, as the last one has just been murdered by malefactors unknown. Fortunately, Gerard has quit the knighthood after a quarrel with his father, and arrives just in time to don a sheriff’s badge.Douglas W. Clark reunites two of the most popular characters from the War of Souls epic in this new novel set in the best-selling Dragonlance¨ world."}, {"id": "1491292830", "genre": "Science Fiction & Fantasy", "title": "Ultimate Battle (Ultimate Plug-Ins) (Volume 2)", "description": "Master the battlefield like never before! This rules supplement delves into mass combat with the same verve and creativity as Ultimate Rulership does to the more peaceable aspects of ruling a kingdom. From advanced tactics and strategy to casualties and prisoners of war, Ultimate Battle takes you from ambush to aftermath with new systems for camouflage and scouting, casualties and prisoners of war, tactical initiative and battle zones, and commanders and mercenaries. In addition, it provides you with expansions of existing rules, including new equipment and dozens of new tactics, command boons, and creature and character special abilities help bring almost any army to life, and robust rules for battlefield conditions from terrain and weather to visibility and the fog of war. This terrific expansion to the mass combat rules found in Pathfinder Roleplaying Game Ultimate Campaign contains everything you need to recruit, train, equip, maintain, and unleash your armies on the battlefield like never before, with 14 brand-new tactics including Cavalry Sweep, Pike Square, and Strafing Skirmishers; 24 new command boons like Death Before Dishonor, Implacable Advance, and Master Recruiter; 21 types of army equipment from firearms to magic shields, chariots to howdahs; and 51 army special abilities, including abilities for armies comprised of PC classes. Pick up this 36-page supplement today to bring amazing depth and dimension to mass combat in your campaign and Make Your Game Legendary!"}, {"id": "0886775329", "genre": "Science Fiction & Fantasy", "title": "Microcosmic Tales", "description": "A collection of one hundred short science fiction tales features the work of such sci-fi masters as Arthur C. Clarke, Larry Niven, Fritz Leiber, Robert Silverberg, Fredric Brown, Harlan Ellison, Lester del Rey, and Isaac Asimov. Original."}]