[{"id": "0857441566", "genre": "Science Fiction & Fantasy", "title": "Superior Synergy Fantasy PFRPG Edition (Pathfinder Roleplaying Game)", "description": "This version is for distribution. Superior Synergy: Fantasy PFRPG Edition brings the concept of game mechanic synergy back into Pathfinder. The idea that some game mechanics (such as skills) are innately compatible with other game mechanics in ways that can influence the game without choosing additional elements (such as feats) to permit their use makes a comeback in a greatly expanded and revised way  The book begins with the familiar (but altered, improved, and expanded) concept of skill synergy, but adds a lot more. Included are ways for feats to work together to create new effects, class abilities that share synergy effects, and even spell synergy. Also, you'll find ways to get all of these elements to come together in the form of craft synergy aspects you can add to certain items, making them special and unique.  Find out what your Pathfinder game has been missing -- pick up Superior Synergy: Fantasy for the Pathfinder RPG."}, {"id": "1846880238", "genre": "Science Fiction & Fantasy", "title": "Death of a Superhero", "description": "Inspired by real events, Death of a Superhero is an original fusion of novel, comic book and film script. Donald Delpe is a troubled teenager. Not only is he a 'terrible teen' by default, as obsessed with sex, music and drugs as the rest of his gang, but he is also suffering from a life-threatening form of leukemia, which makes him an even more difficult boy, both for his parents and his teachers. Escaping into his own comic-book realm of immortal superheroes, ruthless villains and sex-crazed vamps, he repeatedly dashes his family's hopes by refusing to fight the battles facing him in the real world. As famous psychologist Dr. King is brought in to help, a glimmer of hope is rekindled. But will the doctor break the rules, betray the parents' trust and risk everything to help Donald achieve his greatest wish? Or will Donald be the one to save the doctor?"}, {"id": "0595498108", "genre": "Science Fiction & Fantasy", "title": "1: Outrunner Odyssey: Book One", "description": "The long environmental nightmare had ended. Planet Earth had been healed. Its beauty and majesty had been restored by a race of evolving human descendants known as the Mirsiens. They had prevailed against those who would have used the knowledge and the power for themselves alone. Now, with the home world renewed, the time had come for the Mirsiens to reach for the stars.Taya G. Xallnyk is one of them. She seeks her place in the universe and the answers to all things unknown. She also commands the Outrunner vessel Oasis ValiMirum as it travels deep into the constellation of Orion. The vessel is a living, evolving entity in itself; a technological masterpiece in both form and function; a magnificent structure of almost unimaginable power.Others join the Mirsiens along the way. Together, they experience the frigid cold depths of space, the searing hot plains of Xolnon III, the conflicts with the Maljex, the mysterious spacial particle field, and the foreboding canyon on Zantauva. Their voyage is an incredible journey from one dimensional portal to the next as they travel through their wondrous and perilous galaxy."}, {"id": "1536629316", "genre": "Science Fiction & Fantasy", "title": "Tales of the Invisible Hand", "description": "Journey to high-flying adventures in an age long forgotten by modern man! Tales of the Invisible Hand begins a saga of arcane technology, mighty empires, and ancient conspiracy before the dawn of civilization, a saga that will shape our world. For the unlikely pair of Zekh and Gaur - a rookie pilot eager to prove himself and the Neanderthal inquisitor he is tasked to deliver - a routine diplomatic mission becomes a baptism by fire. A flight deep into untamed territory to investigate unrest among the primitive tribes exposes an ancient menace and ignites a chain of events that will forever alter the course of human history. With the future of mankind hanging in the balance, the mismatched travelers must overcome their differences and learn to trust in each other's instincts if they want to have any hope of surviving. "}, {"id": "1543075797", "genre": "Science Fiction & Fantasy", "title": "Galactic Collapse (Large Print Edition) (Agents of ISIS) (Volume 10)", "description": "Finally the evil conspiracy reveals itself in all its true power, bringing the Empire to its knees. Even the Imperial Special Investigation Service is helpless in the face of the unexpected, overwhelming attack. But the Empire strikes back with all the resources at its disposal--hoping against hope that will be enough to save humanity."}]