[{"id": "0575084979", "genre": "Science Fiction & Fantasy", "title": "Retromancer", "description": "There is big and evil magic upon the face of the Earth, and history has consequently been changed. The Germans have won World War II; America is a nuclear wasteland; and worst of all the breakfast menu at The Wife's Legs Café in Brentford is serving bratwurst rather than the proper British sausage. When the world is all wrong and it needs setting right, the only hope left is Hugo Rune, a man who offers the world his genius and asks only that his expenses be covered. Hugo, also known as the hokus bloke, the Lad Himself, and the Retromancer, sets out to rewrite history the way it should be, with the aid of his faithful acolyte and companion Rizla. Together they return to war-torn London to solve the 12 cosmic conundrums based upon Hugo's personal tarot deck, each mystery leading them closer to a final terrifying confrontation. They must match their wits against beautiful spies, advanced alien technology, killer robots, and death rays; do battle with an ancient god; and come face to face once more with Hugo Rune's arch-enemy, the sinister Count Otto Black."}, {"id": "B0776YKSM8", "genre": "Science Fiction & Fantasy", "title": "THE 100 DEATHS OF LUCAS GRAVES (5 Book Series)", "description": "From Book 1: Lucas Graves is a laid-back millennial, who has glided through life thus far by making a habit out of avoiding trouble at all costs. More recently, though, he’s made a habit out of dying…and then coming back to life, again and again. Perplexed, Lucas reveals his odd condition to his best friend, Harmony Jones, who suggests that he might be experiencing a karmic dilemma, a problem that he must overcome in order to be able to resume his normal life. There just so happens to be an axe murderer on the loose near their hometown of Salem, New Jersey, and the duo figures that it can’t just be coincidence. Lucas decides to take a shot in the dark and try to solve his karmic dilemma by thwarting the killer… though it might take getting murdered a time or two for him to get it right. This darkly humorous, suspense-filled first installment in the 100 Deaths of Lucas Graves Series will tickle you with nervous laughter and thrill you with spine-tingling adventure."}, {"id": "B06XS7214V", "genre": "Science Fiction & Fantasy", "title": "Unearthed: Allegory of Pain", "description": "The world is dying, the path of the Sins grows endlessly complex, and Blague is forced to endure an internal conflict he never thought possible. The line between ally and foe wears thin to the point of being indiscernible. An uncertain fate in an uncertain time inspires the greatest lust for change, but will it be enough?"}, {"id": "1556345801", "genre": "Science Fiction & Fantasy", "title": "GURPS Modern Firepower *OP", "description": "A whole book of statistics and descriptions for the latest small arms and tactical equipment, filling the \"arms gap\" between High-Tech and Ultra-Tech. Here you'll find firearms (from handguns to support weapons), along with a wide variety of ammunition and accessories (such as extended magazines, scopes, and sound suppressors); body armor; and much more. A \"must have\" for any kind of modern-day action campaign!"}, {"id": "B075ZJ9VSZ", "genre": "Science Fiction & Fantasy", "title": "Vaka Rangi Volume 2: Star Trek Phase II, Original Film Series and Star Trek: The Next Generation (Season 1)", "description": "Vaka Rangi: In the language of the Rapa Nui, A Canoe for the Stars.Vaka Rangi is a work of comparative mythology. Vaka Rangi is an account of a spiritual journey. Vaka Rangi is a personal memoir. Vaka Rangi is an unauthorized post-structuralist critical history of Star Trek and the voyaging starship.Completely revised and expanded from the blog of the same name, Vaka Rangi Volume 2 includes critical analysis essays on Star Trek Phase II, the fan series that shares its name, the first four Star Trek feature films and every episode of Star Trek: The Next Generation's first season. Each story is re-positioned within its cultural contexts and re-examined through the lenses of utopian philosophy, cultural anthropology and anarcha-feminism."}]