[{"id": "1584154780", "genre": "Children's Books", "title": "Robert Fulton (Robbie Readers) (What's So Great About...?)", "description": "From the time he was young, Robert Fulton liked to work with his hands. For a while, he thought he wanted to be an artist. But it was a hard way to make a living. So he turned to inventing things. One was a very early version of the submarine. Fulton is most famous for building the first practical steamboat. Others had tried and failed. Fulton was successful. His vessel was called the North River Steam Boat. It sailed regularly between New York City and Albany, the capital of New York. The success of the North River Steam Boat inspired Fulton to build other steamboats. Soon he became a very wealthy man."}, {"id": "B009CG2UV0", "genre": "Children's Books", "title": "#7 The Book Bandit: A Mystery with Geometry (Manga Math Mysteries)", "description": "The science club has created a big \"book bandit\" sculpture in the public library. But how did they get the sculpture in through the tiny library window? The librarians offer a prize to whoever can figure out the puzzle.  The kids from Sifu Faiza's Kung Fu School know they can win, but it will take all of their geometry skills plus some unexpected cooperation to size up . . . The Book Bandit."}, {"id": "0224619268", "genre": "Children's Books", "title": "Diving Adventure", "description": "A reissue of Willard Price's classic adventure series set in the animal kingdom.Hal and Roger Hunt dive straight into danger on a specimen-collecting trip to Undersea City. But it's not just sharks and killer whales the brothers have to fear when they are plunged into the depths of another adventure."}, {"id": "1598792016", "genre": "Children's Books", "title": "Following Jesus - Obeying His Commandments (Children's Version)", "description": "These are the commands of Jesus that are written in a way that children will understand them.  It is the author's hope that children of all ages will hear these commands of Jesus and obey them.  Jesus said, \"He who has My commandments and keeps them, he it is who loves Me; and he who loves Me shall be loved by My Father, and I will love him, and will disclose Myself to him.\"  John 14:21    Jesus gave us two commands from which all the others are based.  \"He said, 'You shall love the Lord your God with all your heart, and with all your soul, and with all your mind.'  This is the great and foremost commandment.  The second is like it.  'You shall love your neighbor as yourself.'  On these two commandments depend the whole Law and the Prophets.\"  Matthew 22:37-40.  Each command in this book is given and illustrated in a way that teaches children how to lovingly follow Jesus.  Everything we do should be done in love.  If is it not, then it is done in vain (see I Corinthians 13).    The author has also written an adult version of \"Following Jesus\" which contains all the Bible verses where Jesus gives each command.  The author hopes to have it published soon."}, {"id": "1684121248", "genre": "Children's Books", "title": "Sing and Slide: Itsy Bitsy Spider", "description": "Sing along with the classic nursery rhyme in this adorably illustrated interactive board book with push-button sound. Little ones will love sliding and pulling the tabs and spinning the wheels as they hum along with the sweet \"Itsy Bitsy Spider\" song. The sound chip and hands-on elements make this classic nursery rhyme book a fun read for story time!"}]