[{"id": "0898703808", "genre": "Children's Books", "title": "Kateri Tekakwitha: Mohawk Maiden (Vision Books)", "description": "This book is from the famous line of Vision books of saints that are one of the most popular and well-told series of stories for young people. This is the inspiring story of Saint Kateri Tekakwitha, a holy young Indian woman who was converted to Christianity by the French missionaries led by Saint Isaac Joques during the 1600s.Kateri's mother was a very devout Christian woman who, after being captured by the Iroquois, was not allowed to baptize her daughter. Kateri's whole family died of smallpox, and she was adopted by a chief who was very anti-Christian. When she was baptized and converted by the missionaries, Kateri became ostracized from the tribe. With the help of the priest, she made a daring escape, and thereafter lived a life devoted to God. Denied her desire to become a nun, she declined marriage and lived as a single woman with deep faith, offering her sufferings and life to Christ. She died at the age of twenty-four and is affectionately known as the \"Lily of the Mohawks.\" Kateri was canonized by Saint Pope John Paul II in 2012."}, {"id": "B076DVQYDQ", "genre": "Children's Books", "title": "Tractors on the Go (Bumba Books ™ — Machines That Go)", "description": "Carefully leveled text and fresh, vibrant photos engage young readers in learning about how tractors work. Age-appropriate critical thinking questions and a photo glossary help build nonfiction learning skills."}, {"id": "1548953555", "genre": "Children's Books", "title": "Sydney Wanted Dead Or Alive Cash Reward $100,000,000: Western Themed Personalized Name Journal Notebook For Girls", "description": "Are you looking for personalized books with your child's name?We have the top 50 boy and top 50 girl names in the US on these unique and funny personalized journals. More names will be coming soon.To see if we have a name journal with a specific name just search Dartan Creations and the name you want.These journals have a western wanted poster theme for those cowboys and cowgirls out there.These make the perfect birthday gift for boys or girls who want journals to write in. Kids love it when they get something with their name on it. Like their own personalized diary or journal notebook.Personalized gifts for men, women, boy, girls and kids of all ages.This personalized journal can be used for:Diary For Mom and Daughter or SonCreative Writing Practice WorkbooksDaily Journal For Boys & GirlsNotebook For StudentsJournals To Write and Draw InTo Do List JournalsAnd so much more….Perfect for:Birthday GiftsChristmas GiftsGag Gifts For Adults & KidsBack To School NotebooksScroll up and grab your personalized name notebook today!"}, {"id": "0613016661", "genre": "Children's Books", "title": "Three Little Pigs & the Fox", "description": "Rooter, Oinky and their little sister, Hamlet, are three little pigs who aren't so little. They're getting bigger and bigger, and Mama decides it's time they each get homes of their own. She advises them to build strong houses, visit her each Sunday, and to watch out for that tricky old fox. When her brothers appear to be missing, can Hamlet outfox the fox? An ALA Notable Children's Book. Full color."}, {"id": "0763627631", "genre": "Children's Books", "title": "Not Norman: A Goldfish Story", "description": "\"A sweet story that could be used as a springboard to discussion of the pitfalls of making snap judgments about pets ï¿½ or people.\" ï¿½ School Library JournalNorman the goldfish isn't what this little boy had in mind. He wanted a different kind of pet ï¿½ one that could run and catch, or chase string and climb trees, a soft furry pet to sleep on his bed at night. Definitely not Norman. But when he tries to trade Norman for a \"good pet,\" things don't go as he planned. Could it be that Norman is a better pet than he thought? With wry humor and lighthearted affection, author Kelly Bennett and illustrator Noah Z. Jones tell an unexpected ï¿½ and positively fishy ï¿½ tale about finding the good in something you didn't knowyou wanted."}]