[{"id": "1408889900", "genre": "Children's Books", "title": "These are Animals", "description": "Animals SNUFFLE, CLIMB, HISSSS, CHOMP, ROOOAR, NIBBLE, JUMP, GROWWWWL SPLASH, SWOOP and SLIIIIIIDE... Join some of the world's most incredible animals and many more in this beautifully illustrated book. Daniel Egneus takes readers on a magnificent journey across the land and under the ocean in this stunning first introduction to animals. Travel through the misty meadows, enchanting forests and sparkling seas to meet the animals that live there and find out what they do. A gorgeous book to read out loud that will have you jumping, growling, splashing and howling."}, {"id": "B01E7CP7UO", "genre": "Children's Books", "title": "Super-Duper Monty: (Story Book for Kids)(Picture Book for Kids)(Beginner Book for Children)(Story Book for Children)(Bedtime Stories)(Children's Picture Book)", "description": "Fully illustrated eBook, for ages 3-8Super-Duper Monty is the story of a little frog that loves to hop, leap, and jump so much that everyone calls him Leapfrog.“One morning, Monty jumped over the bushes and landed on the road. ‘This is super duper fun! I can leap, and jump, and run!’ he sang, taking a leap with every word.”But trouble wasn’t far away.Super-Duper Monty is an engaging tale through which parents and caregivers can teach children several things in an entertaining way:They must not wander away.Even while having fun, they must be aware of their surroundings.The importance of natural habitat for creatures.Compassion for other living things.Other Features:The illustrations are vibrant and delightful, and the text of the ebook is on the same page as the picture.This story is suitable for reading at bedtime. It also works as a read aloud book for preschoolers or a self-read book for older children.***There is a FREE GIFT inside***"}, {"id": "0431189218", "genre": "Children's Books", "title": "Making Of A Champion : A World-Class Sprinter Hardback", "description": "This series looks at how people succeed and reach the top of their chosen sport. Each book includes information on basic aptitude and ability, techniques, fitness and training, diet, equipment and much more. It contains fascinating facts about all aspects of the sport. It includes case studies about the sport and its well-known personalities, and features champions and competitors from around the world. Each book contains at least 50 photographs and explanatory diagrams."}, {"id": "0679916792", "genre": "Children's Books", "title": "Film (Eyewitness Books)", "description": "Full-color photos.  Here's a behind-the-scenes look at the history and technology of movies--how sets are built, how stunts are performed, how cartoons and special effects are created, and how films are edited and publicized before release.  The \"multiple visuals are eye-catching, impressive, and accurate.\"--School Library Journal.  "}, {"id": "0778736032", "genre": "Children's Books", "title": "Supercharged Sports: High-tech Sports Science (Techno Planet)", "description": "From drones capturing unique angles of plays for enhanced analysis to swimsuit material helping swimmers go faster, technological innovations are transforming the way sports are played as well as watched. Supercharged Sports examines these exciting advances in technology and also explores whats coming next in the world of sport science, such as health-monitoring systems sewn into the fabric of uniforms and even more immersive virtual reality experiences."}]