[{"id": "B01MG3OLNR", "genre": "Science Fiction & Fantasy", "title": "Native Shifter (Freedom Shifters Book 1)", "description": "In the 1770's, Leotie waits for the day that Keme will ask her to be his life-bond. If only he didn't believe he's a coward. His father wants him to be a warrior, but he hates it. So what if he secretly trains to be a healer? He's so much more interesting than the other young men. Then one day, outlanders come and give her people an ultimatum - to leave their home or die. Soon her tribe is going to war with an unpredictable enemy. Leotie wasn't born to stay home and string beads. She's a hunter and a warrior who gets a chance to defend her people. She goes out into the battle, but doesn't make it back. At least, not as a human. Leotie comes back to life as something quite different. Her tribe calls them skin walkers. The outlanders call them werewolves. She fears what Keme will think of her now. Someone did this to her, but who? Native Shifter will take you into the past for a fast-paced romantic escape."}, {"id": "1615724362", "genre": "Science Fiction & Fantasy", "title": "Humans and Demons and Elves", "description": "The Elves of North America use dimension-bending magic to conceal their woodland villages from humans, though it fails to protect them from the beautiful-but-deadly Eudemons. Edofine is less prejudiced than many, even befriending an Archaedemon, whose people are known for switching sides in the ancient conflict. But when young Edofine's clan is destroyed, he has only one person to turn to: his cousin Kryvek, who was adopted by humans who established the Official Magics-Humans Institute (OMHI). Will Edofine be able to adjust to human society? Can the OMHI help him despite facing its own crisis? Could he possibly be falling in love with Kryvek's friend Lira, a half-Elf half-Eudemon working for the OMHI? His life has fallen to pieces, and the reconstruction is full of surprises. Perfect for a Young Adult audience."}, {"id": "1974398889", "genre": "Science Fiction & Fantasy", "title": "Hugo II (Interstellar Home Finders) (Volume 2)", "description": "The Hugo story continues; A science fiction fantasy of a family of intergalactic explorers which are telepathic and are endowed with supernatural powers. Which are still evolving. Wayne, the biological captain of the Hugo Galactic ship, a resurrected alien starship, leads his small family group to find new planets of the Milky Way Galaxy."}, {"id": "B01NBYHIAA", "genre": "Science Fiction & Fantasy", "title": "A Night in the Sky", "description": "Peter Hawkins is the world's most spectacular genius—but nobody knows it.Abandoned as a toddler, Peter lives alone in a mysterious mansion, where he creates fantastic inventions that no one ever sees. When he tries going to school, bullies keep harassing him. So Peter comes up with a daring plan: build a high-powered airplane and escape into the sky. Along the way, he outmatches a murderous thief, a mysterious giant, and a desert full of danger. But as his incredible Skyliner takes shape, Peter realizes that a secret accomplice is helping him, and that perhaps he’s had a friend all along . . . ."}, {"id": "1979902178", "genre": "Science Fiction & Fantasy", "title": "Unbound (The Clarion Call) (Volume 3)", "description": "Fantastic horizons of liberty and freedom await us- When we let loose our imaginations to see them. In this third volume of The Clarion Call, fifteen authors weave stories across a myriad of wondrous worlds, sharing visions of heroism, freedom, rebellion, and sacrifice. In this collection of liberty themed fantasy are tales of: Technology imbued with magic; Mythical beasts of the Air, Earth, and Water; Personal quests and world changing upheaval; Purpose, choice, responsibility, and discovery. These are the stories of imaginations Unbound."}]