[{"id": "0786195843", "genre": "Children's Books", "title": "Aesop's Fables", "description": "Much of the richness of our language and moral education is owed to a Greek slave who was executed over two thousand years ago. Literally hundreds of metaphors, axioms, and ideas that are woven into the very fabric of Western culture--from \"sour grapes\" and \"crying wolf\" to \"actions speak louder than words\" and \"honesty is the best policy\"--all came from Aesop's Fables. An extraordinary storyteller who used cunning foxes, surly dogs, clever mice, and foolish humans to describe the reality of a harsh world, Aesop created narratives that are appealing, funny, politically astute, and profoundly true. And Aesop's truth--often summed up in the pithy \"moral of the story\"--retains an awesome power to affect us, reaching us through both our intellects and our hearts. Included here are such fables as \"The Country Mouse and the Town Mouse,\" \"The Wind and the Sun,\" \"The Farmer and the Stork,\" \"The Lioness,\" \"The Brash Candlelight,\" \"The Old Woman and the Physician,\" \"The Mole and Her Mother,\" \"The Swallow and the Crow,\" \"The Man Bitten by a Dog,\" \"The Fox and the Grapes,\" \"The Monkey and the Dolphin,\" \"The Hares and the Frogs,\" and many, many more."}, {"id": "0766012301", "genre": "Children's Books", "title": "The Holocaust, Hitler, and Nazi Germany (The Holocaust Remembered Series)", "description": "Describes the history of the Nazi era in Germany, including Adolf Hitler's rise to power and the many atrocities committed during the Holocaust"}, {"id": "160580519X", "genre": "Children's Books", "title": "Easter Parade: A Pop-Up Book", "description": " It's time for the annual Easter parade! Thrill to marching raccoons, acrobatic chipmunks, dancing chicks, and many more in this unique parade, all leading up to the star of the show: the Easter Bunny, on his own festive float.  This incredible book features seven colorful spreads, each filled with pop-up surprises for an Easter celebration."}, {"id": "0916211142", "genre": "Children's Books", "title": "Teenage Mutant Ninja Turtles and Other Strangeness", "description": "A Role-playing game book. A complete game compatible with Heroes Unlimited and Ninjas & Superspies. Contains dozens of mutant animals, martial arts, ninjitsu, the ninja turtles, adventure scenarios and more..."}, {"id": "0860376397", "genre": "Children's Books", "title": "Prophet Adam and Wicked Iblis (The Prophets of Islam)", "description": "A charming activity book, bursting with joyful animals and colorful backgrounds, that introduces children to the Prophet Adam, and one particular story of his. Full of activities including crosswords, puzzles, mazes and colouring, this book is a wonderful way to teach children about the Prophet Adam, the wonders of Paradise where he once lived, and how Iblis got him to disobey Allah."}]