[{"id": "1492638374", "genre": "Children's Books", "title": "The Great Easter Race! (Sesame Street Scribbles)", "description": "It's Easter morning, and all of Sesame Street is gathered at the park for the Great Easter Race. Who will win the day? Will it be the turtle, who moves slowly and steadily toward the finish? Or will it be the bunny, who runs faster than thunder, but seems easily distracted? Fun surprises wait around every turn, so come along with Elmo and all the Sesame Street friends!It's a bright Easter morning on Sesame Street, and out in the park, friends are starting to meet.There are beautiful colors and flags waving free. Something special is happening. But what can it be?"}, {"id": "1423152328", "genre": "Children's Books", "title": "Don't Squish the Sasquatch!", "description": "When Senor Sasquatch boards the bus, he makes one thing perfectly clear to driver: he doesn’t like to be squished. But as the bus travels along its route, other passengers get on--like Miss Elephant Shark, Mr. Octo-Rhino and Miss Whale Goat! Soon senor Sasquatch finds himself at risk...of being squished!"}, {"id": "B00D9YD6XM", "genre": "Children's Books", "title": "Laura Ingalls Wilder - A Short Biography for Kids", "description": "A short illustrated biography of Laura Ingalls Wilder, author of The Little House on the Prairie, written in easy-to-read English for younger readers."}, {"id": "1979911177", "genre": "Children's Books", "title": "Allah made us all different: \"be yourself\"", "description": "Little Birdie was living in a beautiful forest. But Little Birdie was not really happy about what she was. She tried to be a cat, a butterfly, a flower, a fish, and an owl. But she could not. Her mom told her that Allah created various animals, numerous creatures in this world, and made them all different. What makes us unique is being ourselves, and doing what we do best."}, {"id": "0881412589", "genre": "Children's Books", "title": "The Blackbird's Nest: Saint Kevin of Ireland", "description": "Kevin was always different. He loved animals and seemed to understand their secret language. But other children brought out the worst in him. He chased, bullied, and shoved, until one spring when he learned an unforgettable lesson from an unlikely teacher--a blackbird who built a nest in his hand. The Blackbird's Nest: Saint Kevin of Ireland is the story of Kevin's transformation into one of Ireland's best-loved saints (AD-618), revered in many Christian traditions. Written with simplicity and humor by Jenny Schroedel, and brought to life with stunning illustrations by Douglas Montross, The Blackbird's Nest is a rich, vibrant tale of renewal and a welcome addition to children's lenten literature."}]