[{"id": "1624038271", "genre": "Children's Books", "title": "Aaron Rodgers (Football's Greatest Stars)", "description": "This title introduces readers to Aaron Rodgers, providing exciting details about his life and going deep inside the key moments of his NFL career. The title also features informative fast facts, a timeline, and a glossary. Aligned to Common Core Standards and correlated to state standards. SportsZone is an imprint of Abdo Publishing, a division of ABDO."}, {"id": "1911107143", "genre": "Children's Books", "title": "Toletis: For Ages Seven to 107", "description": "The trees are disappearing and the adults don't care. Toletis, his dog Amenophis and friends Claudia and Tutan are on a mission to turn their little valley town, set deep in the mountains, lusciously green again. The odds are stacked against them. Can they succeed ...with some very unusual help? A deep appreciation for nature, art, language, music, friendship, family, the passing of time, old age, loneliness, and the importance of sitting still and reflecting on life, pervade this exquisite story. A must read for 7 to 107 year olds!"}, {"id": "1434230740", "genre": "Children's Books", "title": "Full Court Flash (Sports Illustrated Kids Graphic Novels)", "description": "Dash the Flash grew nearly a foot last year. Now, he's taller, faster, and stronger than everyone else. Dash out jumps defenders and sinks big shots, all the while making it look too easy. There's just one problem -- his teammates are having a hard time keeping up! His passes are missing the mark, and his friends are getting frustrated with Dash putting on a one man show. Dash has some work to do to prove he's not all Flash and no substance."}, {"id": "B00L9B83GW", "genre": "Children's Books", "title": "Fine Life for a Country Mouse (Penguin Core Concepts)", "description": "Fine Life for a Country Mouse covers the concepts Appreciating Differences and Family.Based on Aesop’s beloved fable, City Mouse, Country Mouse, this book is a must have for classroom and at-home reading. Shy Tillie Mouse has invited her city-slicker cousin, Oliver, to visit her home in the country. But Oliver is bored by the country. So, Tillie decides to visit Oliver in the city. Everything is so luxurious. Until . . . there’s a cat! Stomping feet! A vacuum cleaner! The woes of city life are too much for Tillie’s nerves, and she returns home, happy and content to be back in her simple cottage in the country."}, {"id": "1633221660", "genre": "Children's Books", "title": "Reptiles & Amphibians: A close-up photographic look inside your world (Up Close)", "description": "Discover your amazing world through curious and fascinating up-close photography!Transform the ordinary into something extraordinary with exciting micro and macro photography! Reptiles & Amphibiansexplores all things cold-blooded, pairing extreme, hyper-detailed images of scaly skin, snake eyes, and webbed feet with fun facts, activities, and brainteasers. So let’s turn up the ZOOM and discover a whole new way of seeing the world."}]