[{"id": "B016DF6TLE", "genre": "Children's Books", "title": "The Adventures of Mr Froggy (2 Book Series)", "description": "From Book 1: A Frog went a–courting, he did ride,A sword and pistol by his side.He came where Lady Mouse sat to spinAnd called, \"Miss Mouse, are you within?\"And so it goes, a delightful rhyming story book, with superb cartoon-like illustrations of Mr Froggy, Miss Mousie, Mr Bear and many other wonderful characters. Based on the traditional English folk song, \"Frog Went A-Courtin'\", this book contains two short stories...The traditional \"Mr Froggy Went A Courtin'\", and also \"Mr Froggy And The Bear\".A wonderfully fun adventure awaits you and your child inside the book.Click the big orange BUY NOW link at the top right of the page and get Mr Froggy Went A Courtin', Mr Froggy And The Bear (The Adventures of Mr Froggie volume 1). Why not start the fun now!"}, {"id": "1973483637", "genre": "Children's Books", "title": "A Christmas Short Story (2017): A photo of a policeman giving shoes to a homeless man inspires young Thad to do the same for Christmas", "description": "Young Thad sees a photo of a policeman in New York City giving a pair of shoes to a homeless man. This inspires him to do the same. After convincing his dad to help him, they both get into the Christmas giving spirit when they meet down on his luck Mr. Wayne."}, {"id": "1515735362", "genre": "Children's Books", "title": "Tunneling to Freedom: The Great Escape from Stalag Luft III (Great Escapes of World War II)", "description": "Experience the incredible story of the brave men who tunneled to escape a German prisoner-of-war camp. Readers will learn about the planners, task leaders, and key players of the escape from Stalag Luft III."}, {"id": "0374460310", "genre": "Children's Books", "title": "Pumpkin Soup: A Picture Book", "description": "By the Kate Greenaway MedalistDeep in the woods in an old white cabin, three friends make their pumpkin soup the same way every day. The Cat slices up the pumpkin, the Squirrel stirs in the water, and the Duck tips in just enough salt. But one day the Duck wants to stir instead, and then there is a horrible squabble, and he leaves the cabin in a huff. It isn't long before the Cat and the Squirrel start to worry about him and begin a search for their friend. Rendered in pictures richly evoking autumn, Helen Cooper's delightful story will resonate for an child who has known the difficulties that come with friendship. Included at the end is a recipe for delicious pumpkin soup."}, {"id": "1421542218", "genre": "Children's Books", "title": "Pokémon: Zoroark: Master of Illusions (Pokemon)", "description": "Big Trouble in Crown City!  Ash and Pikachu travel to Crown City to watch the Pokémon Baccer World Cup competition, but it’s not all fun and games. The powerful Pokémon Zoroark has attacked! Ash and his friends must solve an old mystery before they can stop Zoroark and save the people of Crown City!"}]