[{"id": "0773455930", "genre": "Science Fiction & Fantasy", "title": "The History of Metaphors of Nature: Science and Literature from Homer to Al Gore,  Vol. 2", "description": "This book shows how modern European Languages have a large number of metaphors which represent the whole of nature. For example, Mother Nature, the celestial harmony, the great chain of being, and the book of nature, are used in natural science and in literature. These and other metaphors have a powerful influence on the framing of scientific hypothesis making, and these words have guided the history of natural science for several millennia. Each chapter in this book is a parallel longitudinal history of a word or phrase which represents the whole of nature, and which has influenced natural science and general literature, and especially North American nature writing."}, {"id": "1514275090", "genre": "Science Fiction & Fantasy", "title": "2: The Adventures of Jack and Miracle Girl: Volume Two", "description": "It's been over six months since ordinary guy Jack Wright inexplicably found himself in a relationship with Signal City's most powerful and most famous superheroine, Miracle Girl. Things have been going well between them...but no matter how hard he tries, Jack just can't seem to avoid getting involved in his girlfriend's crazy-dangerous superhero adventures.And unfortunately things are about to get even more crazy, and even more dangerous: the two of them soon find themselves contending with super-strong World War II-era androids, parallel dimensions, time travel, deadly sorcerers...and, most frightening of all, a terrifying conspiracy that threatens not only Signal City but the entire world.Can Jack and Miracle Girl find time for romance in between all these incredible adventures? Is it even possible to have a normal relationship, in the midst of all this danger and intrigue? Neither of them know for sure...but they're about to find out!"}, {"id": "B000FBFMUM", "genre": "Science Fiction & Fantasy", "title": "20,000 Leagues Under the Sea", "description": "An American frigate, tracking down a ship-sinking monster, faces not a living creature but an incredible invention -- a fantastic submarine commanded by the mysterious Captain Nemo.  Suddenly a devastating explosion leaves just three survivors, who find themselves prisoners inside Nemo's death ship on an underwater odyssey around the world from the pearl-laden waters of Ceylon to the icy dangers of the South Pole . . .as Captain Nemo, one of the greatest villians ever created, takes his revenge on all society.More than a marvelously thrilling drama, this classic novel, written in 1870, foretells with uncanny accuracy the inventions and advanced technology of the twentieth century and has become a literary stepping-stone for generations of science fiction writers."}, {"id": "B01HH0Z8G6", "genre": "Science Fiction & Fantasy", "title": "852: Spawn (Cyborg Romance)", "description": "852’s face returned. “I love you,” he said.Three small words. Three unexpected words. 241’s eyes moistened. Love she understood. It was the bond between her and her son, the power that kept 852 in her mind at all times. It was the greatest and best of human emotions.-----Cyborg 852 united with the only female cyborg in existence, 241, without any idea of the consequences of their actions until a human told him. In his machine-like world, she was a curiosity, her structure different from the rest, and his draw to her unexplainable and devoid of emotion.When his son, the first naturally produced cyborg child, shows up on his doorstep two years later, a series of strange events puts in motion the possible downfall of the Organization that controls all his kind. There will be no more central computer, but instead, the freedom to think, to choose, and decide.Yet 241s willful self-destruction to bring it to pass is too high a cost. And the possible end to the most valuable part of their existence – the chance to feel love.Book 2 of 2 in the CYBORG ROMANCE SERIES, the exciting conclusion by best-selling author, SUZANNE D. WILLIAMS. 22,000 words."}, {"id": "1588463516", "genre": "Science Fiction & Fantasy", "title": "Nosferatu: The Beast That Hunts the Blood (Vampire: The Reqiuem)", "description": "Horror lurks in the darkest places of the World of Darkness. They are the Nosferatu, outcast and shunned. They are the nightmares the lurk just beyond the safety of the firelight, waiting with wicked fangs and unclean hungers for those who stray too far into the night. But even the night terrors have things to fear. Come, and learn of them.  A Clan book for Vampire: The Requiem™  • Uncover the filth-ridden origins of the Nosferatu in ancient Greece, where they haunted the Mediterranean nights as the god-plagued nosophoros.  • Explore the Necropoli of the Nosferatu, the warrens where the horrors dwell.  • Discover the many faces of the clan: the bizarre, the vile, the battle-hardened and the hidden.  • New Merits, bloodlines, Discipline powers and clan secrets that every Vampire: the Requiem player will want to have."}]