[{"id": "0310708982", "genre": "Children's Books", "title": "Legend of the Christmas Stocking", "description": "This wonderful Christmas tale, set in the late 1800s, shares the touching story of a young boy named Peter. He sells newspapers to help his family while his father is away at sea, and he’s been saving a bit of his earnings to buy a model schooner in the woodworker’s shop. But after Uncle Jim, the woodworker, tells him the story of St. Nicholas, Peter discovers the meaning behind the hanging and filling of Christmas stockings and learns a heartfelt lesson in kindness and generosity. Filled with the rich, realistic illustrations of Jim Griffin, children ages 4 to 8 will discover the depth of God's love shown through others as they learn the Christian meaning revealed in The Legend of the Christmas Stocking. Through imaginative and innovative products, Zonderkidz is feeding young souls."}, {"id": "1454928514", "genre": "Children's Books", "title": "Colors (The Montessori Method)", "description": "Introducing Montessori-inspired early childhood activity books! This book—with eight pages of stickers—does more than simply stimulate learning through play: it enhances the cognitive development of the child. The activities become progressively more complex according to the three stages of a child’s learning: getting to know the material through sensory experience, recognizing the material, and being able to explain the material. Let’s learn to color! Take the outlined shapes and fill them in, try to stay within the lines, and say the name of each color out loud as you draw. It’s lots of fun."}, {"id": "0785142428", "genre": "Children's Books", "title": "Marvel Super Hero Squad: Hero Up!", "description": "Marvel's most popular superheroes and villains, including Hulk, Iron Man, Wolverine, Magneto, and Juggernaut, have adventures in Super Hero City and battle each other."}, {"id": "0764146602", "genre": "Children's Books", "title": "French-English Picture Dictionary (First Bilingual Picture Dictionaries)", "description": "It's never too soon to start teaching boys and girls a second language, and this book presents pages filled with cheerful color pictures that help teach French words to English-speaking children in early grades. It presents more than 350 illustrations of familiar objects, with nine pictures on each page. Every picture is labeled with its English word, followed by its French equivalent. The translated word is followed in turn by a phonetic spelling in smaller type. Words are grouped according to themes, such as Sports, The Classroom, Fruit, Vegetables, Party Time, Weather, and many others. For example, the nine illustrations on the Sports page show pictures with bilingual labels for football, table tennis, skiing, fishing, gymnastics, athletics, cycling, swimming, and basketball. Here's a fun way for younger English-speaking children to build a basic vocabulary in French."}, {"id": "0997133759", "genre": "Children's Books", "title": "Kringle Cat Gets Lost in Guatemala", "description": "Kringle Cat returns! This time he is exploring the beautiful country of Guatemala. Meet his new friend Ketsy and join them on their exciting adventure. This book is in both English and Spanish. Edwin Castillo Ramos continues to provide some of the most detailed illustrations found in children's books."}]