[{"id": "0061240818", "genre": "Children's Books", "title": "Baseball from A to Z", "description": "Learning about baseball has never been so much fun! From a pitching Ace to a strike Zone, this energetic alphabet book covers all the bases of America's favorite pastime. Lively, action-packed illustrations will take readers right into the stands to root, root, root for the home team. So put on your favorite team Jersey and get ready for the Ballpark . . . because Baseball from A to Z is one Home run you don't want to miss."}, {"id": "060636336X", "genre": "Children's Books", "title": "100 Most Destructive Natural Disasters Ever (Turtleback School & Library Binding Edition)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Gigantic, powerful, devastating--these are the 100 most destructive natural disasters ever. Next in the successful 100 MOST series, 100 Most Destructive Natural Disasters Ever will feature the world's most devastating hurricanes, earthquakes, and other natural disasters. This book will investigate Mother Nature's worst moments, from the 2004 Indian Ocean tsunami that killed over 200,000 people to the historic 1900 Galveston hurricane. It's everything you ever wanted to know about natural disasters and a whole lot of things you didn't."}, {"id": "B00CC7ZYYG", "genre": "Children's Books", "title": "Pilot (Little People Shape Books)", "description": "Barron's highly popular  Little People Shape Books  portray kids dressed up to fit exciting grown-up roles. Heavy board covers and pages are die-cut in the shapes of the cheerful children shown on each cover. The color-illustrated stories inside are easy for beginning readers, but pre-schoolers will also enjoy hearing them read aloud. The titles in this series stimulate young imaginations and encourage kids to look ahead to exciting careers when they become adults. When each books' cover is closed, the cover child is appears as a layered, three-dimensional image."}, {"id": "0792237366", "genre": "Children's Books", "title": "Abe Lincoln Goes to Washington", "description": "This sequel to \"Abe Lincoln: The Frontier Days, 1809-1837\" follows Lincoln's life from the age of 28, when he arrives in Springfield, Illinois, ready to take up his post in the state legislature, to his assassination in 1865. Includes six maps researched by the National Geographic Society. Full-color illustrations."}, {"id": "B0051UACQG", "genre": "Children's Books", "title": "Sonu's Diwali (Hindi Children's Book Level 3 Easy Reader 7)", "description": "This is a bilingual Hindi/English short story which helps to build the vocabulary of someone trying to learn Hindi using English. The book tells the story of how a young boy called Sonu celebrates Diwali. The experience is typical of what many Indian children growing in the west go through. The book includes the Hindi text, the English transliteration of the text, and the translation in English. The book is beautifully illustrated with hand-drawn charcoal paintings to go along with the story-line. "}]