[{"id": "B0093MYW8W", "genre": "Children's Books", "title": "Ultimate Sticker Book: Shark and Whale", "description": "DK presents exciting new covers for 13 of your favorite Ultimate Sticker Books: Animal, Baby Animal, Ballet, Bug, Bulldozer, Dangerous Dinosaurs, Dinosaur, Ancient Egypt, Farm, Pony, Shark and Whale, Space, and Truck. Annotated with factual information, each book contains more than 60 full-color, reusable stickers so children can create their own fun scenes."}, {"id": "150816424X", "genre": "Children's Books", "title": "Wind Farms: Harnessing the Power of Wind (Powered Up! A Stem Approach to Energy Sources)", "description": "What causes wind? How have scientists and engineers learned to use wind energy to generate power? Where is the best place to build a wind turbine? Readers will find the answers to these and other questions in this fascinating book about harnessing the power of wind. This important early elementary science topic is covered in rich detail with a strong focus on STEM topics featured in the Next Generation Science Standards. Colorful diagrams and photographs allow students to visualize how wind is used to power our planet."}, {"id": "B06Y4QWJX5", "genre": "Children's Books", "title": "The Splendid Kingdom: The Story Of Prophet Solomon (The Prophets To Islam Series For Children)", "description": "Do you know what prophet Solomon asked for? He asked God for wealth no human has ever had or even imagined before. And guess what Allah did! He made prophet Solomon’s wish come true….The Splendid Kingdom is the story of the wisest and RICHEST king on planet Earth (yes seriously!). Allah gave Solomon many treasure, the power to command wind, the power over genies and even gave him the talent to understand the language of birds and animals. His life was awesome! Until the Hoopoe bird ‘tattletaled’ on the ‘Queen of Sheba’ and nothing was ever the same again…."}, {"id": "1450805752", "genre": "Children's Books", "title": "Eric Carle: Around the Farm: Play-a-Sound", "description": "The World of Eric Carle Around the Farm Sound Book has an attached 30-button audio module that enables children to connect sound to 30 unique animal illustrations by artist Eric Carle. Each button represents an animal, bird, or insect that might be found on a farm. Press the button to hear the name of the creature and a sound associated with it. The book is recommended for children ages 3 years and older. Here is the list of the animals in the book: bull, cow, goat, pig, sheep, lamb, donkey, horse, hen, turkey, chick, rooster, cat, dog, mouse, frog, duck, turtle, fish, crow, sparrow, owl, woodpecker, snake, rabbit, cricket, dragonfly, bee, butterfly, and Eric Carle’s famous very hungry caterpillar. The World of Eric Carle Around the Farm Sound Book conforms to the toy safety requirements of ASTM F963-08. Three replaceable long-life AG-13 button cell batteries that power the sound module are included."}, {"id": "B0058I8952", "genre": "Children's Books", "title": "Ourstory: Afrikans from Antiquity to the 21st Century", "description": "Ourstory: Afrikans from Antiquity to the 21st Century is an easy to read introduction to Afrikan history.  The book offers a broad sample of places, events, and people in history who have shaped the world we live in today.  Geared towards young people and meant to offer a positive alternative to the often negative perceptions of mainstream literature, Ourstory is an informative and inspiring look at the past."}]