[{"id": "1494814226", "genre": "Science Fiction & Fantasy", "title": "1: Sparrow Man (Volume 1)", "description": "Meg Clark has turned out to be everything her father and the people of her little North Country town of Gouvernour, NY, have been saying her whole life: nothin’ but a piece of white trash. In an effort to hide her past and turn herself around, she spent her inheritance from her dead mother on the perfect little house with a white picket fence. Then something terrible happened and Meg got sent to county lockup so her fiancé, Jim, wouldn’t have to. And then everyone started waking up…dead. Good thing escaping from County wasn’t hard. Jim told her exactly how to get free. Now Meg is running and the walking dead are following. In a last ditch effort to find weapons to protect herself, Meg finds Sparrow instead. A tall, strange man with a quirk, Sparrow has an obsession with feathers and the only goal that’s on his mind is finding an old barn on Route 37 with a snowy owl in its rafters. Meg’s headed to Kingston, where she and Jim agreed to meet if they ever got separated. But sometimes, crossing the border brings more than just freedom and protection and safety. Sometimes it brings questions that someone like Meg would prefer not to answer. And everyone keeps asking questions, including Sparrow. He thinks she’s hiding something and he’s not impressed by her stories of the sins she’s been committing all her life. While Sparrow’s the one who’s a bit cracked in the head, it never occurs to Meg that she could be the one who’s not remembering something. Like what really happened that day she killed those seven men."}, {"id": "0515155594", "genre": "Science Fiction & Fantasy", "title": "Dark Promises (Carpathian Novel, A)", "description": "Lovers challenge destiny and risk their lives in this Carpathian novel by the #1 New York Times bestselling “queen of paranormal romance.”*Gabrielle has had enough of battles, of wars, of seeing the Carpathian warrior she loves nearly lose his life when it isn’t even his fight. All she wants is to be away from the Carpathian Mountains, far from vampires and the shadows cast by the crumbling monastery that hides so many terrible secrets. But she isn’t the only one in search of answers in the corners of the unknown...Trixie Joanes has come to the Carpathian Mountains in search of her wayward granddaughter, fearing that she has been lured there by something unspeakable. Instead, Trixie has stumbled onto the path of a desperate man and woman on the run. And they’re all fated for the lair of a mysterious ancient with revenge in his soul and the undying power to make bad dreams come true.*J.R. Ward, #1 New York Times bestselling author"}, {"id": "1501131427", "genre": "Science Fiction & Fantasy", "title": "Swan Song", "description": "New York Times bestselling author Robert McCammon’s prescient and “shocking” (John Saul) vision of a post-apocalyptic US comes to life in his classic epic of terror and renewal.In a wasteland born of rage and fear, populated by monstrous creatures and marauding armies, Earth’s last survivors have been drawn into a final battle between good and evil that will decide the fate of humanity. There’s Sister, who discovers a strange and transformative glass artifact in the destroyed Manhattan streets…Joshua Hutchins, the pro wrestler who takes refuge from the nuclear fallout at a Nebraska gas station…and Swan, a young girl possessing special powers, who travels alongside Josh to a Missouri town where healing and recovery can begin with her gifts. But the ancient force behind earth’s devastation is scouring the walking wounded for recruits for its relentless army…beginning with Swan herself."}, {"id": "B01N7ZW7X6", "genre": "Science Fiction & Fantasy", "title": "Across the Golden Desert", "description": "Continuing the story from Beyond the Red Mountains, Luther has ensconced Elizabeth in his fortress to teach her the ways of the Enlightened, but she wonders if he has trapped her there. As she discovers his secrets and the dark corners of his world, she becomes increasingly aware of her power, and vows to escape. Meanwhile, Kelvin refuses to believe that Elizabeth is lost to him forever. When he learns where she is — Across the Golden Desert — he is compelled to find her and defeat Luther. Kelvin sets out on a journey that pits him against adversaries otherworldly and human. His determination and love for Elizabeth bring Kelvin to the brink of survival just as she is realizing her destiny. Events collide in ways that neither of them imagined as they are guided by forces not of their choosing."}, {"id": "0809501546", "genre": "Science Fiction & Fantasy", "title": "Weird Trails: The Magazine of Supernatural Cowboy Stories", "description": " Weird Trails is the \"mockumentary\" of pulp magazines — a hilarious sendup of both H.P. Lovecraft's Cthulhu Mythos, Weird Tales and westerns! Purporting to be a facsimile of the April 1933 issue of Weird Trails magazine, it is a modern classic! Features M.M. Moamrath's \"Riders of the Purple Ooze\" and many more Lovecraft-inspired stories. "}]