[{"id": "0778703606", "genre": "Children's Books", "title": "Field Events in Action (Sports in Action)", "description": "Offers a brief introduction to the history, techniques, equipment, and rules of contests that test the throwing and jumping skills of athletes."}, {"id": "0823422747", "genre": "Children's Books", "title": "Tornadoes!", "description": "Tornadoes are funnel-shaped clouds that can cause massive destruction on the ground. Their winds can swirl faster than 260 miles per hour! Using her acclaimed combination of clear text and detailed illustrations, Gibbons explains how tornadoes form, the scale used for classifying them, and what to do in case one should be near you."}, {"id": "078683787X", "genre": "Children's Books", "title": "Peter and the Shadow Thieves", "description": "In this riveting and adventure-packed follow-up to Peter and the Starcatchers, we discover Peter leaving the relative safety of Mollusk Island\u0097along with his trusted companion Tinker Bell\u0097for the cold, damp streets of London. On a difficult journey across the sea, he and Tink discover the darkand deadly, slithering part-man/part-creature Lord Ombra. It seems that the dreaded Ombra has a variety of mysterious powers including the ability to make shadows disappear. When Peter reaches London, he sets out to find the indomitable Molly. Together they must combat Ombra’s terrible forces to both protect the Starcatchers and the treasured starstuff and most importantly to rescue Molly’s mother from the clutches of evil. Dave Barry and Ridley Pearson have done it again\u0097written a compulsively readable, impossible-to-put-down tale that will delight readers of all ages. "}, {"id": "1626721270", "genre": "Children's Books", "title": "Nerdy Birdy", "description": "Nerdy Birdy likes reading, video games, and reading about video games, which immediately disqualifies him for membership in the cool crowd. One thing is clear: being a nerdy birdy is a lonely lifestyle.When he's at his lowest point, Nerdy Birdy meets a flock just like him. He has friends and discovers that there are far more nerdy birdies than cool birdies in the sky."}, {"id": "1426319355", "genre": "Children's Books", "title": "National Geographic Readers: Alexander Graham Bell (Readers Bios)", "description": "Say hello to the inventor of the telephone—and so much more! Through leveled text and engaging photos, kids meet Alexander Graham Bell and learn about his important invention as well as his role in the founding of the National Geographic Society. This level 2 text provides easy-to-access information perfect for independent readers."}]