[{"id": "0375865837", "genre": "Children's Books", "title": "Flip Flop! (Step into Reading)", "description": "Two best friends ponder over and partake in summer's seemingly endless possibilities. There's fun to be had at the sunny shore, fireworks to watch, and amusement parks to visit. This Step 1 story has big type and easy words, rhyme and rhythm, picture clues and includes two sheets of stickers!"}, {"id": "B0785NL66K", "genre": "Children's Books", "title": "Lumberjanes (Collections) (7 Book Series)", "description": "Jo, April, Mal, Molly and Ripley are five best pals determined to have an awesome summer together...and they're not gonna let any insane quest or an array of supernatural critters get in their way! Not only is it the second title launching in our new BOOM! Box imprint but LUMBERJANES is one of those punk rock, love-everything-about-it stories that appeals to fans of basically all excellent things."}, {"id": "1598201239", "genre": "Children's Books", "title": "Celebra Kwanzaa con Botitas y sus gatitos / Celebrate Kwanzaa with Boots and Her Kittens (Cuentos Para Celebrar / Stories to Celebrate) (Spanish Edition)", "description": "An African-American family gets together to celebrate Kwanzaa, but the celebration is spoiled because their beloved pet cat is missing. As the family sets off on a quest to find the cat, the reader learns about the seven values celebrated in Kwanzaa in a simple and entertaining way. Includes and informative section about the holiday."}, {"id": "1511791543", "genre": "Children's Books", "title": "The Big Bang (The Quaint and Quizzical Cosmos)", "description": "The goal of The Quaint and Quizzical Cosmos rhyming series is to introduce deep human history to kids in a fun and whimsical way. The first book, The Quaint and Quizzical Cosmos: The Big Bang, introduces children to basic physics concepts, including matter, energy, and gravity."}, {"id": "1632903717", "genre": "Children's Books", "title": "Three Little Kittens (Sing-along Animal Songs)", "description": "These little kittens are having a tough day! Wet, dry, dirty, clean– oh my! Learn about opposites  and everything else these silly kittens go through when they accidentally lose their mittens. This hardcover library bound book comes with CD and online music access."}]