[{"id": "1429638745", "genre": "Children's Books", "title": "The Best of Pro Football (Best of Pro Sports)", "description": "Tom Brady takes the snap. He drops back and launches the football to the end zone. The wide receiver leaps. Touchdown! The best moments and players in pro football history are at your fingertips. Look inside to discover who threw the best touchdown, kicked the best field goal, or delivered the most memorable tackle. The Best of Pro Football gets you into the game."}, {"id": "0998582735", "genre": "Children's Books", "title": "Dominic's Ducks", "description": "When Officer Dominic is dispatched to the cherry-red convertible at 1600 Greentree Road, he has no idea what he’s about to get himself into. But when all is said and done, Officer Dominic wouldn’t change a thing."}, {"id": "1624312977", "genre": "Children's Books", "title": "Diplodocus (21st Century Junior Library: Dinosaurs)", "description": "This book details the life of the dinosaur known as Diplodocus. Readers will develop word recognition and reading skills while learning when Diplodocus lived and what it likely looked like. They will also find out how it lived, from what it ate to how it dealt with enemies. Additional text features and search tools, including a glossary and an index, help students locate information and learn new words."}, {"id": "0763635006", "genre": "Children's Books", "title": "Where's Waldo? The Fantastic Journey", "description": "Search for Waldo, and help him discover the truth about himself.The elusive little guy you loved as a kid has ventured into an affordable new format, ready to boggle a new generationl. Now he's easier to carry around -- but just as hard as ever to find!"}, {"id": "1493557548", "genre": "Children's Books", "title": "Alex Goes to the Circus: Amazing Adventures of Alex the Crocodile", "description": "Alex is the main character in the Amazing Adventures of Alex the Crocodile Children's book series.  He lives in Crocodile Cove and can only do good.  He has a love for life, and always seeks out new adventures.  Alex also loves to learn new things.  He is not afraid of anything.  He has a brother named Derek, and many friends that live near him in Crocodile Cove.  In this adventure Alex visits a circus and watching many of his friends perform acts including juggling, jumping through rings of fire, swinging on a trapeze, and performing a joust. This is the 10th book in the series and final book in Volume 1, following the success of Alex and the Lava Pit, Alex Pretends to Celebrate Christmas, Alex Learns How to Surf, Alex Learns How to Play Chess, Alex Meets a Pirate, Alex Goes to a Chocolate Factory, Alex and the Hot Air Balloon, and Alex Meets a Leprechaun."}]