[{"id": "1402785259", "genre": "Children's Books", "title": "Deep Sea Dive (Lift-the-Flap Adventures)", "description": "I'm your dive guide.Come with me. Let's explore thedeep blue sea.  This exciting interactive board book lets kids explore the underwater world and learn about deep-sea creatures. They'll meet a host of animals, from sharks and octopuses to puffer fish and sea turtles. By lifting the flap, children will reveal a close-up glimpse of each animal--and discover fun facts set in rhyming verse. "}, {"id": "B0743VW87C", "genre": "Children's Books", "title": "A Girl Named Hillary: The True Story of Hillary Clinton (American Girl: A Girl Named)", "description": "The A Girl Named series tells the stories of how ordinary American girls grew up to be extraordinary American women. It took a lot of determination, courage, and confidence to become the first woman to be nominated for president by a major political party. A Girl Named Hillary tells of the defining moments that made up her childhood and adolescence with full-color illustrations throughout. In addition to stories and facts about Hillary's upbringing and accomplishments, the book includes a timeline and a glossary, plus a profile of a noteworthy and contemporary American girl following in Hillary's footsteps to break the glass ceiling and show girls everywhere that they can accomplish anything they set their minds to!"}, {"id": "0399216928", "genre": "Children's Books", "title": "The Legend of the Poinsettia (Mexican Folktale)", "description": "In Mexico, the poinsettia is called flor de la Nochebuenao flower of the Holy Night. At Christmastime, the flower blooms and flourishes, the quite exquisite red stars lighting up the countryside.A Mexican legend tells how the poinsettia came to be, through a little girl's unselfish gift to the Christ Child. Tomie dePaola has embraced the legend using his own special feeling for Christmas. His glorious paintings capture not only the brilliant colors of Mexico and its art, but also the excitement of the children preparing for Christmas and the hope of Lucida, who comes to see what makes a gift truly beautiful."}, {"id": "1478731737", "genre": "Children's Books", "title": "Fuzzy Bunny", "description": "Fuzzy Bunny is a special little bunny born with very long ears. They are not just a little bit long, they are very, very, long! All the bunnies in the village make fun of him and tell him he is different. However, with help from a little mouse named Midge, Fuzzy Bunny soon learns his differences are something to be proud of! This beautifully illustrated and touching book about understanding diversity tells the story of a bunny who learns to overcome obstacles and appreciate his unique gifts."}, {"id": "0881062952", "genre": "Children's Books", "title": "The Big Buck Adventure", "description": "One little girl and one very big dollar set out on a great adventure at the store. However, what seems like a pleasant afternoon of shopping soon turns perplexing as the challenge of her buying options becomes overwhelming. She doesn't know what to do. There are so many choices, but she only has one buck. A fun and perfect example of how we use math in our daily lives."}]