[{"id": "B01KZIEETY", "genre": "Children's Books", "title": "2016 MYTHICAL SON ANTHOLOGY: Science Fiction and Paranormal Stories", "description": "Mythical Son presents a selection of 12 stories from two genres, Science fiction and Paranormal stories written by children. Child authors is a concept where children write the stories they want to read. We believe children have an enormous capacity to understand life and are some of the most gifted story tellers. The authors who have contributed to this anthology are all children from India aged between 6 to 18 years. We hope children across the country and world will enjoy reading these stories."}, {"id": "1932082255", "genre": "Children's Books", "title": "Look Who Lives in the Desert!: Bouncing and Pouncing, Hiding and Gliding, Sleeping and Creeping", "description": "Depicts animals and insects of the desert with poetry, humorous illustrations, and panels with facts and photographs."}, {"id": "B072FG4C2N", "genre": "Children's Books", "title": "Akea", "description": "From the day when she was born, Akea’s father knew that she was different; that she was destined for something great.The lone wolf, Kazakh, had sensed it too and even though it was against pack law, he knew that he must help this young husky to be ready, no matter what the cost."}, {"id": "031074539X", "genre": "Children's Books", "title": "Crunch: A Novel (Faithgirlz / Soul Surfer)", "description": "It took real faith and courage to get Bethany back on a surfboard after losing her arm to a shark. The Soul Surfer fiction series is based on the life of surfer star Bethany Hamilton, as she and her friends discover God's love and guidance as they tackle the waves life hands them. In book four, Crunch, Bethany meets a soccer-loving little boy who captures her heart in an unexpected way while on a mission trip in Mexico. Bethany helps him discover the father of his dreams, but because of a promise she makes to him, Bethany's spot in a prestigious surf competition is threatened."}, {"id": "0060208430", "genre": "Children's Books", "title": "Little House on Rocky Ridge (Little House Sequel)", "description": "The first of a five-part series, based on the classic works of Laura Ingalls Wilder, chronicles the Wilder family history as Laura, Almanzo, and daughter Rose travel in a covered wagon to Missouri where they make a new life for themselves."}]