[{"id": "B00D1W9PYQ", "genre": "Children's Books", "title": "The Music of Zombies: The Fifth Tale from the Five Kingdoms (Tales from the Five Kingdoms)", "description": "The web of power looks smooth and peaceful — until a new threat looms — in the fifth tale from the Five Kingdoms.Prince Albion expects a unique occasion when he starts planning Cockenzie Rood Day to celebrate his kingdom — and himself. What he doesn’t expect is boppings on the head and kidnapping, all because a zombie wants to play his fiddle in the talent contest. With a misbehaving path, a romantic bat, and a greedy butler to set them on their way, Gracie Gillypot and Prince Marcus are off on their fifth adventure. It’s up to a Trueheart, a resourceful prince, and Gubble the troll to stop the zombie before he does some giant damage to the Five Kingdoms."}, {"id": "1403401500", "genre": "Children's Books", "title": "The Harlem Renaissance (20th Century Perspectives)", "description": "Describes the time period known as the Harlem Renaissance, during which African American artists, poets, writers, thinkers, and musicians flourished in Harlem, New York."}, {"id": "B0714LXVN4", "genre": "Children's Books", "title": "Rat City (The Rat Chronicles)", "description": "A lost friend. A family tragedy. A psychopathic scientist driven by greed.All Shannon Dane wants to do is be with his girlfriend, Ally. So when tragedy strikes her family, he’s willing to do whatever she asks. Even break into Rat City, the run-down mansion owned by her geneticist uncle.But what Shannon discovers could rip their lives– and the lives of a generation of teens – into shreds."}, {"id": "1520206445", "genre": "Children's Books", "title": "Maui, Kakamora and Other Legends of Oceania", "description": "Excited about the new Disney movie Moana? Want to know more about about Maui and how he pulled up the Hawaiian islands with his fish hook? How about Pele (Te Kā) the volcano goddess, a giant crab, and the not so cute little Kakamora? All are found in the legends and myths of the South Pacific, also known as Oceania. Maui, Kakamora and Other Legends of Oceania has stories and facts about these legends and more compiled from several books and sources. Note: This book is geared toward readers between 7 and 11 years old, depending on their reading level. The most difficult words are the \"fun\" Hawaiian names."}, {"id": "145211241X", "genre": "Children's Books", "title": "Follow the Moon Home: A Tale of One Idea, Twenty Kids, and a Hundred Sea Turtles", "description": "Acclaimed activist Philippe Cousteau and renowned author Deborah Hopkinson team up to offer a story of the powerful difference young people can make in the world. Meet Viv, who has a new home and a new school by the sea, and follow her as she finds her way in a new place and helps bring together a whole community to save the sea turtles of the South Carolina coast."}]