[{"id": "B00IH02IJG", "genre": "Children's Books", "title": "Charlie Brown: POW!: A Peanuts Collection (Peanuts Kids)", "description": "Put me in, Coach!The Peanuts gang is ready to play ball in this collection of baseball-themed cartoons. Some of the most popular Peanuts moments happen on the field and they're gathered here for a season full of enjoyment. As manager of the endlessly losing team, Charlie Brown soldiers on to keep his team's spirits up, while being constantly blown off the pitching mound in a clothes-exploding fashion. It doesn't help that his catcher is a musician by nature or that his shortstop is a dog. Not to mention that center-fielder Lucy can't keep her mouth shut long enough to know what's going on in the game! Put them all together and you get a game plan for laughs!First published in 1950, the classic Peanuts strip now appears in more than 2,200 newspapers in 75 countries in 25 languages. Phrases such as “security blanket” and “good grief,” which originated in the Peanuts world, are now part of the global vernacular, and images of Charles Schulz’s classic characters—Charlie Brown kicking the football, Lucy leaning over Schroeder’s piano—are now universally recognized. "}, {"id": "1591432030", "genre": "Children's Books", "title": "Arjuna: The Gentle Warrior", "description": "A children’s story featuring Arjuna, a compassionate warrior who must choose between abstaining from battle or fulfilling his destiny to end the war • Based on the Mahabharata, the famous Indian epic, adapted for Western children • Illustrated throughout with glowing full-color paintings in traditional Indian style We are all born for a purpose, though sometimes it is not clear to us what it is. In this tale of good versus evil, cousin versus cousin, Prince Arjuna knew that his purpose, his dharma, was to fight in the battle against the greedy and cruel king Duryodhana. Yet his own relatives and friends were on the opposing side. With a lot of soul searching and divine advice from the god Krishna, Arjuna bravely chooses to fulfill his destiny as a warrior with compassion and kindness, restoring peace, justice, and prosperity to his kingdom. This adaptation for children of the classic epic the Mahabharata is beautifully illustrated with paintings created in a centuries-old method traditional to India. Richly detailed, the paintings bring to life the colorful cast of characters as well as Arjuna’s inner conflict and the trials he faces on the path of loyalty, justice, and peace."}, {"id": "B07847YPN9", "genre": "Children's Books", "title": "365 Foreign Dishes: A Foreign Dish for every day in the year (Classic Cookery Books) (Annotated)", "description": "\"365 Foreign Dishes\" originally published in 1908. ''A Foreign Dish for Every Day in the Year''. Starting on January 1st with Austrian Goulasch and ending on December 31st with French Braised Sweetbread, you can cook your way around the world all year long! Dedicated to all Vintage Cookbook Lovers! "}, {"id": "B00BAY7652", "genre": "Children's Books", "title": "Little Red Tractor - The Day of the Big Surprise", "description": "Meet Stan, Patch the dog, and Little Red Tractor and read about their busy lives on Gosling Farm.In this story, Stan, Patch and Little Red Tractor go to Wrigglesworth, where they help to cut the grass at the cricket ground. After a scrumptious tea, Stan finds Patch behind the pavilion with a big surprise!"}, {"id": "0689871473", "genre": "Children's Books", "title": "How Santa Lost His Job", "description": "Santa has the best job he can think of -- brining presents each Christmas to children all around the world. Every year he prepares for his trip: He trims his beard, takes a bath, gets dressed, and packs up his sleigh fort he long night ahead. But there are always a few unexpected delays that make things a little hectic. Muckle, one of the elves who helps Santa, thinks he can come up with a more efficient way of delivering the toys -- a method that won't involve Santa at all."}]