[{"id": "B01IQFT9F2", "genre": "Science Fiction & Fantasy", "title": "IMOGEN: Corrupted: (Book 2)", "description": "Corrupted continues the story of Imogen, the innocent woman taken by her enemy as their war spoils. After being left alone as her captor Erik is called away on business demanded by his corrupt superior, Imogen must begin to accept her current state and all its implications.As her fate begins to overwhelm her, Erik wastes no time in the beginning stages to teach Imogen what she must learn to survive. His warnings of ominous consequences if she does not obey linger unrevealed, and both Imogen and Erik fight to remain in control of themselves and their emotional pull to one another. Can Imogen learn what Erik is trying to teach her? Is Erik strong enough? Or is Imogen’s safety about to be taken out of Erik’s hands and become corrupted?"}, {"id": "1477848150", "genre": "Science Fiction & Fantasy", "title": "Timebound (The Chronos Files)", "description": "2013 Winner — Amazon Breakthrough Novel Award — Grand Prize and Young Adult Fiction WinnerWhen Kate Pierce-Keller’s grandmother gives her a strange blue medallion and speaks of time travel, sixteen-year-old Kate assumes the old woman is delusional. But it all becomes horrifyingly real when a murder in the past destroys the foundation of Kate’s present-day life. Suddenly, that medallion is the only thing protecting Kate from blinking out of existence.Kate learns that the 1893 killing is part of something much more sinister, and her genetic ability to time travel makes Kate the only one who can fix the future. Risking everything, she travels back in time to the Chicago World’s Fair to try to prevent the murder and the chain of events that follows.Changing the timeline comes with a personal cost—if Kate succeeds, the boy she loves will have no memory of her existence. And regardless of her motives, does Kate have the right to manipulate the fate of the entire world? Timebound was originally released as Time’s Twisted Arrow. "}, {"id": "1476733953", "genre": "Science Fiction & Fantasy", "title": "Wool", "description": "For suspense-filled, post-apocalyptic thrillers, Wool is more than a self-published ebook phenomenon―it’s the new standard in classic science fiction.In a ruined and toxic future, a community exists in a giant silo underground, hundreds of stories deep. There, men and women live in a society full of regulations they believe are meant to protect them. Sheriff Holston, who has unwaveringly upheld the silo’s rules for years, unexpectedly breaks the greatest taboo of all: He asks to go outside. His fateful decision unleashes a drastic series of events. An unlikely candidate is appointed to replace him: Juliette, a mechanic with no training in law, whose special knack is fixing machines. Now Juliette is about to be entrusted with fixing her silo, and she will soon learn just how badly her world is broken. The silo is about to confront what its history has only hinted about and its inhabitants have never dared to whisper. Uprising. A New York Times and USA TODAY bestseller, as well as Kindle Book Review’s 2012 Indie Book of the Year, Wool is truly a blockbuster."}, {"id": "031285062X", "genre": "Science Fiction & Fantasy", "title": "The Ascent of Wonder: The Evolution of Hard SF", "description": "Featuring more than sixty groundbreaking short stories by modern science fiction's most important and influential writers, The Ascent of Wonder offers a definitive and incisive exploration of the SF genre's visionary core.From Poe to Pohl, Wells to Wolfe, and Verne to Vinge, this hefty anthology fully charts the themes, trends, thoughts, and traditions that comprise the challenging yet rich literary form known as \"hard SF.\""}, {"id": "1912406063", "genre": "Science Fiction & Fantasy", "title": "Delusional Traits: The Rare Traits Trilogy Book II (Volume 2)", "description": "With the right DNA, you could be free from disease, free from ageing. You could even, perhaps, live forever. John Andrews has the right DNA … and so did his daughter, Paola. In 2012, art-forgery expert Ced Fisher is contacted by a woman from Boston wanting him to compare paintings by two female artists — one modern and one from the 19th century. When Ced discovers that the paintings are by the same artist, he immediately thinks of his 600-year-old artist friend John Andrews and his incredible history. Could the artist be John’s long-lost daughter, Paola Santini, born centuries ago in Naples? And if so, who is the woman in Boston? Further enquiries reveal that the modern artist, Annie Carr, was a delusional murderer incarcerated in a state psychiatric institution in Colorado in 1970, and worse, she is now long dead. But was she delusional or was the psychiatrist who diagnosed her misled? And how accurate are the reports of her death? The second book in the Rare Traits Trilogy continues the tale of 15th-century artist John Andrews and those who share his extraordinary longevity. Centred around the daughter John has never met, Delusional Traits is the story of a woman whose character was honed by adversity, her life a constant fight for survival in a world that will never understand her."}]