[{"id": "B00DU18WEM", "genre": "Children's Books", "title": "Uncle Tom’s Cabin: Young Folks’ Edition", "description": "Uncle Tom's Cabin; or, Life Among the Lowly is an anti-slavery novel by American author Harriet Beecher Stowe. Published in 1852, the novel helped lay the groundwork for the Civil War. The sentimental novel depicts the reality of slavery while also asserting that Christian love can overcome something as destructive as enslavement of fellow human beings. Uncle Tom's Cabin had a deep historical impact as a vital antislavery tool."}, {"id": "0395866189", "genre": "Children's Books", "title": "Piggie Pie!", "description": "Gritch the Witch is grouchy, grumpy, and very hungry. The only thing that could make her happy is something extra special for lunch, and that is: Piggie Pie! Gritch zooms off on her broomstick to find eight plump piggies -- where else? -- on Old MacDonald's Farm. Cleverly disguised pigs impersonate ducks, chickens, a cow, and Old MacDonald himself, as this uproarious, quick-paced story builds to an ironically surprising conclusion. Wacky, hip, and illustrated with bold, bright paintings, \"Piggie Pie\" adds a new twist to an old fairy-tale scene."}, {"id": "1680453106", "genre": "Children's Books", "title": "Python Coding for Kids: Learn to Program the Raspberry Pi (Make:)", "description": "Learning to code is really learning to think clearly and logically.  This book is a practical guide to learning the Python language via 14 projects that you build immediately. Learn how to setup your Raspberry Pi, and how to code in Python, to create electronic sound effects with pushbutton switches, an animated bouncing ball that responds to hand movement, and a jukebox machine that plays your favorite songs. You'll learn electronics by wiring light sensors, pushbutton switches, LEDs, and mini amplifiers to the Raspberry Pi. This book will provide you the knowledge and skills to code and build your own awesome Raspberry Pi devices and gadgets."}, {"id": "B01J2J4IL6", "genre": "Children's Books", "title": "The Egg Nanny Tales: A Dragon Fantasy for Children", "description": "A long, long time ago, this land had no life. Water and air joined the land so it wouldn't be lonely, but that still wasn't enough. The Sun decided to help.  He shown fiercely and heated the land, the water, and the air. The Moon sent seeds to dance in the air. the seeds heated up and became thirst. They drank water, which made them heavy and they fell to earth. They put down roots into the soil. Life began, and soon different forms evolved.Dragons, humans, gnomes, bears,and rabbits were among them.I am a Dragon - an Egg Nanny,Part of an Egg Nanny's training is the telling of stories. We learn them from our nannies, and pass them on to the next generations. We often add new ones of our own, from our experiences and observations.  Here, then, are my stories."}, {"id": "1448847737", "genre": "Children's Books", "title": "Searching for Yeti: The Abominable Snowman (Mystery Explorers)", "description": "The legendary ape-like creature Yeti is thought to live among the snowy cliffs of the Himalayas. Although most scientists regard this abominable snowman as a myth, many people believe that the mysterious creature exists. In this mesmerizing book, readers encounter the Yetis world and learn about its history and the official record of sightings. Modern expeditions to track the creature as well as evidence given to defend or attack Yetis existence are investigated. Sidebars share further fascinating tidbits."}]