[{"id": "B003TFE5NQ", "genre": "Children's Books", "title": "The Beginner's Bible Jesus and His Friends (I Can Read! / The Beginner's Bible)", "description": "Jesus loves many people. He has lots of friends who love him, too. Jesus and his friends help people. They share their food. Best of all, Jesus and his friends tell people about God.This My First I Can Read! book, with basic language, word repetition, and great illustrations, is perfect for shared reading with a child. It aligns with guided reading level J and will be of interest to children Pre-K to 3rd grade."}, {"id": "B00IJGXB9Y", "genre": "Children's Books", "title": "Grace's Garden", "description": "Grace's Garden A small white rabbit named Grace wakes one day up to see that the sun is shining, and spring has come. She decides that it's time to plant her garden. Her friends tempt her to play, and relax all summer, but Grace knows that she'll need to save food for the winter. What will Grace do all summer? Will her friends have time to plant their own gardens? Kids will love the brightly illustrated images of Grace's Garden, while learning a valuable life lesson about how planning ahead can be important later in life. Read now to see why \"Grace's Garden\" is one of the most highly anticipated children's books of 2014! For a fun game, see if you can find the hidden frog in each image! This book is appropriate for ages 2-12, although the message is appropriate for all ages, even adults! Approximately 15 fully illustrated pages. "}, {"id": "B00L3WESDE", "genre": "Children's Books", "title": "Ancient Rome - From Earliest Times to 476 A.D. (Illustrated)", "description": "\"Romulus, first king of Rome, ruled for thirty-seven years (753-716). He found the city needed  inhabitants, and to increase their number he opened an asylum, to which many refugees fled. But wives were needed. To supply this want, he celebrated games, and invited the neighboring people, the SABINES, to attend the sports. When all were engaged in looking on, the Romans suddenly made a rush and seized the Sabine virgins. This bold robbery caused a war, which finally ended in a compromise, and a sharing of the city with the Sabines. Romulus then chose one hundred Senators, whom he called PATRES. He also divided the people into thirty wards. In the thirty-seventh year of his reign he disappeared, and was believed to have been taken up into heaven...\"An excellent survey of the history of Rome, from the legendary founding through the Republic to the Empire and the subsequent collapse of the Western Roman Empire. Illustrated to enhance the reading experience. Enjoy!"}, {"id": "B00GRJZNJ6", "genre": "Children's Books", "title": "My Alphabet Book of Thanksgiving for Toddlers and Earliest Readers (A Quiet-time picture book of things to be thankful for)", "description": "It is never too early to talk about being thankful - and what better season to begin than Thanksgiving!  Help your toddler or young reader match the word with the picture, and then together you can identify other things to be grateful for this holiday season and throughout the year."}, {"id": "B007OV6516", "genre": "Children's Books", "title": "Oh No, Little Dragon!", "description": "Little Dragon wreaks adorable havoc in this energetic picture book from the creator of Except If.With a PHOOSH and a Grrrrrr and a CANNONBAAAALLLLLL! Little Dragon tears through his day (and the house). But even when he gets a little too rambunctious, there’s no OH NO! that Mama’s kiss can’t fix.     Jim Averbeck celebrates both the tremendous energy of a little boy and the tenderness shared between mother and child in this vibrant picture book that begs to be read aloud."}]