[{"id": "1885593198", "genre": "Children's Books", "title": "Fun With My 5 Senses: Activities to Build Learning Readiness (Williamson Little Hands Series)", "description": "Presents a variety of activities which build learning readiness for exploring and understanding the five senses."}, {"id": "0531219674", "genre": "Children's Books", "title": "Internet Inventors (Cornerstones of Freedom)", "description": "Whether they are checking their email for important business correspondence or logging into a social network to check out a friends wedding photos, many people in the United States have come to rely on the Internet as part of their daily lives. This book details the history of the Internet, from its earliest form in the late 1950s to its global influence today."}, {"id": "B01BLKMHF8", "genre": "Children's Books", "title": "The Dragon Slayer (Short Scrolls of Zndaria Book 1)", "description": "The kingdom of Versii is on the verge of war against an enemy they don't know how to defeat. As one of Versii's newest champions, Theodore \"Ted\" McGray eagerly awaits battle. Will war be everything he expects? Can he stop the dragons before his kingdom is destroyed?The first of the Short Scrolls of Zndaria, The Dragon Slayer, takes readers deeper into the magical world of Zndaria and parallels the adventures of Ted's brother, Nathanial McGray, in The Golden Wizard, the first book in the main series, Scrolls of Zndaria."}, {"id": "145950464X", "genre": "Children's Books", "title": "Keeper of the Light", "description": "The life of a lighthouse keeper on the east coast was not an easy one. Isolated on stormy shores, their job was to keep those at sea safe, at any cost. After her father dies in a seafaring accident, eleven-year-old Sara goes to work for the Mosher family helping clean, maintain and keep the light. When the Mosher family must leave for the mainland in a medical emergency, Sara is left alone to keep the light as a terrible gale approaches.Dramatic and beautiful illustrations help tell the tale of a young girl alone and facing an emergency. When Sara sees a boat crashed on the rocks, young readers will feel as though they are standing on the wind-whipped shores making a life or death decision with her.This story is based on the real experiences of young girls and boys who worked at lighthouses in the early 1900s. Janet Barkhouse has taken their experiences and created a dramatic but realistic story that shows the value of the work young people had to do and the sacrifices they had to make."}, {"id": "1435266145", "genre": "Children's Books", "title": "Ayat Jamilah: Beautiful Signs: A Treasury of Islamic Wisdom for Children and Parents (Aesop Prize)", "description": "\"Beautiful Signs / Ayat Jamilah\" draws from not only the core of Islamic spirituality and ethics - the Qur'an and the traditions (hadiths) - but also from the mystical verse, folk tales, and exemplary figures of the Islamic narrative. Unlike any other collection of Islamic stories, \"Beautiful Signs\" gathers traditional stories from the farthest reaches of the Muslim world, stretching from Morocco in the west to Indonesia in the east, and from China in the north to Tanzania in the south. This unique anthology, with its rich and thorough explanatory notes, will be invaluable to anyone wishing to understand or teach geography, world history, or world religions. It will also be treasured by Muslim families and by all parents committed to broadening the lives and values of their children and themselves."}]