[{"id": "B01MCQHYKX", "genre": "Children's Books", "title": "Reckless (Heartless Series Book 4)", "description": "JESSUP HART BLACKWELL SAVED THE WORLD.Not that anyone will ever know.Not that they’ll remember.But I know.I remember.That’s my curse.I don’t agree with how he did it.I wish it had been me that died. Lord knows we would’ve allbeen safer if I’d been the one instead of Hart.But he couldn’t let that happen.He couldn’t live with it.How am I supposed to live with it?The pain.The remorse.The pressing feeling that something inside me that I can’tcontrol is still there… dormant but not dead. Ready to pounce.Ready to kill again.Hart saved the world, that’s true.But he couldn’t save me~*~*~The final book in the Heartless Series. **Early bird PREORDER 99 cents for a limited time!**Heartless (book 1)Soulless (book 2)Breathless (book 3)Reckless (book 4)Hart (Hart Blackwell's journal)"}, {"id": "0062457152", "genre": "Children's Books", "title": "Stick Dog Tries to Take the Donuts", "description": "The popular Stick Dog series continues in Tom Watson's hilarious Stick Dog Tries to Take the Donuts!Stick Dog and his team of strays are off on another outrageous canine caper. To snatch some breakfast treats for his hungry pals, Stick Dog will need to stop a moving truck, outfox a man on a telephone pole, and calm down a very caffeinated Karen. But that's not all. He'll also need to manage the greatest confrontation in history when his good friend Poo-Poo comes face-to-face with the ultimate enemy: a squirrel!With Stick Dog's smarts, daring, loyalty—and patience—he just might lead his buddies to the best breakfast ever. Perfect for fans of Big Nate, Diary of a Wimpy Kid, Timmy Failure, and the previous Stick Dog books.It's morning. The dogs are hungry. It's time to take the donuts!"}, {"id": "0736800425", "genre": "Children's Books", "title": "PT Boats (Land and Sea)", "description": "Describes the history, design, weapons, and tactics of the torpedo-carrying PT-boats, used chiefly during World War II."}, {"id": "B06X18XPSK", "genre": "Children's Books", "title": "Stopping the Sultan of Selfishness (An Adventure in Contentment) (Bibleman)", "description": "Let the all-new Bibleman show YOU the power in God's Word! Join Bibleman and his team as they rely on contentment to defeat the Sultan of Selfishness! Young Tariq is from a rich family, although his parents don't just give him whatever he wants. Uh-oh—the family's live-in butler is secretly buying Tariq expensive gadgets and gizmos. But why? Bibleman knows why: The servant is really a wicked villain who targets the children of wealthy families. Bible story: Prodigal Son. Key verse: Luke 12:15Don't miss the other books in the all-new Bibleman adventures! "}, {"id": "B072VVMCVJ", "genre": "Children's Books", "title": "Spies!", "description": "Explores the lives and daring deeds of spies through the 20th century and beyond using photos, original sources, maps, timelines, and little known facts."}]