[{"id": "0553497588", "genre": "Children's Books", "title": "I'm a Ballerina! (Little Golden Book)", "description": "A little girl invites us into her ballet class, and later performs onstage (gulp!) in her first recital. Young readers will enjoy seeing what happens in a class, and young ballerinas will see themselves in this book."}, {"id": "B01AV66RTK", "genre": "Children's Books", "title": "Children's Book: Sea Creatures:: Fun Facts and Rhymes (Childrens Books, 3-7 Year Olds, Marine Life, Sea Life, Sea Animals, Dolphins, Whales, Sharks)", "description": "Sea Creatures: Fun Facts and RhymesThis book is full of great images, fun facts and fun poems.  This will ensure your children learn about Sea Creatures in a fun and enjoyable way.  For example: Did you know?  An Octopus has three hearts, or a Sea Horse has fins on its head to help it steer, or that a Blue Whale is the largest creature ever to have lived on Earth.Here are the Sea Creatures you will learn about Sidney the SealStella the Star FishTimmy the TurtleColin the CrabWalter the WhaleStanley the Sea HorseOtto the OctopusStefan the SharkThe FishDora the DolphinUnder the sea, under the sea,All the Creatures swimming free;Enjoying the water and splashing around,Download this book to see what we found.Download now and see what we found "}, {"id": "B00E7HV7Q8", "genre": "Children's Books", "title": "Chief Joseph: Leader of the Nez Perce (15-Minute Books Book 615)", "description": "Chief Joseph was the name given to the leader of the Nez Perce Indians by the white men who couldn't pronounce Hin-mah-too-yah-lat-kekht (Thunder Rolling in the Mountains). Inheriting the leadership of the Wallowa Band from his father Tuekakas in 1871, Joseph led his people in the Nez Perce war of 1877, the first and only war between the Nez Perce and the whites.Find out about the life of this man who led the Nez Perce on their epic run for freedom in this 15-minute biography.Ages 8 and up.LearningIsland.com believes in the value of children practicing reading for 15 minutes every day. Our 15-Minute Books give children lots of fun, exciting choices to read, from classic stories, to mysteries, to books of knowledge. Many books are appropriate for hi-lo readers. Open the world of reading to a child by having them read for 15 minutes a day."}, {"id": "0939217619", "genre": "Children's Books", "title": "1-2-3 Draw Horses", "description": "From draft to dressage, young artists will find the horse of their dreams in Freddie Levin's 1-2-3 Draw Horses. Following clear, step-by-step instructions, drawings start with simple shapes and lines and end in full color. Guaranteeing hours of fun - and some great drawings!"}, {"id": "0794441750", "genre": "Children's Books", "title": "Nella the Princess Knight: Looking for a Friend", "description": "Slide the tabs and shine bright with Nella in this hands-on board book!Oh my sparkles! When a Cyclops interrupts the ballet recital and runs off with Trinket, it’s up to Nella to shine bright and save her friend! Slide the tabs and follow Nella on a knightly adventure, as she shows that sometimes making new friends takes a little bit of courage."}]