[{"id": "B00CK05GBG", "genre": "Science Fiction & Fantasy", "title": "2-4 Cavalry Book 10: Operation Resolute Justice (Military Scifi)", "description": "After the decade long war the European Space Union is looking for ways to pay off the massive war debt the Royal Dutch Ministry of Defense started to look ways in order for it to remain fiscally stable and also help pay off its large debt as well. After some decisions a select Battalion sized element, Second Squadron was developed to execute that decision. 2/4 Cavalry, being part of the Kommando since Book 5: Eagle Hammer was brought in to perform this mercenary themed short story. The story is based on the real world template that became known to the world as Black Hawk Down. Given that Operation Gothic Serpent was the actual name I chose to write the mission according to the plans and execution of that fateful mission. However instead of retreading the whole operation and what happened (As I did in Book 3: Another Day In Paradise) this is a more successful outcome."}, {"id": "0575076836", "genre": "Science Fiction & Fantasy", "title": "Provender Gleed", "description": "The Families.O Insanely rich and richly insane.O With world-spanning business interests, glamour and power, they are monarchs, Mafia and movie stars rolled into one.O Since theOBorgias and de'Medicis united in the 17th century,Othe FamiliesOhave transfixed, transformed, and ruled, the world. Top British FamilyOthe Gleeds areOhosting the social event of the year, their annual ball.O Venice has been reconstructed in all its glory in the grounds of their estate, Dashlands, and should provide the perfect romantic backdrop for Provender - the young, disaffected Gleed heir upon whom the Family line, and status, depends - finally to find a wife.O But Provender shows no sign of settling down with any of the social beauties his mother parades before him ...and in the moment whenOloveOdoes begin to blossom, Provender is kidnapped by an anti-Familial revolutionary. The future of the Gleeds, and of Europe,Odepends onOthe skills of two Anagrammatic Detectives - while Provender's own future depends on the dark eyes and equally dark wit of a girl called Is."}, {"id": "0261100211", "genre": "Science Fiction & Fantasy", "title": "Folk Devils and Moral Panics: Creation of Mods and Rockers (Sociology and the modern world)", "description": "Stanley Cohen's study of Mods and Rockers in the 1960s was a foundational text both in terms of investigating the workings of subcultural groups and identifying the concept of a 'moral panic' generated by the media, which leads to groups being vilified in the popular imagination, and inhibits rational debate about solutions to the social problems such groups represent.  The insights Cohen provides into subculture and mass morality are as relevant today as they were when the book was originally published in 1972, as illustrated by the author's introduction for this new edition, in which he tracks moral panics over the last thirty years, commenting on the demonization of young offenders and asylum seekers and on the News of the World's 'name and shame' campaign against paedophiles.Revisiting the theory of moral panic and exploring the way in which the concept has been used, this new edition features a select bibliography of key texts for further reading. The third edition of Folk Devils and Moral Panics makes available a valuable and widely recommended text."}, {"id": "B076KP8DB4", "genre": "Science Fiction & Fantasy", "title": "Doormaker: Tower of Shadows (Book 2)", "description": "Maella has broken the one family rule—to never open a door. She’s (accidentally) unleashed otherworldly violence on her friends, herself, and all the worlds. But things about to get much, much worse.Read Book 2 in this thrilling new fantasy series from New York Times and USA Today bestselling author Jamie Thornton."}, {"id": "0553096745", "genre": "Science Fiction & Fantasy", "title": "Something Rich and Strange (Brian Froud's Faerieland's Series)", "description": "Enter the realm of Faerie: compelling, enchanting, and filled with perilous beauty. It is a world most of us visit only in dreams. Now it is brought to vivid reality by acclaimed fantasy artist Brian Froud, co-author of the bestselling Faeries and designer for the films The Dark Crystal and Labyrinth.They have lived among us for centuries - distant, separate, just out of sight. They fill our myths, our legends, and the stories we tell our children in the dark of night. They come from air, from water, from earth, and from fire. Faeries."}]