[{"id": "1842297392", "genre": "Children's Books", "title": "How to Draw 101 Funny People (How to Draw)", "description": "Learn how to draw 101 different funny people.It's easy! Follow the simple step-by-step drawings and you will soon be amazing all your friends with your new-found artists' skills!This 48-page book from Top That Publishing contains step-by-step line drawings to help budding artists draw 101 different people in various shapes, sizes and poses. Since each image is broken down into six simple steps, children will quickly gain in confidence when they see their finished results, and will soon be adapting their designs and drawing freehand pictures of their own. Ideal for junior artists age 5+."}, {"id": "0688070469", "genre": "Children's Books", "title": "Sir Gawain and the Loathly Lady", "description": "After a horrible hag saves King Arthur's life by answering a riddle, Sir Gawain agrees to marry her and thus releases her from an evil enchantment"}, {"id": "1607992655", "genre": "Children's Books", "title": "The Intruders", "description": "Intruders are the worst kind of newcomers; they invade your spaceeven if your space is only a stable cave. On this night, some very special intruders bring something the animals of the stable never imagined: the gift of love. Strangers became honored guests. Old enemies become cherished friends. Children of all ages will be delighted with Stan Cosby's re-telling of the Christmas story through the eyes of Reuben, the wise old camel; Sarah, the matronly lamb; Jawbone, the abrasive donkey; a high-strung screech owl named Jonas; andbelieve it or notbats. Experience the hope of the agespeace on earth and goodwill toward allin the glorious gift of The Intruders."}, {"id": "1560066148", "genre": "Children's Books", "title": "Male Olympic Champions (History Makers)", "description": "From Jim Thorpe, who in 1912 was hailed as the \"world's greatest athlete\", to Eric Heiden, who swept five speedskating events at the 1980 Winter Olympics in Lake Placid, New York, Olympic athletes have provided some of the greatest moments in sports' history."}, {"id": "189292000X", "genre": "Children's Books", "title": "Al MacInnis: The Defenseman (Sport Snaps Series)", "description": "Al MacInnis: The Defenseman is more than just a biographical snapshot of the career of the All-Star defenseman for the St. Louis Blues. In a unique combination of words provided by Jeff Gordon, sportswriter for the St. Louis Post-Dispatch and photos provided by photo agencies from around the United States, hockey fans will come to know Al MacInnis from his childhood in Inverness, Nova Scotia through the 1997-1998 hockey season. Al's hockey tips for kids, his game-day routine and Coach Joel Quenneville's break down of Al's hockey strengths in the \"Q\" system are a few of the features of this book."}]