[{"id": "1467702145", "genre": "Children's Books", "title": "Dino-Swimming (Carolrhoda Picture Books)", "description": "The Land Sharks take on the Algae Eaters in a dino-swimming showdown! Raptor and Stegosaurus start it off in the individual medley, while the Ptero twins battle it out in the butterfly race. Then Galli and Diplo wow the crowd with their flips and tricks off the diving board! But which team will win the swim meet? It comes down to the last event, the backstroke. Both Stego and Galli think they'll take the prize. Let's hope these dinos remembered their goggles this swim meet is bound to make a splash!"}, {"id": "0316804665", "genre": "Children's Books", "title": "The Leopard's Drum: An Asante Tale from West Africa", "description": "When Osebo the leopard refuses to share his magnificent drum with Nyame, the Sky God, Nyame offers a reward to the animal who can bring him the drum, and a small tortoise undertakes the task of outwitting Osebo."}, {"id": "078765633X", "genre": "Children's Books", "title": "002: Science of Everyday Things: Real Life Physics", "description": "This 4-vol. set illustrates the importance of scientific and mathematical principles through their use in everyday life. Each volume focuses on a specific scientific discipline -- biology, chemistry, earth sciences and physics -- offering students an in-depth understanding of each discipline and its theories. Creating a sense of real-life relevance for students, the Science of Everyday Things expands on the explanations of scientific principles and concepts using a straightforward, step-by-step approach, and presents theories in their everyday applications. Some of the entries covered include: how osmosis is used in dehydrating fruit; how the principles of aerodynamics are applied to cars; Charles' law and the chemical reaction that sets off an airbag; how algorithms are used to figure out the NCAA playoff tournaments; and more. Each volume the Science of Everyday Things presents approximately 40-50 entries and includes photos, diagrams, sidebars containing short glossaries and interesting facts and details relating to each principle."}, {"id": "1930353316", "genre": "Children's Books", "title": "12: Secret Under the Floorboard (Sammy and Brian Mystery)", "description": "A Sammy and Brian Mystery #12. Joshua Glick, a twelve-year-old Amish boy, learns that his shunned brother is involved in a blackmail scheme. Reading level: ages 9-13. Interest level: 9-adult. (150pp. Gaslight Pub., 2001.)"}, {"id": "1416971262", "genre": "Children's Books", "title": "Revolutionary War (Battle Box)", "description": "Open the Battle Box for a totally interactive experience! Inside you'll find a full-color, sixty-four-page book that focuses on the key battles of the Revolutionary War, along with strategic maps, reproductions of the Declaration of Independence and George Washington's commission as commander-in-chief, copies of the stamps from the Stamp Act, and exact replicas of the earliest currency used by colonies - thirteen pieces of memorabilia in all. Like nothing else before it, Battle Box: Revolutionary War is the complete package, a treasure trove about the birth of our country."}]