[{"id": "0786965223", "genre": "Science Fiction & Fantasy", "title": "The Companions: The Sundering, Book I", "description": "“The Companions is the best novel [R.A.] Salvatore has ever written. It’s insanely courageous, profoundly powerful, masterfully constructed, and easily Salvatore’s most ambitious work to date.”—Paul Goat Allen, BarnesandNoble.com “After a quarter of a century, R.A. Salvatore just keeps getting better and better, and The Companions is another masterful leap forward for one of the greatest fantasy epics of all time.”—Philip Athans, best-selling author of Annihilation and The Haunting of Dragon’s CliffThis latest installment in New York Times best-selling author R.A. Salvatore's beloved fantasy saga, The Companions moves Salvatore's signature hero Drizzt into a new era of the Forgotten Realms. As Drizzt's fate hangs in the balance, he reflects on the lives of the trusted allies who stood by his side throughout his early life--the friends now known as the Companions of the Hall. Meanwhile, the first stirrings of the Sundering begin."}, {"id": "031636391X", "genre": "Science Fiction & Fantasy", "title": "Overlord, Vol. 2 - light novel", "description": "It has been a week since Momonga logged in to his favorite RPG one last time and stranded himself there. Now he leads his guild as the Ainz Ooal Gown overlord. Finding himself in dire need of better information, he travels disguised as an adventurer to the walled city of E-Rantel, with Narberal the battle maid at his side. The pair accept a mission to retrieve medicinal herbs, making for a forest said to be the home of a great and wise beast. But the sinister influence of a fanatical cabal approaches E-Rantel, and the armor-clad Ainz will face both a ruthless warrior and a legion of the undead!"}, {"id": "B00TG8C53W", "genre": "Science Fiction & Fantasy", "title": "The Locksmith (Mindjack Origins #5)", "description": "Companion Novella to the Mindjack SeriesIn a world filled with mindreaders, Zeph is a mindjacker who wants to stay hidden—even if it means the cute mindreader in his Latin class is forever out of his reach. He locks and unlocks minds for a ruthless mindjacker Clan in exchange for protection and the chance to have a normal life with his parents and little sister. But when a girl he doesn’t know reveals the existence of mindjackers to the world, Zeph is forced to make a choice: unlock—and ultimately destroy—the mind of a young jacker changeling… or turn his back on everyone he loves.MINDJACK SERIES Kira's StoryOpen Minds (Book One)Closed Hearts (Book Two)Free Souls (Book Three)Zeph's StoryLocked Tight (Book Four)Cracked Open (Book Five)Broken Wide (Book Six)...coming soonMindjack Short Story Collection (Novella Box Set) "}, {"id": "0143112562", "genre": "Science Fiction & Fantasy", "title": "Against the Day", "description": "The inimitable Thomas Pynchon has done it again. Hailed as \"a major work of art\" by The Wall Street Journal, his first novel in almost ten years spans the era between the Chicago World's Fair of 1893 and the years just after World War I and moves among locations across the globe (and to a few places not strictly speaking on the map at all). With a phantasmagoria of characters and a kaleidoscopic plot, Against the Day confronts a world of impending disaster, unrestrained corporate greed, false religiosity, moronic fecklessness, and evil intent in high places and still manages to be hilarious, moving, profound, and so much more."}, {"id": "0316298271", "genre": "Science Fiction & Fantasy", "title": "Battlemage (Age of Darkness)", "description": "\"I can command storms, summon fire and unmake stone,\" Balfruss growled. \"It's dangerous to meddle with things you don't understand.\" Balfruss is a battlemage, sworn to fight and die for a country that fears and despises his kind. Vargus is a common soldier -- while mages shoot lightning from the walls of the city, he's down in the front lines getting blood on his blade. Talandra is a princess and spymaster, but the war may force her to risk everything and make the greatest sacrifice of all. Magic and mayhem collide in this explosive epic fantasy from a major new talent. "}]