[{"id": "B076DRYXTH", "genre": "Children's Books", "title": "Life Science through Infographics (Super Science Infographics)", "description": "Absorbing facts about the 11.3 million species on Earth might cause your brain to burst! You need to take in huge timelines (the first life on Earth formed 3.8 billion years ago), huge numbers (your body is made up of trillions of cells), and even huger mysteries (why species go extinct). How can all these big numbers and concepts make more sense? Infographics! The charts, maps, and illustrations in this book tell a visual story to help you better understand key concepts about life science. Crack open this book to explore mind-boggling questions such as: • How do organisms evolve over millions of years? • How does DNA determine what you will look like? • Why are so many species struggling to survive today? The answers are sure to be life-expanding!"}, {"id": "0375947027", "genre": "Children's Books", "title": "The Best Book to Read (Picture Book)", "description": "THE LITTLE BOY who loves to read is back, and this time he and his classmates are visiting a big public library! In their signature catchy, rhyming verse, Debbie Bertram and Susan Bloom give readers a taste of the variety of books that can be found at the library. Michael Garland’s bright, graphic illustrations bring to life the array of fantastic and hilarious scenes that can result from finding the best book to read!From the Hardcover edition."}, {"id": "0544325249", "genre": "Children's Books", "title": "'Twas the Night Before Christmas (Holiday Classics)", "description": "Everyone knows the famous beginning to this beloved holiday poem: “’Twas the night before Christmas, when all through the house . . .” Clement Moore’s poem was written in 1822 and has been a holiday classic ever since. This edition, with gorgeous illustrations by Jessie Willcox Smith, was first published in 1912 and is considered by many to be the definitive version of the story. This lovely tale is now a part of the Folk Tale Classics series, with gold foil stamping on the cover and full-color illustrations throughout. A beautiful and affordable edition of a classic, this book deserves a place in every child’s library!"}, {"id": "193656209X", "genre": "Children's Books", "title": "Red Sox Activity Book", "description": "Packed with fun baseball related activities to keep young fans busy for hours, the Red Sox Activity Book contains crossword puzzles, word searches, scrambles, mazes and much much more! Color Wally the Green Monster and enjoy many basball related puzzles! Printed on high quality stock, these timeless books make a terrific gift for fans of all ages."}, {"id": "0080351026", "genre": "Children's Books", "title": "Sikhism in Words and Pictures (Words & Pictures)", "description": "This book describes the development of Sikhism and its customs and explains the importance of the Panjab as the centre of the faith. The chapters include the Guru Granth Sahib, teachings of Guru Nanak, Gurdwara, the Khalsa, family life and Sikhs in Britain. Other books in the \"Words and Pictures\" series look at Hinduism, Christianity, Islam and Judaism."}]