[{"id": "B074RGRWNT", "genre": "Children's Books", "title": "Geometry Dash Ultimate", "description": "Jump and fly your way through danger in this rhythm-based action platformer!Prepare for a near impossible challenge in the world of Geometry Dash. Push your skills to the limit as you jump, fly and flip your way through dangerous passages and various spiky obstacles.Simple one touch game play with lots of levels that will keep you entertained for hours on end!"}, {"id": "0199139571", "genre": "Children's Books", "title": "GCSE French for OCR Assessment Oxbox CD-ROM 2009", "description": "The GCSE French for OCR Assessment OxBox CD-ROM is designed to prepare students for the OCR GCSE French exams, in line with the new (2009) specification. It offers a complete set of tests in the four key skill areas of listening, speaking, reading and writing. The tests each examine the material covered in two units of the Students' Book, and are intended to be taken at the end of each term. At the end of the course, there is an end of year test assessment which follows the style of the OCR exams and controlled assessments and covers all of the GCSE topic areas."}, {"id": "0761301429", "genre": "Children's Books", "title": "Good Yontif A Picture Book of the Jewish Year", "description": "Information about the various Jewish holy days throughout the year precedes a series of illustrations showing a young boy and his family celebrating each holiday."}, {"id": "1481468863", "genre": "Children's Books", "title": "The Unwanteds Complete Collection: The Unwanteds; Island of Silence; Island of Fire; Island of Legends; Island of Shipwrecks; Island of Graves; Island of Dragons", "description": "Experience the magic of Artimé and the chills of Quill with all seven fantastical books in the New York Times bestselling Unwanteds series, now available in a collectible boxed set!“The Hunger Games meets Harry Potter” (Kirkus Reviews) in this thrilling series collected here in a hardcover boxed set featuring all seven books. This captivating boxed set includes The Unwanteds, Island of Silence, Island of Fire, Island of Legends, Island of Shipwrecks, Island of Graves, and The Unwanteds #7."}, {"id": "B00BNX6KFW", "genre": "Children's Books", "title": "Beth's First Adventure (Pony Showjumping Stories Book 1)", "description": "Leaving London for a life in rural Yorkshire wasn't something Beth had ever thought she would totally embrace.  It would mean a change of school, leaving her friends and everything she had ever known for a life hundreds of miles away.There was one big bonus though that made the move palatable. The cottage they were moving to also came with Quincey, a thirteen year old chestnut gelding pony.Perhaps life wasn't going to be so bad after all!"}]