[{"id": "1680522310", "genre": "Children's Books", "title": "The First Christmas: Lift-a-Pop Board Book", "description": "Share the story of the first Christmas with your little one! This Lift-a-POP book features pop-ups enclosed within lift-a-flaps. Sturdy board construction resists rips and tears."}, {"id": "178344665X", "genre": "Children's Books", "title": "Spycatcher (No. 1 Boy Detective)", "description": "Damian Drooth, the one-of-a-kind detective hero, is back. Criminals beware! Damian Drooth decides to help a friendly old man who believes that his precious and hard-won inventions are being ripped off by an unscrupulous neighbour. Naturally the meeting of Young Inventors is a good place to start - and using all his cunning, Damian is out to uncover the bad guy . . . Packed with rib-tickling pictures from Tony Ross, this is perfect for newly confident young readers of 6 and up!"}, {"id": "1858810558", "genre": "Children's Books", "title": "Sir Gadabout", "description": "Sir Gadabout is a walking disaster. Voted the \"knight most likely to chop his own foot off in a fight,\" he shivers in his rusty armor when he has to face the brave Sir Lancelot in a joust. Sir Gads travels with his loyal squire Herbert to the wizard Merlin's cottage to get his ear put back in place after the joust, and survives an attack by Merlin's crazed guard turtle. Then, when Queen Guinevere is kidnapped, Sir Gads sets out to save the day! Full of puns and sophisticated humor, the chaotic quest taken by loveable Sir Gadabout, loyal Herbert, and Merlin's sarcastic cat, Sidney Smith, will make every reader—child or adult—laugh out loud. Distinctive line drawings by Tony Ross, illustrator of the Horrid Henry series and the Little Princess series, add to the madcap feel of these adventures,while short accessible chapters make Sir Gads ideal for reluctant readers."}, {"id": "1681197030", "genre": "Children's Books", "title": "Kitty's Magic 4: Star the Little Farm Cat", "description": "Kitty has always thought she was allergic to cats, but during a midnight sneezing fit at a sleepover, she learns that the truth is far more magical--Kitty is able to turn into a cat! She eagerly takes her place as the Guardian of the local cats' Cat Council, using her human knowledge to help them solve their feline problems.Kitty is going to her cousin's farm for the weekend! There are lots of animals to meet, including Daisy, an adorable black and white puppy, and Star, the old farmhouse cat. Star's job is to chase mice away from the strawberry harvest--but it's become hard now that he's older. Daisy wants to help, but cats and dogs can't be friends . . . can they? Will Kitty be able to solve her toughest problem yet--without the help of the Cat Council?"}, {"id": "0823419223", "genre": "Children's Books", "title": "Anansi's Party Time", "description": "The fifth book in the popular Anansi trickster tales series by acclaimed author-and-illustrator team Eric A. Kimmel and Janet Stevens. Anansi is throwing a party. He invites Turtle, but plays so many tricks on him that Turtle can't have any fun. So turtle decides to get even and throws a part of his own. A companion to \"Anansi and the Moss-Covered Rock\", \"Anansi Goes Fishing\", \"Anansi and the Talking Melon,\" and \"Anansi and the Magic Stick\". "}]