[{"id": "1540501485", "genre": "Children's Books", "title": "Farm  Animals, Trains and Hobos", "description": "My autobiography, \"Farm Animals, Trains and Hobos,\" describes my visits to my grandparents home in the late 50's. Before television, computers and video games; we invented our own entertainment. I also describe what one did before toilet paper became affordable."}, {"id": "1615709142", "genre": "Children's Books", "title": "On the Hardwood: Golden State Warriors", "description": "Despite a nearly 40 year wait for another NBA championship, Warriors' fever in the Bay Area has reached new heights. On the Hardwood: Golden State Warriors hints that the wait is almost over."}, {"id": "0692640053", "genre": "Children's Books", "title": "Ray's Radishes", "description": "Take a tour through the vegetable garden with Farmer Ray. He’ll show you lots of different vegetables and even tell you which one is his favorite! Follow along with this fun limerick rhyme."}, {"id": "1613281129", "genre": "Children's Books", "title": "The Kingstone Bible: Volume 7", "description": "The Kingstone Bible is a complete graphic adaptation of the Bible and is published in 12 volumes to illustrate in exquisite detail the grand story of the Holy Bible. Each volume is a rich narrative sequentially illustrated to teach and explain the major stories and themes in the Bible in a historical and chronological manner. Volume 7 tells of the fall of Jerusalem and the exile of the Jews into Babylon and then their subsequent return after the Babylonian exile. Daniel, Nehemiah, and Ezra lead the Jews to be faithful to God and fulfill their destiny."}, {"id": "0152165444", "genre": "Children's Books", "title": "Patience, Princess Catherine: A Young Royals Book", "description": "England anxiously awaits Prince Arthur's betrothed--the Spanish princess who will be its future queen. But when Arthur dies not long after the wedding, Catherine of Aragon's fate becomes uncertain. Will the king and Catherine's parents arrange a marriage with Arthur's brother, Henry, or will she return to Spain a widow? Through all this turmoil, the young princess's resolve remains unshaken. She will one day be England's queen . . . no matter how long it takes."}]