[{"id": "068985398X", "genre": "Children's Books", "title": "A Lesson for Martin Luther King Jr. (Ready-To-Read)", "description": "Relates an incident from the childhood of civil rights leader Martin Luther King, Jr., when his best friend's father said they could no longer play together because \"colored and white can't mix!\" Simultaneous."}, {"id": "B010IUKEI4", "genre": "Children's Books", "title": "Narla and the Hidden Treasure (Team Golden Oldies Book 2)", "description": "Can Narla's friends help her see her own beauty?Narla has a crisis of confidence in her appearance. She tries everything to change how she looks, before her family and friends help her find her true beauty.In this second book of the Team Golden Oldies series, Lisa Domeny has again shared her love of old rescue dogs and their adventures, provided a positive story for children about self-confidence and how true beauty comes from within.This heart warming story is told through the eyes of Golden Retriever Narla, and although aimed at 3-5 year olds, is enjoyable to read at any age."}, {"id": "1562399942", "genre": "Children's Books", "title": "Dolphins: Bottlenose, Common, Freshwater, Spinner, Spotted and White-Sided", "description": "Journey beyond the blue into the wonderful world of the abundant common dolphin! Full-color photos bring readers face to face with this social mammal. A labeled diagram and a chapter on size, shape, and color help readers identify the uniquely colored common dolphin from beak to flukes. Students will also discover how this cooperative hunter uses clicks and whistles to communicate with others and a melon to navigate Earth's oceans. With so much to explore, readers will dream of riding waves with active common dolphins! A facts page, bolded glossary terms, and an index supplement the easy-to-read chapter text. Checkerboard Library is an imprint of ABDO Publishing Company."}, {"id": "1496534921", "genre": "Children's Books", "title": "The Death of Baldur (Norse Myths: A Viking Graphic Novel)", "description": "Baldur, Odin's greatest son, is a leader of men--and loved by all. So when a prophecy is made that the end of the world, Ragnarok--the Twilight of the Gods--will occur when Baldur dies, Odin imprisons all those who might be involved in the death of his beloved son. But fate is fate. Baldur will die. The only question is how--and the only result is the beginning of the end for all of creation."}, {"id": "0635014742", "genre": "Children's Books", "title": "Abraham Lincoln: Great Emancipator (5) (1000 Readers)", "description": "Abraham Lincoln never knew he was destined for greatness. He was poor, uneducated, and awkward. No one expected that he would become the most famous of presidents next to George Washington. He did this and more-holding the nation together through the most difficult time in American history, the Civil War.These popular readers include easy-to-read information, fun facts and trivia, humor, activities and a whole lot more. They are great for ages 7-12 (grades 2-6), because although simple, these readers have substance and really engage kids with their stories. They are great for social studies, meeting state and national curriculum standards, individual and group reading programs, centers, library programs, and have many other terrific educational uses. Get the Answer Key for the Quizzes! Click HERE."}]