[{"id": "1568229178", "genre": "Children's Books", "title": "The 100+ Series German, Middle School / High School", "description": "     Help your student form a solid understanding of the German language. Building on the basics, this book covers common phrases, functional vocabulary, conjugation of verbs, basic grammar, and sentence structure. Over 100 pages of reproducible activities get your students started on the path to speaking and writing German. The activities provided offer fun and varied exercises to practice concepts and vocabulary. Students learn to tell time, formulate sentences, conjugate verbs, pose and answer questions, and make comparisons - all while learning about German-speaking culture.   "}, {"id": "1589978412", "genre": "Children's Books", "title": "The Ultimate Road Trip: Family Vacation Collection (Adventures in Odyssey)", "description": "Fasten your seat belts and settle in for a road trip adventure with the folks from Odyssey. Whether it’s surfing with Rodney Rathbone in Hawaii, running from a mad bull with Eugene Meltsner in Mexico, or chasing down a family fortune with Wooton Bassett in Alaska, you never know what will happen next! Along the way, the Barclay family learns about family togetherness on their best vacation ever, the Washingtons solve a mystery while stranded in a long-forgotten ghost town, and Bernard Walton discovers a map to an underground river of gold! Don’t miss the on-ramp to more than six hours of nonstop action and character-building fun for the whole family in our Ultimate Road Trip collection!"}, {"id": "1448868106", "genre": "Children's Books", "title": "How to Beat Cyberbullying (Beating Bullying)", "description": "According to the National Crime Prevention Association, cyberbullying affects about half of the teens in the United States. Cyberbullies use electronic devices such as computers and cell phones to embarrass, harass, or threaten someone. They might attack over and over, day or night. They use words or pictures to scare or taunt their targets at home, school, and many other places. Victims feel threatened because they cannot escape the attacks and may not know their attacker. In this insightful book, teens can learn smart ways to protect themselves when they use electronic devices and how to stand up for themselves, friends, and others. They also explore cyberbullying and the law, and what schools are doing about cyberbullying prevention."}, {"id": "1782762280", "genre": "Children's Books", "title": "Home Volume 1", "description": "A hilarious all-new comic mini-series based on DreamWorks Animation’s latest big screen adventure!In Home, when Earth is taken over by the alien race the Boov, who try to relocate the humans, it’s up to one resourceful girl, Tip, and a banished member of the Boov named Oh, to work together to put things right… This brand new series of original comic series features all new stories involving Tip, Oh, Captain Smek, Kyle and more of the gang!"}, {"id": "B0093N3868", "genre": "Children's Books", "title": "The Official Guide To Battlebots", "description": "Based on the kid-friendly and wildly popular Comedy Central show BattleBots, this is a photo -and-stat-packed official guide to over 50 of the most popular, most winning BattleBots.THE OFFICIAL GUIDE TO BATTLEBOTS--based on the Comedy Central show BattleBots in which customized robots built by contestants compete for supremacy in the BattleBox arena--is a handy insider's guide to the most popular BattleBots in each of the four weight classes (light, middle, heavy, superheavy). Fans can easily reference their favorite BattleBot, see its picture, and read a list of interesting facts and information.Over 50 of the most well-known and most winning BattleBots are featured. Facts listed include weapon power, drive power, special features, and more."}]