[{"id": "B00MN5X0LG", "genre": "Science Fiction & Fantasy", "title": "Ruin (The Ruin Saga Book 1)", "description": "After the apocalypse, what would you save? What would you fight for?Decades after the apocalypse, a group of survivors struggling to stop the dawn of a new dark age, inadvertently spark a war with a country in the grips of famine, and encounter supernatural forces that might destroy the Old World forever.------------Full SynopsisThe End cost humanity six billion lives. Almost every person vanished, the lights went out, computers turned to dust, and planes fell from the sky. The Vanished left behind a handful of scattered survivors, in a world made empty and quiet.Forty years on, civilization is failing. The ways of the Old World are being forgotten, and the original survivors are ageing. All that stands between the British Isles and a new Dark Age is the mission of New Canterbury, desperate to save the books, technology and knowledge needed to begin again.Famine has forced refugees to wander in their thousands. Anger against the city's hoarding of resources is growing. In the wild lands surrounding New Canterbury, old grudges fester, and supernatural forces have awoken. Somewhere, an army is on the move, hell-bent on ending the Old World forever.The End was just the beginning."}, {"id": "B01MQVT2RA", "genre": "Science Fiction & Fantasy", "title": "Machine Learning: New and Collected Stories", "description": "A new collection of stories, including some that have never before been seen, from the New York Times best-selling author of the Silo trilogy Hugh Howey is known for crafting riveting and immersive page-turners of boundless imagination, spawning millions of fans worldwide, first with his best-selling novel Wool, and then with other enthralling works such as Sand and Beacon 23.   Now comes Machine Learning, an impressive collection of Howey’s science fiction and fantasy short fiction, including three stories set in the world of Wool, two never-before-published tales written exclusively for this volume, and fifteen additional stories collected here for the first time. These stories explore everything from artificial intelligence to parallel universes to video games, and each story is accompanied by an author’s note exploring the background and genesis of each story.   Howey’s incisive mind makes Machine Learning: New and Collected Stories a compulsively readable and thought-provoking selection of short works—from a modern master at the top of his game.   "}, {"id": "0759531048", "genre": "Science Fiction & Fantasy", "title": "Spice and Wolf, Vol. 1 - light novel", "description": "The life of a traveling merchant is a lonely one, a fact with which Kraft Lawrence is well acquainted. Wandering from town to town with just his horse, cart, and whatever wares have come his way, the peddler has pretty well settled into his routine-that is, until the night Lawrence finds a wolf goddess asleep in his cart. Taking the form of a fetching girl with wolf ears and a tail, Holo has wearied of tending to harvests in the countryside and strikes up a bargain with the merchant to lend him the cunning of \"Holo the Wisewolf\" to increase his profits in exchange for taking her along on his travels. What kind of businessman could turn down such an offer? Lawrence soon learns, though, that having an ancient goddess as a traveling companion can be a bit of a mixed blessing. Will this wolf girl turn out to be too wild to tame?"}, {"id": "0739193031", "genre": "Science Fiction & Fantasy", "title": "Changing Bodies in the Fiction of Octavia Butler: Slaves, Aliens, and Vampires", "description": "Changing Bodies in the Fiction of Octavia Butler: Slaves, Aliens, and Vampires is a timely text that critically situates Butler's fiction in several fields of study including American, African-American, gender, and science fiction studies. This book attempts to avoid excluding as many readers as possible by evading esoteric jargon while still engaging the interdisciplinary discourses that respond to Butler's fiction. The study asserts that Butler's fiction transforms the way the body is imagined with reference to race and gender. This text examines how Butler's fiction is able to cross several genre boundaries while simultaneously reshaping the genre of science fiction. This book makes the claim that Butler's fiction is crucial for contemporary and future investigations of identity formation. Discussions of race, class, and sex are reoccurring topic that are inextricable to any understanding of body politics and theory. This book is filled with exciting and insightful discussions that raise questions about what constitutes humanity in Butler's fiction and in the real world. Ultimately, the purpose of the text is to add to the scholarship surrounding Butler and to bring her to the attention of audiences that might otherwise overlook her work. This book is an invitation for readers inside and outside of the academy to discover the fiction of Octavia Butler."}, {"id": "0998822515", "genre": "Science Fiction & Fantasy", "title": "Lunora and the Monster King", "description": "Between the avenues of stars, the Kingdom of Nevermore trembles beneath the tyrannical rule of the Banished Oberon. This land of dreams and nightmares known as Caligo holds all secrets and its inhabitants seek to keep us out. With the King's Obsidian law and his crude enforcers--all seems lost. That is until a young girl with a troubled past named Lunora arrives.                  __________________________________________________________________________The Monster King's searching for a human, and word on the wind is Mother Leaf knows where it is!Wake to a New Horizon.The vast world of Caligo dwells beyond the gaze of humans. Inhabiting extraordinary fiends and deadly creatures, its black sun and moonless nights are hidden for one lone purpose-to keep us out.Fourteen-year-old Lunora wakes up scared and alone in this dark world, but she's not alone'and she's not welcome. Her treacherous journey to find her father will take her body and soul to the depths of despair as she must turn enemies into allies to survive. A Hyperion monster boy, Iko, must decide if he can trust a human over the will of his tribe and the rule of the ruthless Monster King.Experience this coming-of-age story that explores what it means to be human and examines the limitless possibilities still hidden away in the cracks and corners of reality."}]