[{"id": "1403479291", "genre": "Children's Books", "title": "The History and Activities of the Aztecs (Hands-on Ancient History)", "description": "Have you ever wondered what life was really like for the Aztecs? What did people wear? What did they eat? What sorts of games did kids play? Through history, recipes, crafts, activities, and games this series gives you a chance to experience what life was like throughout history."}, {"id": "B00I214H4O", "genre": "Children's Books", "title": "Cheetahs (Did You Know)", "description": "What do you know about the many animals around the world we live in? The 'Did You Know' series is a beautiful, and interactive set of books created to engage early readers while keeping them interested and entertained!Learn amazing facts while flipping through beautiful pictures of your childrens' favorite animals.  These kid-style encyclopedias are sure to become a household favorite. Pick up your copies now and get started on the hours of fun with your children. "}, {"id": "1452127123", "genre": "Children's Books", "title": "A Beetle Is Shy", "description": "The award-winning duo of Dianna Hutts Aston and Sylvia Long team up again, this time creating a gorgeous look at the fascinating world of beetles. From flea beetles to bombardier beetles, an incredible variety of these beloved bugs are showcased here in all their splendor. Poetic in voice and elegant in design, this carefully researched and visually striking book is perfect for sparking children's imaginations in both classroom reading circles and home libraries."}, {"id": "083682301X", "genre": "Children's Books", "title": "Hunchdog of Notre Dame (Adventures of Wishbone)", "description": "During a fast-paced roller hockey game in which an awkward boy is humiliated by the other players, Wishbone imagines himself as Quasimodo, the hunchbacked bellringer of Paris's Notre Dame Cathedral, who defeats his enemies and saves the life of a beautiful gypsy."}, {"id": "0060275766", "genre": "Children's Books", "title": "Kissing the Witch: Old Tales in New Skins", "description": "The noted lesbian and author of Hood adds new twists to thirteen age-old fairy tales, including the story of a Cinderella who forsakes her handsome prince and runs off with the fairy godmother."}]