[{"id": "1616551925", "genre": "Children's Books", "title": "Plants vs. Zombies Volume 1: Lawnmageddon", "description": "The confusing-yet-brilliant inventor known only as Crazy Dave helps his niece, Patrice, and young adventurer Nate Timely fend off a \"fun-dead\" neighborhood invasion in Plants vs. Zombies: Lawnmageddon! Winner of over thirty \"Game of the Year\" awards, Plants vs. Zombies is now determined to shuffle onto all-ages bookshelves to tickle funny bones and thrill... brains. * The first Plants vs. Zombies comic book! *"}, {"id": "B00A69BQOY", "genre": "Children's Books", "title": "Reaching New Heights: The Kelly Clark Story (ZonderKidz Biography)", "description": "Reaching New HeightsSnowboarder and Olympic Gold Medalist Kelly Clark had accomplished her life’s goals by the age of 18.Yet, success didn’t leave her feeling fulfilled. Two years later, at an event in Salt Lake City, Kelly stood at the bottom of the pipe, listening to one snowboarder console another who had just crashed: “It’s alright. God still loves you.” These words led Kelly on a new journey from an Olympian snowboarder into an awesome relationship with Jesus. This story of one of the world’s greatest snowboarders will encourage readers young and old to reach for the next level, knowing that God will be with them, win or lose."}, {"id": "B0121GW666", "genre": "Children's Books", "title": "Diary of a Hungry Zombie [An Unofficial Minecraft Book] (Minecraft Tales Book 26)", "description": "Read about the crazy adventures of a hungry zombie!This zombie can't seem to satisfy its hunger. What does it have to eat for it to be satisfied?!  A STEVE?? AN ENDER DRAGON?!? THE WHOLE MINECRAFT WORLD??!? WHAT!!!???Find out in the Diary of a Hungry Zombie!- - - - - - - - - - - - - - - - - - - - - - -Tags: minecraft stories, minecraft fanfiction, minecraft books, minecraft diaries, minecraft tales, minecraft short stories, minecraft short story, minecraft story, minecraft creepypasta, minecraft diary of a wimpy, game fanfiction, kids books, minecraft free, minecraft books for kids, minecraft games, minecraft xbox, minecraft tips, minecraft game, minecraft comics, minecraft story book, minecraft journal book, herobrine, villager. minecraftales, game fiction, game stories, game books, game story books."}, {"id": "8181901320", "genre": "Children's Books", "title": "The Mixed-Up Chameleon (English and Hindi Edition)", "description": "English-Hindi Bilingual Picture book: The chameleon's life is not very exciting untill the day it discovers it can change not only its colour but its shape and size too. So when it sees the different animals in the zoo, it immediately wants to be like them but ends up being like all of them at once with hilarious results! The illustrations, collages and die-cut pages introduce graphic colours and the names and characteristics of different animals to make this a great story of self-acceptance."}, {"id": "B01MRVAZCG", "genre": "Children's Books", "title": "The Secret of Priest's Grotto: A Holocaust Survival Story", "description": "According to legend, a group of Jewish families survived the Holocaust by hiding out for months in the 77 miles of caves in Ukraine known as Priest's Grotto. Cavers Taylor and Nicola chronicle their trip to explore the caves and uncover the story of the survivors."}]