[{"id": "B01N31XJ82", "genre": "Science Fiction & Fantasy", "title": "NES Classic: The Ultimate Guide to The Legend Of Zelda", "description": " Think you have mastered The Legend Of Zelda??? Think again! It's Dangerous to go alone. Take this....This unofficial guide as over 150 pages of everything you need to know to become the hero that saves Hyrule. Find every heart piece, secret caves and detailed strategies on how to beat each boss in every dungeon. This is the game that started it all! Not only is this the first game in this legendary franchise but this game is the reason we can save our progress in video games today! Yes, it's all because of the original Legend Of Zelda. ****FREE ----> Get the Ultimate Guide to Super Mario Bros. FREE when you purchase this book! Take a look inside this guide and you will be getting a brief history on this game, what made it so popular and the impact it had on the gaming world. It doesn't matter if you play it on the NES Classic or the original NES, this game is a favorite on everybody's list. First time players or longtime masters will LOVE this guide!Inside get the best tips on:What items to collect before heading into the first dungeonDetailed maps for each dungeon and were all the special items areHow to find hidden caves throughout HyruleMultiple maps of the Overworld with hidden locations and items markedMaps for BOTH the first and second questThe best and fastest way to defeat all the bosses including Ganon!And MoreDon’t delay, BUY THIS GUIDE today and discover some of the best secrets that The Legend Of Zelda has to offer!"}, {"id": "0999544217", "genre": "Science Fiction & Fantasy", "title": "The Society of Misfit Stories Presents...", "description": "The Society of Misfit Stories Presents this eclectic collection of unique novelettes and novellas from some of the most unique voices in the speculative genres. This diverse anthology offers readers an enticing assortment of high fantasy, alien adventure, paranormal investigations, haunts both real and imagined, and more. By Force and Against the King’s Peace by James Dorr Provenance by Fred McGavran Propinquity by Brian Koukol The Barghest by Rafe McGregor On Sabbatical by O’Brian Gunn Bearwalker by Derek Muk Raising Mary (Frankenstein) by Ace Antonio Hall The Belladonna by Sonny Zae Desperate Measures by Deven Greene Little Green Men? By Paul Stansbury The Number of a Man by Tom Pawlowski Detached by Rohit Arora The Death of Dr. Dean by Jack Coey The Short End of the Stick by David Perlmutter Winona in the Window by Steve Passey The Squirming, Scarlet Madness by J.E. Bates The Man with the Golden Hair by Cam Rhys Lay Song of Ascents by Maxwell Zimon Grave Escape by Olga Godim No Way At All by Mike Sherer Idan's World by Milo James Fowler"}, {"id": "836447300X", "genre": "Science Fiction & Fantasy", "title": "TimeZero (Savage Worlds, S2P30110)", "description": "Strap on your blaster, flintlock, gladius, or marginally-sharpened stick and take to the streams of time! In GRAmel s newly-released TimeZero, it falls to you and the rest of the TimeGuard to fight time crimes along the millenia of history. Save the timeline from time thieves, chronoterrorists, and other incredible dangers. TimeZero contains everything you need for quickly creating time-cops and running a time-travel game! Don t forget the TimeZero Preview and the TimeZero Archetypes available as free downloads for an initial taste. Synchronize your watches, folks time waits for no man!"}, {"id": "0998424560", "genre": "Science Fiction & Fantasy", "title": "Requiem: Aurora Resonant Book Three (Volume 3)", "description": "The end of the world began with a library query...how will it conclude? What began as a chance discovery of an anomalous signal is now a multiverse war between humanity and its genetic ancestors over who controls the levers of life and death. Over who decides what life is and whether it will be allowed to exist. For the ruling Anaden Directorate, victory means immortality. For humanity, defeat means extinction. On the heels of a breakthrough in wormhole technology, AEGIS and the anarchs enjoy the upper hand in the war. But their escalation pushes the Directorate to the brink, and now it will stop at nothing to destroy its enemy. \"Dangerous we can do. Nearly impossible we can do. All we need is the tiniest odds of success.\" The Directorate has perfected the art of conquest through obliteration. But humanity has advantages the Anadens do not. They are led by a woman who's made a career of meeting the devil at the crossroads and sending him home in defeat. Caleb Marano wields a power as ancient as the universe itself. Alex Solovy manipulates the fabric of space-time at her whim. Unlike the Directorate, they fight for something greater than themselves. And now, they have one more Solovy on the team. In the thrilling finale of Aurora Rhapsody, events rush headlong toward an explosive conclusion that will decide the fate of civilizations, and only the victor is making it out the other side. * Our universe is but a snowglobe--an experiment born of desperation and hope. The true universe is unfathomably vast, teeming with life and untold wonders. And it is enslaved. Created by ancient aliens in a daring gambit to understand the nature of the enemy, humanity is now asked to be the savior of a universe not their own. If they are to succeed, they must rise above not only their fractious past but the sins of their genetic ancestors to boldly embrace a future they never dared imagine possible."}, {"id": "0345511131", "genre": "Science Fiction & Fantasy", "title": "Star Wars: An Imperial Commando Novel, 501st (Star Wars: Imperial Commando - Legends)", "description": "The Clone Wars are over, but for those with reason to run from the new galactic Empire, the battle to survive has only just begun. . . .The Jedi have been decimated in the Great Purge, and the Republic has fallen. Now the former Republic Commandos–the galaxy’s finest special forces troops, cloned from Jango Fett–find themselves on opposing sides and in very different armor. Some have deserted and fled to Mandalore with the mercenaries, renegade clone troopers, and rogue Jedi who make up Kal Skirata’s ragtag resistance to Imperial occupation. Others–including men from Delta and Omega squads–now serve as Imperial Commandos, a black ops unit within Vader’s own 501st Legion, tasked to hunt down fugitive Jedi and clone deserters. For Darman, grieving for his Jedi wife and separated from his son, it’s an agonizing test of loyalty. But he’s not the only one who’ll be forced to test the ties of brotherhood. On Mandalore, clone deserters and the planet’s own natives, who have no love for the Jedi, will have their most cherished beliefs challenged. In the savage new galactic order, old feuds may have to be set aside to unite against a far bigger threat, and nobody can take old loyalties for granted."}]