[{"id": "0766074714", "genre": "Children's Books", "title": "Independence Day (The Story of Our Holidays)", "description": "From flags to fireworks, full-color photos and accessible text will teach young readers about the history of America's independence and how it is celebrated across the country. Includes a craft for kids to make their own sparklers and a Fourth of July-inspired recipe. Simultaneous and eBook."}, {"id": "0761503889", "genre": "Children's Books", "title": "Hexen: The Official Strategy Guide", "description": "You are about to enter a virtual world of medieval fantasy and horror the ultimate sword and sorcery battlefest that is Hexen. Don't walk into 31 tough levels of potential pain unprepared! With the teachings of Hexen: The Official Strategy Guide on your side, you'll know exactly what you're getting into before the gruesome battle begins. Hexen: The Official Strategy Guide covers every aspect of Hexen, the sequel to the bestseller Heretic, including:Spells for becoming invincible, creating clouds of poisonous gas, and changing rivals into pigsHow to jump, fly, and survive hellacious fallsFind Hyle's stronghold, destroy the Serpent Rider, and restore order to the world - before it's too late! Whether you are a mage, warrior, or cleric, Hexen: The Official Strategy Guide has what you need to complete your mission!About the AuthorJoe Grant Bell is the author of numerous electronic entertainment game books, including MechWarrior 2: The Official Strategy Guide (Prima). His articles about games and gaming appear in Computer Games Strategy Plus magazine."}, {"id": "1465464115", "genre": "Children's Books", "title": "LEGO Absolutely Everything You Need to Know", "description": "The ultimate collection of LEGO® facts and Minifigures in brick-sized bites of trivia.Can you believe that a wooden duck was one of the LEGO Group's first toys? Or that 68,000 LEGO pieces are created every minute? Did you know that the evil Overlord is the only NINJAGO® Minifigure to wear a skirt? Or that you'll find a LEGO croissant piece inside 44 LEGO sets? This book is crammed full of fun and fascinating trivia for LEGO fans of every age. From minuscule Minifigure mugs to the largest LEGOLAND® model, it covers all the places, populations, pieces, and themes that make up the LEGO world. Produced in collaboration with the LEGO Group.Series Overview: A previous book in the series, Star Wars™: Absolutely Everything You Need to Know, was a USA Today Top 150 bestseller and was nominated for Favorite Book at the 2016 Nickelodeon Kids' Choice Awards.LEGO, the LEGO logo, the Brick and Knob configurations and the Minifigure are trademarks of the LEGO Group. © 2017 The LEGO Group. Produced by Dorling Kindersley under license from the LEGO Group."}, {"id": "B000YJ84ZA", "genre": "Children's Books", "title": "100 Cupboards (100 Cupboards Book 1) (The 100 Cupboards)", "description": "Readers who love Percy Jackson, the Unwanteds, and Beyonders will discover that 100 cupboards mean 100 opportunities for adventure! The bestselling and highly acclaimed 100 Cupboards series starts here.   What dangers are locked behind the cupboard doors? Henry isn’t brave, but when he hears a thumping and scratching on the other side of his bedroom wall, he can’t ignore it. He scrapes off the plaster and discovers mysterious doors—cupboards of all different shapes and sizes. Through one he sees a glowing room and a man strolling back and forth. Through another he sees only darkness and feels the cold sense that something isn’t right. When his cousin Henrietta boldly travels into the worlds beyond the cupboards, it’s up to Henry to follow her. Now that he’s opened the doors, can he keep the evil inside from coming through?  \"A must-read series.\" —The Washington Post"}, {"id": "0394523709", "genre": "Children's Books", "title": "Satan: His Psychotherapy and Cure by the Unfortunate Dr. Kassler, J.S.P.S.", "description": "Satan returns to earth in the form of a computer and chooses psychoanalyst Sy Kassler to cure him of an unhappiness caused by his eternal competition with God"}]