[{"id": "1502604108", "genre": "Children's Books", "title": "Celebrate Hanukkah (Our Holidays)", "description": "Hanukkah is a special holiday celebrated by many people around the world. This book explores the holiday in a clear and easy manner for beginning readers. It discusses ways people celebrate Hanukkah in their homes and with their families every year."}, {"id": "1595667520", "genre": "Children's Books", "title": "Polar Bear Paddle (Storytime)", "description": "The Storytime range of picture storybooks introduces young children to the thrills of sharing and reading stories. These wonderful books will quickly become bedtime favourites!"}, {"id": "1883845483", "genre": "Children's Books", "title": "Robert Rodriguez (Real-Life Reader Biography)", "description": "Presents a biography of the young Latino filmmaker who made \"El Mariachi\" for $7000 and went on to direct \"Desperado\" and \"From Dusk Till Dawn.\""}, {"id": "0613949625", "genre": "Children's Books", "title": "Stick and Stone Age (Cartoon History of the Earth)", "description": "The Stick and Stone Age focuses on the proliferation of mammals, the cooling of Earth's surface and the emergence of early man. The Stick and Stone Age is part of A Cartoon History of the Earth. Each book closes with a timeline, a comprehensive glossary and an index. Scientific consultants, chosen for their particular areas of expertise, have verified all the factual information. Combined with humorous dialogue and comic-strip illustrations, each book in the series is at once entertaining, engaging and -- educational!"}, {"id": "B019G6DC1C", "genre": "Children's Books", "title": "The Adventures of Captain Ed: The Rise of the Bones", "description": "Becka and Martin are very different people.  Becka is bold, and confident, while Martin is quiet and guarded, but they have one thing in common---their love for ancient wooden sailing ships.  By chance the two teens meet at a theme park where a replica of a sixteenth century ship is on display.  Their knowledge of sailing ships amazes the other visitors, and brings them together.  They explore every nook and cranny of the ship, and dream the same dream---to actually sail a ship---to adventure.  But that's impossible.  Or is it?   Becka discovers there is another old ship on the island, AND it takes kids out on a one day cruise---for free.  But the ship is more legend than real, and rarely seen.  Becka is undaunted, and with Martin's help, and a little magic to guide them, they find the magical ship, The Merry Belle.  With their parents' blessing, Becka and Martin sail thru a strange purple mist, and into---the past.A past time, where sailing ships rule the waves, and magical creatures, strange islands, and pirates abound.  They will have to stay together, and keep each other safe to make it back home again.  But what could possibly happen?  It was ONLY a one day cruise!"}]