[{"id": "B00FB39KSO", "genre": "Children's Books", "title": "Tales of the Greeks (Illustrated)", "description": "This lucid introduction to the historical tales of the ancient Greek civilization is a powerful statement of the captivating majesty and primacy of Greece in history. These are the stories that beget all other stories in the western canon, and to truly lay claim to an education, one must devour the stories in their archetypal primal form: the Greek form."}, {"id": "0316384089", "genre": "Children's Books", "title": "Ever After High: Fairy Tail Ending (A School Story)", "description": "The sixth fableous book in Suzanne Selfors' Ever After High: A School Story series. Meeshell is not an ordinary mermaid princess; she knows that someday, when she is older, she will leave her sea kingdom and live happily ever after on land with her prince. The thought of living on land is thrilling but also nerve-racking. Meeshell is glad she has years to prepare! But there is a change in the tides, and now Meeshell will start attending Ever After High. She has almost no time to do all of her preparing and planning. Can Meeshell fit in at Ever After High, or will she stand out like a fish out of water?© 2016 Mattel. All Rights Reserved."}, {"id": "B001AJKWJE", "genre": "Children's Books", "title": "The Olympics: Legendary Sports Events (Matt Christopher Legendary Sports Events)", "description": "Ask most Olympians how their story begins and they will answer, \"When I was young, I always dreamed of going to the Olympics. . .\"  Some will then go on to tell of their great athletic triumphs. Others will recall agonizing near-misses. But for most, the very fact that they reached the Games at all was a dream come true.  For the Olympic Games offer athletes something few others sporting events can: the chance to be recognized as the best in the world at a chosen sport. With stories of great triumphs and great tragedies, the Olympics not only embodies the competitive human spirit, but also sets a stage stage for foreign relations and politics. Historical references combined with amazing sports stories give this book both an educational and exciting appeal."}, {"id": "1458739392", "genre": "Children's Books", "title": "Captain Moonlite: Australian bushrangers", "description": "In 1869 Mt Egerton was outraged by the armed hold-up of the local bank by a masked villain calling himself 'Captain Moonlite'. The perpetrator turned out to be the new lay preacher, Andrew George Scott. On his release from prison Moonlite led a ragged bunch of young desperadoes to stage a siege that envolved a shoot-out and the death of a policeman."}, {"id": "0001006827", "genre": "Children's Books", "title": "Fun Pack 1", "description": "This pack contains a single cassette containing jokes, rhymes, stories and songs and a mini cassette-sized book which contains puzzles, trivia, quizzes and fun facts."}]