[{"id": "B0188UXQ3Q", "genre": "Science Fiction & Fantasy", "title": "After The Clones: Love in the Time of Genetic Engineering", "description": "With sardonic humor, SOUDA NIMES takes us to a future where an entire clone generation is dying out.The survivors have joined the Clone Liberation Front.Meet Primordius Bull, supposedly genetically perfect, who is a lovesick couch potato.He can't understand why his girlfriend Amber would go missing..."}, {"id": "0316177725", "genre": "Science Fiction & Fantasy", "title": "The Two of Swords: Volume One", "description": "\"Why are we fighting this war? Because evil must be resisted, and sooner or later there comes a time when men of principle have to make a stand. But at this stage in the proceedings,\" he added, with a slightly lopsided grin, \"mostly from force of habit.\"A soldier with a gift for archery. A woman who kills without care. Two brothers, both unbeatable generals, now fighting for opposing armies. No one in the vast and once glorious United Empire remains untouched by the rift between East and West, and the war has been fought for as long as anyone can remember. Some still survive who know how it was started, but no one knows how it will end. Except, perhaps, the Two of Swords.World Fantasy Award-winning author K. J. Parker delivers the first volume of his most ambitious work yet-the story of a war on a grand scale, told through the eyes of soldiers, politicians, victims, and heroes."}, {"id": "B00WZXQRSE", "genre": "Science Fiction & Fantasy", "title": "The Rise of the Phoenix (Society Series Book 0)", "description": "Cast out by his own family after a wolf’s bite infects him, a young thirteen-year-old boy is forced to roam the streets and fend for himself. In a world of Humans and Others, he belongs to neither. No longer considered Human, but nor a purebred Other, a race of powerful supernatural beings, he will be unwanted and hunted  by both. Danger lurks at every turn. Young, vulnerable and afraid, he tries to come to terms with the physical changes taking place in him while at the same time trying to find a way to survive.In a menacing world filled with threats and hate, is there any hope of salvation for this orphaned fledgling?Please note, this is a Society Short."}, {"id": "0345350804", "genre": "Science Fiction & Fantasy", "title": "The Best of H. P. Lovecraft: Bloodcurdling Tales of Horror and the Macabre", "description": "This is the collection that true fans of horror fiction have been waiting for: sixteen of H.P. Lovecraft's most horrifying visions, including Lovecraft's masterpiece, THE SHADOW OUT OF TIME--the shocking revelation of the mysterious forces that hold all mankind in their fearsome grip.\"I think it is beyond doubt that H.P. Lovecraft has yet to be surpassed as the Twentieth Century's greatest practitioner of the classic horror tale.\"Stephen King"}, {"id": "B0145F7V7K", "genre": "Science Fiction & Fantasy", "title": "Arthurian Legendarians:  Faith-less Book One, Part One", "description": "Think of a world where the term vampire means something different than a sparkly race that is above humans. A world where Ireland meets vampire. Fantasy meets culture. Modernism meets mythology. All of these polar opposites clash in an intriguing story of a beach-loving girl who gets more than she bargained for when she inquires about her family history. There are parts of her family that will have any vampire lover cringe and be \"sucked in\" to what will happen next. This edge of your seat thriller will have you guessing and guessing again. Just when you think you know what will happen, the author shuts down your thought processes and completely throws you off track. Stay tuned for this series, there are many more to come!"}]