[{"id": "0765366029", "genre": "Science Fiction & Fantasy", "title": "Impulse: A Jumper Novel", "description": "Steven Gould returns to the world of his classic novel Jumper in Impulse.Cent has a secret. She lives in isolation, with her parents, hiding from the people who took her father captive and tortured him to gain control over his ability to teleport, and from the government agencies who want to use his talent. Cent has seen the world, but only from the safety of her parents' arms. She's teleported more than anyone on Earth, except for her mother and father, but she's never been able to do it herself. Her life has never been in danger. Until the day when she went snowboarding without permission and triggered an avalanche. When the snow and ice thundered down on her, she suddenly found herself in her own bedroom. That was the first time."}, {"id": "B01N0ZK1QT", "genre": "Science Fiction & Fantasy", "title": "Inwards Bound (The RIM CONFEDERACY Book 13)", "description": "                  \"Tempted by the dissolution of the huge empire inwards, Duke Scott and the Baroness and the Caliph join forces to send a ship inwards bound, to find new planets for the expansion of the RIM Confederacy--led by the new captain, Bram Sander. Making a mind-reader a ship's captain means more than one might expect, and Bram has to worry about the issues that arise.Broken now into smaller Warlord realms, the first thing to do is to find allies and that becomes a major thrust in the RIM Confederacy ships first voyage inwards--and that leads to various new allies and antagonists too. One Warlord wants to join the Confederacy and one wants to take it over by force and the chances of that happening are real.As the new secret mine for Xithricite is found by the Confederacy who now mines the red ore in secret, the Warlord fomenting war sends declarations to the Confederacy ship and Bram must respond. Aided by his own red ship and the Leudies gifts, he foists the Confederacy wishes on the Warlords--and the battles begin...\"             "}, {"id": "1608875202", "genre": "Science Fiction & Fantasy", "title": "Hidden Universe Travel Guides: Star Trek: Vulcan", "description": "Set in the Star Trek universe, this Hidden Universe travel guide explores all that Vulcan—Spock’s home planet—has to offer in an interactive guidebook.Plan your next trip to the planet Vulcan! Find restaurants that serve the best fried sandworms and Vulcan port. Take a trip to the Fire Plains or experience spring break at the Voroth Sea. Learn all about the native Vulcan people and their unusual customs. Discover how to correctly perform the traditional Vulcan salutation (you really don’t want to get this wrong). Learn key Vulcan phrases such as Nam-tor puyan-tvi-shal wilat: “Where is your restroom?” Find out what to do if you suddenly find yourself host to a katra—a Vulcan’s living spirit—at an inconvenient moment. All this and more can be found within the pages of this essential travel guide to one of the most popular—and logical—destinations in the known universe.  This Hidden Universe travel guide draws on 50 years of Star Trek TV shows, films, and novels to present a comprehensive guide to Spock’s iconic home world. Modeled after real-world travel guides, the book will explore every significant region on Vulcan with fascinating historical, geographical, and cultural insights that bring the planet to life like never before. Also featuring a dynamic mixture of classic Star Trek imagery and original illustrations created exclusively for the book, Hidden Universe Travel Guide: Star Trek: Vulcan is the perfect way to celebrate 50 years of Star Trek and will thrill pop culture fans and hardcore Star Trek fans alike."}, {"id": "0595260721", "genre": "Science Fiction & Fantasy", "title": "1: Chronicles of the Lords of the March: Volume I: Heir to the March", "description": "Kandwyn is the Heir to the March and he must deal with two old friends. One is working to get his revenge for his banishment and blames Kandwyn. Through sorcery and guile he attacks the March, the family?held realm, and brings the Heir to his most challenging confrontations and reckonings. The family-led military must meet the demands of the invasion and bring forth the next generation of warriors to defend the March and their lands from ruin. The other works his deceit from the inside for the lost love he feels Kandwyn stole from him, but makes a mistake in his revenge that could change everything for the Lords of the March and bring Kandwyn to his doom.King, Prince and Heir, along with the family, must lead the people of the March through these desperate times using their own means, while youths grow to warriors and love finds its way to help them all, and in the background, an important revelation is coming to the fore from the past."}, {"id": "1946858188", "genre": "Science Fiction & Fantasy", "title": "The Enigma Always (The Enigma Series) (Volume 6)", "description": "Book 6 of The Enigma Series, offers a thrilling exploration of the intersection of cyber technology, medical science, and human greed, The Enigma Always incorporates technical facts, big data analytics, and real-world hacking techniques into a fast-paced story with elements of romance and intrigue. The R-Group is fighting at the forefront of the cyber wars, battling against an evil force seeking to harness supercomputer technology to reengineer humans at the cellular level. In parallel, returning cyber-thugs are interjecting their brand of technology domination, which must be thwarted. Dr. Xavier Pekoni has morally-devoid and ethically-challenged intentions regarding his fountain of youth project. Using nanotechnology and DNA mapping, Pekoni is close to reaching his goal of extending human life ten-fold and will stop at nothing to achieve his objectives. Pekoni’s scientific advancements are all-consuming for him, regardless of the immoral implications or the resulting negative consequences. The team must go to great lengths to make sure this technology isn’t unleashed, as it could have devastating penalties for society. R-Group and the CATs team must use the full range of their intelligence and technological savvy to fight Pekoni. But two top team members, Petra and Jacob, are missing from the action as they fight to vanquish their personal demons."}]