[{"id": "0431104603", "genre": "Children's Books", "title": "Groundbreakers Charles Babbage Paperback", "description": "A biography of Charles Babbage. As well as providing his life story and analysis of his work, the text places his achievements in context by looking at the technological and historical context of the time. The book includes quotes and writings from newspapers and journals of the time; a look at the ongoing impact of his work; and information about his rivals and the men and women who affected his life and work."}, {"id": "1416961232", "genre": "Children's Books", "title": "Jazz Age Josephine: Dancer, singer--who's that, who? Why, that's MISS Josephine Baker, to you!", "description": "A picture book biography that will inspire readers to dance to their own beats!Singer, dancer, actress, and independent dame, Josephine Baker felt life was a performance. She lived by her own rules and helped to shake up the status quo with wild costumes and a you-can’t-tell-me-no attitude that made her famous. She even had a pet leopard in Paris!From bestselling children’s biographer Jonah Winter and two-time Caldecott Honoree Marjorie Priceman comes a story of a woman the stage could barely contain. Rising from a poor, segregated upbringing, Josephine Baker was able to break through racial barriers with her own sense of flair and astonishing dance abilities. She was a pillar of steel with a heart of gold—all wrapped up in feathers, sequins, and an infectious rhythm."}, {"id": "B00FY5WGVW", "genre": "Children's Books", "title": "Moose Racks, Bear Tracks, and Other Kid Snacks: Cooking with Kids Has Never Been So Easy! (PAWS IV)", "description": "This assortment of 25 kid-tested and kid-approved snack recipes is designed for young and enthusiastic cooks who view flour dust storms as a sign of progress and sticky fingers as a measure of success! Kids will delight in the colorful illustrations of Alaska scenes by Shannon Cartwright and love creating such tasty treats as Totem Poles, Denali Peaks, Glacier Ice, and more."}, {"id": "1477757422", "genre": "Children's Books", "title": "The Checkered Flag", "description": "For those who like to get their adrenaline pumping, get ready to be thrown into the middle of several death-defying, yet exhilarating, sports. The essentials of sports car, NASCAR, and motorcycle racing, among other types of racing, are explained alongside heart-stopping photography. Speed demons will enjoy these energetic books that showcase the histories, regulations, and facts that every racing fan should know. • Nonfiction about an engaging subject matter that satisfies students’ need for complex informational text • Designed to encourage reluctant readers to read independently • Texts are crafted to promote additional analysis of each sport • Sports terminology defined and explained in context"}, {"id": "B0778JSJ5Z", "genre": "Children's Books", "title": "JAVASCRIPT: Programming for beginners( for dummies,step-by-step,tips,apps)", "description": "JAVASCRIPT is the best guide about programming for beginners. This book contains step-by-step information for those who just start their studying in this sphere. Further more excellent programming tips will be helpful in your studying.If you purchase this book you will learn the following sections:-WHAT IS JAVASCRIPT-WRITING YOUR FIRST JAVASCRIPT PROGRAM-HOW TO USE OPERATORS AND WRITE EXPRESSIONS-HOW TO ENABLE (AND DISABLE) JAVASCRIPT IN YOUR BROWSER-THE ADVANTAGES AND DISADVANTAGES OF JAVASCRIPT FOR WEB DESIGN-THE SIMILARITIES AND DIFFERENCES BETWEEN JAVA AND JAVASCRIPTDownload JAVASCRIPT:Programming for beginners( for dummies,step-by-step,tips,apps) and be sure that you will get a good experience"}]