[{"id": "1974296091", "genre": "Children's Books", "title": "Team Fourth Grade: First Day Of School Books For Fourth Grade (Composition Notebooks)(8.5 x 11)(Journals For Kids To Write In)", "description": "Cute & Cool Composition NotebooksThis awesome school journal for kids has 120 lined pages measuring 8.5 x 11 that people will be jealous of. Stop buying those boring composition books and grab one of these fun and exciting school notebooks.Great gift ideas for teachers and students. Perfect for back to school supplies, birthday gifts and Christmas gifts.These College Ruled Journals make great:Back To School NotebooksSchool Supplies For StudentsPrimary Composition BooksCollege Ruled JournalsTeacher NotebooksCute Notebooks 8.5 x 11Dream Journals For KidsFirst Day Of School BooksLarge Notebooks and JournalsStock up for the back to school rush or just because you need a good looking lined journal notebook today! "}, {"id": "1551433060", "genre": "Children's Books", "title": "Barkerville Gold", "description": "Fresh from their adventures capturing daring art thieves in Mystery from History, Rusty, Katie and Sheila are back, sent out of town with Rusty's grandparents to keep them out of trouble. This time the trio is in historic Barkerville, a gold rush town with a secret. After witnessing what they take to be a ghost in the night, the three friends find themselves involved in a mystery from the past that seems to have a few other people interested as well. New information has come to light about a fortune in missing gold, a centuries-old curse and a missing miner. While the three budding detectives try and figure out which of the aging prospectors they keep running into is actually a ghost, they find they are in a race against time to recover the gold and return it to its rightful owners to avert a tragedy. Will they find the gold in time? Or will they suffer the fate of Three Finger Evans, the missing miner?"}, {"id": "153456182X", "genre": "Children's Books", "title": "India in Ancient Times (World History)", "description": "The history and culture of ancient India is rich and complex. However, most history classes only touch on the most prominent aspects of ancient Indian culture, such as Hinduism. Readers experience the full breadth of this ancient society through detailed text, insightful quotes from historians, and fascinating sidebars. Vivid photographs and historical images are included to enhance the reading experience. From the lives of powerful historical figures to the stories of mythological heroes, ancient India comes to life in a way that strongly supplements standard social studies curricula."}, {"id": "0883881772", "genre": "Children's Books", "title": "001: California Missions to Cut Out (Book 1)", "description": "Volume One of the California missions, in the most exquisite and accurate detail possible. Easy to cut out and stand up, with text by Dr. Neuerburg."}, {"id": "B0198N90VE", "genre": "Children's Books", "title": "Ariel Is My Babysitter (Disney Princess) (Little Golden Book)", "description": "A Disney Princess makes the best babysitter! Children ages 2 to 5 will love this Little Golden Book, which tells a funny story about Princess Ariel, the Little Mermaid, taking care of a baby octopus.From the Hardcover edition."}]