[{"id": "B06Y4VJJM4", "genre": "Children's Books", "title": "The Show-Off Monkey and Other Taoist Tales", "description": "A picture book of Taoist wisdom tales inspired by the ancient philosopher Chang Tzu, for children ages 5-10, beautifully illustrated with original artwork.“If we are true to who we are, we will naturally find what is right.” “Beauty is in the eyes and mind of the beholder.” “What is good in life is not always obvious.”   These morals are inspired by the teachings Taoist philosopher Chuang Tzu (fourth century b.c.e.), who through charming and sometimes cryptic fables explained to his students the qualities of humility, modesty, simplicity, acceptance, and contentment. In “The Sea Turtle and the Frog,” two creatures share their unique perspective on the world. “The Happy Fish” offers a reflection on what makes for a good leader. And “The White Peacock” demonstrates the virtues of a simple life rather than one adorned with material riches. Beautifully illustrated in the traditional Asian style by artist Mark McGinnis, this book collects thirty-three of these traditional Taoist wisdom tales that will teach readers young and old about the Taoist view of living in harmony with the natural world."}, {"id": "0141387688", "genre": "Children's Books", "title": "Mr Lemoncello's Great Library Race", "description": "#1 New York Times bestselling author Chris Grabenstein is back with the third fantastically fun, puzzle-packed MR LEMONCELLO adventure!Everyone's favourite game maker, Mr Lemoncello, is testing out his new FABULOUS FACT-FINDING FRENZY game! If Kyle can make it through the first round, he'll compete in a great race - by bicycle, bookmobile, and even Mr.Lemoncello's corporate banana jet! - to find fascinating facts about famous Americans. The first back to Mr Lemoncello's library is promised spectacularprizes!But then a few surprising 'facts' surface about Mr Lemoncello . . . Could Kyle's hero be a fraud? It's winner takes all, so Kyle and the other kids will have to digdeep to find out the truth before it's GAME OVER for Mr Lemoncello . . . !Filled with brand-new puzzles and games (including a hidden bonus puzzle!),this fast-paced read will have gamers and readers alike racing to the finish line!"}, {"id": "B00NI4HZ5S", "genre": "Children's Books", "title": "The Abbey Mice: Christmas is coming: Book 1 - Series 1", "description": "A lovely series of books for children aged 5-12. All the fun and excitement of Autumn and the lead up to and the eventual arrival of the wonderful celebration that is Christmas and all that it means are here in this new Abbey Mice series.  All the favourites, Sesame, Hilary and Robert and more new friends make this an enchanting tale. Autumn leads into Christmas and the Abbey Mice are preparing for the winter and all that it brings. Friendships are made and rekindled, problems occur, dangers encountered, but they are overcome by the intrepid Abbey Mice making this an enchanting tale that children will adore to read or have read to them…time and time again."}, {"id": "160886488X", "genre": "Children's Books", "title": "The Amazing World of Gumball Vol. 1", "description": "Popular webcomic creators Frank Gibson (TINY KITTEN TEETH) and artist Tyson Hesse (BOXER HOCKEY) bring the wacky adventures of Gumball and his friends to comics for the first time!Gumball, Darwin, and all of their friends take on the world of comics! Gumball thinks he’s the coolest kid on the block, but his little sister Anais begs to differ, and Darwin just wants to keep them all out of trouble. There’s always another adventure to be had in their mixed-up world! AMAZING WORLD OF GUMBALL volume 1 collects issues #1-#4 of the brand new comic series by web comickers Frank Gibson (Tiny Kitten Teeth) and Tyson Hesse (Boxer Hockey). The Amazing World of Gumball is a British/American animated children's television series created by Ben Bocquelet for Cartoon Network. Produced primarily by Cartoon Network Development Studio Europe, the series first aired in 2011 and since then has been aired in eight countries on four continents, and has been nominated for twenty broadcasting awards in it's short tenure to date."}, {"id": "B005IV0876", "genre": "Children's Books", "title": "Palace Beautiful", "description": "When sisters Sadie and Zuzu Brooks move to Salt Lake City, they discover a secret room in the attic of their new house, with a sign that reads \"Palace Beautiful\" and containing an old journal. Along with their neighbor, dramatic Belladonna Desolation (real name: Kristin Smith), they take turns reading the story of a girl named Helen living during the flu epidemic of 1918. The journal ends with a tragedy that has a scary parallel to Sadie and Zuzu's lives, and the girls become obsessed with finding out what happened to Helen after the journal ends. Did she survive the flu? Is she still alive somewhere? Or could her ghost be lurking in the nearby graveyard? Sarah DeFord Williams has created a gripping read that covers two time periods, many fantastic characters, and a can't-put-it-down ending, all with delightful, extraordinary prose."}]