[{"id": "1465408800", "genre": "Children's Books", "title": "Stephen Biesty's Cross-sections Castle", "description": "More than one million copies sold worldwide — now revised and updated! An intimate guide to the inside of a castle and the lives of its residents, this Stephen Biesty classic details the workings of a medieval fortress. With intricately detailed cross-sections, each layer of a castle is presented, so readers can explore layer upon layer of castle life including the people, their possessions, and how they lived, as well as how they defended themselves from enemy attacks and settled down for an evening of entertainment. Each time readers turn the page, they'll discover new details, making this the ultimate \"insider's guide\" to the structure of a castle and the lives of its inhabitants."}, {"id": "1434230287", "genre": "Children's Books", "title": "Busy, Busy Train (Wonder Wheels)", "description": "Train has an accident while hauling grain to the mill. Thankfully Tractor is around to help Train get back on track."}, {"id": "0439339111", "genre": "Children's Books", "title": "Zen Shorts (Caldecott Honor Book)", "description": "\"Michael,\" said Karl. \"There's a really big bear in the backyard.\" This is how three children meet Stillwater, a giant panda who moves into the neighborhood and tells amazing tales. To Addy he tells a story about the value of material goods. To Michael he pushes the boundaries of good and bad. And to Karl he demonstrates what it means to hold on to frustration. With graceful art and simple stories that are filled with love and enlightenment, Jon Muth -- and Stillwater the bear -- present three ancient Zen tales that are sure to strike a chord in everyone they touch."}, {"id": "B00ZZ3DFBI", "genre": "Children's Books", "title": "Books for Kids: Tommy Tiger Broken Toy:  Illustration Book (Ages 3-8),Short Stories for Kids, Kids Books, Bedtime Stories For Kids, Children Books, Early Readers", "description": " Books for Kids : Tommy Tiger Broken ToyWhen Tommy Tiger’s friend Patty Panda comes over to play, Tommy can’t wait to show her his newest toy. But when Patty  drops the toy and it breaks, Tommy gets upset. Will Tommy be able to understand that she didn’t break it on purpose and still play?Parents, this book is designed to help kids understand that even though they may get angry with someone, the best course of action is forgiveness. It intertwines that with a story about how accidents happen, and that you should give your friends a chance to apologize.Beautifully illustrated bedtime story that children and parents will love! Download Your Copy Right Now! Your kids will love going back to this cute Illustration book again and again. "}, {"id": "1628324678", "genre": "Children's Books", "title": "The NBA: A History of Hoops: Washington Wizards", "description": "This high-interest title summarizes the history of the Washington Wizards professional basketball team, highlighting memorable events and noteworthy players such as Westley Unseld."}]