[{"id": "B00EP7E7HQ", "genre": "Children's Books", "title": "Kin Seeker: An Upper Middle Grade, Epic Fantasy Adventure (Dragon Calling Book 1)", "description": "“Please, I ask you to look with all your heart and strength for the other dragons. You must––far more is at stake than you can comprehend.”The dragons have mysteriously vanished from the lands of Valadae––except one.With no memory of his past, or what happened to his kin, Laeka’Draeon begins the daunting quest for answers, well aware the stakes are more than personal.If the dragons fail to return and restore the waning magic of the legendary towers of Klonnoth Aire, the consequences could bring about the return of an ancient and devastating enemy.The peace between the eleven allied kingdoms hangs in the balance, and only Laeka’Draeon can set things right."}, {"id": "0062405608", "genre": "Children's Books", "title": "More Caps for Sale: Another Tale of Mischievous Monkeys Board Book", "description": "The charming, never-before-published sequel to Caps for Sale! Those mischievous monkeys are at it again, bringing laughs to a new generation of readers.Since Esphyr Slobodkina’s Caps for Sale was first published in 1940, millions of children have savored the original tale of the peddler, his caps, and a band of very funny monkeys. Now More Caps for Sale continues the story, picking up right where Caps for Sale left off. This board book edition features thick pages and is just the right size for small hands.More Caps for Sale is the first posthumous book from Esphyr Slobodkina and is based on story ideas shared with Ann Marie Mulhearn Sayer throughout their years as friends and business associates prior to Esphyr's death in 2002. The warmth and humor of the simple text and bright illustrations creates the perfect opportunity for early readers to experience a classic folktale tradition."}, {"id": "0894909568", "genre": "Children's Books", "title": "The Internet: Surfing the Issues (Issues in Focus)", "description": "-- These over-100-page titles present the facts and analyze some of the most controversial topics in today's news.-- Offers excellent and up-to-date information for reports or debates.-- Helps teenagers to begin developing critical thinking skills."}, {"id": "B01F27KOAG", "genre": "Children's Books", "title": "National Geographic Readers: Peek, Otter", "description": "Meet the funny and adorable river otter! Young readers will learn all about these amazing animals. Through text features such as the vocabulary tree and the wrap-up activity, kids will be introduced to vocabulary in concept groups—helping them make connections between words and expand their understanding of the world."}, {"id": "0807503967", "genre": "Children's Books", "title": "An Apple for Harriet Tubman", "description": "Like other enslaved African American children, young Harriet Tubman had to work hard. In her master's orchard, she spent long hours picking the juicy apples she was forbidden to eat. Harriet vowed to one day be free and to grow apple trees of her own. When she was grown, she made her escape to the North. Then, repeatedly risking her life, she returned to lead many other African Americans to freedom."}]