[{"id": "1508176647", "genre": "Children's Books", "title": "Everything You Need to Know About Fake News and Propaganda (Need to Know Library)", "description": "These days it's hard to know what to believe. Is the news on television and the internet real or fake? How can you tell? This comprehensive guide helps readers sift through the many types of information out there. It gives guidelines for deciding which sources can be believed. Using a wealth of examples from recent news, politics, and science, it teaches readers how to distinguish fact from fiction and truth from lies. It gives suggestions on how to function in a \"posttruth\" world."}, {"id": "1474883265", "genre": "Children's Books", "title": "Disney Princess Emoji Super-smiley Activities: Over 700 Stickers", "description": "Disney Princess Emoji Super-Smiley Activities includes 2000 stickers to complete fun activities with your favorite Disney Princesses."}, {"id": "1550286412", "genre": "Children's Books", "title": "Fast Finish (Lorimer Sports Stories)", "description": "Noah Meyers is a fast runner—faster than all his friends, faster than the bullies who wait for him outside his school. When he's asked to train with the Clarington Vikings in Oshawa he jumps at the chance, eager to focus on something other than his father's recent death. Soon after he qualifies for provincial finals, however, tragedy threatens to strike again, and Noah has to summon all his courage to stay on track. Fast Finish is the engaging story of a young athlete who overcomes a tragic past in order to succeed."}, {"id": "0399557288", "genre": "Children's Books", "title": "Big Shark, Little Shark (Step into Reading)", "description": "Just when you thought it was safe to read an early reader . . . SHARK!This fun Step 1 book about two sharks is a study in opposites. Big Shark has big teeth; Little Shark has little teeth. Big Shark swims fast; Little Shark swims slow. But they are both hungry! Will they each succeed in finding a tasty snack? Little Shark is hoping that he won’t become fast food for Big Shark!   Step 1 Readers feature big type and easy words for children who know the alphabet and are eager to begin reading. Rhyme and rhythmic text paired with picture clues help children decode the story."}, {"id": "1508155119", "genre": "Children's Books", "title": "What Are Binary and Hexadecimal Numbers? (Spotlight on Kids Can Code)", "description": "Elementary students around the globe are taught to count using a base-10 number system. We form numbers using the 10 digits of our base-10 systemzero through nine. Inside this book, readers discover other number systems people have used throughout history. With a binary system, computers only use two digits0 and 1. So how does a computer count to 10? Readers will learn the answer inside this book. Also included is a review of hexadecimal numbers, which serve as the old basis of assembly languages and can still be found today setting colors on the web. This volume meets math standards addressing number systems other than base 10."}]