[{"id": "0062657607", "genre": "Children's Books", "title": "On a Magical Do-Nothing Day", "description": "Give the gift of a magical do-nothing day!This picture book with startlingly beautiful words and pictures will spur imagination and a break from boredom or screen time. Now a New York Times Best Illustrated Book of the Year!All I want to do on a rainy day like today is play my game. My mom says it’s a waste of time, but without my game, nothing is fun! On the other hand, maybe I’m wrong about that…While reading On a Magical Do-Nothing Day, one gets the sense that the illustrator became lost in her drawings, and as a reader, you'll want to do the same. Perfect for fans of picture books by Julie Morstad, Carson Ellis, Jon Klassen, and Tomi Ungerer.“Hands down, Beatrice Alemagna is my favorite contemporary illustrator,\" said the Caldecott Honor-winning illustrator of Last Stop on Market Street, Christian Robinson.On a Magical Do-Nothing Day has been recognized with a Gold Medal from the Society of Illustrators. Don't miss this picture book that beautifully encourages unplugged exploration."}, {"id": "0793577683", "genre": "Children's Books", "title": "Hercules", "description": "inch....this work is likely to become a standart work very quickly and is to be recommended to all schools where recorder studies are undertaken inch. (Oliver James,Contact Magazine) A novel and comprehensive approach to transferring from the C to F instrument. 430 music examples include folk and national songs (some in two parts), country dance tunes and excerpts from the standard treble repertoire of•Bach, Barsanti, Corelli, Handel, Telemann, etc. An outstanding feature of the book has proved to be Brian Bonsor's brilliantly simple but highly effective practice circles and recognition squares designed to give, in only a few minutes, concentrated practice on the more usual leaps to and from each new note and instant recognition of random notes. Quickly emulating the outstanding success of the descant tutors, these books are very popular even with those who normally use tutors other than the Enjoy the Recorder series."}, {"id": "0766085058", "genre": "Children's Books", "title": "Lin-Manuel Miranda: Composer, Actor, and Creator of Hamilton (Influential Lives)", "description": "Presents the life of the writer, composer, actor, and rapper starring in the Pulitzer Prize-winning musical Hamilton."}, {"id": "1897550065", "genre": "Children's Books", "title": "Goldfish Don't Take Bubble Baths (Abby and Tess Pet-Sitters)", "description": "Abby adores animals and is thrilled to be looking after Mrs. Wilson's two goldfish. But Tess gets Abby barking mad by tagging along, pretending to be a dog. Will her antics ruin Abby's chance to prove she can be a responsible pet-sitter? Trina Wiebe lives in Invermere, British Columbia, and is the author of the Abby and Tess Pet-Sitters series and the Max-a-Million series. Combined, these books have sold over 65,000 copies worldwide and have been translated into five languages.        "}, {"id": "1842368850", "genre": "Children's Books", "title": "Big Cats (100 Facts)", "description": "Sharpen your claws and get ready to meet cats in the wild! Discover everything you need to know about big cats with this brilliant book. One hundred facts, fantastic images, and fun cartoons reveal all about the big cat world, while quizzes test your knowledge."}]