[{"id": "B077S1M958", "genre": "Science Fiction & Fantasy", "title": "The Chronicles of Nardyl: Embraced by Darkness", "description": "The Saitrens of Nardyl had come to Earth in our distant past.  Their barbaric ferocity had left a lasting mark upon the psyche of humans.  They were the image we carried in our minds of the demons of the underworld--red skinned, winged devils with horns.With their world devastated by global pandemic, the survivors are as ferocious as their predecessors.They’ve found the portal through the wormhole.Their objective—conquest.But this time they’ve come to take mates."}, {"id": "B078842885", "genre": "Science Fiction & Fantasy", "title": "Lost Cantos of the Ouroboros Caves", "description": "A collection of fables in the literary tradition of Italo Calvino, Lost Cantos of the Ouroboros Caves brings together medicine men, monks, immortals, witches, seekers, souls in various stages of their cycles in and out of lived-life, and the occasional talking animal, all searching for the meaning of it all and each other. Each fable is a meditation on love, death, growth, pain, identity, self, spirit, and the natural world, as seen from the perspectives of the primal, the celestial, or the spiritual. Fragile yet beautifully strong, Lost Cantos of the Ouroboros Caves is for anyone seeking stories for a larger life. "}, {"id": "1536886556", "genre": "Science Fiction & Fantasy", "title": "The Die Is Cast (The Order of Right) (Volume 2)", "description": "This volume is the sequel to \"The Order of Right\", and second in the saga of the Brotherhood.  The realm of Tramlin has endured the disappearance of the beloved Lady Margot, daughter of the Regent Galen, the banishment of the scorned Prince Helden, heir apparent of the realm, and the flight of half of its populace under the spell of the Prodigy Lucian, an ingenious, deceptive populist, who has escaped without a trace. As neighboring realms contemplate the plunder of Tramlin, and yet more ominous tidings come to light, the fate of the realm is now in the hands of the Order of Right, four young and diverse heroes of extraordinary skill and character. There is Raelic the True, our narrator and the scholarly heir to the vaunted station of his late father, Eomond, as Steward of the Temple and the Tower. There is Devon the Just, a soldier and prince of his lost tribe in the land of Tenegalan. There is Shondra the Wise, the shaman of Devon's tribe, and his betrothed. At last, there is Nicky the Good, a scout of some renown, for her legendary nimble feats in Brighthold.  Throughout the tale, our friends in the Order learn about themselves and each other, as they grow together as harmonious in their hearts as they are in their music, while they explore the world beyond Brighthold along with their shared values and beliefs, in the natural rights and benign yearnings for security, independence, family and legacy.  Only the Maker knows where their fate and their faith will lead them."}, {"id": "1541418174", "genre": "Science Fiction & Fantasy", "title": "All the Windwracked Stars (Edda of Burdens)", "description": "From the author of The Stone in the Skull It all began with Ragnarok, with the Children of the Light and the Tarnished ones battling to the death in the ice and the dark. At the end of the long battle, one Valkyrie survived, wounded, and one valraven-the steeds of the valkyrie. Because they lived, Valdyrgard was not wholly destroyed. Because the valraven was transformed in the last miracle offered to a Child of the Light, Valdyrgard was changed to a world where magic and technology worked hand in hand. 2500 years later, Muire is in the last city on the dying planet, where the Technomancer rules what's left of humanity. She's caught sight of someone she has not seen since the Last Battle: Mingan the Wolf is hunting in her city."}, {"id": "1544796048", "genre": "Science Fiction & Fantasy", "title": "Fire's Song", "description": "Having already lost and given up everything, Key is determined to find a cure for her curse. With her very touch able to kill, she must seek answers from a distance. In this world, if a curse born dies, then the demons win their soul. Without much more to lose, Key decides to try the last of her luck on a village catered to magic born. Her questions unleash events that take her places she never expected existed."}]