[{"id": "0606268995", "genre": "Children's Books", "title": "Who Cut The Cheese? (Turtleback School & Library Binding Edition) (Doctor Proctor's Fart Powder)", "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Nilly, Lisa, and Doctor Proctor are too busy inventing things to watch TV, and everyone says they're missing out on the hot singing competition. But then Nilly and Lisa notice that their friends and family are acting really weird. And the only people acting weird.are the ones watching TV."}, {"id": "1482451395", "genre": "Children's Books", "title": "Astronomy (100 Facts You Should Know)", "description": "Astronomy is both a study and a skill, and both aspects of astronomy are thoughtfully presented in this beautiful volume that encourages readers to look to the sky. Even though our universe is vast, readers can travel to points around the solar system and galaxy through the stunning photographs and illustrations on each page. Theyll understand key points about space science through 100 interesting and accessible facts and hone their understanding through fun quizzes and activities, including making a sundial and demonstrating an eclipse for themselves and their friends."}, {"id": "048629756X", "genre": "Children's Books", "title": "The Titanic Coloring Book (Dover History Coloring Book)", "description": "On the night of April 14, 1912, while passengers aboard the Titanic were enjoying the luxurious accommodations of the White Star fleet's newest ocean liner, the ship struck an iceberg off the coast of Newfoundland. Described as \"unsinkable,\" the largest and most elegant ocean vessel of the period quickly sank in the early morning hours on April 15 with the loss of more than 1.500 lives.This exciting coloring book dramatically re-creates events leading up to and including the monumental tragedy. Twenty-nine realistic drawings, accompanied by fact-filled captions, depict the Titanic docked in Southhampton, England; the ship's captain and officers on the bridge; passengers dining and strolling on deck; the ship striking the iceberg; survivors huddled in lifeboats; and more."}, {"id": "B077Y4NR6H", "genre": "Children's Books", "title": "Raymond's Rainbow: Children's Storybook and Audiobook", "description": "Raymond’s going out todayWith his Dad to fly awayOver to the shopping mallTo hunt some food for one and allWhat will he see when he gets there?What will they get to eat and share?What is the big thing in the clouds?Come and turn a page, and I’ll tell you now!Other Children’s TitlesMagnus and Molly and the Floating Chairs.A Birds Tale.Zak and Zara and the Invisibility Ball.The Alphabet Zoo.Windy and Wendy get bendy and Fly!Ace has an Accident!Adult TitlesSaving Eden. (Ecology Romance)The Market Lads and Me. (Adult Humour)Brick Lane. (Communal living Comedy)The Time -Travel Twins. (Time Travel Tale)CONTACT: https://www.amazon.co.uk/S-C-Hamill/e/B012L4AFQ6/"}, {"id": "1564557383", "genre": "Children's Books", "title": "The Gift of Dreams: Tales from the Black Sea (Secrets of the World Ser.)", "description": "World-renowned storyteller Laura Simms shares the true story of the gift from the stars she received from her grandmother when she was a child, and the tales of the wandering Jews and Gypsies from the Black Sea. From the lazy \"Dreamer\" (whose remarkable dream comes true) to the Gypsy boy who searches for gold at the end of the rainbow, this collection of magical, mysterious, and humorous stories encourages children to be true to their dreams. Laura Simms received the 1999 Sesame Street Sunny Days Award and the 1996 Circle of Excellence Award. Her children’s recordings and books include Four Legged Tales and Moon and Otter and Frog (1996 Best Reader Award). Includes 8 story cards and poster"}]