[{"id": "1448869277", "genre": "Children's Books", "title": "Going Live: Launching Your Digital Business (Digital Entrepreneurship in the Age of Apps, the Web, and Mobile Devices)", "description": "Building a successful digital product requires working knowledge of the technology involved and familiarity with the competition. With new tools appearing regularly, making the job of constructing apps and websites easier, it's possible to dive in with little experience and come out with a hit product. An overview is given of how to design, develop, and launch digital products, including mobile apps, games, websites, and blogs. Understanding the steps needed to create the product, as well as the tools and techniques used during production, will help readers move forward with confidence. The author, an expert game developer, reviews key code languages, technologies, and development approaches, using simple explanations and instructions to get the reader going. The book also covers options for monetizing a digital product, such as setting up online payment systems or supporting the product with advertising."}, {"id": "0756906113", "genre": "Children's Books", "title": "Twelve Impossible Things Before Breakfast", "description": "Features the Nebula Award-winning novella Lost Girls.In these modern myths and tales for the young and the young at hear, Jane Yolen transforms the impossible into the familiar and real. Among the outlandish wonders are an Alice grown tough in Wonderland, a dear--but dead--mother's homecoming, a bridge that longs for a goat-eating troll, and a mutiny among Peter Pan's troops."}, {"id": "0745122256", "genre": "Children's Books", "title": "Street Child (Galaxy Children's Large Print Books)", "description": "London in the 1860s is a dangerous place, as Jim Jarvis, a runaway from the workhouse, finds out. An orphan, separated from his sisters, Jim seems unable to find a home and friendship, until his trail of adventure leads him to the Ragged School, to Dr Barnardo and to security."}, {"id": "B01NAH2R7D", "genre": "Children's Books", "title": "A Family Haggadah I (Revised Edition)", "description": "With just the right blend of text and commentary, the popular A Family Haggadah, with new full-color art, is the haggadah of choice for families with young children to use at their Passover seders. Hebrew prayers and songs include English translations and transliterations."}, {"id": "B004W0CEMG", "genre": "Children's Books", "title": "Trio of Haunting Tales - Spooky Short Stories", "description": "Trio of Haunting Tales offers three short stories for kids who love spine-tingling fiction. Great for reading aloud at ghost-story gatherings, such as sleepovers, around a campfire, in the classroom, or at home for a night of spooky, family fun. Cyclops Clyde, a freaky computer monster, wreaks havoc both on and off screen, taunting and paralyzing his victim. In Night of the Howling Werewolf, Eric Lung searches out the bullies who jumped his best friend, Ben, and stole his bike. Things get weird on Slaughter Hill, the bullies’ favorite hangout. Ghost Warrior kicks the fright factor up and will creep out even the bravest of souls. Connie worked overtime and now worries that she’ll be punished with extra pushups for being late to karate class, but pushups become the least of her problems when rival ghost gangs that haunt the parking structure claim first dibs on this mortal prey."}]