[{"id": "0374355037", "genre": "Children's Books", "title": "This Next New Year", "description": "Celebrating the Chinese New YearA young boy looks forward to Chinese New Year - also known as the Lunar New Year, the day of the first new moon. It is a time of hope, and you don't have to be Chinese to celebrate it! His best friend, Glenn, who is French and German, and his cousin Evelyn, part Hopi and part Mexican, like the food and the envelopes of money, while he celebrates the fresh start the day offers. He cleans the house to make room for luck, and is glad the palms of his hands itch - that means he is coming into money. Most of all, he vows not to say things such as \"can't do / don't have / why me\" because he has dreams he is ready to make come true. Janet S. Wong's spare, lyrical couplets voice a child's determination to face the new year with courage and optimism. Yangsook Choi captures the spirit of celebration in her vibrant, energetic pictures."}, {"id": "B077WPSB6B", "genre": "Children's Books", "title": "La Storia della Nativita e del Natale", "description": "Uno dei miracoli più famosi della Bibbia è avvenuto migliaia di anni fa, in una citta molto lontana. Questa città si chiamava Nazareth.     Qui viveva una giovane donna di nome Maria. Stava aspettando con gioia il giorno delle sue nozze con un giovane uomo di nome Giuseppe. (…)"}, {"id": "0141300043", "genre": "Children's Books", "title": "Amistad: A Long Road to Freedom", "description": "When a group of illegally enslaved Africans takes over their captors' ship, the Amistad, in 1839, they find themselves facing a judge, with not only their freedom at stake but also the issue of slavery as a whole on trial. Reprint."}, {"id": "0140384774", "genre": "Children's Books", "title": "The Roald Dahl Quiz Book", "description": "Offers a variety of questions and answers based on Dahl's popular books, \"Charlie and the Chocolate Factory,\" \"George's Marvellous Medicine,\" \"Fantastic Mr. Fox,\" \"Esio Trot,\" \"The Giraffe and the Pelly and Me,\" and \"Matilda.\""}, {"id": "0310757614", "genre": "Children's Books", "title": "Loved: The Lord’s Prayer", "description": "From the blockbuster hit The Jesus Storybook Bible, with over two million copies sold, comes Loved, based on the Lord’s Prayer. Written by Sally Lloyd-Jones and illustrated by Jago, little ones will fall in love with this padded board book that shows even the youngest readers how to talk to God. Lloyd-Jones’ heartfelt text is a comfort to children and reminds them that God will always love them with a Never Stopping, Never Giving Up, Unbreaking, Always and Forever Love."}]