[{"id": "1974327221", "genre": "Children's Books", "title": "Creativity Journal: Writing & Creativity Journal (Creativity Journal For Kids & Adults)(Blank Journal)", "description": "Awesome creativity journal notebooks for all your ideas, stories and song writing!Do you love expressing your creativity through journaling? This 6x9, 108 lined page journal with vibrant images is perfect for everything your imagination can muster up.This creativity journal can help boys and girls explore their innermost feelings and adults to write down that breakthrough idea.Works great for:Idea Notebook JournalCreative Writing Practice WorkbooksSong Writing JournalNotebook For StudentsBack To School NotebooksBlank Journal For KidsAnd much more…..Makes the perfect:Birthday GiftMother’s Day GiftChristmas GiftsBack To School GiftTeacher SuppliesGrab your copy today by scrolling up and hitting the buy button today!"}, {"id": "B00D6CXH0O", "genre": "Children's Books", "title": "African-American Religious Leaders (A to Z of African Americans)", "description": "Praise for the previous edition:\"...informative...a useful addition to high school and college libraries.\"—American Reference Books Annual\"...useful for high-school collections where brief biographies are well used as well as for public and undergraduate libraries.\"—Booklist\"...valuable...Recommended.\"—ChoiceAfrican-American Religious Leaders, Revised Edition profiles prominent religious leaders from a variety of faiths and persuasions. Each entry provides a biographical sketch of the leader, addressing major achievements, events, and contributions to his or her followers and society at large. A general bibliography, subject indexes, and further reading lists complete this revised, comprehensive book.New and revised profiles include:Ralph Abernathy Calvin ButtsCreflo DollarLouis Farrakhan Barbara Clementine Harris Jesse Jackson Mahalia JacksonOtis MossIman Zaid ShakirAl Sharpton William Shaw Conrad Tillard Renita WeemsCornel West Andrew Young Johnny Ray YoungbloodArchbishop Gregory Wilton of Atlanta and more."}, {"id": "1988976006", "genre": "Children's Books", "title": "Caterpillar Yom Kippur (Jewish Nature) (Volume 6)", "description": "\"It's a lot of work, growing and changing every single day...\" When one lonely little caterpillar realizes there's probably more to life than eating, he starts wondering how he'll figure out what his purpose could be. Is it possible to become a better caterpillar? The answer is more wonderful than he could possibly imagine. Explore the Yom Kippur observance in a fun, new way and greet the High Holiday season together, with a smile!"}, {"id": "0975462466", "genre": "Children's Books", "title": "The Deer Hunting Book: Short stories for young hunters", "description": "The Deer Hunting Book is a wonderful collection of deer hunting short stories for boys and girls interested in the outdoors. The book captures the excitement of hunting whitetails through a variety of adventurous and humorous stories about young hunters. Ages 9 & up."}, {"id": "B007HBT9JS", "genre": "Children's Books", "title": "The Berenstain Bears Chapter Book: The Freaky Funhouse", "description": "When the carnival comes to town to raise money for Bear Country Hospital, everyone is excited to ride the rides and play some games. But when the rides don't work and the game prizes aren't good, Brother and Sister Bear suspect something fishy is in the works. Can the cubs get to the bottom of it before the carnival is ruined?This chapter book story is the perfect next step for Berenstain Bears fans!"}]