[{"id": "B077PCZG29", "genre": "Children's Books", "title": "Hack College Like an Entrepreneur: 40 Surprising Insights from the World's Top Founders", "description": "You don’t have to drop out to become a successful entrepreneur. Learn how to prepare for your entrepreneurial journey by optimizing college. Based on insights from entrepreneurs such as Richard Branson, Mark Zuckerberg, and Tony Robbins - plus interviews with some of the world's hottest founders, Hack College Like an Entrepreneur distills forty surprising insights that will help take your entrepreneurial ability to the next level.These real-world insights include:Improve your “deserve it factor”Dance with fear of failureFail fast, fail forwardFollow your passion, yes or noDevelop your competitive advantageGo partyProving you can train yourself to be a successful entrepreneur while in college, Hack College Like an Entrepreneur is the must-have guide to prepare you for an entrepreneurial journey and a life of impact."}, {"id": "1547109998", "genre": "Children's Books", "title": "Happy 82nd Birthday: Birthday Memory Book, Birthday Journal Notebook For 82 Year Old For Journaling & Doodling, 7 x 10, (Birthday Keepsake Book)", "description": "Are you looking for a unique birthday keepsake book?This 7” x 10” birthday journal notebook not only has 80 lined pages for journaling but also includes 40 blank pages for guests to write their happy birthday messages to the birthday celebrator. Or they can be used for doodles, sketches or any other way you want.With the kind words from loved ones and the ability to journal this birthday keepsake is the ultimate happy birthday book.Makes the perfect birthday gifts for men, women and kids of all ages whether they were born in 1917 or 2012.Just click on Dartan Creations to see hundreds of other journal styles and options."}, {"id": "1499806698", "genre": "Children's Books", "title": "A Surprise for Bunny", "description": "An adorable padded board book for parents and children!Little Bunny is excited today.  Outside there's a treasure hunt game to play.  In this fun and playful story, Mommy Bunny has set up a scavenger hunt for Little Bunny and Fluffy Squirrel. They look in the bushes, under the swing, on the ground, and in the tree until they finally find the treasure--a picnic for the both of them! This beautifully illustrated board book is the perfect gift for new parents!"}, {"id": "1541911970", "genre": "Children's Books", "title": "Joan of Arc : The Peasant Girl Who Led The French Army - Biography of Famous People | Children's Biography Books", "description": "Christianity has seen so many martyrs over the years. One of the most unbelievable stories is that of Joan of Arc. Joan was very young when she died but she has lived a life of fulfillment. She followed the will of God even if it meant leading armies to wars. Read about her story of bravery and learn from her actions. Use this book today!"}, {"id": "B01H28S1K8", "genre": "Children's Books", "title": "Amazing Pictures and Facts About The Rainforest: The Most Amazing Fact Book for Kids About The Rainforest", "description": "Kid’s U Presents...Rainforests- Amazing Pictures and Facts about Rainforests.  Have your children ever wondered where the rainforests are? How many creatures and animals live in the rainforest? Are rainforests wet? In this book you will explore the wonders of rainforests, finding the answers to these questions and so many more. Complete with incredible pictures to keep even the youngest of children captivated, you will all embark on a little journey into the great unknown.  In school our children aren’t taught in a way that makes them curious and want to learn. I want to change that!  This book will show your children just how interesting the world is and help ignite a passion for learning.  Your children will learn how to:    Become curious about the world around them.   Find motivation to learn.   Use their free time to discover more about the world-and have fun while doing so!   And much more! "}]