[{"id": "0448439689", "genre": "Children's Books", "title": "Who Was Johnny Appleseed?", "description": "The perfect biography to \"bite into\" at the start of a new school year! Children are sure to be fascinated by the eccentric and legendary Johnny Appleseed, a man who is best known for bringing apple trees to the midwest. Over John Chapman’s lifetime, he saw the country grow and start to spread westward. Traveling alone— in bare feet and sporting a pot on his head!—Johnny left his own special mark planting orchards that helped nourish new communities. His journeys and adventures are illustrated in a hundred black-and-white illustrations."}, {"id": "148244450X", "genre": "Children's Books", "title": "20 Fun Facts About Mammal Adaptations (Fun Fact File: Animal Adaptations)", "description": "One major adaptation of mammals is part of what differentiates them from other animals: the growth and nourishment of babies inside the mothers body. Water-repelling fur, tough hides, camouflage, as well as the size and shape of various body parts are just a few other adaptations mammals have developed in order to better survive their environment. Readers learn many examples of how mammals have evolved to hide from predators and hunt for prey. Graphic organizers present even more information to aid readers understanding while full-color photographs bring them close to animals they might otherwise only see in a zoo."}, {"id": "1435249682", "genre": "Children's Books", "title": "Max's Easter Surprise (Max and Ruby)", "description": "Ruby and her friend Louise are decorating Easter eggs, but Max wants to have an Easter Parade. Big sister Ruby tells Max that the Easter Parade is tomorrow, but that he can help today by carrying all the decorated eggs to the Easter basket. But Max doesn?t want to just carry the eggs?he wants to march them in a parade!"}, {"id": "0060294086", "genre": "Children's Books", "title": "Mama Loves", "description": " These are the things a mama loves:    Dancing in slippers. Teapots of tea. Reading the paper and mornings with me!    Mama always finds ways to share life's moments big and small with all her little ones. Tenderly illustrated by award-winning artist Kathryn Brown, mama loves will strike a chord with every child who loves being loved by Mama. "}, {"id": "0763690406", "genre": "Children's Books", "title": "Maisy's Moon Landing: A Maisy First Science Book", "description": "Pull the tabs and fly to the moon with Maisy!Maisy has a big day tomorrow. She's going to the moon! Little readers can pull the tabs to help her rocket blast off, move Maisy's vehicle over the moon rocks (with Panda in tow), and open a parachute that helps her land on Earth. There's even a control room with levers that lift up and down to make gauges change! Little ones will love taking off with Maisy on her outer-space adventure — and be happy when Cyril brings his friend safely home. Hooray!"}]