[{"id": "1410980499", "genre": "Children's Books", "title": "Heroes of World War II", "description": "The year is 1939. Germany, led by Adolf Hitler, has invaded Poland. The world is about to enter into the biggest and most terrible war in history. But from the depths of despair rose some very courageous, selfless people who risked their lives for the sakes of others in need, often for no gain and with no recognition. Here are some of their stories…"}, {"id": "0448425521", "genre": "Children's Books", "title": "Shaquille O'Neal: Man of Steel", "description": "All Aboard Reading!It's a bird. It's a plane. It's--Super Shaq! Shaquille O'Neal in one of the biggest and strongest players in the NBA. Standing over 7 feet tall and scoring more points than any other player in the '99-00 season, he helped his team to win the coveted NBA Championship. Children will be delighted to learn about Shaq both on and off the basketball court as he comes to life in colorful photographs."}, {"id": "0399257837", "genre": "Children's Books", "title": "Cinders: A Chicken Cinderella", "description": "Jan Brett sets her Cinderella story in a snowy Russian winter where one magical night, Cinders, the most picked upon hen in the flock, becomes the most loved by Prince Cockerel when she arrives at his ball looking so beautiful that even her bossy sisters don't recognize her. Jan travelled to Russia and readers will be in awe of the Ice Palace aglow under a deep blue moonlit sky, exquisite ball gowns on the comely pullets, uniforms with gold braids and buttons on the cockerels, striking Russian architecture transformed into ice in the borders, and a very funny flock of chickens who provide an appealing, original look at this snowy Cinderella. Readers will find these dressed up chickens comical as they pour over the extravagant setting, including a \"WOW\"-inducing double gatefold of chicken couples whirling around the ballroom. A feast for the eyes sure to become a perennial favorite."}, {"id": "0766016811", "genre": "Children's Books", "title": "Jesse Owens: Olympic Star (Great African Americans Series)", "description": "Describes the life of the sharecroppers' son who became an Olympic legend, and challenged Hitler's dream of Aryan superiority during the 1936 Olympics in Berlin."}, {"id": "0316019984", "genre": "Children's Books", "title": "DC Super Heroes: The Ultimate Pop-Up Book", "description": "Critically acclaimed pop-up engineer Matthew Reinhart celebrates the history, heroes, and villains of the DC Universe in this ultimate 3-D masterpiece! Bursting with over 25 impressive pop-ups, this deluxe format features a variety of unique novelty elements-including a light-up Bat-Signal, a cosmic Justice League of America battle scene, a twirling Lasso of Truth, and a transparent Invisible Jet! With vibrant illustrations, exciting facts, and an eye-catching design, this is an absolute must-have for DC Super Hero fans of all ages!"}]