[{"id": "0756975204", "genre": "Children's Books", "title": "The Vanishing Passenger (Boxcar Children)", "description": "The famous mystery writer, Gilbert Finch, is coming to Greenfield to speak at the library and the Aldens can't wait to meet him. When they go with Grandfather to pick Finch up at the train station, he is nowhere to be found. Henry, Jessie, Violet, and Benny need to solve this mystery quickly. Otherwise, Finch's archrival, Hubert VanBuren, will speak at the library instead of Finch!"}, {"id": "0756908213", "genre": "Children's Books", "title": "Young CAM Jansen and the Pizza Shop Mystery (Easy-To-Read Young CAM Jansen - Level 2)", "description": "Cam, her father, and her best friend can't pass up eating at the best pizza place in the world. But they can't leave the mall until they solve the mystery of the missing jacket. Will Cam's photographic memory be enough to solve the case? Illustrations."}, {"id": "B004U8QXX6", "genre": "Children's Books", "title": "Are You Smarter Than A Flying Gator?: Gator Mikey Over Florida", "description": "When the governor of Florida challenges the kids in the state to come up with ideas to promote the learning of history and geography, a precocious eighth grader named Prez and his friends take on the challenge in a big way. They create an incredible flying gator that sings like Elvis and asks multiple choice history and geography questions. Under bizarre circumstances, the flying gator ends up flying out of control - and that's where the real craziness begins! Before you know it, the whole world is involved in this incredible adventure!"}, {"id": "1515791661", "genre": "Children's Books", "title": "Pope Francis (Graphic Lives)", "description": "In 2013, the white smoke of the Vatican announced to the world the election of the first Latin American Pope. That day, Father Jorge became Francis, but a few weeks earlier, he was walking the streets of his native Buenos Aires, always close to the needy. Discover the origins of the man who, with his example of humility and love, may change the Church, and perhaps the whole world."}, {"id": "1491536861", "genre": "Children's Books", "title": "Caminar", "description": "Set in 1981 Guatemala, a lyrical debut novel tells the powerful tale of a boy who must decide what it means to be a man during a time of war.Carlos knows that when the soldiers arrive with warnings about the Communist rebels, it is time to be a man and defend the village, keep everyone safe. But Mama tells him not yet—he’s still her quiet moonfaced boy. The soldiers laugh at the villagers, and before they move on, a neighbor is found dangling from a tree, a sign on his neck: Communist. Mama tells Carlos to run and hide, then try to find her.... Numb and alone, he must join a band of guerillas as they trek to the top of the mountain where Carlos’s abuela lives. Will he be in time, and brave enough, to warn them about the soldiers? What will he do then? A novel in verse inspired by actual events during Guatemala’s civil war, Caminar is the moving story of a boy who loses nearly everything before discovering who he is."}]