[{"id": "0880388609", "genre": "Science Fiction & Fantasy", "title": "Greyhawk Ruins (Advanced Dungeons & Dragons module WGR1)", "description": "Try your hand at the busiest dungeon ever created. There are more than two dozen levels of horror and treasures. Run into brutal foes and gain uncountable wealth - nearly 1,000 seperate room descriptions in all! Greyhawk Ruins is a complete guide to the most famous dungeon in the WORLD OF GREYHAWK campaign setting. All you need is the ADVANCED DUNGEONS & DRAGONS 2nd Edition role-playing game, nerves of steel, and the resolve to challenge the puzzles and powers the ruins have to offer! Greyhawk Ruins is designed for five to seven characters of levels 2 to 15."}, {"id": "1532879180", "genre": "Science Fiction & Fantasy", "title": "1950: a time travel story by", "description": "Avery Sims has a dream, a fantasy he never expects to come true... to go back in time and live out his life in a past world. It isn't until he meets an old art dealer named Mr. Atoz that he realizes how attainable his dream is. To live in a more laidback world, where a man's handshake was his contract, without computers and the instant insanity they brought to everything, 24/7. It is a past as wonderful as he imagined, but is there a catch? Mr. Atoz is watching as well, always watching..."}, {"id": "1460206797", "genre": "Science Fiction & Fantasy", "title": "Return of the Raven", "description": "It is the year 2000 and something and the world is not what it was 500 years ago when Eagles and Ravens were revered. Time and modern science has changed the people of the West Coast. They no longer believe in the animal spirits and they no longer believe their own legends: the stories are forgotten, the young people no longer look up to the Raven, the bringer of the light, the transformer, the trickster, the creator. Those days are gone. In today's world, creation is in the hands of machines, computers are the transformers, the government is the trickster and a man called Thomas Edison was the bringer of the light. Then a Raven saved a frog from certain death by covering him with a maple leaf. He did the first transformation in over 500 years and the spirits flowed again. The trouble was he had no idea how he had done it."}, {"id": "B077XZYKHX", "genre": "Science Fiction & Fantasy", "title": "1963: Spying on Lee Harvey Oswald and the Plot to Kill President Kennedy", "description": "2018 Edition: Includes 2017 Document Release.1963 Patch Kincaid's time travel to 1961 resulted in President Kennedy's assassination. The sequel to 1961 begins with Patch in Dealey Plaza, selling CD's and DVD's of President Kennedy's life. He is kidnapped and his mind altered as he is thrust through a new time portal back to 1963. Patch enters the life of Lee Harvey Oswald. Oswald's activities as well the events leading up to the Kennedy Assassination are footnoted in this unusual time travel novel. Patch's memory slowly returns and snaps into place on the morning of the Kennedy Assassination: November 22, 1963. Along with his friend Shari, Patch must try to stop the killing of the thirty-fifth president."}, {"id": "B01MT3IO1L", "genre": "Science Fiction & Fantasy", "title": "Something (Wisteria, #1)", "description": "\"I will find true love and everything will be okay. I will find true love and everything will be okay...\" she chanted. They say be careful what you read. Something is wrong. Something is very wrong. It can happen to anyone. This is just four teenagers' story. Aubrey Golding hates her face, her body, and is devastated after Nathan Silva leaves her. Alone, suicidal, and desperate for love, she discovers a book called Something and unknowingly links others to a dark and terrifying curse that is beginning to consume her. Nathan is glad to be moving on with someone new and can hardly believe what is happening now. Wild child and amateur porn star, Bella Broadhurst, loves bullying that \"emo whore\" Aubrey with the other girls, but mostly she loves partying, hookups, and plain ol' drama when terror arises. And Kendra Coke is just a new teen mother working on a delicate relationship when things start becoming utterly bizarre. Chilling sleep disturbances and figures hiding in the corners of their rooms are just warnings of what is to come. Be careful what you read, they say. Tread carefully...\"Extremely well-written and almost Gothic in nature, Something (Wisteria #1) is horror at its best. -Bestselling author N.N. Light \"This isn't just another teen book. It dives deep into problems most people like to just skim over without a second thought.\" -K & J \"I have never read anything like this book before, and I'm sure I won't read anything similar for a long time\"-Wren"}]